{"pressItemDictionary": {"Press Releases": [{"Title": "26 More Cases Discharged; 596 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1587308220000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "19 Apr 2020", "Summary": "", "MainContent": "<p>As of 19 April 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 596 cases of COVID-19 infection in Singapore. The breakdown is as follows: </p> <p><strong>a)&nbsp; Imported cases: 0</strong></p><p><p>There are no imported cases today.&nbsp; &nbsp;</p><p><strong>b)&nbsp; Cases in the community: 30 </strong>(25 Singaporeans/Permanent Residents and 5 Work Passes)</p></p><p><p>The number of new cases in the community has decreased, from an average of 37 cases per day in the week before, to an average of 31 per day in the past week. The number of unlinked cases in the community has increased slightly, from an average of 18 cases per day in the week before, to an average of 22 per day in the past week.&nbsp;We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.</p><p><strong>c)&nbsp; Work Permit holders (residing outside dormitories): 22</strong></p></p><p><p>The number of new cases amongst Work Permit holders residing outside dormitories has increased, from an average of 11 cases per day in the week before, to an average of 21 per day in the past week.&nbsp;</p><p><strong>d)&nbsp; Work Permit holders (residing in dormitories): 544</strong></p></p> <p>The main increase today continues to be for Work Permit holders residing in dormitories, in line with our continued efforts to actively test and isolate the infected workers. Most of these cases are young, have a mild illness and are being monitored in the community isolation facilities or general ward of our hospitals. None of them is in the intensive care unit.</p> <p><span style=\"font-size: 13px;\">&nbsp;2.<strong>&nbsp; &nbsp;</strong></span>Details of these trends can be found in MOH’s daily situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\">www.moh.gov.sg/covid-19/situation-report</a>).</p><p><p>3.&nbsp; Of the new cases, 68% are linked to known clusters, while the rest are pending contact tracing.</p></p> <p><strong>Links between previous cases found</strong><br></p><p>4.&nbsp; &nbsp;In the past week (12 April to 18 April), MOH has uncovered links for 528 previously unlinked cases (see <a href=\"/docs/librariesprovider5/default-document-library/annex-ae5f2460aa89c4e7b9169d392d85e380b.pdf?sfvrsn=7d2e9f15_0\" title=\"Annex A\">Annex A</a>). </p><p><br>5.&nbsp; &nbsp;Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. A summary of the confirmed cases are in <u><a href=\"/docs/librariesprovider5/default-document-library/annex-b5b793d89fa65418ca2cc232a47b12dfa.pdf?sfvrsn=995429a1_0\" title=\"Annex B\">Annex B</a></u>.</p><p>6.&nbsp; &nbsp;Please refer to the MOH website for the situation report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\">www.moh.gov.sg/covid-19/situation-report</a>). <p><strong><br></strong><strong>Cases from public healthcare sector</strong></p><p><u>Case 4556 (Announced on 17 April)</u></p><p>7.&nbsp; &nbsp;Case 4556 is a 32 year-old female Singapore Citizen who has no recent travel history to affected countries or regions. She reported onset of symptoms on 13 April, and subsequent test results confirmed COVID-19 infection on 17 April. She is currently warded at Khoo Teck Puat Hospital (KTPH).</p></p><p><p>8.&nbsp; &nbsp;Prior to hospital admission, she had gone to work as a nurse at KTPH.</p></p><p><p><strong>Update on condition of confirmed cases</strong></p><p>9.&nbsp; &nbsp;26 more cases<a href=\"file:///C:/Users/Vimita/Downloads/Press%20Release-Confirmed%20cases%205993%20to%206588-Draft%2019Apr%202215h%20(Final)%20(5).docx#_ftn1\" name=\"_ftnref1\" title=\"\"><sup><sup>[1]</sup></sup></a> of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 768 have fully recovered from the infection and have been discharged from hospitals or community isolation facilities.</p></p><p><p>10. Of the 2,921 confirmed cases who are still in hospital, most are stable or improving. 22 are in critical condition in the intensive care unit. 2,888 cases who are clinically well but still test positive for COVID-19 are isolated and cared for at community facilities. 11 have passed away from complications due to COVID-19 infection.</p></p><p><strong>MINISTRY OF HEALTH</strong><br></p><p><strong>19 APRIL 2020</strong></p><div><br clear=\"all\"> <hr align=\"left\" size=\"1\" width=\"33%\"> <div id=\"ftn1\"> </div></div><p>[1] Cases 284, 288, 391, 545, 557, 611, 976, 1158, 1199, 1402, 1412, 1500, 1514, 1888, 2023, 2157, 2524, 2541, 2737, 3140, 3337, 4571, 4578, 4579, 4774 and 4777.</p>", "PressCategory": ["Press Releases"], "CustomDetailUrl": "", "UrlName": "26-more-cases-discharged-596-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "596 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1587281040000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "19 Apr 2020", "Summary": "", "MainContent": "<p>As of 19 April 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 596 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders residing in foreign worker dormitories. Of the 596 cases, 25 are Singaporeans/ Permanent Residents.<br><br>We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.</p> <p>&nbsp;</p>", "PressCategory": ["Press Releases"], "CustomDetailUrl": "", "UrlName": "596-new-cases-of-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}