{"pressItemDictionary": {"Press Releases": [{"Title": "477 More Cases Discharged; 202 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1593443760000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "29 Jun 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp;As of 29 June 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 202 cases of COVID-19 infection in Singapore. The breakdown is as follows: </p> <p><strong>a) Imported cases: 0&nbsp;<br><br></strong>There are no imported cases today.&nbsp;<br><br><strong>b)</strong>&nbsp;<strong>Cases in the community: 6 </strong>(4 Singaporeans, 2 Work Permit holders) <br><br>Of the 6 cases in the community, 4 had been picked up as a result of our proactive surveillance and screening, and 1 had already been placed on quarantine earlier. <br><br>Amongst the 4 Singaporean cases, 1 (Case 43538) had been identified as a contact of a previously confirmed case, and had already been quarantined earlier. He was swabbed during quarantine to verify his status. Another 2 (Cases 43539 and 43637) were detected due to our proactive surveillance of persons working at dormitories or deployed to frontline COVID-19 operations, even though they are asymptomatic. Epidemiological investigations are ongoing for the remaining case (Case 43691). <br><br>Both Work Permit holders (Cases 43540 and 43638) are asymptomatic, and had been swabbed as part of our proactive screening of workers in essential services or those working at dormitories. <br><br>Besides the polymerase chain reaction (PCR) test, we also conducted serological tests to determine if some of these cases are current or past infections.[1]&nbsp;The serological test results for Cases 43539 and 43540 have come back positive, which indicate likely past infections. The test results for the remaining cases are pending. <br><br>Overall, the number of new cases in the community has increased, from an average of 4 cases per day in the week before, to an average of 7 per day in the past week. The number of unlinked cases in the community has also increased, from an average of 2 cases per day in the week before, to an average of 4 per day in the past week.&nbsp;We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.&nbsp;<br><br>c)&nbsp;&nbsp;<strong>Cases residing in dormitories: 196&nbsp;<br><br></strong>We continue to pick up cases amongst Work Permit holders residing in dormitories, including in factory-converted dormitories, because of extensive testing in these premises, as part of our process to verify and test the status of all workers. <br><br>2.&nbsp; &nbsp; &nbsp;Details of these trends can be found in MOH’s daily situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\">www.moh.gov.sg/covid-19/situation-report</a>). Please refer to <u><a href=\"/docs/librariesprovider5/default-document-library/annex-acbf7e8b580584f2592f132dc617edfab.pdf?sfvrsn=11376997_0\" title=\"Annex A\">Annex A</a></u> for the summary of the confirmed cases. <br><br>3.&nbsp; &nbsp; &nbsp;Of the new cases, 97% are linked to known clusters, while the rest are pending contact tracing.<br><br>4.&nbsp; &nbsp; &nbsp;We announced on 28 June that a student at East Spring Secondary School had tested positive for COVID-19. As a precaution, 39 students and 11 staff who had been in close contact with the student have been put on Leave of Absence by the Ministry of Education or Home Quarantine Order by MOH. They have been tested for COVID-19, and their test results have all come back negative.&nbsp;<br><br><strong>Links between previous cases found&nbsp;<br><br></strong>5.<strong>&nbsp; &nbsp; &nbsp;&nbsp;</strong>In the past week (22 June to 28 June), MOH has uncovered links for 5 previously unlinked cases. <br><br>6.&nbsp; &nbsp; &nbsp; Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <u><a href=\"/docs/librariesprovider5/default-document-library/annex-be69150c503ff4f7784a00d63c2de492b.pdf?sfvrsn=db320c9a_0\" title=\"Annex B\">Annex B</a></u> and <u><a href=\"/docs/librariesprovider5/default-document-library/annex-c45e7b89292db436b91d484972ec720bd.pdf?sfvrsn=be4cfdc7_0\" title=\"Annex C\">Annex C</a></u> for details.&nbsp;<br><br><strong>Update on condition of confirmed cases&nbsp;<br><br></strong>7.&nbsp;<strong> &nbsp; &nbsp;&nbsp;</strong>477 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 37,985 have fully recovered from the infection and have been discharged from hospitals or community care facilities. <br><br>8.&nbsp; &nbsp; &nbsp; There are currently 197 confirmed cases who are still in hospital. Of these, most are stable or improving, and 1 is in critical condition in the intensive care unit. 5,453 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 26 have passed away from complications due to COVID-19 infection.&nbsp;<br><br><strong>MINISTRY OF HEALTH<br></strong><strong>29 JUNE 2020</strong></p> <div><br clear=\"all\"> <hr align=\"left\" size=\"1\" width=\"33%\"> <div id=\"ftn1\"> <p>[1] Cases whose serological tests are positive are likely to have a past infection, and could be shedding minute fragments of the virus RNA picked by the PCR test, which were no longer transmissible and infective to others.</p> </div> </div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "477-more-cases-discharged-202-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "202 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1593414300000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "29 Jun 2020", "Summary": "", "MainContent": "<p align=\"center\" style=\"text-align: left;\"><span style=\"text-align: left;\">&nbsp; &nbsp; &nbsp; &nbsp; As of 29 June 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 202 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders residing in foreign worker dormitories. Based on our investigations so far, there are 6 cases in the community, of whom 4 are Singaporeans/ Permanent Residents and 2 are Work Pass holders.&nbsp;<br><br>2.&nbsp; &nbsp; &nbsp;</span>We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.</p> <p style=\"text-align: left;\">&nbsp;</p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "202-new-cases-of-covid-19-infection", "CurrentPageUrl": null}, {"Title": "Standardised Packaging & Enlarged Graphic Health Warnings Mandatory for All Tobacco Products  In Singapore From 1 July 2020", "PublishedDate": "/Date(1593360000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "29 Jun 2020", "Summary": "", "MainContent": "<p>1.&nbsp; &nbsp; &nbsp; As part of Singapore's continued efforts on tobacco control, from 1 July 2020, all tobacco products sold in Singapore will be subject to standardised packaging and enlarged graphic health warnings (collectively, \"the SP Measure\"). The SP Measure applies to all tobacco products, including cigarettes, cigarillos, cigars, beedies, <em>ang hoon</em> and other roll-your-own tobacco products.<br><br>2.&nbsp; &nbsp; &nbsp; The SP Measure for tobacco products is part of a multipronged approach aimed, among others, at discouraging non-smokers from picking up smoking, encouraging smokers to quit, and encouraging Singaporeans to adopt a tobacco-free lifestyle, which will ultimately lead to reduced smoking prevalence.<br><br><strong>SP Measure</strong><br><br>3.&nbsp; &nbsp; &nbsp; The Ministry of Health (MOH) had announced the decision to implement the SP Measure for all tobacco packaging on 31 October 2018, after an extensive process of reviewing and evaluating the available international and local studies, research and evidence on the SP Measure, as well as several rounds of public consultations.<br><br>4.&nbsp; &nbsp; &nbsp; Following the passage of amendments to the Tobacco (Control of Advertisements and Sale) Act in March 2019, MOH introduced subsidiary legislation to implement the SP Measure for all tobacco products in Singapore. The Tobacco (Control of Advertisements and Sale) (Appearance, Packaging and Labelling) Regulations 2019 (\"SP Regulations\") were published on 1 July 2019 and will come into operation on 1 July 2020.<br><br>5.&nbsp; &nbsp; &nbsp; The requirements set out in the SP Regulations encompass the appearance, packaging and labelling on retail packaging of all tobacco products and include:<br><br>(a) The removal of all logos, colours, images and promotional information on the packaging of tobacco products (other than brand names and variant names displayed in a standard colour and font style); and<br><br>(b) An increase in the minimum size of the mandatory graphic health warnings from the existing 50% to 75% of all specified tobacco product packaging surfaces.<br><br>Guidance on what the SP Measure may look like on different tobacco packaging formats can be found in the Health Promotion Board's (HPB) Standardised Packaging Guidance Booklet at&nbsp;<a href=\"https://www.hpb.gov.sg/healthy-living/substance-abuse/standardised-packaging-guidance-booklet\" title=\"\" class=\"\" target=\"\">https://www.hpb.gov.sg/healthy-living/substance-abuse/standardised-packaging-guidance-booklet</a>.<br><br>6.&nbsp; &nbsp; &nbsp; From 1 July 2020, all tobacco products imported into, distributed, sold, offered for sale or possessed for sale in Singapore must comply with the SP Regulations. Non-compliance with the SP Regulations is an offence punishable with a fine not exceeding $10,000, imprisonment for a term of up to six months, or both for first offenders. Those with a prior qualifying conviction will face heavier penalties.<br><br>7.&nbsp; &nbsp; &nbsp; A period of 12 months' notice from 1 July 2019 was given to tobacco manufacturers, importers, wholesalers and retailers to adjust and prepare for the full implementation of the SP Measure from 1 July 2020. This included a three-month transition period from 1 April 2020 to 30 June 2020. Tobacco products with standardised packaging have been imported into Singapore since April 2020 and have already been distributed to retailers during the transition period. The Health Sciences Authority (HSA) had also issued letters and email circulars to remind tobacco licensees of the SP Regulations and their obligations.<br><br><strong>Singapore's continued efforts on tobacco control</strong><br><br>8.&nbsp; &nbsp; &nbsp; Tobacco use is associated with cancers (e.g. mouth, lung), ischaemic heart disease, stroke, lung disease and many other diseases. It is the second highest contributor to ill health and premature death in Singapore. Together with HPB, HSA, our partners and the wider community, MOH seeks to reduce smoking prevalence in Singapore for positive public health outcomes.<br><br>9.&nbsp; &nbsp; &nbsp; The range of other tobacco control measures include public education, taxation, smoking cessation programmes, bans on tobacco advertising, the point-of-sale display ban and the institution of a minimum legal age for tobacco.</p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "standardised-packaging-enlarged-graphic-health-warnings-mandatory-for-all-tobacco-products-in-singapore-from-1-july-2020", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}