{"pressItemDictionary": {"Press Releases": [{"Title": "22 More Cases Discharged, 10 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1601649240000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "02 Oct 2020", "Summary": "", "MainContent": "&nbsp; &nbsp; &nbsp; As of 2 October 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 10 cases of COVID-19 infection in Singapore. The breakdown of the cases is as follows:<br><br><strong>Summary of new cases</strong><br><br>All new cases today are asymptomatic, and were detected from our proactive screening and surveillance.&nbsp;<br><div><br><br><div dir=\"ltr\" align=\"left\"><table><colgroup><col width=\"241\"><col width=\"120\"><col width=\"120\"><col width=\"120\"></colgroup><tbody><tr><td><br></td><td><p dir=\"ltr\">Already in quarantine/ isolation before detection</p></td><td><p dir=\"ltr\">Detected from surveillance</p></td><td><p dir=\"ltr\">Total</p></td></tr><tr><td><p dir=\"ltr\">Imported cases</p></td><td><p dir=\"ltr\">5</p></td><td><p dir=\"ltr\">0</p></td><td><p dir=\"ltr\">5</p></td></tr><tr><td><p dir=\"ltr\">Cases in the community</p></td><td><p dir=\"ltr\">0</p></td><td><p dir=\"ltr\">1</p></td><td><p dir=\"ltr\">1</p></td></tr><tr><td><p dir=\"ltr\">Cases residing in dormitories</p></td><td><p dir=\"ltr\">1</p></td><td><p dir=\"ltr\">3</p></td><td><p dir=\"ltr\">4</p></td></tr></tbody></table></div><br><strong>a) Imported cases: 5</strong> (1 Singaporean, 1 Permanent Resident, 1 Work Permit holder, 1 Dependant’s Pass holder, 1 Short-Term Visit Pass holder)<br><br>Amongst the 5 imported cases, 1 (Case 57940) is a Singaporean and another (Case 57938) is a Singapore Permanent Resident who returned to Singapore from India on 18 September and 20 September. Another case (Case 57939) is a Short-Term Visit Pass holder who arrived from Indonesia on 18 September. She was allowed entry into Singapore as her parent is a Singaporean. The remaining cases are a Work Permit holder (Case 57936) currently employed in Singapore who arrived from Indonesia on 20 September, and a Dependant’s Pass holder (Case 57933) who arrived from India on 16 September.<br><br>All of them had been placed on 14-day Stay-Home Notice (SHN) upon arrival in Singapore, and were tested while serving their SHN at dedicated facilities.&nbsp;<br><br><strong>b) Cases in the community: 1</strong> (1 Work Permit holder)<br><br>There is 1 case in the community today who is currently unlinked. Case 57941 was detected as a result of our Rostered Routine Testing of workers in the construction, marine and process sectors who are living outside the dormitories, even though he is asymptomatic. Epidemiological investigations of the case are in progress. In the meantime, all the identified close contacts of the case have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for his household contacts to determine if he could have been infected by them.<br><br>Overall, the number of new cases in the community has remained stable at an average of fewer than 1 case per day in the past 2 weeks. The number of unlinked cases in the community has also remained stable at an average of fewer than 1 case per day in the past 2 weeks. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br><br><strong>c) Cases residing in dormitories: 4</strong><br><br>Amongst the 4 cases residing in dormitories, 1 had been identified earlier as a contact of previous cases, and had already been quarantined to prevent further transmission. He was tested during quarantine to determine his status.&nbsp;&nbsp;<br><br>The remaining 3 cases were detected through surveillance testing, such as our bi-weekly Rostered Routine Testing of workers living in dormitories. This allows us to pick up cases early, including asymptomatic ones, so that we are able to ring-fence them quickly to prevent further transmission, by aggressively containing, tracing and isolating the close contacts.&nbsp;<br><br>2.&nbsp; &nbsp; Details of these trends can be found in MOH’s daily situation Report (<a href=\"https://www.moh.gov.sg/covid-19/situation-report\" title=\"\" class=\"\" target=\"\">www.moh.gov.sg/covid-19/situation-report</a>). Please refer to <a href=\"/docs/librariesprovider5/default-document-library/annex-a4f2c4980cc0c4eaf9297c2b4c93d3e92.pdf?sfvrsn=55d864fe_0\" title=\"Annex A \">Annex A </a>&nbsp;for the summary of the confirmed cases.&nbsp;<br><br>3.&nbsp; &nbsp; Of the new cases, 90% are imported or linked to known cases/ clusters, while the rest are pending contact tracing.&nbsp;<br><br><strong>Links between previous cases found</strong><br><br>4.&nbsp; &nbsp; Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <a href=\"/docs/librariesprovider5/default-document-library/annex-b603b19bc8982472c8835e08286b1b169.pdf?sfvrsn=5aa1c561_0\" title=\"Annex B \">Annex B </a>&nbsp;and <a href=\"/docs/librariesprovider5/default-document-library/annex-c825213d0136e4684ab5ee9113e1af703.pdf?sfvrsn=6d48fac_0\" title=\"Annex C \">Annex C </a>&nbsp;for details.&nbsp;<br><br><strong>Update on condition of confirmed cases</strong><br><br>5.&nbsp; &nbsp; 22 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 57,534 have fully recovered from the infection and have been discharged from hospitals or community care facilities.&nbsp;<br><br>6.&nbsp; &nbsp; There are currently 48 confirmed cases who are still in hospital. Of these, most are stable or improving, and none is in the intensive care unit. 185 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 27 have passed away from complications due to COVID-19 infection.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>2 OCTOBER 2020</strong><br><div><br></div><br></div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "22-more-cases-discharged-10-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "10 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1601623440000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "02 Oct 2020", "Summary": "", "MainContent": "&nbsp; &nbsp; &nbsp; As of 2 October 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 10 cases of COVID-19 infection in Singapore. Based on our investigations so far, there is 1 case in the community, who is a Work Pass holder.&nbsp;<br><br>2.&nbsp; &nbsp; There are 5 imported cases, who had all been placed on Stay-Home Notice upon arrival in Singapore.&nbsp;&nbsp;<br><br>3.&nbsp; &nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;<br><br><br><div><strong>MINISTRY OF HEALTH<br>2 OCTOBER 2020</strong><br><div><br></div><br></div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "10-new-cases-of-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}