{"pressItemDictionary": {"Press Releases": [{"Title": "305 More Cases Discharged, 113 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1593096000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "25 Jun 2020", "Summary": "", "MainContent": "<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; As of 25 June 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 113 cases of COVID-19 infection in Singapore. The breakdown is as follows: </p><p><strong>a)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Imported cases: 0</strong></p><p>There are no imported cases today.&nbsp; </p><p><strong>b)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Cases in the community: 5 </strong>(1 Singaporean, 2 Work Pass holders, 2 Work Permit holders)</p><p>Of the 5 cases in the community, 2 had been picked up as a result of our proactive surveillance and screening, and 2 had already been placed on quarantine earlier. </p><p>Epidemiological investigations are ongoing for the Singaporean case (Case 42761), who had been tested when he sought medical treatment.</p><p>All 4 Work Pass/ Work Permit holders were tested even though they are asymptomatic. Amongst them, 2 (Cases 42669 and 42684) had been identified as contacts of previously confirmed cases, and had already been quarantined at government quarantine facilities. They were swabbed during quarantine to verify their status. The remaining 2 cases (Cases 42731 and 42732) were tested as part of our efforts to screen workers in essential services.&nbsp; </p><p>Besides the polymerase chain reaction (PCR) test, we also conducted serological tests to determine if some of these cases are current or past infections.<sup>[1]</sup> The serological test results for four of today’s cases (Cases 42669, 42684, 42731 and 42732) have come back positive, which indicate likely past infection. </p><p>Overall, the number of new cases in the community has decreased, from an average of 7 cases per day in the week before, to an average of 4 per day in the past week. The number of unlinked cases in the community has remained stable at an average of 2 per day in the past two weeks. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.</p><p><strong>c)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Cases residing in dormitories: 108</strong></p><p>We continue to pick up cases amongst Work Permit holders residing in dormitories, including in factory-converted dormitories, because of extensive testing in these premises, as part of our process to verify and test the status of all workers. </p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Details of these trends can be found in MOH’s daily situation Report (<a title=\"\" href=\"http://www.moh.gov.sg/covid-19/situation-report\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?q=http://www.moh.gov.sg/covid-19/situation-report&amp;source=gmail&amp;ust=1593182182821000&amp;usg=AFQjCNFkgGqAO7izpBVQCKCSWKjwWOQskg\">www.moh.gov.sg/covid-19/<wbr>situation-report</a>). Please refer to <a title=\"Annex A\" href=\"/docs/librariesprovider5/pressroom/annex-a-25-jun.pdf?sfvrsn=7213fff6_2\">Annex A</a>&nbsp;for the summary of the confirmed cases. </p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Of the new cases, 96% are linked to known clusters, while the rest are pending contact tracing. </p><p>&nbsp;</p><p><strong>Links between previous cases found</strong></p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In the past week (18 June to 24 June), MOH has uncovered links for 8 previously unlinked cases. </p><p>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <a title=\"Annex B\" href=\"/docs/librariesprovider5/pressroom/annex-b-25-jun.pdf?sfvrsn=aa7380a6_2\">Annex B</a>&nbsp;and <a title=\"Annex C\" href=\"/docs/librariesprovider5/pressroom/annex-c-25-jun.pdf?sfvrsn=cd5657a2_2\">Annex C</a>&nbsp;for details.</p><p>&nbsp;</p><p><strong>Update on condition of confirmed cases</strong></p><p>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 305 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 36,604 have fully recovered from the infection and have been discharged from hospitals or community care facilities. </p><p>7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; There are currently 189 confirmed cases who are still in hospital. Of these, most are stable or improving, and 1 is in critical condition in the intensive care unit. 5,917 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 26 have passed away from complications due to COVID-19 infection. </p><p>&nbsp;</p><p><strong>MINISTRY OF HEALTH<br>25 JUNE 2020</strong></p><p><sup>[1]&nbsp; </sup>Cases whose serological tests are positive are likely to have a past infection, and could be shedding minute fragments of the virus RNA picked by the PCR test, which were no longer transmissible and infective to others.</p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "305-more-cases-discharged-113-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "Steady Progress In Dormitory Clearance; Aggressive Testing and Tracing In Phase 2", "PublishedDate": "/Date(1593082260000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "25 Jun 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; As we resume more activities under Phase Two, we will continue to step up testing capacities and contract tracing capabilities as key enablers to support the safe re-opening of our economy and society. We will continue to expand our community testing efforts to include all individuals, aged 13 years and above, diagnosed with acute respiratory infection (ARI), starting from 1 July 2020. In addition, we will provide additional support to our Public Health Preparedness Clinics (PHPCs) who are a key pillar of this community testing effort. </p> <p><strong>Expansion of Testing in the Community and Support for PHPCs</strong></p> <p>2.&nbsp; &nbsp; &nbsp; As we continue to expand our testing capacity, we have also updated our testing strategy to test more extensively among key population groups in the community.</p><p><p>a)&nbsp; &nbsp; &nbsp; To better support rapid active case finding, we now test all close contacts of confirmed COVID-19 cases in the community, at the start and end of their quarantine period. <br><br>b)&nbsp; &nbsp; &nbsp; We have expanded our active surveillance efforts to more population groups who are deemed vulnerable or who have a higher risk of exposure to COVID-19. This includes the completion of the recent testing of staff and residents of the Ministry of Health (MOH) and Ministry of Social and Family Development (MSF) residential homes serving the elderly, as well as all staff of preschools. We have also started regular testing of workers returning to work in the construction, marine and process sectors, and frontline workers supporting our COVID-19 operations. <br><br>c)&nbsp; &nbsp; &nbsp; We are also facilitating travel and the re-opening of our borders by testing incoming travellers before the end of their Stay-Home Notice period.&nbsp; <br><br>3.&nbsp; &nbsp; &nbsp; From 1 July 2020, we will also <strong>test</strong> <strong>all individuals</strong> <strong>aged</strong> <strong>13 and above who are diagnosed with ARI</strong> <strong>at first presentation to a doctor</strong>. This is an expansion from the current strategy to only test all individuals aged 45 and above who are diagnosed with ARI, and will achieve our original target of testing everyone diagnosed with ARI once we had sufficient testing capacity. As clinical and scientific evidence shows that an infected person is most infectious right before and immediately after the start of symptoms, doing so allows us to detect infected individuals early and to quickly contain further spread. For children aged 12 and below who are diagnosed with ARI, doctors will continue to assess if a test is required, given different clinical considerations for young children. <br><br>4.&nbsp; &nbsp; &nbsp; We will continue to review our risk assessment and conduct more active and targeted surveillance testing in the community where needed. For example, we have plans to test target groups such as frontline staff interacting with travellers as we re-open our borders, and those living in communal facilities and shelters. Relevant sectors will be engaged and consulted on the testing. <br><br>5.&nbsp; &nbsp; &nbsp; The expanded testing will be supported by our polyclinics and PHPCs under the Swab and Send Home (SASH) Programme, as well as the Regional Screening Centres (RSCs) set up by the Health Promotion Board (HPB). To meet the anticipated increase in the number of individuals being tested, HPB will be opening more RSCs in the coming weeks.&nbsp;<br><br><em>COVID-19 Business Grant for PHPCs&nbsp;<br><br></em>6<em>.&nbsp; &nbsp; &nbsp;&nbsp;</em>PHPCs play an important role by providing subsidised treatment, investigations and medications during public health outbreaks. In the last four months, more than 900 PHPCs have provided subsidised consultation and treatment for Singaporeans, Permanent Residents and eligible Work Permit holders diagnosed with respiratory infections. More than 450,000 patients have benefitted from subsidies for treatment of respiratory infections at PHPCs and polyclinics, with around $31 million in subsidies disbursed to date. <br><br>7.&nbsp; &nbsp; &nbsp; In recognition of the role that PHPCs play in supporting the nation’s efforts in combatting the COVID-19 pandemic despite challenging circumstances, MOH will provide a one-off COVID-19 grant, totalling $10,000 to each PHPC. The COVID-19 Business Grant for PHPCs was first announced by Deputy Prime Minister Heng Swee Keat in the Budget Round-Up Speech in February 2020. This grant is intended to support PHPCs in their active role in caring for patients with respiratory symptoms and defray additional costs that the clinics may have incurred in doing so. <br><br>8.&nbsp; &nbsp; &nbsp; The grant will be disbursed in December 2020 to all PHPCs that have been activated as of 25 June 2020, and remain activated until they are stood down. Clinics that have indicated their interest to be activated as of 24 June 2020 and are eventually activated for the COVID-19 response will also be eligible for the grant.&nbsp;<br><br><em>One-time Start-up Grant to Bring on More PHPCs under the Swab and Send Home Programme (SASH)&nbsp;<br><br>9.&nbsp; &nbsp; &nbsp;&nbsp;</em>There are currently about 400 PHPCs who are part of the SASH programme. These PHPC clinics provide COVID-19 testing services to eligible individuals, and play an important role in testing and diagnosing COVID-19 cases in the community. MOH will provide a one-time start-up grant of $1,200 in recognition of the costs and effort incurred in stepping up to support our national COVID-19 testing effort and to encourage more PHPCs to join the SASH programme. The SASH Start-up Grant will help clinics defray the additional start-up costs, such as purchase of equipment and setting up of new workflows. <br><br>10.&nbsp; &nbsp; &nbsp;All PHPCs who come on board the SASH programme will be eligible for the grant. Clinics can expect to receive the grant after about three months on the SASH programme, with payments starting in September 2020. <br><br>11.&nbsp; &nbsp; Members of the public may refer to <a href=\"file:///C:/Users/hijanah/AppData/Local/Microsoft/Windows/INetCache/Content.Outlook/H5M4D6KN/flugowhere.gov.sg\">flugowhere.gov.sg</a> for the updated list of PHPCs and SASH PHPCs.&nbsp;<br><br><em>PHPC Assurance Grant&nbsp;&nbsp;<br><br>12.&nbsp; &nbsp; &nbsp;</em>With their key role in the COVID-19 response, we recognise that PHPCs may be significantly impacted in the event that PHPC doctor(s) contract COVID-19 infection or are quarantined. While the risks are low as healthcare professionals are adequately protected with personal protective equipment like masks, gowns and gloves, PHPCs may consider using the COVID-19 Business Grant to purchase insurance.As an added assurance, MOH will also provide an Assurance Grant to support PHPCs whose regular practising doctors contract COVID-19 or are placed on Quarantine Order (QO) as a result of their providing care to their patients. Eligible PHPCs will receive $500 per day for the duration of the doctor’s recovery or quarantine period. For quarantined cases, the PHPC Assurance Grant replaces the Quarantine Order Allowance Scheme. More details on the eligibility criteria and application process will be shared with PHPCs when ready.&nbsp;&nbsp;<br><br><strong>Update on Progress of Clearance of Dormitories&nbsp;<br><br></strong>13.&nbsp;<strong> &nbsp; &nbsp;</strong>The Inter-agency Taskforce (ITF) is continuing its efforts to systematically test and clear workers and dormitories. Up to 10,000 tests, involving individual swabs, pooled swabs and serological testing, are conducted for migrant workers daily. The ITF strives to clear all the dormitories in the most expedient and efficient way possible, while safeguarding the good health of residents. Dormitories are prioritised based on their readiness for testing, which depends on factors including the prevalence of infection, length of time since the onset of infection, and adherence to safe distancing. <br><br>14.&nbsp; &nbsp; &nbsp;As of 23 June 2020, about 120,000 workers have either recovered or have been tested to be free from the virus. Amongst them 80,000 are able to resume work while the rest are pending movement to appropriate accommodations before they start work. By the end of July, we expect that around 250,000 migrant workers, or 80% of workers staying in the dormitories, would have recovered or cleared through our testing protocols.&nbsp;<br><br><strong>Working Together for a Safe Transition&nbsp;<br><br></strong>15.<strong>&nbsp; &nbsp; &nbsp;</strong>The expansion of systematic testing in the community, supported by our RSCs, PHPCs and polyclinics, will allow us to enhance and tighten disease surveillance, detect the virus early and reduce the risk of further transmission. Our dormitory clearance strategy would also provide for the safe return of migrant workers to the workforce. These are in addition to efforts to leverage technology through TraceTogether and SafeEntry to expand our contact tracing capability. Nonetheless, the risk of infection and spread remains and the implementation of strong safe management measures, safe distancing measures and infection control measures by everyone remains key.&nbsp;<br><br><strong>MINISTRY OF HEALTH<br></strong><strong>25 JUNE 2020</strong></p></p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "steady-progress-in-dormitory-clearance-aggressive-testing-and-tracing-in-phase-2", "CurrentPageUrl": null}, {"Title": "113 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1593068700000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "25 Jun 2020", "Summary": "", "MainContent": "<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; As of 25 June 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 113 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders residing in foreign worker dormitories. Based on our investigations so far, there are 5 cases in the community, of whom 1 is a Singaporean and 4 are Work Pass holders.</p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight. </p><p><br><strong>MINISTRY OF HEALTH<br>25 JUNE 2020</strong></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "113-new-cases-of-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}