{"pressItemDictionary": {"Press Releases": [{"Title": "432 More Cases Discharged, 86 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1597586400000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "16 Aug 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As of 16 August 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 86 cases of COVID-19 infection in Singapore. The breakdown of the cases is as follows:</p><p><strong>a)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Imported cases: 6 </strong>(1 Singaporean, 1 Work Pass holder, 3 Dependant’s Pass holders, 1 Student’s Pass holder)<br></p><p>Amongst the 6 imported cases, 1 (Case 55805) is a Singaporean who returned to Singapore from Indonesia on 4 August. Another 3 cases (Cases 55754, 55807 and 55808) are Dependant’s Pass holders who arrived from India on 31 July and the Philippines on 4 August. Another case (Case 55794), who is a Work Pass holder currently employed in Singapore, arrived from the Philippines on 4 August. The remaining case (Case 55810) is a Student’s Pass holder who arrived from Russia on 4 August.<br></p><p>All of them had been placed on 14-day Stay-Home Notice (SHN) upon arrival in Singapore, and were serving their SHN at dedicated facilities. They had been tested while serving their SHN.<br></p><p><br><strong>b)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Cases in the community: 2</strong> (1 Singaporean, 1 Work Permit holder)<br></p><p>Both cases (Cases 55804 and 55790) in the community had been identified as contacts of previously confirmed cases. They had been placed on quarantine earlier, and were tested during quarantine to determine their status. Case 55790 is a technician who had boarded the affected vessel (reported in yesterday’s press release) on 9 August to carry out essential repair and maintenance work. He was subsequently placed on quarantine when some crew members were confirmed to have COVID-19, and swabbed even though he is asymptomatic.<br></p><p>Overall, the number of new cases in the community has remained stable at an average of 2 cases per day in the past 2 weeks. The number of unlinked cases in the community has also remained stable at an average of 1 case per day in the past 2 weeks. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br></p><p><br><strong>c)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Cases residing in dormitories: 78</strong><br></p><p>The Inter-agency Taskforce has completed the testing of all workers in the dormitories. There are currently about 19,900 workers who are still serving out their quarantine period. These workers will be tested when their quarantine ends, and we expect the case counts to remain high in the coming days, before tapering down thereafter.<br></p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Details of these trends can be found in MOH’s daily situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?q=http://www.moh.gov.sg/covid-19/situation-report&amp;source=gmail&amp;ust=1597672797216000&amp;usg=AFQjCNEG7g4w4xd6LKb4MGJVSu-8NQ4z1g\" title=\"\" class=\"\">www.moh.gov.sg/covid-19/<wbr>situation-report</a>). Please refer to <a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-a-16-aug.pdf?sfvrsn=d67560c7_2\" title=\"Annex A\">Annex A</a>&nbsp;for the summary of the confirmed cases.<br></p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Of the new cases, 98% are linked to known clusters, while the rest are pending contact tracing.<br></p><p>&nbsp;</p><p><strong>Links between previous cases found</strong></p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-b-16-aug.pdf?sfvrsn=99e4698c_2\" title=\"Annex B\">Annex B</a>&nbsp;and <a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-c-16-aug.pdf?sfvrsn=9beff3ae_2\" title=\"Annex C\">Annex C</a>&nbsp;for details.<br></p><p>&nbsp;</p><p><strong>Update on condition of confirmed cases</strong></p><p>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 432 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 51,953 have fully recovered from the infection and have been discharged from hospitals or community care facilities.<br></p><p>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; There are currently 82 confirmed cases who are still in hospital. Of these, most are stable or improving, and none is in the intensive care unit. 3,685 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 27 have passed away from complications due to COVID-19 infection.<br></p><p><br><strong>MINISTRY OF HEALTH<br>16 AUGUST 2020</strong></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "432-more-cases-discharged-86-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "86 New Cases of Covid-19 Infection ", "PublishedDate": "/Date(1597562700000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "16 Aug 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As of 16 August 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 86 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders currently under quarantine. Based on our investigations so far, there are 2 cases in the community, of whom 1 is a Singaporean and 1 is a Work Pass holder.</p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In addition, there are 6 imported cases, who had all been placed on Stay-Home Notice or isolated upon arrival in Singapore.&nbsp;<br></p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.<br></p><p><strong><br>MINISTRY OF HEALTH<br></strong><strong>16 AUGUST 2020</strong></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "86-new-cases-of-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}