{"pressItemDictionary": {"Press Releases": [{"Title": "1 New Case of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1609336800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "30 Dec 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\">&nbsp; &nbsp; &nbsp; &nbsp;As of 30 December 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified that there is 1 new case of locally transmitted COVID-19 infection. The case is in the community, and there are no new cases in the dormitories. There are 26 imported cases, of whom 25 had been placed on Stay-Home Notice or isolated upon arrival in Singapore. Amongst the new cases today, 22 are asymptomatic, and were detected from our proactive screening and surveillance, while 5 were symptomatic.&nbsp;&nbsp;<br><br><strong>Summary of new cases</strong><br></p><table border=\"1\" cellspacing=\"0\" cellpadding=\"0\" width=\"605\"><tbody><tr><td width=\"129\"><p align=\"right\">&nbsp;</p></td><td width=\"60\"><p>&nbsp;</p></td><td width=\"16\" valign=\"top\"><p>&nbsp;</p></td><td width=\"192\" colspan=\"2\"><p align=\"center\"><strong>Breakdown by</strong></p></td><td width=\"16\" valign=\"top\"><p>&nbsp;</p></td><td width=\"192\" colspan=\"2\"><p align=\"center\"><strong>Breakdown by</strong></p></td></tr><tr><td width=\"129\"><p align=\"right\">&nbsp;</p></td><td width=\"60\"><p><strong>Number of cases</strong></p></td><td width=\"16\" valign=\"top\"><p>&nbsp;</p></td><td width=\"96\"><p><strong>Already in quarantine/ isolation before detection</strong></p></td><td width=\"96\"><p><strong>Detected from surveillance</strong></p></td><td width=\"16\" valign=\"top\"><p>&nbsp;</p></td><td width=\"96\"><p><strong>Symptomatic</strong></p></td><td width=\"96\"><p><strong>Asymptomatic</strong></p></td></tr><tr><td width=\"129\"><p><strong>Cases in the community</strong></p></td><td width=\"60\"><p align=\"center\">1</p></td><td width=\"16\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">0</p></td><td width=\"96\"><p align=\"center\">1</p></td><td width=\"16\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">1</p></td><td width=\"96\"><p align=\"center\">0</p></td></tr><tr><td width=\"129\"><p><strong>Cases residing in dormitories</strong></p></td><td width=\"60\"><p align=\"center\">0</p></td><td width=\"16\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">0</p></td><td width=\"96\"><p align=\"center\">0</p></td><td width=\"16\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">0</p></td><td width=\"96\"><p align=\"center\">0</p></td></tr><tr><td width=\"129\"><p><strong>Imported cases</strong></p></td><td width=\"60\"><p align=\"center\">26</p></td><td width=\"16\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">24</p></td><td width=\"96\"><p align=\"center\">2</p></td><td width=\"16\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">4</p></td><td width=\"96\"><p align=\"center\">22</p></td></tr><tr><td width=\"129\"><p><strong>Total</strong></p></td><td width=\"60\"><p align=\"center\">27</p></td><td width=\"16\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">&nbsp;</p></td><td width=\"16\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">&nbsp;</p></td></tr></tbody></table><p style=\"text-align: justify;\"><br>2.&nbsp; &nbsp; &nbsp; &nbsp;Overall, the number of new cases in the community has remained low, with a total of 2 cases in the past week who are currently unlinked. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br><br><strong>Case Details<br></strong><br><strong>a) Cases in the community: 1<br></strong><br>There is 1 case in the community today who is currently unlinked. Case 58810 is a Singapore Permanent Resident who works as a Marine Surveyor at Lloyd’s Register Singapore. His work entails working onboard vessels docked at Sembcorp Marine Admiralty Yard.&nbsp;<br><br>He developed acute respiratory infection (ARI) symptoms on 27 December, and sought treatment at a general practitioner clinic on 28 December where he was tested for COVID-19 as part of our enhanced community testing to test all individuals aged 13 and above who are diagnosed with ARI at first presentation to a doctor. He was confirmed to have COVID-19 infection the next day and was conveyed in an ambulance to the National Centre for Infectious Diseases (NCID). His serological test results has come back negative, indicating that this is likely a current infection.&nbsp;<br><br>He had not gone to work since onset of symptoms. His earlier tests from Rostered Routine Testing (RRT) – the last being on 14 December – had been negative for COVID-19 infection.&nbsp;<br><br>Epidemiological investigations are ongoing. In the meantime, all the identified close contacts of the case, including his family members, have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for the close contacts to determine if the case could have been infected by them<br><br><strong>b) Cases residing in dormitories: 0<br></strong><br>There are no cases residing in dormitories today.&nbsp;<br><br><strong>c) Imported cases: 26<br></strong><br>Amongst the 26 imported cases, 3 (Cases 58793, 58794 and 58811) are Singaporeans and 4 (Cases 58790, 58791, 58792 and 58802) are Singapore Permanent Residents who returned from India, Indonesia, Portugal, UK, US and Switzerland. In addition, there are 5 (Cases 58787, 58789, 58795, 58801 and 58809) Work Pass holders who arrived from the Philippines, India and UK. Another 7 are Work Permit holders who arrived from Indonesia and Myanmar, of whom 6 (Cases 58798, 58799, 58803, 58804, 58805 and 58807) are foreign domestic workers.&nbsp;<br><br>Another 3 (Cases 58788, 58796 and 58797) are Dependant’s Pass holders who arrived from India. In addition, there is a Student’s Pass holder (Case 58800) who arrived from Indonesia, a Long-Term Visit Pass holder (Case 58786) who arrived from India and a Short-Term Visit Pass holder (Case 58806) who arrived from Indonesia to visit her Singaporean spouse. The remaining case (Case 58808) is a Special Pass holder who is a crew member of a ship which arrived from Indonesia. He had not disembarked from the ship until he was conveyed to a hospital following a swab onboard.&nbsp;<br><br>Amongst them, 25 had been placed on SHN or isolated upon arrival in Singapore and were tested while serving SHN or under isolation.&nbsp;<br><br>Case 58811 is a Singaporean who works as a pilot with Singapore Airlines. He recently travelled to the UK for work from 19 December to 22 December. He was tested on 23 December as part of RRT for air crew who travel frequently, and his test came back negative for COVID-19 infection. On 26 December, he developed a fever, and sought medical treatment at a general practitioner clinic the next day, where he was swabbed. His test came back positive for COVID-19 infection on 29 December and he was conveyed to NCID in an ambulance. His serological test result has come back negative, indicating a likely current infection. He has also tested preliminarily positive for the B117 strain, a potentially more contagious strain of the COVID-19 virus that is circulating in the UK. Further tests will be conducted to confirm the strain.<br><br>Case 58809 is a Work Pass holder who arrived from the UK on 7 December, and was placed on SHN at a dedicated facility upon arrival in Singapore. He was tested on 17 December and his test result was negative for COVID-19. He ended his SHN on 21 December, but started to develop body ache on 22 December and ARI symptoms on 25 December. He sought medical treatment on 28 December and was swabbed for COVID-19. His test result came back positive on 29 December, and he was conveyed to NCID in an ambulance. His serological test result has come back positive. He has also tested preliminarily positive for the B117 strain, and is pending further confirmatory tests.&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp;Epidemiological investigations are in progress. In the meantime, all the identified close contacts of the cases have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for the close contacts to determine if the cases could have been infected by them.<br><br>4.&nbsp; &nbsp; Please refer to the <a href=\"/docs/librariesprovider5/default-document-library/annexes3afc55a1d353454ba0d649842c42b6bc.pdf?sfvrsn=54c349ce_0\" title=\"Annexes\">Annexes</a>&nbsp;and MOH’s daily Situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\" title=\"\" class=\"\" target=\"\">www.moh.gov.sg/covid-19/situation-report</a>) for details.&nbsp;<br><br><strong>Update on condition of confirmed cases<br></strong><br>5.&nbsp; &nbsp; &nbsp;11 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 58,411 have fully recovered from the infection and have been discharged from hospitals or community care facilities.&nbsp;<br><br>6.&nbsp; &nbsp; &nbsp; &nbsp;There are currently 52 confirmed cases who are still in hospital. Of these, most are stable or improving, and none is in the intensive care unit. 77 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 29 have passed away from complications due to COVID-19 infection.&nbsp;<br><br><strong>MINISTRY OF HEALTH<br>30 DECEMBER 2020</strong><br></p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "1-new-case-of-locally-transmitted-covid-19-infection-30dec-update", "CurrentPageUrl": null}, {"Title": "Medifund Continues to Assist Needy Singaporeans With Their Healthcare Needs", "PublishedDate": "/Date(1609318800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "30 Dec 2020", "Summary": "", "MainContent": "<p><span style=\"font-size: 16px;\">1.&nbsp; &nbsp; &nbsp;&nbsp;The Medical Endowment Fund (MediFund) provided a total of $159.1 million through more than 1.2 million successful applications in assistance to needy Singaporeans for their medical bills in Financial Year (FY) 2019, i.e. for the period 1 April 2019 to 31 March 2020. This was an increase of $2.6 million compared to the $156.5 million disbursed in FY2018.<br><br>2.&nbsp; &nbsp; &nbsp;&nbsp;MediFund assists needy Singaporean patients who are unable to afford their medical bills, after government subsidies, insurance and MediSave. MediFund Silver and MediFund Junior provide more targeted assistance for the elderly and children respectively. MediFund ensures that no Singaporean will be denied basic medical care due to inability to pay.<br><br>3.&nbsp; &nbsp; &nbsp;&nbsp;The increase in assistance is due to the support extended towards patients in Intermediate and Long-term Care (ILTC) facilities, including the elderly. The key statistics of MediFund assistance provided in FY2019 are:<br><br></span></p> <p style=\"margin-left: 40px;\"><span style=\"font-size: 16px;\">(i) The number of approved MediFund applications was 1,215,809. This was a 1.9% decrease from the 1,239,578 number of approved applications in FY2018, contributed by a decrease in the total number of applications over the period[1];<br><br>(ii) In public hospitals and institutions, a total assistance of $122.8 million was provided to patients, compared to $124.2 million in FY2018;<br><br>(iii) In ILTC facilities, a total assistance of $36.2 million was provided to patients, compared to $32.3 million in FY2018; and<br><br>(iv) On average, the amount of MediFund assistance provided was about $900 per inpatient treatment, and about $90 per outpatient treatment.<br><br></span></p> <p><span style=\"font-size: 16px;\">4.&nbsp; &nbsp; &nbsp;&nbsp;More details can be found in the <a href=\"https://www.moh.gov.sg/docs/librariesprovider5/default-document-library/medical-endowment-scheme-annual-report-fy2019-2020\" title=\"\" class=\"\" target=\"\"><span style=\"text-decoration: underline;\">Medical Endowment Scheme Annual Report 2019/2020</span></a>.<br><br><br></span><strong style=\"font-size: 16px;\">MINISTRY OF HEALTH<br></strong><strong style=\"font-size: 16px;\">30 DECEMBER 2020</strong></p> <div><span style=\"font-size: 16px;\"><br><br clear=\"all\"> </span><hr align=\"left\" size=\"1\" width=\"33%\"> <div id=\"ftn1\"> <p><span style=\"font-size: 16px;\">[1] Total applications decreased by about 1.7%.</span></p> </div> </div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "medifund-continues-to-assist-needy-singaporeans-with-their-healthcare-needs-2020", "CurrentPageUrl": null}, {"Title": "1 New Case of Locally Transmitted Covid-19 Infection ", "PublishedDate": "/Date(1609317000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "30 Dec 2020", "Summary": "", "MainContent": "<p><span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp; As of 30 December 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 1 new case of locally transmitted COVID-19 infection. Based on our investigations so far, the case is in the community, and there are no new cases in the dormitories.<br><br>2.&nbsp; &nbsp; &nbsp;&nbsp;In addition, there are 26 imported cases, of whom 25 had been placed on Stay-Home Notice or isolated upon arrival in Singapore. The remaining case is a pilot with Singapore Airlines who had tested negative for COVID-19 upon return to Singapore but developed symptoms subsequently. Amongst the imported cases, 7 are Singaporeans or Singapore Permanent Residents, and 6 are foreign domestic workers. In total, there are 27 new cases of COVID-19 infection in Singapore today.<br><br>3.&nbsp; &nbsp; &nbsp;&nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.<br><br><strong>MINISTRY OF HEALTH<br></strong><strong>30 DECEMBER 2020</strong></span></p><div> <p><span style=\"font-size: 16px;\"><br></span></p> </div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "1-new-case-of-locally-transmitted-covid-19-infection-30-dec", "CurrentPageUrl": null}, {"Title": "Minimum Legal Age for Tobacco Raised to 21 Years Old From 1 January 2021", "PublishedDate": "/Date(1609257600000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "30 Dec 2020", "Summary": "", "MainContent": "1.&nbsp; &nbsp; &nbsp; From 1 January 2021, the Minimum Legal Age for the purchase, use, possession, sale and supply of tobacco products (MLA) will be raised from 20 to 21 years old.<br><br>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Raising the MLA is part of Singapore's ongoing efforts to reduce smoking prevalence. It aims to prevent youth from picking up smoking by limiting access to tobacco products, and to further de-normalise smoking particularly for those below 21 of age.<br><br>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The change in the MLA from 18 to 21 years old was debated and passed in Parliament on 7 November 2017, as part of the Tobacco (Control of Advertisements and Sale) (Amendment) Bill 2017. The MLA was subsequently raised from 18 to 19 years old on 1 January 2019, and from 19 years old to 20 years old on 1 January 2020.<br><br>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The tobacco industry, including retailers, importers and wholesalers, have been reminded of the changes. Warning notices, stating that sale of tobacco to persons below the age of 21 is not permitted, have been distributed to retailers for display at their outlets.<br><br>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Retailers who contravene the law and sell any tobacco products to a person below the MLA shall be liable on conviction to a maximum fine of $5,000 for the first offence and $10,000 for subsequent offences. In addition, their tobacco retail licences will be suspended for the first offence and revoked for subsequent offences. If any outlet is found selling tobacco products to underage persons in school uniform or those below 12 years of age, its tobacco retail licence will be revoked, even at the first offence.<br><br>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Persons caught giving or furnishing tobacco to a person below the MLA shall be liable on conviction to a maximum fine of $500 for the first offence and $1,000 for subsequent offences. Persons caught buying or acquiring tobacco for a person below the MLA shall be liable on conviction to a maximum fine of $2,500 for the first offence and $5,000 for subsequent offences. Underage smokers who are caught using, buying or having in their possession tobacco products are liable on conviction to a fine of up to $300.<br><br>7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Members of the public can report errant retailers to the Health Sciences Authority's (HSA) Tobacco Regulation Branch using the online form at <a href=\"https://go.gov.sg/reporttobaccooffences\" title=\"\" class=\"\" target=\"\">go.gov.sg/reporttobaccooffences</a>. Alternatively, they can call 6684 2036 or 6684 2037 during office hours (9:00am to 5:30pm, Monday to Friday).<br><br>8.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Tobacco use is one of the highest contributors to ill health and premature death in Singapore. It is associated with cancers (e.g. mouth, lung), ischaemic heart disease, stroke, lung disease and many other diseases.<br><br>9.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The Ministry of Health (MOH) is committed to lowering smoking prevalence in Singapore through a comprehensive, multipronged approach to discourage and reduce the use of tobacco products. Together with the Health Promotion Board, HSA, our partners and the wider community, we have adopted a range of tobacco control measures to reduce smoking prevalence. In addition to MLA, the range of tobacco control measures include public education, taxation, smoking cessation programmes, bans on tobacco advertising, point-of-sale display ban, and standardised packaging of tobacco products.", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "minimum-legal-age-for-tobacco-raised-to-21-years-old-from-1-january-2021", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}