{"pressItemDictionary": {"Press Releases": [{"Title": "211 More Cases Discharged; 310 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1595428320000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "22 Jul 2020", "Summary": "", "MainContent": "<p><span style=\"font-size: 13px;\">&nbsp; &nbsp; &nbsp; As of 22 July 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 310 cases of COVID-19 infection in Singapore. The breakdown of the cases is as follows:&nbsp;<br><br><strong>a)</strong>&nbsp;<strong>Imported cases: 6 </strong>(3 Singaporeans/ Permanent Residents, 3 Work Pass holders) <br><br>Amongst the imported cases, 3 (Cases 48551, 48552 and 48821) are Singaporeans/Permanent Residents who returned to Singapore from India on 12 July, and from Kazakhstan on 10 July. The remaining 3 (Cases 48535, 48579 and 48820) are Work Pass holders who are currently employed in Singapore. They arrived in Singapore from the Philippines on 8 July and 10 July. All of them had been placed on 14-day Stay-Home Notice (SHN) upon arrival in Singapore, and had been tested while serving their SHN.&nbsp;<br><br><strong>b)&nbsp;Cases in the community: 7 </strong>(3 Singaporeans, 3 Work Pass holders, 1 Work Permit holder) <br><br>Of the 7 cases in the community, 6 were picked up as a result of our proactive surveillance and screening, and 1 had already been placed on quarantine earlier. 6 of the cases are asymptomatic, and were detected through our proactive testing. <br><br>2 of the community cases today are linked to previous cases or clusters. Of these, 1 (Case 48550) had been identified as a contact of a previously confirmed case, and had been placed on quarantine earlier. She was tested during quarantine to determine her status, even though she is asymptomatic. The remaining case (Case 48695) was swabbed as part of our efforts to screen individuals working in frontline COVID-19 operations, and had been detected before symptoms onset.&nbsp; <br><br>5 of the community cases are currently unlinked. All of them were detected from our proactive screening of workers in essential services who are living outside the dormitories, even though they are asymptomatic. <br><br>Epidemiological investigations of the unlinked cases are in progress. In the meantime, all the identified close contacts of the cases have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for their household contacts to determine if these cases could have been infected by them. <br><br>Overall, the number of new cases in the community has decreased, from an average of 13 cases per day in the week before, to an average of 9 per day in the past week. The number of unlinked cases in the community has also decreased, from an average of 8 cases per day in the week before, to an average of 5 per day in the past week.&nbsp;We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.&nbsp;<br><br>c)&nbsp;Cases residing in dormitories: 297&nbsp; <br><br>We continue to pick up cases amongst Work Permit holders residing in dormitories, including in factory-converted dormitories, because of extensive testing in these premises, as part of our process to verify and test the status of all workers.&nbsp; <br><br>2.&nbsp; &nbsp; &nbsp;&nbsp;Details of these trends can be found in MOH’s daily situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\">www.moh.gov.sg/covid-19/situation-report</a>). Please refer to <u><a href=\"/docs/librariesprovider5/default-document-library/annex-af8dbde1ce8904bda9c2b59c451e6ebf1.pdf?sfvrsn=b197fcea_0\" title=\"Annex A\">Annex A</a></u> for the summary of the confirmed cases. <br><br>3.&nbsp; &nbsp; &nbsp; Of the new cases, 98% are linked to known clusters, while the rest are pending contact tracing. <br><br>4.&nbsp; &nbsp; &nbsp; The Inter-Agency Task Force has been systematically and progressively clearing dormitories through aggressive testing of migrant workers residing in dormitories. The following dormitories have been cleared, and now house only recovered individuals and those who have recently tested negative for COVID-19 infection. As such, the clusters have now been closed.&nbsp;<br></span></p><ul><li><p><span style=\"font-size: 13px;\">Cochrane Lodge II (49 Admiralty Road West); </span></p></li><li><p><span style=\"font-size: 13px;\">Hulett Dormitory (20 Senoko Drive);</span></p></li><li><p><span style=\"font-size: 13px;\">Shaw Lodge (12 Shaw Road); </span></p></li><li><p><span style=\"font-size: 13px;\">Tampines Dormitory (2 Tampines Place);</span></p></li><li><p><span style=\"font-size: 13px;\">31 Sungei Kadut Avenue; and</span></p></li><li><p><span style=\"font-size: 13px;\">230 Woodlands Industrial Park E5.</span></p></li></ul><p><span style=\"font-size: 13px;\"><strong>Links between previous cases found</strong><br><br>5.&nbsp; &nbsp; &nbsp; In the past week (15 July to 21 July), MOH has uncovered links for 2 previously unlinked cases in the community. <br><br>6.&nbsp; &nbsp; &nbsp; Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <u><a href=\"/docs/librariesprovider5/default-document-library/annex-b4e2b1dac13e6469688680579eb7d3bef.pdf?sfvrsn=685e9762_0\" title=\"Annex B\">Annex B</a></u> and <u><a href=\"/docs/librariesprovider5/default-document-library/annex-ce32a6752a2db47d89ad2905d3cd88f0e.pdf?sfvrsn=59958ae3_0\" title=\"Annex C\">Annex C</a></u> for details.&nbsp;<br><br><strong>Update on condition of confirmed cases&nbsp;<br><br></strong>7.&nbsp; <strong>&nbsp; &nbsp;&nbsp;</strong>211 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 44,795 have fully recovered from the infection and have been discharged from hospitals or community care facilities. <br><br>8.&nbsp; &nbsp; &nbsp; There are currently 150 confirmed cases who are still in hospital. Of these, most are stable or improving, and none is in the intensive care unit. 3,772 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 27 have passed away from complications due to COVID-19 infection.<br></span></p> <div> <p><span style=\"font-size: 13px;\"><strong>MINISTRY OF HEALTH<br></strong><strong>22 JULY 2020</strong></span></p> </div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "211-more-cases-discharged-310-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "310 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1595359200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "22 Jul 2020", "Summary": "", "MainContent": "<p align=\"center\" style=\"text-align: left;\"><span style=\"text-align: left;\">&nbsp; &nbsp; &nbsp; As of 22 July 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 310 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders residing in foreign worker dormitories. Based on our investigations so far, there are 7 cases in the community, of whom 3 are Singaporeans/ Permanent Residents and 4 are Work Pass holders.&nbsp;<br><br></span>2.&nbsp; &nbsp; &nbsp; In addition, there are 6 imported cases who had been placed on Stay-Home Notice upon arrival in Singapore. <br><br>3.&nbsp; &nbsp; &nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.</p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "310-new-cases-of-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}