{"pressItemDictionary": {"Press Releases": [{"Title": "71 More Cases Discharged, 27 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1600267320000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "16 Sep 2020", "Summary": "", "MainContent": "&nbsp; &nbsp; &nbsp; As of 16 September 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 27 cases of COVID-19 infection in Singapore. The breakdown of the cases is as follows:<br><br><strong>Summary of new cases</strong><br><br>All new cases today are asymptomatic, and were detected from our proactive screening and surveillance.&nbsp;<br><div><br></div><table style=\"border-color: rgb(0, 0, 0);\" class=\"\"><tbody><tr><td class=\"\">&nbsp;</td><td><strong>Already in quarantine/ isolation before detection</strong>&nbsp;</td><td><strong>Detected from surveillance</strong>&nbsp;</td><td><strong>Total</strong>&nbsp;</td></tr><tr><td>&nbsp;<strong>Imported cases</strong></td><td>&nbsp;2</td><td>&nbsp;0</td><td>&nbsp;2</td></tr><tr><td>&nbsp;<strong>Cases in the community</strong></td><td>&nbsp;0</td><td>&nbsp;2</td><td>&nbsp;2</td></tr><tr><td>&nbsp;<strong>Cases residing in dormitories</strong></td><td>&nbsp;17</td><td>&nbsp;6</td><td>&nbsp;23</td></tr></tbody></table><br><strong>a) Imported cases: 2 (1 Singaporean, 1 Long-Term Visit Pass holder)</strong><br><br>Both imported cases arrived from India. Case 57652 is a Singaporean who returned to Singapore on 12 September. Case 57638 is a Long-Term Visit Pass holder who arrived on 3 September. They had been placed on 14-day Stay-Home Notice (SHN) upon arrival in Singapore, and were tested while serving their SHN at dedicated facilities.&nbsp;<br><br><strong>b) Cases in the community: 2 (2 Work Permit holders)<br></strong><br>There are 2 cases in the community, both of whom were picked up as a result of our proactive surveillance and screening, even though they are asymptomatic. Cases 57630 and 57631 were detected from our Rostered Routine Testing of workers in the construction, marine and process sectors who are living outside the dormitories. Case 57631 is linked to an earlier case, while Case 57630 is currently unlinked.&nbsp;<br><br>Overall, the number of new cases in the community has decreased, from an average of 2 cases per day in the week before, to an average of 1 per day in the past week. The number of unlinked cases in the community has also decreased, from an average of 1 case per day in the week before, to an average of fewer than 1 per day in the past week. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br><br><strong>c) Cases residing in dormitories: 23</strong><br><br>Amongst the 23 cases residing in dormitories, 17 had been identified earlier as contacts of previous cases, and had already been quarantined to prevent further transmission. They were tested during quarantine to determine their status.&nbsp;&nbsp;<br><br>The remaining 6 cases were detected through surveillance testing, such as our bi-weekly Rostered Routine Testing of workers living in dormitories. This allows us to pick up cases early, including asymptomatic ones, so that we are able to ring-fence them quickly to prevent further transmission, by aggressively containing, tracing and isolating the close contacts.&nbsp;<br><br>Besides the polymerase chain reaction (PCR) test, we have also conducted serological tests to determine if some of the cases are current or past infections.<sup>1 </sup>The serological test results for 8 cases have come back positive so far, which indicate likely past infection.<br><br>2.&nbsp; &nbsp; &nbsp;Details of these trends can be found in MOH’s daily situation Report (<a href=\"https://www.moh.gov.sg/covid-19/situation-report\" title=\"\" class=\"\" target=\"\">www.moh.gov.sg/covid-19/situation-report)</a>. Please refer to <a href=\"/docs/librariesprovider5/default-document-library/annex-a812a88c499f54243a973721070a753e9.pdf?sfvrsn=7dac17e_0\" title=\"Annex A \">Annex A </a>&nbsp;for the summary of the confirmed cases.&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp;Of the new cases, 85% are imported or linked to known cases/ clusters, while the rest are pending contact tracing.&nbsp;<br><br><strong>Links between previous cases found</strong><br><br>4.&nbsp; &nbsp; &nbsp;Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <a href=\"/docs/librariesprovider5/default-document-library/annex-b07fadbdaf8ef4231b3df56f9f6240f32.pdf?sfvrsn=fc3bb0f9_0\" title=\"Annex B \">Annex B </a>and <a href=\"/docs/librariesprovider5/default-document-library/annex-ce91fc2786ac343cb822f8fa398f1bb57.pdf?sfvrsn=61bbe14b_0\" title=\"Annex C \">Annex C </a>&nbsp;for details.&nbsp;<br><br><strong>Update on condition of confirmed cases</strong><br><br>5.&nbsp; &nbsp; &nbsp;71 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 56,955 have fully recovered from the infection and have been discharged from hospitals or community care facilities.&nbsp;<br><br>6.&nbsp; &nbsp; &nbsp;There are currently 42 confirmed cases who are still in hospital. Of these, most are stable or improving, and none is in the intensive care unit. 490 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 27 have passed away from complications due to COVID-19 infection.&nbsp;<br><div><p dir=\"ltr\"><br><br><br><strong>MINISTRY OF HEALTH<br>16 SEPTEMBER 2020</strong><br></p></div><hr><br><div><span style=\"font-size: 11px;\"><sup>1 </sup>Cases whose serological tests are positive are likely to have a past infection, and could be shedding minute fragments of the virus RNA picked by the PCR test, which were no longer transmissible and infective to others.</span></div><br>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "71-more-cases-discharged-27-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "27 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1600240680000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "16 Sep 2020", "Summary": "", "MainContent": "<p dir=\"ltr\">&nbsp; &nbsp; &nbsp; &nbsp;As of 16 September 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 27 cases of COVID-19 infection in Singapore. Based on our investigations so far, there are 2 cases in the community, both of whom are Work Pass holders. <br><br>2.&nbsp; &nbsp; There are 2 imported cases, who had been placed on Stay-Home Notice upon arrival in Singapore.&nbsp; <br><br>3.&nbsp; &nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;</p><br><br><p dir=\"ltr\"><strong>MINISTRY OF HEALTH<br>16 SEPTEMBER 2020</strong></p><div><br></div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "27-new-cases-of-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}