{"pressItemDictionary": {"Press Releases": [{"Title": "Five more cases discharged; 23 new cases of COVID-19 infection confirmed", "PublishedDate": "/Date(1584449100000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "17 Mar 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Five more cases of COVID-19 infection have been discharged from hospital (Cases 122, 123, 131, 171 and 196). In all, 114 have fully recovered from the infection and have been discharged from hospital.</p><p>2.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;As of 17 March 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified 23 more cases of COVID-19 infection in Singapore. Of these:</p> <ul><li>17 are imported cases (Cases 244, 246, 247, 249, 250, 253, 254, 255, 257, 258, 259, 261, 262, 263, 264, 265 and 266); and </li><li>Two are linked to previous cases (Case 251 is linked to Case 186; and Case 256 is linked to Case 205); and</li><li>Four are currently unlinked (Cases 245, 248, 252 and 260).</li></ul><p><strong>Links between previous cases found</strong></p> <p>3.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. This was made possible with the assistance of the Singapore Police Force.</p><p><p>a)&nbsp; &nbsp; &nbsp;Eight of the locally transmitted confirmed cases (Cases 31, 33, 38, 83, 90, 91, 138 and 151), as well as Cases 8 and 9, are linked to The Life Church and Missions Singapore. These cases are linked to another 23 confirmed cases (Cases 48, 49, 51, 53, 54, 57, 58, 60, 61, 62, 63, 66, 67, 68, 70, 71, 73, 74, 78, 80, 81, 84, 88) who are linked to the Grace Assembly of God.</p></p><p><p>b)&nbsp; &nbsp; 14 of the confirmed cases (Cases 93, 95, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 108 and 110) are linked to Wizlearn Technologies Pte Ltd.</p></p><p><p>c)&nbsp; &nbsp; 47 of the confirmed cases (Cases 94, 96, 107, 112, 114, 115, 116, 117, 118, 120, 121, 122, 125, 127, 128, 129, 130, 131, 133, 134, 137, 139, 140, 142, 144, 145, 146, 148, 149, 150, 155, 156, 157, 158, 159, 160, 161, 164, 166, 174, 179, 185, 186, 196, 201, 218 and 224) are linked to a private dinner function at SAFRA Jurong on 15 February. Two (Cases 142 and 144) are linked to the clusters at boulder+ Gym and Church of Singapore (Bukit Timah).</p></p><p><p>i. Three of the confirmed cases (Cases 142, 162 and 163) are linked to boulder+ Gym (12 Kallang Avenue).</p></p><p><p>ii. Four of the confirmed cases (Cases 144, 208, 214 and 235) are linked to the Church of Singapore (Bukit Timah) (2B Hindhede Road).</p></p><p><p><br>4.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Investigations on these clusters are ongoing. In addition to the clusters, our investigations have identified the following links between cases:</p></p> <ul><li>Case 72 is linked to Cases 59 and 79; </li><li>Case 86 is linked to Case 82;</li><li>Case 126 is linked to Case 109; </li><li>Case 143 is linked to Case 132; </li><li>Case 167 is linked to Case 178; </li><li>Case 190 is linked to Cases 172 and 184; </li><li>Case 200 is linked to Case 165; </li><li>Case 219 is linked to Cases 142, 211 and 236; </li><li>Case 221 is linked to Case 204;</li><li>Case 237 is linked to Case 225;</li><li>Case 242 is linked to Case 166;</li><li>Case 251 is linked to Case 186; and</li><li>Case 256 is linked to Case 205.</li></ul><p><br>5.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Contact tracing is underway for the other 16 locally transmitted cases to establish any links to previous cases or travel history to affected countries or regions.</p><p><p><strong><br></strong><strong>About the confirmed cases</strong></p><p><u>Case 244</u></p><p>6.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Case 244 is an imported case involving a 53 year-old male Singapore Citizen who had been in Germany from 26 February to 29 February, Italy from 29 February to 7 March, and Switzerland from 7 March to 14 March. He is currently warded in an isolation room at the National Centre for Infectious Diseases (NCID). He is linked to Case 243.</p></p><p><p>7.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;He reported onset of symptoms on 7 March. He presented at the emergency department of Gleneagles Hospital on 15 March, and was referred to NCID on the same day. Subsequent test results confirmed COVID-19 infection on 16 March afternoon.</p></p><p><p>8.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Prior to hospital admission, he had gone to work at a home office at River Valley Road. He stays at Alexandra Road.</p></p><p><p><u>Case 245</u></p></p><p>9.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Case 245 is a 76 year-old male Singaporean Citizen with no recent travel history to affected countries and regions. He is currently warded in an isolation room at Singapore General Hospital (SGH). </p><p>10.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;He reported onset of symptoms on 12 March, and was conveyed by ambulance to SGH on 15 March. Subsequent test results confirmed COVID-19 infection on 16 March afternoon.</p><p>11.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Prior to hospital admission, he had gone to work at Marina One West Tower (9 Straits View). He stays at Boon Lay Drive.</p><p><p><u>Case 246</u></p><p>12.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Case 246 is an imported case involving a 39 year-old male Canadian national who had been in Japan from 23 February to 7 March. He is currently warded in an isolation room at SGH.</p></p><p><p>13.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;He reported onset of symptoms on 9 March. He presented at the emergency department of SGH on 15 March and subsequent test results confirmed COVID-19 infection on 16 March afternoon.</p></p><p><p>14.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Prior to hospital admission, he had visited Singtel Comcentre (31 Exeter Road). He stays in the Tanjong Pagar area.</p></p><p><p><u>Case 247</u></p><p>15.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Case 247 is an imported case involving a 41 year-old male Singapore Citizen who had been in the United Kingdom from 5 March to 8 March, and again from 10 March to 12 March, and France from 8 March to 10 March. He is currently warded in an isolation room at NCID.</p></p><p><p>16.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;He reported onset of symptoms on 16 March, and had presented at NCID on the same day. Subsequent test results confirmed COVID-19 infection on 16 March afternoon.</p></p><p><p>17.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;He stays at Tampines Avenue 8.</p></p><p><p><u>Case 248</u></p><p>18.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Case 248 is a 23 year-old female Malaysian national who is a Singapore Work Pass holder, and had been in Malaysia from 12 March to 13 March. She was confirmed to have COVID-19 infection on 17 March morning, and is currently warded in an isolation room at NCID.</p></p><p><p><u>Case 249</u></p><p>19.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Case 249 is an imported case involving a 42 year-old male Singapore Permanent Resident who had been in the United States from 4 March to 16 March. He was confirmed to have COVID-19 infection on 17 March morning, and is currently warded in an isolation room at NCID.</p></p><p><p><u>Case 250</u></p><p>20.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Case 250 is an imported case involving a 28 year-old male British national who is a Singapore Work Pass holder, and had been in the United Kingdom and Austria from 29 February to 14 March. He was confirmed to have COVID-19 infection on 17 March morning, and is currently warded in an isolation room at NCID.<br></p></p><p><p><u>Case 251</u><br></p><p>21.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Case 251 is a 59 year-old female Singapore Citizen with no recent travel history to affected countries and regions. She was confirmed to have COVID-19 infection on 17 March morning, and is currently warded in an isolation room at NCID. She is a family member of Case 186<sup>[1]</sup>.</p></p><p><p><u>Case 252</u></p><p>22.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Case 252 is a 66 year-old male Singapore Citizen, who had been in Malaysia from 25 February to 29 February. He was confirmed to have COVID-19 infection on 17 March morning, and is currently warded in an isolation room at NCID.</p></p><p><p><u>Case 253</u></p></p><p>23.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Case 253 is an imported case involving a 24 year-old male Singapore Citizen who had been in Spain from 12 February to 16 March. He was confirmed to have COVID-19 infection on 17 March morning, and is currently warded in an isolation room at NCID.</p><p><u>Case 254</u></p><p>24.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Case 254 is an imported case involving a 43 year-old female Singapore Permanent Resident who had been in France from 22 February to 13 March. She was confirmed to have COVID-19 infection on 17 March morning, and is currently warded in an isolation room at NCID.</p><p><p><u>Case 255</u></p><p>25.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Case 255 is an imported case involving a 44 year-old male Swedish national, who is a Singapore Work Pass holder, and had been in Norway, Denmark and Sweden from 1 March to 9 March. He was confirmed to have COVID-19 infection on 17 March morning, and is currently warded in an isolation room at NCID.</p></p><p><p><u>Case 256</u></p><p>26.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Case 256 is a 32 year-old female Filipino national who is a Singapore Work Pass holder, and has no recent travel history to affected countries and regions. She was confirmed to have COVID-19 infection on 17 March morning, and is currently warded in an isolation room at NCID. She is linked to Case 205<sup>[2]</sup>.</p></p><p><p><u>Case 257</u></p></p><p>27.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Case 257 is a 19 year-old male French national, who is a Singapore Long Term Pass holder, and had been in the United Kingdom from 16 October 2019 to 14 March 2020. He was confirmed to have COVID-19 infection on 17 March morning, and is currently warded in an isolation room at the National University Hospital (NUH).</p><p><u>Case 258</u></p><p>28.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Case 258 is an imported case involving a 47 year-old male Indian national who had been in Europe from 9 February to 15 March. He was confirmed to have COVID-19 infection on 17 March morning, and is currently warded in an isolation room at NCID.</p><p><p><u>Case 259</u></p></p><p>29.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Case 259 is an imported case involving a 30 year-old female Singapore Citizen, who had been in the Philippines from 7 March to 9 March. She was confirmed to have COVID-19 infection on 17 March morning, and is currently warded in an isolation room at NCID.</p><p><u>Case 260 </u></p><p>30.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Case 260 is a 48 year-old female Singapore Permanent Resident who has no recent travel history to affected countries and regions. She was confirmed to have COVID-19 infection on 17 March morning, and is currently warded in an isolation room at Farrer Park Hospital.</p><p><p><u>Case 261</u></p></p><p>31.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Case 261 is an imported case involving a 30 year-old male American national who is a Singapore Work Pass holder, and had been in the United States from 23 February to 9 March, and France from 9 March to 15 March. He was confirmed to have COVID-19 infection on 17 March morning, and is currently warded in an isolation room at NCID.</p><p><u>Case 262</u></p><p>32.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Case 262 is an imported case involving a 20 year-old female Indonesian national, who had been in the United Kingdom from late January to 16 March. She was confirmed to have COVID-19 infection on 17 March morning, and is currently warded in an isolation room at NCID.</p><p><p><u>Case 263</u></p></p><p>33.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Case 263 is an imported case involving a 52 year-old female Singapore Citizen who was in Spain from 6 March to 8 March and again from 9 March to 14 March, and Portugal from 8 March to 9 March. She was confirmed to have COVID-19 infection on 17 March morning, and is currently warded is an isolation room at NCID. She is linked to Case 266.</p><p><u>Case 264</u></p><p>34.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Case 264 is an imported case involving a 41 year-old female Indonesian national who arrived in Singapore on 16 March. She was confirmed to have COVID-19 infection on 17 March morning, and is currently warded in an isolation room at NCID.<br></p><p><p><u>Case 265</u><br></p><p>35.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Case 265 is an imported case involving a 25 year-old female Singapore Citizen who had been in the United Kingdom from 6 March to 14 March. She was confirmed to have COVID-19 infection on 17 March morning, and is currently warded in an isolation room at NCID.</p></p><p><p><u>Case 266</u></p></p><p>36.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Case 266 is an imported case involving a 63 year-old male Singapore Citizen who had been in Spain from 6 March to 8 March and again from 9 March to 14 March, and Portugal from 8 March to 9 March. He was confirmed to have COVID-19 infection on 17 March morning, and is currently warded in an isolation room at NCID. He is linked to case 263.</p><p><u>Case 233 (Announced on 16 March)</u></p><p>37.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Case 233 is an imported case involving a 61 year-old male British national who is a Singapore Long Term Pass holder, and had been in the United Kingdom from 6 March to 13 March. He is currently warded in an isolation room at NCID.<br></p><p>38.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;He reported onset of symptoms on 15 March and had sought treatment at the emergency department of Parkway East Hospital on 15 March. He was referred to NCID on the same day. Subsequent test results confirmed COVID-19 infection on 16 March morning.</p><p>39.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;He stays at East Coast Road.</p><p><p><u>Case 234 (Announced on 16 March)</u></p></p><p>40.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Case 234 is an 86 year-old male Singapore Citizen who has no recent travel history to affected countries and regions. He is currently warded in an isolation room at SGH. </p><p>41.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;He reported onset of symptoms on 28 February, and had sought treatment at a GP clinic and Bukit Merah Polyclinic on 2 March, 9 March and 14 March. He presented at the emergency department of SGH on 14 March. Subsequent test results confirmed COVID-19 infection on 16 March morning.<br></p><p><p>42.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;He stays at Telok Blangah Heights.<br></p></p><p><p><u>Case 235 (Announced on 16 March)</u><br></p><p>43.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Case 235 is a 31 year-old female Singapore Citizen with no recent travel history to affected countries and regions. She is currently warded in an isolation room at SGH. She is linked to Case 208<sup>[3]</sup>.</p></p><p>44.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;She reported onset of symptoms on 11 March and had sought treatment at SGH’s staff clinic on 13 March and 14 March. Subsequent test results confirmed COVID-19 infection on 16 March morning.</p><p>45.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Prior to hospital admission, she had gone to work as a Medical Social Worker at SGH (Outram Road). She stays at Bukit Batok West Avenue 8.</p><p><p><u>Case 236 (Announced on 16 March)</u></p></p><p>46.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Case 236 is a 30 year-old female Singapore Citizen with no recent travel history to affected countries and regions. She is currently warded in an isolation room at NCID. She is a family member of Case 219<sup>[4]</sup>, and is linked to Cases 142<sup>[5]</sup>&nbsp;and 211<sup>[6]</sup>.</p><p>47.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;As she had been identified as a contact of Case 142, she was placed under quarantine since 9 March. She reported onset of symptoms on 10 March and was conveyed by ambulance to NCID on 15 March. Subsequent test results confirmed COVID-19 infection on 16 March morning.<br></p><p><p>48.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;She stays at Bishan Street 22.</p></p><p><p><u>Case 237 (Announced on 16 March)</u></p><p>49.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Case 237 is a 36 year-old female Indonesian national who is a Singapore Work Pass holder, and has no recent travel history to affected countries and regions. She is currently warded in an isolation room at NCID. She is linked to Case 225.<br></p></p><p><p>50.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;She reported onset of symptoms on 12 March and had sought treatment at a GP clinic on 13 March. As she had been identified as a contact of Case 225, she was referred by MOH to NCID on 15 March. Subsequent test results confirmed COVID-19 infection on 16 March morning.<br></p></p><p><p>51.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;She stays at Beach Road.</p></p><p><p><u>Case 238 (Announced on 16 March)</u></p><p>52.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Case 238 is an imported case involving a 83 year-old female Belgium national who arrived in Singapore on 6 March. She is currently warded in an isolation room at NCID.<br></p></p><p><p>53.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;She reported onset of symptoms on 14 March and had sought treatment at Raffles Hospital on 15 March. She was referred to NCID on 15 March and subsequent test results confirmed COVID-19 infection on 16 March morning.<br></p></p><p><p>54.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Prior to hospital admission, she mostly stayed in the Jalan Besar area.</p></p><p><p><u>Case 239 (Announced on 16 March)</u></p><p>55.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Case 239 is an imported case involving a 28 year-old male British national who is a Singapore Work Pass holder, and had been in France from 7 March to 14 March. He is currently warded in an isolation room at NCID. He is linked to Case 241.<br></p></p><p><p>56.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;He reported onset of symptoms on 14 March and was referred to NCID upon arrival in Singapore. Subsequent test results confirmed COVID-19 infection on 16 March morning.<br></p></p><p><p>57.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;He stays at Cairnhill Rise.</p></p><p><p><u>Case 240 (Announced on 16 March)</u></p><p>58.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Case 240 is an imported case involving a 27 year-old male Singapore Permanent Resident who had been in Spain from 7 March to 14 March. He is currently warded in an isolation room at NUH. He is a family member of Case 229.<br></p></p><p><p>59.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;He reported onset of symptoms on 14 March and had presented at NCID on 15 March. Subsequent test results confirmed COVID-19 infection on 16 March morning.<br></p></p><p>60.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;He stays at Kim Keat Road.</p><p><u>Case 241 (Announced on 16 March)</u></p><p>61.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Case 241 is an imported case involving a 28 year-old male British national who is a Singapore Work Pass holder, and had been in France from 7 March to 14 March. He is currently warded in NCID. He is linked to Case 239.</p><p><p>62.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;He reported onset of symptoms on 11 March while in France, and was referred to NCID upon arrival in Singapore on 15 March. Subsequent test results confirmed COVID-19 infection on 16 March morning.<br></p></p><p><p>63.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;He stays in the Cairnhill Road area.</p></p><p><p><u>Case 242 (Announced on 16 March)</u></p><p>64.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Case 242 is a 64 year-old female Singapore Citizen who had been in Malaysia on 7 March and 8 March. She is currently warded in NCID. She is linked to Case 166<sup>[7]</sup>.<br></p></p><p><p>65.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;She reported onset of symptoms on 14 March. As she had been identified as a contact of Case 166, she was issued a home quarantine order on 11 March. She was conveyed to NCID on 15 March. Subsequent test results confirmed COVID-19 infection on 16 March morning.<br></p></p><p><p>66.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;She stays at Gangsa Road.</p></p><p><p><u>Case 243 (Announced on 16 March)</u></p><p>67.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Case 243 is an imported case involving a 36 year-old male Singapore Citizen who had been in Germany from 26 February to 29 February, Italy from 29 February to 7 March, and Switzerland from 7 March to 14 March. He is currently warded in NCID. He is linked to Case 244.<br></p></p><p><p>68.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;He reported onset of symptoms on 11 March. He presented at NCID on 15 March, and subsequent test results confirmed COVID-19 infection on 16 March morning.<br></p></p><p><p>69.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Prior to hospital admission, he had gone to work at a home office at River Valley Road. He stays at Havelock Road.</p></p><p><p><strong>Update on condition of confirmed cases</strong></p><p>70.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;To date, a total of 114 cases have fully recovered from the infection and have been discharged from hospital. Of the 152 confirmed cases who are still in hospital, most are stable or improving. 14 are in critical condition in the intensive care unit.</p></p><p><p><strong>Update on contact tracing for confirmed cases</strong></p></p><p>71.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Contact tracing for the confirmed cases is ongoing. Once identified, MOH will closely monitor all close contacts. As a precautionary measure, they will be quarantined for 14 days from their last exposure to the patient. In addition, all other identified contacts who have a low risk of being infected will be under active surveillance, and will be contacted daily to monitor their health status. </p><p>72.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;As of 17 March 2020, 12pm, MOH has identified 5,939 close contacts who have been quarantined. Of these, 2,062 are currently quarantined, and 3,877 have completed their quarantine.</p><p><p><strong>Health advisory<br> </strong></p></p><p>73.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Singaporeans are advised to defer all non-essential travel abroad. </p><p>74.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;All travellers should monitor their health closely for two weeks upon return to Singapore and seek medical attention promptly if they feel unwell. Travellers should inform their doctor of their travel history. If they have a fever or respiratory symptoms (e.g. cough, shortness of breath), they should wear a mask and call the clinic ahead of the visit.<br></p><p><p>75.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Travellers and members of the public should adopt the following precautions at all times:</p></p> <ul><li>Avoid close contact with people who are unwell or showing symptoms of illness; </li><li>Observe good personal hygiene; </li><li>Practise frequent hand washing with soap (e.g. before handling food or eating, after going to toilet, or when hands are dirtied by respiratory secretions after coughing or sneezing); </li><li>Wear a mask if you have respiratory symptoms such as a cough or shortness of breath; </li><li>Cover your mouth with a tissue paper when coughing or sneezing, and dispose the soiled tissue paper in the rubbish bin immediately; and </li><li>Seek medical attention promptly if you are feeling unwell.<p>&nbsp;</p></li></ul> <p>76.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;MOH will continue to monitor the situation closely. As medical practitioners are on the lookout for suspect cases, Singapore is likely to see more cases that will need to be investigated. </p> <div><br clear=\"all\"> <hr align=\"left\" size=\"1\" width=\"33%\"> <div id=\"ftn1\"> <p><sup>[1]</sup>&nbsp;Case 186 is a 64 year-old male Singapore citizen who has no recent travel history to affected countries and regions. He was confirmed to have COVID-19 infection on 12 March. He is linked to Case 166.</p> </div> <div id=\"ftn2\"> <p><sup>[2]</sup>&nbsp;Case 205 is an imported case involving a 30 year-old female Filipino national who had been in the Philippines from 27 February to 6 March. She was confirmed to have COVID-19 infection on 14 March.</p> </div> <div id=\"ftn3\"> <p><sup>[3]</sup>&nbsp;Case 208 is a 26 year-old female Singapore Citizen who has no recent travel history to affected countries and regions, and was confirmed to have COVID-19 infection on 14 March. She is a Medical Social Worker at SGH.</p> </div> <div id=\"ftn4\"> <p><sup>[4]</sup>&nbsp;Case 219 is a 30 year-old male Singapore Citizen with no recent travel history to affected countries and regions. He was confirmed to have COVID-19 infection on 15 March. He is linked to Cases 142 and 211.</p> </div> <div id=\"ftn5\"> <p><sup>[5]</sup>&nbsp;Case 142 is a 26 year-old male Singapore Citizen who was confirmed to have COVID-19 infection on 7 March. He is linked to the cluster involving the private dinner function at SAFRA Jurong.</p> </div> <div id=\"ftn6\"> <p><sup>[6]</sup>&nbsp;Case 211 is a 35 year-old female Filipino national who is a Singapore Long Term Pass holder with no recent travel history to affected countries and regions. She was confirmed to have COVID-19 infection on 15 March. She is linked to Case 142.</p> </div> <div id=\"ftn7\"> <p><sup>[7]&nbsp;</sup>Case 166 is a 55 year-old female Singapore Citizen who was confirmed to have COVID-19 infection on 10 March. She is a contact of Case 134, and is linked to the cluster involving the private dinner function at SAFRA Jurong.</p> </div> </div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "five-more-cases-discharged-23-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}