{"pressItemDictionary": {"Press Releases": [{"Title": "Medifund Continues to Assist Needy Singaporeans With Their Healthcare Needs", "PublishedDate": "/Date(1609318800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "30 Dec 2020", "Summary": "", "MainContent": "<p><span style=\"font-size: 16px;\">1.&nbsp; &nbsp; &nbsp;&nbsp;The Medical Endowment Fund (MediFund) provided a total of $159.1 million through more than 1.2 million successful applications in assistance to needy Singaporeans for their medical bills in Financial Year (FY) 2019, i.e. for the period 1 April 2019 to 31 March 2020. This was an increase of $2.6 million compared to the $156.5 million disbursed in FY2018.<br><br>2.&nbsp; &nbsp; &nbsp;&nbsp;MediFund assists needy Singaporean patients who are unable to afford their medical bills, after government subsidies, insurance and MediSave. MediFund Silver and MediFund Junior provide more targeted assistance for the elderly and children respectively. MediFund ensures that no Singaporean will be denied basic medical care due to inability to pay.<br><br>3.&nbsp; &nbsp; &nbsp;&nbsp;The increase in assistance is due to the support extended towards patients in Intermediate and Long-term Care (ILTC) facilities, including the elderly. The key statistics of MediFund assistance provided in FY2019 are:<br><br></span></p> <p style=\"margin-left: 40px;\"><span style=\"font-size: 16px;\">(i) The number of approved MediFund applications was 1,215,809. This was a 1.9% decrease from the 1,239,578 number of approved applications in FY2018, contributed by a decrease in the total number of applications over the period[1];<br><br>(ii) In public hospitals and institutions, a total assistance of $122.8 million was provided to patients, compared to $124.2 million in FY2018;<br><br>(iii) In ILTC facilities, a total assistance of $36.2 million was provided to patients, compared to $32.3 million in FY2018; and<br><br>(iv) On average, the amount of MediFund assistance provided was about $900 per inpatient treatment, and about $90 per outpatient treatment.<br><br></span></p> <p><span style=\"font-size: 16px;\">4.&nbsp; &nbsp; &nbsp;&nbsp;More details can be found in the <a href=\"https://www.moh.gov.sg/docs/librariesprovider5/default-document-library/medical-endowment-scheme-annual-report-fy2019-2020\" title=\"\" class=\"\" target=\"\"><span style=\"text-decoration: underline;\">Medical Endowment Scheme Annual Report 2019/2020</span></a>.<br><br><br></span><strong style=\"font-size: 16px;\">MINISTRY OF HEALTH<br></strong><strong style=\"font-size: 16px;\">30 DECEMBER 2020</strong></p> <div><span style=\"font-size: 16px;\"><br><br clear=\"all\"> </span><hr align=\"left\" size=\"1\" width=\"33%\"> <div id=\"ftn1\"> <p><span style=\"font-size: 16px;\">[1] Total applications decreased by about 1.7%.</span></p> </div> </div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "medifund-continues-to-assist-needy-singaporeans-with-their-healthcare-needs-2020", "CurrentPageUrl": null}, {"Title": "1 New Case of Locally Transmitted Covid-19 Infection ", "PublishedDate": "/Date(1609317000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "30 Dec 2020", "Summary": "", "MainContent": "<p><span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp; As of 30 December 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 1 new case of locally transmitted COVID-19 infection. Based on our investigations so far, the case is in the community, and there are no new cases in the dormitories.<br><br>2.&nbsp; &nbsp; &nbsp;&nbsp;In addition, there are 26 imported cases, of whom 25 had been placed on Stay-Home Notice or isolated upon arrival in Singapore. The remaining case is a pilot with Singapore Airlines who had tested negative for COVID-19 upon return to Singapore but developed symptoms subsequently. Amongst the imported cases, 7 are Singaporeans or Singapore Permanent Residents, and 6 are foreign domestic workers. In total, there are 27 new cases of COVID-19 infection in Singapore today.<br><br>3.&nbsp; &nbsp; &nbsp;&nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.<br><br><strong>MINISTRY OF HEALTH<br></strong><strong>30 DECEMBER 2020</strong></span></p><div> <p><span style=\"font-size: 16px;\"><br></span></p> </div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "1-new-case-of-locally-transmitted-covid-19-infection-30-dec", "CurrentPageUrl": null}, {"Title": "Minimum Legal Age for Tobacco Raised to 21 Years Old From 1 January 2021", "PublishedDate": "/Date(1609257600000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "30 Dec 2020", "Summary": "", "MainContent": "1.&nbsp; &nbsp; &nbsp; From 1 January 2021, the Minimum Legal Age for the purchase, use, possession, sale and supply of tobacco products (MLA) will be raised from 20 to 21 years old.<br><br>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Raising the MLA is part of Singapore's ongoing efforts to reduce smoking prevalence. It aims to prevent youth from picking up smoking by limiting access to tobacco products, and to further de-normalise smoking particularly for those below 21 of age.<br><br>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The change in the MLA from 18 to 21 years old was debated and passed in Parliament on 7 November 2017, as part of the Tobacco (Control of Advertisements and Sale) (Amendment) Bill 2017. The MLA was subsequently raised from 18 to 19 years old on 1 January 2019, and from 19 years old to 20 years old on 1 January 2020.<br><br>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The tobacco industry, including retailers, importers and wholesalers, have been reminded of the changes. Warning notices, stating that sale of tobacco to persons below the age of 21 is not permitted, have been distributed to retailers for display at their outlets.<br><br>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Retailers who contravene the law and sell any tobacco products to a person below the MLA shall be liable on conviction to a maximum fine of $5,000 for the first offence and $10,000 for subsequent offences. In addition, their tobacco retail licences will be suspended for the first offence and revoked for subsequent offences. If any outlet is found selling tobacco products to underage persons in school uniform or those below 12 years of age, its tobacco retail licence will be revoked, even at the first offence.<br><br>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Persons caught giving or furnishing tobacco to a person below the MLA shall be liable on conviction to a maximum fine of $500 for the first offence and $1,000 for subsequent offences. Persons caught buying or acquiring tobacco for a person below the MLA shall be liable on conviction to a maximum fine of $2,500 for the first offence and $5,000 for subsequent offences. Underage smokers who are caught using, buying or having in their possession tobacco products are liable on conviction to a fine of up to $300.<br><br>7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Members of the public can report errant retailers to the Health Sciences Authority's (HSA) Tobacco Regulation Branch using the online form at <a href=\"https://go.gov.sg/reporttobaccooffences\" title=\"\" class=\"\" target=\"\">go.gov.sg/reporttobaccooffences</a>. Alternatively, they can call 6684 2036 or 6684 2037 during office hours (9:00am to 5:30pm, Monday to Friday).<br><br>8.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Tobacco use is one of the highest contributors to ill health and premature death in Singapore. It is associated with cancers (e.g. mouth, lung), ischaemic heart disease, stroke, lung disease and many other diseases.<br><br>9.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The Ministry of Health (MOH) is committed to lowering smoking prevalence in Singapore through a comprehensive, multipronged approach to discourage and reduce the use of tobacco products. Together with the Health Promotion Board, HSA, our partners and the wider community, we have adopted a range of tobacco control measures to reduce smoking prevalence. In addition to MLA, the range of tobacco control measures include public education, taxation, smoking cessation programmes, bans on tobacco advertising, point-of-sale display ban, and standardised packaging of tobacco products.", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "minimum-legal-age-for-tobacco-raised-to-21-years-old-from-1-january-2021", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}