{"pressItemDictionary": {"Press Releases": [{"Title": "781 More Cases Discharged, 407 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1592146800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "14 Jun 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\">&nbsp; &nbsp; &nbsp; &nbsp;As of 14 June 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 407 cases of COVID-19 infection in Singapore. The breakdown is as follows:&nbsp;<br><br><strong>a) Imported cases: 1<br></strong><br>There is an imported case today involving a Bangladeshi national who arrived in Singapore on 10 June to seek medical treatment that is not related to COVID-19 infection. His health declaration submitted before immigration clearance indicated he did not have any COVID-19 symptoms, and had not been diagnosed or suspected to have COVID-19 infection. He was subsequently tested for COVID-19 after arrival in Singapore and his results came back positive on 13 June. Contact tracing is ongoing, and identified close contacts have been placed on quarantine.&nbsp;&nbsp;<br><br><strong>b) Cases in the community: 9</strong> (4 Singaporeans, 1 Work Pass holder, 4 Work Permit holders)<br><br>Of the 9 cases in the community, 8 had been picked up as a result of our proactive surveillance and screening, and 1 had already been placed on quarantine.&nbsp;<br><br>Amongst the 4 Singaporean cases, 3 (Cases 40268, 40479 and 40480) were detected due to our proactive surveillance of persons working at dormitories, even though 2 of them (Cases 40268 and 40480) are asymptomatic. The remaining case (Case 40571) is a family member of a previously confirmed case, and had already been quarantined earlier. He is asymptomatic, and had been swabbed during quarantine to verify his status.<br><br>All 5 Work Pass/ Work Permit holders were picked up as a result of our proactive screening. 2 of them (Cases 40269 and 40478) work at dormitories, and were swabbed as part of our surveillance. The remaining three (Cases 40558, 40559 and 40560) were tested as part of our efforts to screen workers in essential services.<br><br>Overall, the number of new cases in the community has remained stable at an average of 8 per day in the past two weeks. The number of unlinked cases in the community has also remained stable at an average of 8 per day in the past two weeks. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br><br><strong>c) Cases residing in dormitories: 397<br></strong><br>We continue to pick up cases amongst Work Permit holders residing in dormitories, including in factory-converted dormitories, because of extensive testing in these premises, as part of our process to verify and test the status of all workers.&nbsp;<br><br>2.&nbsp; &nbsp;Details of these trends can be found in MOH’s daily situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\" title=\"\" class=\"\" target=\"\">www.moh.gov.sg/covid-19/situation-report</a>). Please refer to <a href=\"/docs/librariesprovider5/default-document-library/annex-a94332057c31945c19e6ab1d40e3aaf99.pdf?sfvrsn=9917a9bd_0\" title=\"Annex A\">Annex A</a>&nbsp;for the summary of the confirmed cases.&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp; Of the new cases, 99% are linked to known clusters, while the rest are pending contact tracing.&nbsp;<br><br>4.&nbsp; &nbsp; &nbsp; We announced yesterday that a student at St Anthony’s Canossian Secondary School has tested positive for COVID-19. As a precaution, 47 students and 12 staff who had been in close contact with the student have been put on Leave of Absence by the Ministry of Education or Home Quarantine Order by MOH. All 47 students have been tested for COVID-19, and their test results have all come back negative. The results for the staff are pending.&nbsp;<br><br><strong>Links between previous cases found<br></strong><br>5.&nbsp; &nbsp; &nbsp; &nbsp;In the past week (7 June to 13 June), MOH has uncovered links for 13 previously unlinked cases.&nbsp;<br><br>6.&nbsp; &nbsp; &nbsp;Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <a href=\"/docs/librariesprovider5/default-document-library/annex-bbd5b69f9129c4664b96de85ab2091556.pdf?sfvrsn=369cf94d_0\" title=\"Annex B\">Annex B</a>&nbsp;and <a href=\"/docs/librariesprovider5/default-document-library/annex-ca981e9ef70c44f9e98e39bec55226c25.pdf?sfvrsn=e1bd255c_0\" title=\"Annex C\">Annex C</a>&nbsp;for details.<br><br><strong>Update on condition of confirmed cases<br></strong><br>7.&nbsp; &nbsp; &nbsp; 781 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 29,589 have fully recovered from the infection and have been discharged from hospitals or community care facilities.&nbsp;<br><br>8.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;There are currently 238 confirmed cases who are still in hospital. Of these, most are stable or improving, and 2 are in critical condition in the intensive care unit. 10,751 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 26 have passed away from complications due to COVID-19 infection.&nbsp;<br><br><strong>MINISTRY OF HEALTH<br>14 JUNE 2020</strong></p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "781-more-cases-discharged-407-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "407 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1592118300000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "14 Jun 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As of 14 June 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 407 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders residing in foreign worker dormitories. Based on our investigations so far, there are 9 cases in the community, of whom 4 are Singaporeans/Permanent Residents and 5 are Work Pass holders.&nbsp;<br><br>2.&nbsp; &nbsp; &nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;<br><br><strong>MINISTRY OF HEALTH<br>14 JUNE 2020</strong></p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "407-new-cases-of-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}