{"pressItemDictionary": {"Press Releases": [{"Title": "More Than Half of Private Ambulances Accredited Under Voluntary Accreditation Scheme", "PublishedDate": "/Date(1579140000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "16 Jan 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; To enhance patient care and help providers transit to the new Healthcare Services Act (HCSA) which will come into effect between early 2021 and end 2022, the Ministry of Health (MOH) introduced the Voluntary Accreditation Scheme (VAS) for private ambulance operators in January 2018. To date, 30 operators have met the standards stipulated under the VAS. These constitute more than 50 percent of the total private ambulances in Singapore.\n<br>\n<br>2.&nbsp;&nbsp;&nbsp;&nbsp; Under the new HCSA, private ambulance services will be licensed to ensure the safety and safeguard the welfare of patients. Private ambulance services will be regulated as either Emergency Ambulance Service [1] or Medical Transport Service [2], and licensed under HCSA in its second phase of implementation in the second half of 2021.\n<br>\n<br>3.&nbsp;&nbsp;&nbsp;&nbsp; MOH’s priority is to ensure that patient safety and welfare are not compromised in the provision of healthcare services. Even before 2021 when the new licensing framework for private ambulances comes into effect, MOH has been taking a progressive approach to raise the capabilities and competencies of the sector, in preparation for the new licensing scheme in HCSA:\n<br>\n<br>a) MOH released a set of standards in 2017 [3], so that private ambulance operators have clarity on the requirements to provide an appropriate level of safe clinical care to patients using private ambulance services. These standards include the defining of core competencies, capabilities and training requirements for different ambulance crew members, as well as the mandating of essential documentation, equipment, medications, and life-saving and infection control protocols.\n<br>\n<br>b) The VAS was introduced in 2018 to facilitate the private ambulance operators’ transition into HCSA. Operators assessed to have met MOH’s 2017 standards for ambulance services can be accredited under the VAS. Accredited operators must continue to adhere to the level of safety\n<br>\n<br>standards listed in MOH’s standards ahead of the HCSA regulations for ambulance operators coming into force.\n<br>\n<br>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; As part of the VAS application process, MOH conducts preliminary assessments on the ambulance personnel and vehicles, and provides on-site assistance to help private ambulance operators meet the safety and quality standards necessary for accreditation. We have also partnered training institutions like the Alice Lee Institute of Advanced Nursing, Institute of Technical Education and Nanyang Polytechnic to offer training programmes for ambulance personnel to learn or upgrade their skills to meet the crew requirements under the new standards.\n<br>\n<br>5.&nbsp;&nbsp;&nbsp;&nbsp; MOH will also bring about greater price transparency for consumers. To do this, MOH will work with the accredited operators to publish the range of common fees charged, so that consumers are able to make informed decisions on their choice of private ambulance operators.\n<br>\n<br>6.&nbsp;&nbsp;&nbsp;&nbsp; Moving forward, MOH will continue to engage the private ambulance operators and encourage remaining operators to come on board the VAS. The list of VAS-accredited private ambulance operators can be found on the <a title=\"\" href=\"http://www.moh.gov.sg/licensing-and-regulation/accredited-private-ambulance-operators\" target=\"\">MOH website</a> for the public’s reference.\n<br>\n<br>MINISTRY OF HEALTH\n<br>\n16 JANUARY 2020<br><br>[1] Emergency Ambulance Service means a service to transport, by land, any individual suffering, or believed to be suffering, from an injury or condition of acute or sudden onset and of an emergency nature.<br>[2] Medical Transport Service means a ground conveyance that is used or intended to be used for the transport of patient(s) who is being provided with non-emergency clinical care or monitoring en-route.<br>[3] MOH Standards for Emergency Ambulance Services (2017) can be found on the MOH website at <a href=\"https://www.moh.gov.sg/licensing-and-regulation/regulations-guidelines-and-circulars/details/moh-standards-for-emergency-ambulance-service-(2017)-updated-21-nov-2018\">https://www.moh.gov.sg/licensing-and-regulation/regulations-guidelines-and-circulars/details/moh-standards-for-emergency-ambulance-service-(2017)-updated-21-nov-2018</a>. </p>", "PressCategory": ["Press Releases"], "CustomDetailUrl": "", "UrlName": "more-than-half-of-private-ambulances-accredited-under-voluntary-accreditation-scheme", "CurrentPageUrl": null}, {"Title": "Update On Local Situation Regarding Severe Pneumonia Cluster In Wuhan", "PublishedDate": "/Date(1579104000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "16 Jan 2020", "Summary": "", "MainContent": "<p>As of 10am, 16 January 2020, the Ministry of Health has been notified of a 69 year-old male Singaporean with pneumonia, who had travel history to Wuhan. He has been admitted for further assessment and treatment, and isolated as a precautionary measure. His condition is stable.<br></p><p>The suspect case had not visited the Huanan seafood wholesale market associated with the cluster of pneumonia in Wuhan.&nbsp;<br></p><p>Investigations to establish whether the suspect case is linked to the Wuhan pneumonia cluster are ongoing.</p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "update-on-local-situation-regarding-severe-pneumonia-cluster-in-wuhan-16-jan", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}