{"pressItemDictionary": {"Press Releases": [{"Title": "1,337 More Cases Discharged, 611 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1590764400000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "29 May 2020", "Summary": "", "MainContent": "<div style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 14px;\">&nbsp; &nbsp;&nbsp; As of 29 May 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 611 cases of COVID-19 infection in Singapore. The breakdown is as follows:<br><br></span></div><div style=\"text-align: justify; margin-left: 40px;\"><span style=\"font-family: Arial; font-size: 14px;\"><strong>a)&nbsp;Imported cases: 0</strong></span></div><div style=\"text-align: justify; margin-left: 40px;\"><span style=\"font-family: Arial; font-size: 14px;\"><br>There are no imported cases today. </span></div><div style=\"text-align: justify; margin-left: 40px;\"><span style=\"font-family: Arial; font-size: 14px;\"><br><strong>b)&nbsp;Cases in the community: 9 </strong>(3 Singaporeans/Permanent Residents, 2 Work Pass holders, 4 Work Permit holders)</span></div><div style=\"text-align: justify; margin-left: 40px;\"><span style=\"font-family: Arial; font-size: 14px;\"><br>Amongst the 3 SC/PR cases today, 2 are linked to dormitory clusters, and had already been placed on quarantine earlier. 1 is currently unlinked. </span></div><div style=\"text-align: justify; margin-left: 40px;\"><span style=\"font-family: Arial; font-size: 14px;\"><br>Amongst the 6 Work Pass and Work Permit holders, 5 were picked up as a result of our proactive screening and surveillance. Amongst them, 3 were tested as part of our screening of migrant workers residing at shop-houses located at Balestier Road, due to their proximity to another cluster in the same area. The other 2 were tested before they were due to start work on plumbing/ electrical projects at schools, as a precautionary measure to prepare for the safe re-opening of schools. The remaining case is a contact of earlier cases, and had already been placed on quarantine earlier. </span></div><div style=\"text-align: justify; margin-left: 40px;\"><span style=\"font-family: Arial; font-size: 14px;\"><br>Overall, the number of new cases in the community has decreased, from an average of 6 cases per day in the week before, to an average of 5 per day in the past week. The number of unlinked cases in the community has remained stable at an average of 2 per day in the past two weeks. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br><br></span></div><div style=\"text-align: justify; margin-left: 40px;\"><span style=\"font-family: Arial; font-size: 14px;\"><strong>c)&nbsp;Cases residing in dormitories: 602<br></strong><br></span><span style=\"font-family: Arial; font-size: 14px;\">We continue to pick up many cases amongst Work Permit holders residing in dormitories, including in factory-converted dormitories, because of extensive testing in these premises, as part of our process to verify and test the status of all workers. </span></div><div style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 14px;\"><br>2. &nbsp;&nbsp; Details of these trends can be found in MOH’s daily situation Report (<a title=\"\" href=\"http://www.moh.gov.sg/covid-19/situation-report\" target=\"\">www.moh.gov.sg/covid-19/situation-report</a>). Please refer to <a title=\"Annex A\" href=\"/docs/librariesprovider5/pressroom/press-releases/moh-press-release---annex-a-(29-may-2020).pdf?sfvrsn=f8985bf8_0\">Annex A</a>&nbsp;for the summary of the confirmed cases.<br><br></span></div><div style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 14px;\">3. &nbsp; &nbsp; Of the new cases, 99% are linked to known clusters, while the rest are pending contact tracing. </span></div><div style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 14px;\"><br>4. &nbsp; &nbsp; &nbsp; MOH has been monitoring existing clusters for any further transmission. As there have been no more cases linked to Keppel Shipyard (51 Pioneer Sector 1) and 2 Tuas Avenue 10 for the past two incubation periods (i.e. 28 days), the clusters have now been closed.<br><br></span><span style=\"font-family: Arial; font-size: 14px;\">5. &nbsp; &nbsp; We had previously informed that of the preschool staff who have been proactively screened so far, 13 had tested positive using the polymerase chain reaction (PCR) test. Of these, 11 were likely to be past infections, based on epidemiological investigations, including their positive serological test results <sup>[1]</sup>. One more serological test has come back positive today. We have assessed that the individual was unlikely to be infectious by the time of the recent screening. The final serological test (Case 33092) has come back negative, which is indicative of a recent infection. The case is a non-teaching staff and had been asymptomatic. Her close contacts have been placed under quarantine. In all, more than 39,000 preschool staff <sup>[2]</sup> have been tested so far, and only one case is likely to be a current infection.<br><br></span></div><div style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 14px;\"><strong>Links between previous cases found</strong></span></div><div style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 14px;\"><br>6. &nbsp; &nbsp; In the past week (22 May to 28 May), MOH has uncovered links for 2 previously unlinked cases. <br><br></span></div><div style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 14px;\">7. &nbsp; &nbsp;&nbsp; Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <a title=\"Annex B\" href=\"/docs/librariesprovider5/pressroom/press-releases/moh-press-release---annex-b-(29-may-2020).pdf?sfvrsn=a880b0bb_0\">Annex B</a>&nbsp;and <a title=\"Annex C\" href=\"/docs/librariesprovider5/pressroom/press-releases/moh-press-release---annex-c-(29-may-2020)-(1).pdf?sfvrsn=474cfe2_0\">Annex C</a>&nbsp;for details.<br><br></span></div><div style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 14px;\"><strong>Cases from public healthcare sector</strong></span></div><div style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 14px;\"><br> </span><p><u><span style=\"font-family: Arial; font-size: 14px;\">Case 33864</span></u><span style=\"font-family: Arial; font-size: 14px;\"><br></span></p></div><div style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 14px;\">8. &nbsp; &nbsp; Case 33864 is a 25 year-old Singapore Citizen who has no recent travel history to affected countries or regions. She was confirmed to have COVID-19 infection on 28 May, and is currently warded at Changi General Hospital (CGH).</span></div><div style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 14px;\"><br>9. &nbsp; &nbsp;&nbsp; She is employed as a physiotherapist at CGH but had not gone to work since onset of symptoms.<br><br></span></div><div style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 14px;\"><strong>Update on condition of confirmed cases</strong></span></div><div style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 14px;\"><br>10. &nbsp;&nbsp; 1,337 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 19,631 have fully recovered from the infection and have been discharged from hospitals or community care facilities.<br><br> </span></div><div style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 14px;\">11. &nbsp; &nbsp; There are currently 461 confirmed cases who are still in hospital. Of these, most are stable or improving, and 8 are in critical condition in the intensive care unit. 13,745 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 23 have passed away from complications due to COVID-19 infection. </span></div><div style=\"text-align: justify;\"><span style=\"font-family: Arial;\"><span style=\"font-size: 14px;\"><br><strong>MINISTRY OF HEALTH<br>29 MAY 2020</strong><br><br>==<br><span style=\"font-size: 12px;\">[1]&nbsp;Cases whose serological tests are positive are likely have a past infection, and could be shedding minute fragments of the virus RNA picked by the PCR test, which were no longer transmissible and infective to others.<br><br>[2]&nbsp;Includes ECDA’s preschools, MOE kindergartens and pre-school sections in private education institutes.</span><br></span></span></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "1-337-more-cases-discharged-611-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "New Chief Nursing Officer In Ministry of Health", "PublishedDate": "/Date(1590741180000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "29 May 2020", "Summary": "", "MainContent": "<span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;From 1 July 2020, Ms Paulin Koh will succeed Ms Tan Soh Chin as the new Chief Nursing Officer (CNO) in the Ministry of Health (MOH) to oversee the strategic development and regulation of the nursing profession in Singapore.&nbsp;&nbsp;<br><br>2.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Since Ms Tan’s appointment as CNO in January 2015, she has led transformative efforts in nursing to improve the delivery of healthcare, and has made invaluable contributions in shaping nursing development and resourcing policies.&nbsp; Under Ms Tan’s leadership, all the recommendations from the National Nursing Taskforce (NNT) to strengthen the development of the nursing profession and better attract, recognise and retain nurses were rolled out progressively in 2015-16.&nbsp;&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;A strong proponent of continuing education, Ms Tan spearheaded the formation of the Nursing Education Executive Committee in March 2017 to look into enhancing competency-based nursing education at the national level. She instituted the Advanced Clinical Education nursing programmes to equip nurses with broad-based skills and knowledge to manage patients across care settings, in line with the needs of an ageing population. Ms Tan also strengthened the Advanced Practice Nurse (APN) training programme to better equip expert nurses with advanced clinical skills to manage patients with complex needs. To strengthen nursing in the community, she worked with the nurse leaders to implement the Regional Health System (RHS)-led Community Nursing pilots across the three clusters in October 2017. In addition, she oversaw the development and completion of the Community Nursing Competency Framework and Training Roadmap.<br><br>4.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;A highly respected figure in the nursing profession, Ms Tan was awarded the Public Administration Medal (Silver) in 2017 for her outstanding contributions towards the improvement of our healthcare system.<br><br>5.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Ms Paulin Koh is the Chief Nurse at Changi General Hospital (CGH) and the Deputy Group Chief Nurse of SingHealth. Ms Koh was appointed as CNO-Designate in MOH from 1 January 2020 to 30 June 2020.&nbsp; Ms Koh has been a key driver for Community Nursing at CGH to extend its reach beyond the hospital and into the community.&nbsp; As a member of various MOH and Singapore Nursing Board committees, Ms Koh has contributed towards elevating the nursing profession in Singapore and has shaped policies and strategies to enhance nursing practice, education and career.&nbsp; Ms Koh’s professionalism, drive for high standards of patient safety and services and close linkage with the ground will provide her with a strong foundation to advance the nursing profession in Singapore.&nbsp;<br></span><div><span style=\"font-size: 16px;\"><br></span></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "new-chief-nursing-officer-in-ministry-of-health", "CurrentPageUrl": null}, {"Title": "611 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1590735600000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "29 May 2020", "Summary": "", "MainContent": "<div style=\"text-align: justify;\"><span style=\"font-family: Arial;\"><span style=\"font-size: 14px;\">&nbsp; &nbsp;&nbsp; As of 29 May 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 611 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders residing in foreign worker dormitories. Three cases are Singaporeans/ Permanent Residents.<br><br>2. &nbsp;&nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight. </span></span></div><div style=\"text-align: justify;\"><span style=\"font-family: Arial;\"><span style=\"font-size: 14px;\"><br><strong>MINISTRY OF HEALTH<br>29 MAY 2020</strong></span></span><br></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "611-new-cases-of-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}