{"pressItemDictionary": {"Press Releases": [{"Title": "Five More Cases Discharged; 74 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1585670400000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "01 Apr 2020", "Summary": "&nbsp;", "MainContent": "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Five more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities (Cases 246, 257, 539, 709 and 827). In all, 245 have fully recovered from the infection and have been discharged from hospitals or community isolation facilities. \n<br>\n \n\n<br>2.         As of 1 April 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 74 cases of COVID-19 infection in Singapore, of which 20 are imported and 54 are local cases who have no recent travel history abroad. \n<br>\n \n\n<br>•           The 20 imported cases<sup>[1]</sup> had travel history to Australia, Europe, South America, Africa, ASEAN and other parts of Asia.\n\n<br>•           29 cases<sup>[2] </sup>are linked to previous cases or clusters.\n\n<br>•           25 cases<sup>[3] </sup> are currently unlinked, and contact tracing is ongoing. \n<br>\n<br> \n<br>\n<strong>Links between previous cases found\n</strong><br>\n \n\n<br>3.         Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases.\n<br>\n \n\n<br>a)         10 of the newly confirmed cases (Cases 973, 976, 983, 984, 985, 986, 987, 988, 989 and 990) are linked to a previous case (Case 918), forming a new cluster at Lee Ah Mooi Old Age Home (1 Thomson Lane). \n<br>\n \n\n<br>b)         Two of the confirmed cases (Cases 972 and 974) are linked to a previous case (Case 868), forming a new cluster at a dormitory located at 55 Sungei Kadut Loop.\n<br>\n \n\n<br>c)         Six additional cases are linked to the cluster at S11 Dormitory @ Punggol (2 Seletar North Link), which has a total of 10 confirmed cases now (Cases 826, 829, 852, 860, 946, 947, 966, 979, 982 and 993).\n<br>\n \n\n<br>d)         Two additional cases are linked to the cluster at Westlite Toh Guan dormitory (18 Toh Guan Road East), which has a total of seven confirmed cases now (Cases 875, 922, 924, 925, 926, 934 and 977).\n<br>\n \n\n<br>e)         One additional case is linked to the cluster at Wilby Residences (25 Wilby Road), which has a total of eight confirmed cases now (Cases 439, 678, 793, 818, 848, 864, 873 and 980). \n<br>\n \n\n<br>f)          One additional case is linked to the cluster at Hero’s (69 Circular Road), which has a total of seven confirmed cases now (Cases 192, 556, 657, 670, 714, 813 and 940).\n<br>\n<br> \n\n<br>4.         Contact tracing is underway for 115 locally transmitted cases to establish any links to previous cases or travel history to affected countries or regions. \n<br>\n \n\n<br>5.         Please refer to the <a title=\"Annex\" href=\"/docs/librariesprovider5/pressroom/annex1-4.pdf?sfvrsn=92ca5f96_2\">Annex</a>&nbsp;for a summary of the confirmed cases. \n<br>\n<br> \n<br>\n<strong>Cases from public healthcare sector\n</strong><br>\n \n\n<br><u>Case 951</u> <br>\n \n\n<br>6.         Case 951 is a 29 year-old female Singapore Citizen who has no recent travel history to affected countries or regions. She reported onset of symptoms on 30 March, and subsequent test results confirmed COVID-19 infection on 31 March afternoon. She is currently warded in an isolation room at Singapore General Hospital (SGH). \n<br>\n \n\n<br>7.         She is employed as a clinical research coordinator at SGH. Prior to hospital admission, she had gone to work on 30 March but had not interacted with patients. \n<br>\n<br> \n<br>\n<u>Case 952</u> <br>\n \n\n<br>8.         Case 952 is a 37 year-old female Singapore Citizen who had been in the UAE from 14 March to 20 March 2020. She reported onset of symptoms on 30 March, and subsequent test results confirmed COVID-19 infection on 31 March afternoon. She is currently warded in an isolation room at SGH. \n<br>\n \n<br>\n9.         She is employed as a nurse at SGH. Prior to hospital admission, she had gone to work on 30 March. \n<br>\n \n<br>\n<br><u>Case 978</u>\n<br>\n \n\n<br>10.        Case 978 is a 26 year-old female Singapore Citizen who has no recent travel history to affected countries or regions. She reported onset of symptoms on 31 March, and subsequent test results confirmed COVID-19 infection on 1 April morning. She is currently warded in an isolation room at National Centre for Infectious Diseases (NCID). \n<br>\n \n\n<br>11.        She is employed as a doctor at Ng Teng Fong General Hospital but had not gone to work since onset of symptoms. \n<br>\n<br> \n<br>\n<strong>Update on condition of confirmed cases\n</strong><br>\n \n\n<br>12.        To date, a total of 245 cases have fully recovered from the infection and have been discharged from hospitals or community isolation facilities. <br>\n \n<br>\n13.        Of the 461 confirmed cases who are still in hospital, most are stable or improving. 24 are in critical condition in the intensive care unit. 291 cases who are clinically well but still test positive for COVID-19 are isolated and cared for at Concord International Hospital, Mount Elizabeth Hospital, Gleneagles Hospital and the Community Isolation Facility at D’Resort NTUC. Three have passed away from complications due to COVID-19 infection.\n<br>\n<br> \n\n<br><strong>Update on contact tracing for confirmed cases \n</strong><br>\n \n\n<br>14.        Contact tracing for the confirmed cases is ongoing. Once identified, MOH will closely monitor all close contacts. As a precautionary measure, they will be quarantined for 14 days from their last exposure to the patient. In addition, all other identified contacts who have a low risk of being infected will be under active surveillance, and will be contacted daily to monitor their health status. <br>\n \n<br>\n15.        As of 1 April 2020, 12pm, MOH has identified 14,050 close contacts who have been quarantined. Of these, 4,803 are currently quarantined, and 9,247 have completed their quarantine.\n<br>\n \n\n \n<br>\n<br><strong>MINISTRY OF HEALTH\n\n<br>1 APRIL 2020\n</strong><br>\n \n\n<sup><br>[1] </sup>Cases 928, 932, 933, 938, 943, 944, 949, 950, 952, 954, 955, 960, 961, 962, 968, 969, 970, 995, 996 and 997.\n<br>\n<sup>[2] </sup> Cases 927, 934, 935, 940, 941, 942, 946, 947, 966, 972, 973, 975, 974, 976, 977, 979, 980, 982, 983, 984, 985, 986, 987, 988, 989, 990, 991, 992 and 993.\n<br>\n<sup>[3] </sup>Cases 929, 930, 931, 936, 937, 939, 945, 948, 951, 953, 956, 957, 958, 959, 963, 964, 965, 967, 971, 978, 981,  994, 998, 999 and 1000.", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "five-more-cases-discharged-74-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}