{"pressItemDictionary": {"Press Releases": [{"Title": "26 More Cases Discharged; 15 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1601305860000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "28 Sep 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; As of 28 September 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 15 cases of COVID-19 infection in Singapore. The breakdown of the cases is as follows:</p> <p><strong>Summary of new cases</strong></p> <p>&nbsp; &nbsp; &nbsp; Amongst the new cases today, 13 are asymptomatic, and were detected from our proactive screening and surveillance, while 2 were symptomatic.</p> <table border=\"1\" cellspacing=\"0\" cellpadding=\"0\"> <tbody><tr> <td width=\"241\" valign=\"top\"> <p>&nbsp;</p> </td> <td width=\"120\"> <p align=\"center\"><strong>Already in quarantine/ isolation before detection </strong></p> </td> <td width=\"120\"> <p align=\"center\"><strong>Detected from surveillance </strong></p> </td> <td width=\"120\"> <p align=\"center\"><strong>Total</strong></p> </td> </tr> <tr> <td width=\"241\" valign=\"top\"> <p><strong>Imported cases</strong></p> </td> <td width=\"120\"> <p align=\"center\">6</p> </td> <td width=\"120\"> <p align=\"center\">0</p> </td> <td width=\"120\"> <p align=\"center\">6</p> </td> </tr> <tr> <td width=\"241\" valign=\"top\"> <p><strong>Cases in the community </strong></p> </td> <td width=\"120\"> <p align=\"center\">1</p> </td> <td width=\"120\"> <p align=\"center\">1</p> </td> <td width=\"120\"> <p align=\"center\">2</p> </td> </tr> <tr> <td width=\"241\" valign=\"top\"> <p><strong>Cases residing in dormitories </strong></p> </td> <td width=\"120\"> <p align=\"center\">4</p> </td> <td width=\"120\"> <p align=\"center\">3</p> </td> <td width=\"120\"> <p align=\"center\">7</p> </td> </tr> </tbody></table> <p>&nbsp;</p> <p><strong>a) Imported cases: 6 </strong>(1 Permanent Resident, 2 Work Pass holders, 1 Work Permit holder, 2 Dependant’s Pass holders) <br><br>Amongst the 6 imported cases, 1 (Case 57850) is a Singapore Permanent Resident who returned to Singapore from India on 16 September. Another 3 (Cases 57849, 57851 and 57860) are Work Pass/ Work Permit holders currently employed in Singapore who arrived from France, the Philippines and India on 16 September. The remaining 2 (Cases 57857 and 57858) are Dependant’s Pass holders who arrived from India on 15 September.&nbsp;<p><br>All of them had been placed on 14-day Stay-Home Notice (SHN) upon arrival in Singapore, and were tested while serving their SHN at dedicated facilities.</p><p><strong>b) Cases in the community: 2</strong> (2 Work Permit holders) <br><br>Both cases in the community were detected as a result of our proactive surveillance and screening. Case 57847 was tested as part of our proactive screening of workers in essential services who are living outside the dormitories, and is currently unlinked. Case 57861 had been identified as a household contact of Case 57847. When contacted by MOH on 27 September after Case 57847 was confirmed with COVID-19 infection, Case 57861 reported having symptoms and was immediately conveyed to a hospital for a swab. He was tested positive subsequently. <br><br>Epidemiological investigations of the unlinked case are in progress. In the meantime, all the identified close contacts of the case have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for his other household contacts to determine if he could have been infected by them. <br><br>Overall, the number of new cases in the community has remained stable at an average of fewer than 1 case per day in the past 2 weeks. The number of unlinked cases in the community has also remained stable at an average of fewer than 1 case per day in the past 2 weeks.&nbsp;We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.&nbsp;<br><br><strong>c) Cases residing in dormitories: 7&nbsp;<br><br></strong>Amongst the 7 cases residing in dormitories, 4 had been identified earlier as contacts of previous cases, and had already been quarantined to prevent further transmission. They were tested during quarantine to determine their status.&nbsp;&nbsp;<strong><br><br></strong>The remaining 3 cases were detected through surveillance testing, such as our bi-weekly Rostered Routine Testing of workers living in dormitories. This allows us to pick up cases early, including asymptomatic ones, so that we are able to ring-fence them quickly to prevent further transmission, by aggressively containing, tracing and isolating the close contacts. <br><br>2.&nbsp; &nbsp; &nbsp; Details of these trends can be found in MOH’s daily situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\">www.moh.gov.sg/covid-19/situation-report</a>). Please refer to <u><a href=\"/docs/librariesprovider5/default-document-library/annex-a1e291df56d7d45a4b15f17dfddfadd8f.pdf?sfvrsn=e075e581_0\" title=\"Annex A\">Annex A</a></u> for the summary of the confirmed cases. <br><br>3.&nbsp; &nbsp; &nbsp; Of the new cases, 93% are imported or linked to known cases/ clusters, while the rest are pending contact tracing. <br><br>4.&nbsp; &nbsp; &nbsp; MOH has been monitoring existing clusters for any further transmission. As there have been no more cases linked to Changi Lodge II (80 Tanah Merah Coast Road) and the dormitories at 35 Kian Teck Way and 66 Tech Park Crescent for the past two incubation periods (i.e. 28 days), the clusters have now been closed.&nbsp;<br><br><strong>Links between previous cases found&nbsp;<br><br></strong>5.<strong>&nbsp; &nbsp; &nbsp;</strong>Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <u><a href=\"/docs/librariesprovider5/default-document-library/annex-ba054e1fcdcf547edbaceaf2d17ea8f58.pdf?sfvrsn=364e3d44_0\" title=\"Annex B\">Annex B</a></u> and <u><a href=\"/docs/librariesprovider5/default-document-library/annex-c562b91612e604aeaa453678d2fe3904c.pdf?sfvrsn=c4d5c700_0\" title=\"Annex C\">Annex C</a></u> for details.&nbsp;<br><br><strong>Update on condition of confirmed cases&nbsp;<br><br></strong>6.&nbsp; <strong>&nbsp; &nbsp;&nbsp;</strong>26 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 57,393 have fully recovered from the infection and have been discharged from hospitals or community care facilities. <br><br>7.&nbsp; &nbsp; &nbsp; There are currently 36 confirmed cases who are still in hospital. Of these, most are stable or improving, and none is in the intensive care unit. 259 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 27 have passed away from complications due to COVID-19 infection.</p></p> <p>&nbsp;</p> <p><strong>MINISTRY OF HEALTH<br></strong><strong>28 SEPTEMBER 2020</strong></p><div> <p>&nbsp;</p> </div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "26-more-cases-discharged-15-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "15 New Cases of Covid-19 Infection  (28 Sept)", "PublishedDate": "/Date(1601277300000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "28 Sep 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; As of 28 September 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 15 cases of COVID-19 infection in Singapore. Based on our investigations so far, there are 2 cases in the community, both of whom are Work Pass holders. <br><br>&nbsp; &nbsp; &nbsp; There are 6 imported cases, who had all been placed on Stay-Home Notice upon arrival in Singapore. <br><br>&nbsp; &nbsp; &nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.</p> <p>&nbsp;</p> <div> <p><strong>MINISTRY OF HEALTH<br></strong><strong>28 SEPTEMBER 2020</strong></p> </div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "15-new-cases-of-covid-19-infection-(28-sept)", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}