{"pressItemDictionary": {"Press Releases": [{"Title": "No new confirmed cases of novel coronavirus infection in singapore", "PublishedDate": "/Date(1580644200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "02 Feb 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As of 2 February 2020, 2pm, the Ministry of Health (MOH) has not been notified of any new confirmed cases of 2019 novel coronavirus (2019-nCoV) infection in Singapore. Eighteen confirmed imported cases were earlier announced by MOH.<br><br>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;There is currently no evidence of community spread in Singapore.<br><br><strong>About case 18<br><br></strong>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;The 18<sup>th</sup>&nbsp;confirmed case was announced on 1 February. The case is a 31 year-old female Chinese national who arrived in Singapore from Wuhan on 22 January. She is currently warded in an isolation room at the National Centre for Infectious Diseases (NCID). <br><br>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;The case reported that she was asymptomatic during her flight to Singapore. She was a travelling companion of the 12<sup>th</sup>&nbsp;confirmed case[1]&nbsp;and was identified as a close contact on 30 January. She reported that she had not left her room at Home Suite View Hotel at 12 Lorong 12 Geylang until she was transferred to a government quarantine facility (GQF) in the early hours of 31 January. While at the GQF, she reported that she had a cough from 30 January. She was conveyed by an ambulance to NCID on 31 January, where she was immediately isolated. Subsequent test results confirmed 2019-nCoV infection on 1 February at about 2pm.<br><br><strong>Update on condition of confirmed cases<br><br></strong>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;None of the 18 previously announced cases is critically ill. All of them remain in stable condition, and most are improving.&nbsp;<br><br><strong>Update on suspect cases<br><br></strong>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;As of 2 February, 12pm, 240 of the suspect cases have tested negative for 2019-nCoV, and 18 have tested positive. Test results for the remaining 43 cases are pending.<br><br><strong>Update on contact tracing for confirmed cases<br><br></strong>7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Contact tracing for the confirmed cases is ongoing. Once identified, MOH will closely monitor all close contacts. As a precautionary measure, they will be quarantined for 14 days from their last exposure to the patient. In addition, all other identified contacts who have a low risk of being infected will be under active surveillance, and will be contacted daily to monitor their health status.<br><br>8.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;As of 2 February, 12pm, MOH has identified 251 close contacts. Of the 182 who are still in Singapore, 179 have been contacted and are being quarantined or isolated.&nbsp;Efforts are ongoing to contact the remaining three close contacts.<br><br><strong>Health advisory<br><br></strong>9.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Singaporeans are advised to defer all travel to Hubei Province and all non-essential travel to Mainland China.<br><br>10.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;All travellers should monitor their health closely for two weeks upon return to Singapore and seek medical attention promptly if they feel unwell. Travellers should inform their doctor of their travel history. If they have a fever or respiratory symptoms (e.g. cough, shortness of breath), they should wear a mask and call the clinic ahead of the visit.<br><br>11.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Travellers and members of the public should adopt the following precautions at all times:<br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Avoid contact with live animals including poultry and birds, and consumption of raw and undercooked meats;<br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Avoid close contact with people who are unwell or showing symptoms of illness;<br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Observe good personal hygiene;<br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Practise frequent hand washing with soap (e.g. before handling food or eating, after going to toilet, or when hands are dirtied by respiratory secretions after coughing or sneezing);<br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Wear a mask if you have respiratory symptoms such as a cough or shortness of breath;<br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Cover your mouth with a tissue paper when coughing or sneezing, and dispose the soiled tissue paper in the rubbish bin immediately; and<br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Seek medical attention promptly if you are feeling unwell.<br><br>12.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;MOH will continue to monitor the situation closely. As medical practitioners are on the lookout for cases with pneumonia who have recently been in China, Singapore is likely to see more suspect cases that will need to be investigated.<br><br><br>_______________<br></p><p>[1]&nbsp;The 12<sup>th</sup>&nbsp;confirmed case is a 37 year-old female Chinese national from Wuhan who arrived in Singapore on 22 January, and was confirmed positive for 2019-nCoV on 29 January at about 11pm.</p><div><br></div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "no-new-confirmed-cases-of-novel-coronavirus-infection-in-singapore", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}