{"pressItemDictionary": {"Press Releases": [{"Title": "36 More Cases Discharged, 1,037 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1587655800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "23 Apr 2020", "Summary": "", "MainContent": "<p>1. As of 23 April 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 1,037 cases of COVID-19 infection in Singapore. The breakdown is as follows: \n<br>\n<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <strong>a) Imported cases: 0 \n</strong><br>\n<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; There are no imported cases today.   \n<br>\n<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <strong>b) Cases in the community: 25 </strong>(22 Singaporeans/Permanent Residents<sup>1</sup>, 3 Work Passes)\n<br>\n<br>The number of new cases in the community has decreased, from an average of 34 cases per day in the week before, to an average of 25 per day in the past week. The number of unlinked cases in the community has decreased slightly, from an average of 20 cases per day in the week before, to an average of 18 per day in the past week.&nbsp;We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.\n<br>\n<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong> c) Work Permit holders (residing outside dormitories): 30\n</strong><br>\n<br>The number of new cases amongst Work Permit holders residing outside dormitories has continued to increase, from an average of 16 cases per day in the week before, to an average of 30 per day in the past week.&nbsp; \n<br>\n<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <strong>d) Work Permit holders (residing in dormitories): 982\n</strong><br>\n<br>The main increase today continues to be for Work Permit holders residing in dormitories, where we are picking up many more cases because of extensive testing. Most of these cases have a mild illness and are being monitored in the community isolation facilities or general ward of our hospitals. None of them is in the intensive care unit. \n<br>\n<br>2. Details of these trends can be found in MOH’s daily situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\">www.moh.gov.sg/covid-19/situation-report</a>). Please refer to <a title=\"Annex A\" href=\"/docs/librariesprovider5/default-document-library/annex-a-(23-apr).pdf?sfvrsn=3c499e7a_0\">Annex A</a>&nbsp;for the summary of the confirmed cases. \n<br>\n<br>3. Of the new cases, 75% are linked to known clusters, while the rest are pending contact tracing. \n<br>\n<br><strong>Links between previous cases found\n</strong><br>\n<br>4. In the past week (16 April to 22 April), MOH has uncovered links for 1,024 previously unlinked cases. \n<br>\n<br>5. Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <a title=\"Annex B\" href=\"/docs/librariesprovider5/default-document-library/annex-b-(23-apr).pdf?sfvrsn=1ef49a9a_0\">Annex B</a>&nbsp;for details.\n<br>\n<br><strong>Update on condition of confirmed cases\n</strong><br>\n<br>6. 36 more cases<sup>2</sup> of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 924 have fully recovered from the infection and have been discharged from hospitals or community isolation facilities. \n<br>\n<br>7. As our care protocols adapt based on our understanding of the disease, we have re-categorised the confirmed cases to more accurately reflect where the confirmed cases are being cared for. There are currently 1,368 confirmed cases who are still in hospital. Of these, most are stable or improving, and 26 are in critical condition in the intensive care unit. 8,874 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 12 have passed away from complications due to COVID-19 infection. \n<br>\n<br>8. Case 8190, a 46 year-old male Indian national, has passed away on 23 April. He was confirmed to have COVID-19 infection on 19 April, and had been warded at Khoo Teck Puat Hospital. Police investigations into his death are ongoing.&nbsp;<br><strong><br><br></strong>[1] Updated from the afternoon press release as one more case had been classified following contact tracing. <br><br>[2] Cases 188, 359, 491, 550, 596, 597, 633, 702, 740, 910, 912, 968, 969, 971, 1013, 1031, 1197, 1223, 1241, 1244, 1285, 1291, 1345, 1410, 1704, 1810, 1951, 2011, 2270, 2273, 2291, 2403, 2978, 3336, 7117 and 8190.<br>&nbsp;</p><p> \n<br>\n<br></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "36-more-cases-discharged-1-037-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "1,037 New Cases of Covid-19 Infection ", "PublishedDate": "/Date(1587625200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "23 Apr 2020", "Summary": "", "MainContent": "1. As of 23 April 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 1,037 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders residing in foreign worker dormitories. 21 cases are Singaporeans/ Permanent Residents.\n<br>\n<br>2. We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight. \n<br>\n<br>\n<br><strong>MINISTRY OF HEALTH\n<br>23 APRIL 2020\n</strong><br>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "1-037-new-cases-of-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}