{"pressItemDictionary": {"Press Releases": [{"Title": "767 More Cases Discharged, 408 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1591022700000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "01 Jun 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\">&nbsp; &nbsp; &nbsp; &nbsp; As of 1 June 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 408 cases of COVID-19 infection in Singapore. The breakdown is as follows:&nbsp;<br><br><strong>a) Imported cases: 0<br></strong><br>There are no imported cases today.&nbsp;<br><br><strong>b) Cases in the community: 0<br></strong><br>There are no cases in the community today.&nbsp;<br><br>Overall, the number of new cases in the community has decreased, from an average of 7 cases per day in the week before, to an average of 3 per day in the past week. The number of unlinked cases in the community has remained stable at an average of 2 per day in the past two weeks. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br><br><strong>c) Cases residing in dormitories: 408<br></strong><br>We continue to pick up many cases amongst Work Permit holders residing in dormitories, including in factory-converted dormitories, because of extensive testing in these premises, as part of our process to verify and test the status of all workers.&nbsp;<br><br>2.&nbsp; &nbsp;Details of these trends can be found in MOH’s daily situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\" title=\"\" class=\"\" target=\"\">www.moh.gov.sg/covid-19/situation-report</a>). Please refer to <a href=\"/docs/librariesprovider5/default-document-library/annex-a00d45301ddf94778bff66f8c3529e55e.pdf?sfvrsn=470b5ae6_0\" title=\"Annex A\">Annex A</a>&nbsp;for the summary of the confirmed cases.&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;All the new cases are linked to known clusters.&nbsp;<br><br><strong>Links between previous cases found<br></strong><br>4.&nbsp; &nbsp; &nbsp; In the past week (25 May to 31 May), MOH has uncovered links for 3 previously unlinked cases.&nbsp;<br><br>5.&nbsp; &nbsp; &nbsp;Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <a href=\"/docs/librariesprovider5/default-document-library/annex-b036e07dddf59451687b1c3bd3fd5bd7b.pdf?sfvrsn=eb4ac5d0_0\" title=\"Annex B\">Annex B</a>&nbsp;and <a href=\"/docs/librariesprovider5/default-document-library/annex-c53d72136f08d4535b5a3bc6588b3c86f.pdf?sfvrsn=21d7e373_0\" title=\"Annex C\">Annex C</a>&nbsp;for details.<br><br><strong>Update on condition of confirmed cases<br></strong><br>6.&nbsp; &nbsp; &nbsp;767 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 22,466 have fully recovered from the infection and have been discharged from hospitals or community care facilities.&nbsp;<br><br>7.&nbsp; &nbsp; &nbsp; &nbsp;There are currently 344 confirmed cases who are still in hospital. Of these, most are stable or improving, and 7 are in critical condition in the intensive care unit. 12,458 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 24 have passed away from complications due to COVID-19 infection.&nbsp;<br><br>8.&nbsp; &nbsp; Case 17329, a 51 year-old male Chinese national, has passed away from complications due to COVID-19 infection on 31 May 2020. He was diagnosed with lymphoma complicated by multi-organ failure while he had been warded in the intensive care unit in end-April. Despite being treated for lymphoma, his condition had deteriorated and he subsequently passed on.&nbsp; He was confirmed to have COVID-19 infection on 1 May. The National University Hospital has reached out to his family and is extending assistance to them.<br><br><strong>MINISTRY OF HEALTH<br>1 JUNE 2020</strong></p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "767-more-cases-discharged-408-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "Guidance for Use of Masks and Face Shields", "PublishedDate": "/Date(1591008840000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "01 Jun 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As more activities and services resume after the circuit breaker lifts from 2 June 2020, the use of masks will continue to be mandatory when people go outside their homes. The use of masks that closely and completely cover the nose and mouth will be required as a default. With effect from 2 June, face shields will be treated differently from masks, and will be allowed only for specific exempt groups or settings.<br><br>2.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;COVID-19 is spread predominantly through droplets. The design of face shields typically leaves a gap between the face shield and the face. Masks that are worn closely and completely over the nose and mouth do not have such gaps. During the circuit breaker, face shields were allowed to be worn, in place of masks. But with the re-opening of our economy and society, we can expect more activities and close contact amongst people, including on public transport. So masks will now be required as the default.<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;In some situations, the wearing of masks may not be practical. In such situations, face shields may be worn. The face shields must be worn properly so that it covers the entire face, from the forehead to below the chin, wrapping around the sides of the face. The groups which can wear face shields are as follows:</p> <ul><li>Children twelve years and below, who may have difficulty wearing and keeping face masks on for a prolonged period of time;</li><li>Persons who have health conditions that may result in breathing or other medical difficulties when a mask is worn for a prolonged period of time; and</li><li>Persons who are speaking to a group in a classroom or lecture-style setting, where they largely remain at the spot from which they are speaking, and are able to maintain a safe distance away from any other persons.<p>&nbsp;</p></li></ul> <p>4.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;We currently exempt persons doing television broadcasts from having to wear face masks or face shields. We will continue with this exemption, provided such activities are done in a safe and controlled environment, e.g. safe distancing is observed vis-à-vis other persons, and safe management practices are followed throughout the recording or filming process.<br><br>5.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;In certain settings, face shields may be worn on top of a mask to provide additional protection. For example, wearing a shield can help to protect one’s eyes from droplets that may contain virus particles, and can also prevent the mask from getting wet. It may also help to stop people from adjusting their masks or touching their faces.<br><br>6.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;The general public are still advised to stay at home and avoid going out where possible. However, for those who need to go out, the wearing of masks, in combination with other preventive measures such as hand hygiene and safe distancing, remain important to help reduce and prevent the spread of COVID-19. We will continue to exercise flexibility in enforcement for groups that may have difficulties wearing a face mask or shield, including children with special needs and young children aged two and above. In particular, mask-wearing is not recommended for young children below the age of two for safety reasons.<br><br>7.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;As more activities and services gradually resume, we urge everyone to play their part by wearing masks, observing good personal hygiene, and adhering to safe distancing and safe management measures.</p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "guidance-for-use-of-masks-and-face-shields", "CurrentPageUrl": null}, {"Title": "408 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1590995100000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "01 Jun 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As of 1 June 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 408 cases of COVID-19 infection in Singapore, all of whom are Work Pass holders residing in foreign worker dormitories. Based on our investigations so far, there are no cases in the community.&nbsp;&nbsp;<br><br>2.&nbsp; &nbsp; &nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;<br><br><strong>MINISTRY OF HEALTH<br>1 JUNE 2020</strong><br></p><div><br></div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "408-new-cases-of-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}