{"pressItemDictionary": {"Press Releases": [{"Title": "1,094 More Cases Discharged, 465 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1589643900000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "16 May 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\">&nbsp; &nbsp; &nbsp; &nbsp;As of 16 May 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 465 cases of COVID-19 infection in Singapore. The lower number of cases today is partly due to fewer tests being processed as one testing laboratory is reviewing its processes following an earlier apparatus calibration issue, and will need time to ramp up its testing capacity. The breakdown is as follows:&nbsp;<br><br><strong>a) Imported cases: 0<br></strong><br>There are no imported cases today.&nbsp;<br><br><strong>b) Cases in the community: 5</strong> (4 Singaporeans/Permanent Residents, 1 Work Pass)<br><br>The number of new cases in the community has decreased, from an average of 9 cases per day in the week before, to an average of 3 per day in the past week. The number of unlinked cases in the community has also decreased, from an average of 3 cases per day in the week before, to an average of 1 per day in the past week.&nbsp;<br><br>Most of the community cases today are linked. Two work at migrant worker dormitories and two are household contacts of one of the cases.&nbsp;<br><br><strong>c) Work Permit holders (residing outside dormitories): 3<br></strong><br>The number of new cases amongst Work Permit holders residing outside dormitories has decreased, from an average of 4 cases per day in the week before, to an average of 2 per day in the past week.&nbsp;<br><br><strong>d) Work Permit holders (residing in dormitories): 457<br></strong><br>We continue to pick up many more cases amongst Work Permit holders residing in dormitories, including in factory-converted dormitories, because of extensive testing in these premises, as part of our process to verify and test the status of all workers.&nbsp;<br><br>2.&nbsp; &nbsp;Details of these trends can be found in MOH’s daily situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report)\" title=\"\" class=\"\" target=\"\">www.moh.gov.sg/covid-19/situation-report)</a>. Please refer to <a href=\"/docs/librariesprovider5/default-document-library/annex-a7582813453ca40c5af1447b069e8b0ad.pdf?sfvrsn=65cb90f4_0\" title=\"Annex A\">Annex A</a>&nbsp;for the summary of the confirmed cases.&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp; Of the new cases, 99% are linked to known clusters, while the rest are pending contact tracing.&nbsp;<br><br><strong>Links between previous cases found<br></strong><br>4.&nbsp; &nbsp; &nbsp; In the past week (9 May to 15 May), MOH has uncovered links for 41 previously unlinked cases.&nbsp;<br><br>5.&nbsp; &nbsp; &nbsp;Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <a href=\"/docs/librariesprovider5/default-document-library/annex-baf7bf67228e64c43860e7aa4a2f7b1e9.pdf?sfvrsn=deaa0c6a_0\" title=\"Annex B\">Annex B</a>&nbsp;and <a href=\"/docs/librariesprovider5/default-document-library/annex-cb29003596cdd4ce4afd9859f87ddfaa9.pdf?sfvrsn=18048920_0\" title=\"Annex C\">Annex C</a>&nbsp;for details.<br><br><strong>Update on condition of confirmed cases<br></strong><br>6.&nbsp; &nbsp; &nbsp; 1,094 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 8,342 have fully recovered from the infection and have been discharged from hospitals or community care facilities.&nbsp;<br><br>7.&nbsp; &nbsp; &nbsp; &nbsp; There are currently 1,111 confirmed cases who are still in hospital. Of these, most are stable or improving, and 16 are in critical condition in the intensive care unit. 17,881 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 22 have passed away from complications due to COVID-19 infection.&nbsp;<br><br>8.&nbsp; &nbsp; Case 1516, a 67 year-old male Singapore Citizen, has passed away from complications due to COVID-19 infection on 15 May 2020. He was confirmed to have COVID-19 infection on 7 April, and had a history of ischaemic heart disease, hypertension and hyperlipidaemia. Sengkang General Hospital has reached out to his family and is extending assistance to them.<br><br><strong>MINISTRY OF HEALTH<br>16 MAY 2020</strong></p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "1-094-more-cases-discharged-465-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "465 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1589613600000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "16 May 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As of 16 May 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 465 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders residing in foreign worker dormitories. Four cases are Singaporeans/ Permanent Residents.&nbsp;<br><br>2.&nbsp; &nbsp; &nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;<br><br><strong>MINISTRY OF HEALTH<br>16 MAY 2020</strong><br></p><div><br></div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "465-new-cases-of-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}