{"pressItemDictionary": {"Press Releases": [{"Title": "Precautionary Measures In Response to Severe Pneumonia Cases In Wuhan, China ", "PublishedDate": "/Date(1577894400000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "02 Jan 2020", "Summary": "", "MainContent": "<p>The Ministry of Health (MOH) is aware of the cluster of severe pneumonia cases in Wuhan city, Hubei Province, China and&nbsp;is monitoring the situation closely.</p> <p>As a precautionary measure, MOH has alerted all medical practitioners to be vigilant to look out for suspected cases with pneumonia who have recently returned from Wuhan. Suspect cases with&nbsp;fever and acute respiratory illness or pneumonia&nbsp;and with&nbsp;travel history to Wuhan within 14 days before onset of symptoms&nbsp;will be isolated as a precautionary measure to prevent transmission.</p> <p>From the evening of 3 January 2020, temperature screening will be implemented at Changi airport for inbound travellers arriving on flights from Wuhan, and suspected cases will be referred to hospitals for further assessment. Health advisory posters for all travellers will be put up at Changi Airport, and a health advisory will be provided to all inbound travelers on flights from Wuhan.&nbsp;&nbsp;</p> <p>As of 2 January 2020, MOH has not been notified of any suspected cases.</p> <p><strong>Health advisory</strong></p> <p>MOH advises all travellers to Wuhan to monitor their health closely and to seek medical attention promptly if they feel unwell, and to also inform their doctor of their travel history. Travellers and members of the public should adopt the following precautions at all times:</p> <ul><li>Avoid contact with live animals including poultry and birds, and consumption of raw and undercooked meats;</li><li>Avoid close contact with people who are unwell or showing symptoms of illness;</li><li>Observe good personal hygiene; </li><li>Practise frequent hand washing with soap (e.g. before handling food or eating, after going to toilet, or when hands are dirtied by respiratory secretions after coughing or sneezing); </li><li>Wear a mask if you have respiratory symptoms such as a cough or runny nose;</li><li>Cover your mouth with a tissue paper when coughing or sneezing, and dispose the soiled tissue paper in the rubbish bin immediately; and</li><li>Seek medical attention promptly if you are feeling unwell.</li></ul>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "precautionary-measures-in-response-to-severe-pneumonia-cases-in-wuhan-china", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}