{"pressItemDictionary": {"Press Releases": [{"Title": "No New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1608453600000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "20 Dec 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;As of 20 December 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed that there are no new cases of locally transmitted COVID-19 infection. <br><br>2.&nbsp; &nbsp; &nbsp;There are 19 imported cases, who had already been placed on Stay-Home Notice (SHN) or isolated upon arrival in Singapore. <br><br>3.&nbsp; &nbsp; &nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;<br><br><strong>Investigations into 13 cases who served SHN at Mandarin Orchard Singapore&nbsp;<br><br></strong>4.&nbsp; &nbsp; &nbsp; MOH announced on 19 December that it is investigating 13 cases [1]&nbsp;of COVID-19 infection amongst individuals who had served SHN at Mandarin Orchard Singapore between 22 October and 11 November 2020. As a precautionary measure to ensure the safety of all guests, the hotel has stopped accepting new guests since 19 December and is checking out existing guests progressively. Individuals serving SHN at Mandarin Orchard Singapore have been transported via dedicated vehicles to an alternative SHN dedicated facility. <br><br>5.&nbsp; &nbsp; &nbsp; In total, 394 persons serving SNH at the hotel have been swabbed, and 384 test results are ready, while 10 are pending. Of the results that are ready, 381 have come back negative for COVID-19 infection. 3 have tested positive and were immediately conveyed to the hospital via ambulance. As they have recent travel history, it is likely that these are imported and have been included in today’s case count. Nevertheless the National Public Health Laboratory will conduct whole genome sequencing and phylogenetic analysis to determine if they could be linked to the 13 cases. It takes about 4 weeks to culture the virus and complete the genome sequencing. <br><br>6.&nbsp; &nbsp; &nbsp; MOH has also tested 158 staff of Mandarin Orchard Singapore so far, and all the Polymerase Chain Reaction (PCR) test results have come back negative for COVID-19. However the serological tests of 3 staff have come back positive, indicating likely past infections. Epidemiological investigations of these cases are in progress.</p> <p>&nbsp;</p> <div> <p><strong>MINISTRY OF HEALTH<br></strong><strong>20 DECEMBER 2020</strong></p> </div> <div><br clear=\"all\"> <hr align=\"left\" size=\"1\" width=\"33%\"> <div id=\"ftn1\"> <p>[1] Cases 58204, 58235, 58233, 58236, 58237, 58234, 58244, 58245, 58253, 58252, 58268, 58281 and 58284. They were confirmed between 2 November and 11 November to have COVID-19 infection. These cases were classified as imported cases due to their recent travel history. </p> </div> </div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "no-new-cases-of-locally-transmitted-covid-19-infection-20dec", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}