{"pressItemDictionary": {"Press Releases": [{"Title": "Expert Committee Appointed to Make Recommendations to the Government On Covid-19 Vaccination Strategy", "PublishedDate": "/Date(1605168000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "12 Nov 2020", "Summary": "", "MainContent": "<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The Ministry of Health (MOH) has appointed a 14-member Expert Committee on COVID-19 Vaccination to make recommendations to the government on Singapore’s COVID-19 vaccination strategy, and ensure the safe and effective use of COVID-19 vaccines in our population. The Expert Committee’s appointment came into effect on 5 October 2020. </p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The Expert Committee is chaired by Associate Professor Benjamin Ong, Senior Advisor to the Director of Medical Services, Ministry of Health, and Senior Vice President (Health Education and Resources), National University of Singapore. It comprises experts in infectious diseases, immunology and other relevant fields. The Expert Committee will leverage scientific and clinical expertise to assess vaccine candidates, and recommend the appropriate vaccines for use against COVID-19 in Singapore when they become available. Please refer to the <a title=\"Annex\" href=\"/docs/librariesprovider5/pressroom/press-releases/annex-ec19v-12-nov.pdf?sfvrsn=1bce5edb_2\">Annex</a>&nbsp;for the composition of the Expert Committee. </p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The Expert Committee will consider the most up-to-date information and assessment of COVID-19 vaccines, including closely monitoring the global vaccine development landscape and stance of authoritative agencies such as the World Health Organization (WHO). As the latest clinical data of vaccine candidates emerges, the Expert Committee will assess their safety, efficacy and suitability for use by the different segments of Singapore’s population.&nbsp; It will then make recommendations on the administration of vaccines to specific segments of the population and advise on the overall vaccination strategy for Singapore.</p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The Expert Committee convened their first meeting on 13 October 2020 and has met regularly in the past month to discuss the profiles of various vaccine candidates, as well as the conditions for their deployment in Singapore’s context.</p><p>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Expert Committee chairperson A/Prof Benjamin Ong said, “Globally, as more vaccine candidates are made available for clinical use, ensuring that vaccines are safe and effective will be a top priority. There are many factors to consider as not all vaccines would be suitable, safe and effective for all segments of our population. The Expert Committee will need to closely study the safety and clinical data as they become available, while taking into account our local context, so that we can assess and recommend an appropriate and holistic vaccination strategy that can be put in place for the Singapore population. The safety of Singaporeans is our top priority, and the diverse range of expertise among my colleagues in the Expert Committee will put us in good stead as we deliberate on strategies for the implementation of COVID-19 vaccination in Singapore.”</p><p>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Singapore has been actively monitoring the global progress in COVID-19 vaccine development, and has taken steps to secure access to a portfolio of vaccines for our population amidst expected strong global demand. We are a strong supporter and active participant in driving the work of the global COVID-19 Vaccine Global Access (COVAX) Facility. On top of our efforts through the COVAX Facility, we have further broadened and diversified our COVID-19 vaccine portfolio with a number of pharmaceutical companies which currently have vaccine candidates in development, so as to improve our chances of securing a suitable vaccine for Singapore.</p><p>7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; MOH will continue to closely track the progress of the different COVID-19 vaccine candidates under development globally in the coming months, and will provide further updates on our plans.</p><p><br><strong>MINISTRY OF HEALTH<br>12 NOVEMBER 2020</strong></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "expert-committee-appointed-to-make-recommendations-to-the-government-on-covid-19-vaccination-strategy", "CurrentPageUrl": null}, {"Title": "No New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1605166260000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "12 Nov 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\"><span style=\"font-size: 16px;\"><span style=\"font-family: Arial;\">1.&nbsp; &nbsp; &nbsp;As of 12 November 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed that there are no new cases of locally transmitted COVID-19 infection. </span></span></p> <p style=\"text-align: justify;\"><span style=\"font-size: 16px; font-family: Arial;\">2.&nbsp; &nbsp; &nbsp;<span style=\"text-align: left;\">There are 11 imported cases, who had already been placed on Stay-Home Notice or isolated upon arrival in Singapore</span><span style=\"text-align: left;\">.</span></span></p> <p style=\"margin-left: 0cm; text-align: justify;\"><span style=\"font-size: 16px; font-family: Arial;\">3.&nbsp; &nbsp; &nbsp;</span><span style=\"text-align: left; font-size: 16px; font-family: Arial;\">We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.</span></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "no-new-cases-of-locally-transmitted-covid-19-infection-12Nov-2020", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}