{"pressItemDictionary": {"Press Releases": [{"Title": "472 More Cases Discharged; 81 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1597506240000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "15 Aug 2020", "Summary": "", "MainContent": "<div> <p>&nbsp; &nbsp; &nbsp; As of 15 August 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 81 cases of COVID-19 infection in Singapore. The breakdown of the cases is as follows:&nbsp;<br><br>a)&nbsp;&nbsp;<strong>Imported cases: 16 </strong>(2 Work Pass holders, 1 Work Permit holder, 3 Dependant’s Pass holders, 10 Special Pass holders) <br><br>Amongst the 16 imported cases, 3 (Cases 55671, 55695 and 55696) are Dependant’s Pass holders who arrived from India on 31 July and South Africa on 29 July. Another 3 cases (Cases 55686, 55688 and 55690) are Work Pass/ Work Permit holders who are currently employed in Singapore. They arrived from Bangladesh on 1 August and the Philippines on 2 August. All of them had been placed on 14-day Stay-Home Notice (SHN) upon arrival in Singapore, and were serving their SHN at dedicated facilities. They had been tested while serving their SHN. <br><br>Another 10 cases are seamen who are Special Pass holders. They arrived in Singapore from India on 8 August on a vessel, where they had not disembarked from. As they had been identified as close contacts of previous cases, they were swabbed while on the vessel even though 5 of them are asymptomatic. They had remained on the vessel until their test results came back positive for COVID-19, and subsequently conveyed in ambulances to a hospital.&nbsp;<br><br><strong>b)</strong>&nbsp;<strong>Cases in the community: 3 (2 Singaporeans, 1 Work Pass holder)&nbsp;<br><br></strong>All 3 cases in the community are linked to previous cases. 2 (Cases 55706 and 55731) had been identified as contacts of previously confirmed cases. They had been placed on quarantine earlier, and were tested during quarantine to determine their status. Case 55731 is a technician who had boarded the affected vessel between 8 August and 12 August to carry out essential repair and maintenance work. He was subsequently placed on quarantine when some crew members were confirmed to have COVID-19, and swabbed even though he is asymptomatic. <br><br>Case 55712 was detected under our enhanced community testing to test all individuals aged 13 and above who are diagnosed with acute respiratory infection (ARI) at first presentation to a doctor. This allows us to identify infected individuals early and to quickly contain further spread. <br><br>Epidemiological investigations found that 3 cases (Cases 55169, 55469 and 55712) had visited Jewel Music Box KTV at HomeTeamNS Khatib on 1 August and 2 August 2020. Amongst them, 2 had been at the KTV for long periods for work purposes. Visitors were invited to preview the new, yet to be opened KTV premise on 1 August and 2 August, and most stayed for a short period of time. The KTV was not operational during the visits and there were no singing activities held. Therefore the risk of infection for visitors is assessed to be low. However as a precautionary measure, MOH will be contacting all visitors to the KTV on these two days and facilitating COVID-19 testing for them. Those who are unwell when contacted will be conveyed to the hospital for further medical assessment. We advise all visitors to the Jewel Music Box KTV at HomeTeamNS Khatib during the affected dates to monitor their health and seek medical attention promptly should they develop acute respiratory infection symptoms. They may call MOH at 1800-333-9999 if they have queries. <br><br>Overall, the number of new cases in the community has remained stable at an average of 2 cases per day in the past 2 weeks. The number of unlinked cases in the community has also remained stable at an average of 1 case per day in the past 2 weeks.&nbsp;We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.&nbsp;<br><br><span style=\"font-size: 13px;\"><strong>c)&nbsp; &nbsp; &nbsp; Cases residing in dormitories: 62&nbsp;&nbsp;<br><br></strong>The Inter-agency Taskforce has completed the testing of all workers in the dormitories. There are currently about 20,700 workers who are still serving out their quarantine period. These workers will be tested when their quarantine ends, and we expect the case counts to remain high in the coming days, before tapering down thereafter.&nbsp;<br><br>2.&nbsp; &nbsp; &nbsp;&nbsp;Details of these trends can be found in MOH’s daily situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\">www.moh.gov.sg/covid-19/situation-report</a>). Please refer to <u><a href=\"/docs/librariesprovider5/default-document-library/annex-afa977c1d4f694a6183cfcb33f654c146.pdf?sfvrsn=5d429215_0\" title=\"Annex A\">Annex A</a></u> for the summary of the confirmed cases.&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp;&nbsp;</span>All the new cases are linked to known clusters. <br><br>4.&nbsp; &nbsp; &nbsp; The following dormitories have been cleared by the Inter-agency Taskforce, and now house only recovered individuals and those who have recently tested negative for COVID-19 infection. As such, the clusters have now been closed.</p> </div> <br clear=\"all\">  <div> <ul><li>36 &amp; 38 Kian Teck Drive </li><li>17 Shaw Road </li><li>52 Tech Park Crescent</li><li>8 Tuas South Lane <br></li></ul><p><strong>Links between previous cases found&nbsp;<br><br></strong>5.<strong>&nbsp; &nbsp; &nbsp;&nbsp;</strong>Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <u><a href=\"/docs/librariesprovider5/default-document-library/annex-be8dd277c890e4d919eb0e12f5ffa0508.pdf?sfvrsn=82c09a4a_0\" title=\"Annex B\">Annex B</a></u> and <u><a href=\"/docs/librariesprovider5/default-document-library/annex-c5de168c49c9143729a1466c4fb6f2a62.pdf?sfvrsn=e78cb0dc_0\" title=\"Annex C\">Annex C</a></u> for details.&nbsp;<br><br><strong>Update on condition of confirmed cases&nbsp;<br><br></strong>6.&nbsp; <strong>&nbsp; &nbsp;</strong>472 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 51,521 have fully recovered from the infection and have been discharged from hospitals or community care facilities. <br><br>7.&nbsp; &nbsp; &nbsp;There are currently 83 confirmed cases who are still in hospital. Of these, most are stable or improving, and none is in the intensive care unit. 4,030 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 27 have passed away from complications due to COVID-19 infection.</p></div> <p><strong>MINISTRY OF HEALTH<br></strong><strong>15 AUGUST 2020</strong></p><div> <p><strong>&nbsp;</strong></p> </div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "472-more-cases-discharged-81-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "81 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1597480380000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "15 Aug 2020", "Summary": "", "MainContent": "<p align=\"center\" style=\"text-align: left;\"><span style=\"font-size: 13px;\"><span style=\"text-align: left; font-size: 13px;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;As of 15 August 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 81 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders currently under quarantine. Based on our investigations so far, there are 3 cases in the community, of whom 2 are Singaporeans/ Permanent Residents and 1 is a Work Pass holder.&nbsp;<br><br>2.&nbsp; &nbsp; &nbsp; &nbsp;</span>In addition, there are 16 imported cases, of whom 10 are from a vessel which arrived in Singapore on 8 August. Prior to being conveyed to the hospital, all crew members had not disembarked from the vessel. The rest of the imported cases had all been placed on Stay-Home Notice upon arrival in Singapore. <br><br>3.&nbsp; &nbsp; &nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.</span></p> <p><span style=\"font-size: 13px;\"><br><strong>MINISTRY OF HEALTH<br></strong><strong>15 AUGUST 2020</strong></span></p><div> <p>&nbsp;</p> </div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "81-new-cases-of-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}