{"pressItemDictionary": {"Press Releases": [{"Title": "202 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1593414300000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "29 Jun 2020", "Summary": "", "MainContent": "<p align=\"center\" style=\"text-align: left;\"><span style=\"text-align: left;\">&nbsp; &nbsp; &nbsp; &nbsp; As of 29 June 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 202 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders residing in foreign worker dormitories. Based on our investigations so far, there are 6 cases in the community, of whom 4 are Singaporeans/ Permanent Residents and 2 are Work Pass holders.&nbsp;<br><br>2.&nbsp; &nbsp; &nbsp;</span>We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.</p> <p style=\"text-align: left;\">&nbsp;</p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "202-new-cases-of-covid-19-infection", "CurrentPageUrl": null}, {"Title": "Standardised Packaging & Enlarged Graphic Health Warnings Mandatory for All Tobacco Products  In Singapore From 1 July 2020", "PublishedDate": "/Date(1593360000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "29 Jun 2020", "Summary": "", "MainContent": "<p>1.&nbsp; &nbsp; &nbsp; As part of Singapore's continued efforts on tobacco control, from 1 July 2020, all tobacco products sold in Singapore will be subject to standardised packaging and enlarged graphic health warnings (collectively, \"the SP Measure\"). The SP Measure applies to all tobacco products, including cigarettes, cigarillos, cigars, beedies, <em>ang hoon</em> and other roll-your-own tobacco products.<br><br>2.&nbsp; &nbsp; &nbsp; The SP Measure for tobacco products is part of a multipronged approach aimed, among others, at discouraging non-smokers from picking up smoking, encouraging smokers to quit, and encouraging Singaporeans to adopt a tobacco-free lifestyle, which will ultimately lead to reduced smoking prevalence.<br><br><strong>SP Measure</strong><br><br>3.&nbsp; &nbsp; &nbsp; The Ministry of Health (MOH) had announced the decision to implement the SP Measure for all tobacco packaging on 31 October 2018, after an extensive process of reviewing and evaluating the available international and local studies, research and evidence on the SP Measure, as well as several rounds of public consultations.<br><br>4.&nbsp; &nbsp; &nbsp; Following the passage of amendments to the Tobacco (Control of Advertisements and Sale) Act in March 2019, MOH introduced subsidiary legislation to implement the SP Measure for all tobacco products in Singapore. The Tobacco (Control of Advertisements and Sale) (Appearance, Packaging and Labelling) Regulations 2019 (\"SP Regulations\") were published on 1 July 2019 and will come into operation on 1 July 2020.<br><br>5.&nbsp; &nbsp; &nbsp; The requirements set out in the SP Regulations encompass the appearance, packaging and labelling on retail packaging of all tobacco products and include:<br><br>(a) The removal of all logos, colours, images and promotional information on the packaging of tobacco products (other than brand names and variant names displayed in a standard colour and font style); and<br><br>(b) An increase in the minimum size of the mandatory graphic health warnings from the existing 50% to 75% of all specified tobacco product packaging surfaces.<br><br>Guidance on what the SP Measure may look like on different tobacco packaging formats can be found in the Health Promotion Board's (HPB) Standardised Packaging Guidance Booklet at&nbsp;<a href=\"https://www.hpb.gov.sg/healthy-living/substance-abuse/standardised-packaging-guidance-booklet\" title=\"\" class=\"\" target=\"\">https://www.hpb.gov.sg/healthy-living/substance-abuse/standardised-packaging-guidance-booklet</a>.<br><br>6.&nbsp; &nbsp; &nbsp; From 1 July 2020, all tobacco products imported into, distributed, sold, offered for sale or possessed for sale in Singapore must comply with the SP Regulations. Non-compliance with the SP Regulations is an offence punishable with a fine not exceeding $10,000, imprisonment for a term of up to six months, or both for first offenders. Those with a prior qualifying conviction will face heavier penalties.<br><br>7.&nbsp; &nbsp; &nbsp; A period of 12 months' notice from 1 July 2019 was given to tobacco manufacturers, importers, wholesalers and retailers to adjust and prepare for the full implementation of the SP Measure from 1 July 2020. This included a three-month transition period from 1 April 2020 to 30 June 2020. Tobacco products with standardised packaging have been imported into Singapore since April 2020 and have already been distributed to retailers during the transition period. The Health Sciences Authority (HSA) had also issued letters and email circulars to remind tobacco licensees of the SP Regulations and their obligations.<br><br><strong>Singapore's continued efforts on tobacco control</strong><br><br>8.&nbsp; &nbsp; &nbsp; Tobacco use is associated with cancers (e.g. mouth, lung), ischaemic heart disease, stroke, lung disease and many other diseases. It is the second highest contributor to ill health and premature death in Singapore. Together with HPB, HSA, our partners and the wider community, MOH seeks to reduce smoking prevalence in Singapore for positive public health outcomes.<br><br>9.&nbsp; &nbsp; &nbsp; The range of other tobacco control measures include public education, taxation, smoking cessation programmes, bans on tobacco advertising, the point-of-sale display ban and the institution of a minimum legal age for tobacco.</p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "standardised-packaging-enlarged-graphic-health-warnings-mandatory-for-all-tobacco-products-in-singapore-from-1-july-2020", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}