{"pressItemDictionary": {"Press Releases": [{"Title": "73 More Cases Discharged, 27 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1601391720000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "29 Sep 2020", "Summary": "", "MainContent": "1. As of 29 September 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 27 cases of COVID-19 infection in Singapore. The breakdown of the cases is as follows:\n<br>\n<br><strong>Summary of new cases\n</strong><br>\n<br>Amongst the new cases today, 26 are asymptomatic, and were detected from our proactive screening and surveillance, while 1 was symptomatic. <br><br> <table width=\"601\" bordercolor=\"#00000a\" border=\"1\" cellspacing=\"0\" cellpadding=\"7\"> <colgroup><col width=\"226\"> <col width=\"106\"> <col width=\"106\"> <col width=\"105\"> <tbody><tr> <td width=\"226\" valign=\"TOP\" bgcolor=\"#fff2cc\"> <p><br> </p><span style=\"font-family: Arial; font-size: 13px;\"> </span></td> <td width=\"106\" bgcolor=\"#fff2cc\"> <p align=\"CENTER\"><span style=\"font-family: Arial; font-size: 13px;\"><strong>Already in quarantine/ isolation before detection </strong> </span></p> </td> <td width=\"106\" bgcolor=\"#fff2cc\"> <p align=\"CENTER\"><span style=\"font-family: Arial; font-size: 13px;\"><strong>Detected from surveillance </strong> </span></p> </td> <td width=\"105\" bgcolor=\"#fff2cc\"> <p align=\"CENTER\"><span style=\"font-family: Arial; font-size: 13px;\"><strong>Total</strong></span></p> </td> </tr> <tr> <td width=\"226\" valign=\"TOP\" bgcolor=\"#fff2cc\"> <p><span style=\"font-family: Arial; font-size: 13px;\"><strong>Imported cases</strong></span></p> </td> <td width=\"106\"> <p align=\"CENTER\"><span style=\"font-family: Arial; font-size: 13px;\">9</span></p> </td> <td width=\"106\"> <p align=\"CENTER\"><span style=\"font-family: Arial; font-size: 13px;\">0</span></p> </td> <td width=\"105\"> <p align=\"CENTER\"><span style=\"font-family: Arial; font-size: 13px;\">9</span></p> </td> </tr> <tr> <td width=\"226\" valign=\"TOP\" bgcolor=\"#fff2cc\"> <p><span style=\"font-family: Arial; font-size: 13px;\"><strong>Cases in the community </strong> </span></p> </td> <td width=\"106\"> <p align=\"CENTER\"><span style=\"font-family: Arial; font-size: 13px;\">1</span></p> </td> <td width=\"106\"> <p align=\"CENTER\"><span style=\"font-family: Arial; font-size: 13px;\">0</span></p> </td> <td width=\"105\"> <p align=\"CENTER\"><span style=\"font-family: Arial; font-size: 13px;\">1</span></p> </td> </tr> <tr> <td width=\"226\" valign=\"TOP\" bgcolor=\"#fff2cc\"> <p><span style=\"font-family: Arial; font-size: 13px;\"><strong>Cases residing in dormitories </strong> </span></p> </td> <td width=\"106\"> <p align=\"CENTER\"><span style=\"font-family: Arial; font-size: 13px;\">8</span></p> </td> <td width=\"106\"> <p align=\"CENTER\"><span style=\"font-family: Arial; font-size: 13px;\">9</span></p> </td> <td width=\"105\"> <p align=\"CENTER\"><span style=\"font-family: Arial; font-size: 13px;\">17</span></p> </td> </tr> </tbody></table> <br><strong>a) Imported cases: 9</strong> (1 Singaporean, 5 Permanent Residents, 1 Work Pass holder, 1 Work Permit holder, 1 Dependant’s Pass holder)\n<br>\n<br>Amongst the 9 imported cases, 1 (Case 57878) is a Singaporean and 5 (Cases 57869, 57870, 57871, 57879 and 57881) are Singapore Permanent Residents who returned to Singapore from Indonesia on 18 September and India between 16 September and 18 September. Another 2 (Cases 57866 and 57880) are Work Pass/ Work Permit holders currently employed in Singapore who arrived from Indonesia on 17 September and India on 16 September. The remaining case (Case 57868) is a Dependant’s Pass holder who arrived from India on 17 September. \n<br>\n<br>All of them had been placed on 14-day Stay-Home Notice (SHN) upon arrival in Singapore, and were tested while serving their SHN at dedicated facilities. <br><br><strong>b) Cases in the community: 1</strong> (1 Work Permit holder)\n<br>\n<br>There is 1 case in the community today who was detected as a result of our proactive case finding. Case 57867 had been identified as a household contact of Cases 57847 and 57861. When contacted by MOH on 27 September after Case 57847 was confirmed with COVID-19 infection, Case 57867 reported having symptoms earlier and was immediately conveyed to a hospital for a swab. He was tested positive subsequently.\n<br>\n<br>Overall, the number of new cases in the community has remained stable at an average of fewer than 1 case per day in the past 2 weeks. The number of unlinked cases in the community has also remained stable at an average of fewer than 1 case per day in the past 2 weeks.&nbsp;We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.\n<br>\n<br><strong>c) Cases residing in dormitories: 17\n</strong><br>\n<br>Amongst the 17 cases residing in dormitories, 8 had been identified earlier as contacts of previous cases, and had already been quarantined to prevent further transmission. They were tested during quarantine to determine their status.  \n<br>\n<br>The remaining 9 cases were detected through surveillance testing, such as our bi-weekly Rostered Routine Testing of workers living in dormitories. This allows us to pick up cases early, including asymptomatic ones, so that we are able to ring-fence them quickly to prevent further transmission, by aggressively containing, tracing and isolating the close contacts. \n<br>\n<br>2. Details of these trends can be found in MOH’s daily situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\">www.moh.gov.sg/covid-19/situation-report</a>). Please refer to <a title=\"Annex A\" href=\"/docs/librariesprovider5/default-document-library/annex-a-(29-sep).pdf?sfvrsn=726a8578_0\">Annex A</a>&nbsp;for the summary of the confirmed cases. \n<br>\n<br>3. Of the new cases, 85% are imported or linked to known cases/ clusters, while the rest are pending contact tracing. \n<br>\n<br>4. MOH has been monitoring existing clusters for any further transmission. As there have been no more cases linked to SLR Revolution at Excelsior Shopping Centre (5 Coleman Street) for the past two incubation periods (i.e. 28 days), the cluster has now been closed.\n<br>\n<br><strong>Links between previous cases found\n</strong><br>\n<br>5. Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <a title=\"Annex B\" href=\"/docs/librariesprovider5/default-document-library/annex-b-(29-sep).pdf?sfvrsn=21223fe4_0\">Annex B</a>&nbsp;and <a title=\"Annex C \" href=\"/docs/librariesprovider5/default-document-library/annex-c-(29-sepl).pdf?sfvrsn=e0173167_0\">Annex C </a>&nbsp;for details. \n<br>\n<br><strong>Update on condition of confirmed cases\n</strong><br>\n<br>6. 73 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 57,466 have fully recovered from the infection and have been discharged from hospitals or community care facilities. \n<br>\n<br>7. There are currently 32 confirmed cases who are still in hospital. Of these, most are stable or improving, and none is in the intensive care unit. 217 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 27 have passed away from complications due to COVID-19 infection. \n<br>\n<br>\n<br><strong>MINISTRY OF HEALTH\n<br>29 SEPTEMBER 2020</strong>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "73-more-cases-discharged-27-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "Government to Provide About $2.2 Billion to Help Singaporeans With Medishield Life Premium Adjustments ", "PublishedDate": "/Date(1601373600000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "29 Sep 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\">&nbsp; &nbsp; &nbsp; &nbsp;The MediShield Life Council has made preliminary recommendations for the MediShield Life benefits to be enhanced, and for premiums to be correspondingly adjusted. While the public consultation on the proposed benefit enhancements is ongoing, the Government has committed about $2.2 billion for premium subsidies and support over the next three years to help Singapore Residents with their MediShield Life premiums, particularly in view of the impact of COVID-19 on Singapore Residents and the economy. With these support measures, the net premium increases for all Singapore Citizens will be kept to up to about 10% in the first year.<br><br><strong>Existing Premium Support Measures&nbsp;<br></strong><br>2.&nbsp; &nbsp; &nbsp; &nbsp;Since 2015, the Government has provided the following to keep premiums affordable for Singaporeans:<br><br>a. Funding to cover the bulk of the cost of bringing those who were previously uninsured into MediShield Life, to ease the shift to universal coverage;<br>b. Premium subsidies of up to 50% for the lower- to middle-income;&nbsp;<br>c. Additional Merdeka Generation (MG) subsidies of 5% or 10% [1] (from 2019 onwards);<br>d. Special Pioneer Generation (PG) subsidies of 40% to 60% [1];&nbsp;<br>e. Transitional Subsidies for all Singapore Citizens for the first four years; and&nbsp;&nbsp;<br>f. Additional Premium Support (APS) to help the needy pay for their premiums.<br><br>A total of $3.1 billion has been spent over the past four years to help Singapore Residents with their premiums.&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp; Moving forward, the Government will continue to provide premium support through premium subsidies, MG/PG subsidies and APS, estimated at about $1.8 billion over the next three years, after taking into account the preliminary premium adjustments. Additionally, PG and MG seniors currently receive annual MediSave top-ups which can be used to pay for their MediShield Life premiums. MG seniors receive $200 annually from 2019 to 2023. PG seniors receive $200 to $800 annually, for life.<br><br><strong>One-off COVID-19 Subsidy<br></strong><br>4.&nbsp; &nbsp; &nbsp;To further cushion the impact of the proposed premium adjustments during this exceptional period, the Government will provide a one-off COVID-19 subsidy for all Singapore Citizens. The Government will subsidise 70% of the net increase in premiums (after taking into account existing premium subsidies) in the first year, followed by 30% in the second year.&nbsp;<br><br>5.&nbsp; &nbsp; &nbsp; &nbsp;The one-off COVID-19 subsidy will cost about $360 million over the next two years. Taken together with the existing premium support measures, the net premium increases for all Singapore Citizens will be kept to up to about 10% in the first year.&nbsp;<br><br>6.&nbsp; &nbsp; &nbsp;Minister for Health Mr Gan Kim Yong said, “Since its launch, MediShield Life has improved protection against large hospitalisation bills, and provided greater assurance for Singaporeans. The current premium subsidies for lower-to middle-income Singapore Residents, MG and PG seniors and Additional Premium Support will continue to help keep premiums affordable for Singaporeans. This will amount to about $1.8 billion over the next three years. Given the impact of COVID-19 on the economy, the Government will provide an additional $360 million through the one-off COVID-19 subsidy to help Singaporeans with their premiums during this exceptional period. In total, we have budgeted about $2.2 billion for premium subsidies and support over the next three years. Singaporeans who still face difficulties with their premiums can apply for Additional Premium Support. No one will lose MediShield Life coverage due to financial difficulties.”<br><br>7.&nbsp; &nbsp; &nbsp; &nbsp;Please refer to <a href=\"/docs/librariesprovider5/default-document-library/annex-a7eebc4edb05b4a61b0cc003ac8757a7b.pdf?sfvrsn=978c0457_0\" title=\"Annex A\">Annex A</a>&nbsp;for additional details on net indicative premiums after taking into account these additional Government support.&nbsp;<br><br><strong>MINISTRY OF HEALTH&nbsp;<br>29 SEPTEMBER 2020<br><br></strong>[1] These subsidies increase with age of the PG and MG.<br></p>", "PressCategory": ["Press Releases"], "CustomDetailUrl": "", "UrlName": "government-to-provide-about-2-2-billion-to-help-singaporeans-with-medishield-life-premium-adjustments", "CurrentPageUrl": null}, {"Title": "Public Consultation On Medishield Life Review", "PublishedDate": "/Date(1601373600000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "29 Sep 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\">&nbsp; &nbsp; &nbsp; &nbsp; As part of an ongoing review of MediShield Life benefits and premiums, the MediShield Life Council will conduct a public consultation to seek views from the public on the preliminary recommendations and suggestions for enhancements to the scheme. The public consultation will be held from 29 September to 20 October 2020.&nbsp;<br><br><strong>Keeping healthcare affordable for Singaporeans<br></strong><br>2.&nbsp; &nbsp; &nbsp; &nbsp;MediShield Life is a basic health insurance plan launched in November 2015 to protect all Singaporeans against large medical bills regardless of pre-existing conditions, for life. The MediShield Life Council was appointed by the Minister for Health to provide recommendations on the policy and scheme parameters of MediShield Life, and to review its administration. This is the first major review of the scheme since its launch, and the changes are expected to be implemented in early 2021.<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp;Mrs Fang Ai Lian, Chairman of the MediShield Life Council said, “MediShield Life plays a key role in ensuring our healthcare services remain affordable and gives Singaporeans greater peace of mind. We have to periodically review and update the scheme benefits and premiums to keep pace with evolving medical practice, healthcare cost inflation and actual claims experience, so that it continues to provide assurance for Singaporeans while remaining sustainable. As the Council undertakes the review, we invite Singaporeans to share their ideas and views through the public consultation so that MediShield Life will continue to benefit policyholders.”<br><br><strong>Preliminary recommendations from the MediShield Life Council<br></strong><br>4.&nbsp; &nbsp; &nbsp; &nbsp;MediShield Life was designed based on two key considerations: (a) provide better protection to Singaporeans, while (b) keeping premiums affordable. These considerations must be balanced carefully, as payouts are ultimately funded through premiums to ensure that MediShield Life remains sustainable.&nbsp;<br><br>5.&nbsp; &nbsp; &nbsp; Guided by these considerations, the MediShield Life Council has identified preliminary enhancements in three broad areas:<br><br><strong><em>(a) Refreshing and refining claim limits to provide better coverage&nbsp;<br></em></strong><br>6.&nbsp; &nbsp; &nbsp; MediShield Life claim limits should be refreshed to cover 9 in 10 subsidised bills, and should be reviewed more regularly to ensure that they offer adequate protection in light of inflation and medical advancements. In addition, the Council proposes the following refinements:<br><br>i. I<span style=\"text-decoration: underline;\">ntroduce treatment-specific claim limits for community hospital care and outpatient radiotherapy</span> to improve coverage for patients receiving sub-acute care [1] or costlier outpatient radiotherapy.<br><br>ii. <span style=\"text-decoration: underline;\">Raise the policy year claim limit from $100,000 to $150,000</span>, to better protect Singaporeans against exceptionally large bills arising from long or multiple periods of hospitalisation during the year.&nbsp;<br><br><strong><em>(b) Enhancements to support larger healthcare transformation&nbsp;<br></em></strong><br>7.&nbsp; &nbsp; In line with larger healthcare transformation efforts to keep healthcare costs sustainable, the MediShield Life Council recommends enhancements to better support Singaporeans who can be more appropriately cared for in the community or at home, to reduce the need for expensive hospital care:&nbsp;<br><br>i. <span style=\"text-decoration: underline;\">Introduce higher claim limits for daily ward and treatment charges for the first two days of acute hospital stay</span>, as higher charges tend to be incurred during the first two days due to diagnostic tests and investigations. This is to better support patients who can be discharged home earlier.&nbsp;<br><br>ii. <span style=\"text-decoration: underline;\">Lower the deductible [2] for day surgeries for older patients,</span> so that they are not discouraged from choosing a day surgery over an inpatient stay.&nbsp;<br><br><strong><em>(c) Other proposed enhancements&nbsp;<br></em></strong><br>8.&nbsp; &nbsp; &nbsp; &nbsp;The MediShield Life Council also proposes other enhancements:<br><br>i. <span style=\"text-decoration: underline;\">Lower the pro-ration factor [3] for private hospitals to 25%</span>, to better reflect the actual charges and ensure greater parity in payouts between subsidised and private patients.<br><br>ii. <span style=\"text-decoration: underline;\">Remove the standard exclusions for treatments arising from attempted suicide, intentional self-injury, drug addiction and alcoholism,</span> as treatment plays an increasingly important part in the support and recovery of these patients.<br><br><strong>Review of premiums and premium affordability<br></strong><br>9.&nbsp; &nbsp; &nbsp; Premiums need to be adjusted periodically to support enhancements that provide better coverage and higher payouts, and to keep pace with healthcare cost inflation and actual claims experience. In particular, MediShield Life payouts have increased by close to 40% over the last four years, and the number of claimants has increased by almost 30%. The MediShield Life Council recommends adjusting the premiums this round as proposed by the actuary to ensure that the scheme continues to be sustainable.&nbsp;<br><br>10.&nbsp; &nbsp; &nbsp; As MediShield Life premiums had been kept constant for the first five years in line with the Government’s commitment, premiums were not adjusted when several benefit enhancements were implemented from 2018 to 2020. This round of adjustments will also take these enhancements into account.&nbsp;<br><br>11.&nbsp; &nbsp; &nbsp; Premium subsidies and support will continue to be extended to lower- and middle-income households, Merdeka Generation and Pioneer Generation seniors. Premiums will continue to be fully payable through MediSave. Total household premiums after subsidies will be within annual MediSave contributions and inflows for most typical households.&nbsp;<br><br>12.&nbsp; &nbsp; &nbsp;Nonetheless, the Council notes that some Singaporeans may face greater challenges with their premiums given the impact of COVID-19, and has asked the Ministry of Health (MOH) to consider providing additional assistance during this exceptional period. The Council is pleased to note that MOH has committed additional support for Singaporeans over the next two years. No one will lose MediShield Life coverage due to financial difficulties.<br>&nbsp;<br>13.&nbsp; &nbsp; &nbsp; &nbsp; Please refer to <a href=\"/docs/librariesprovider5/default-document-library/annex-adacb69218d94403dbf35d4e22721e3cf.pdf?sfvrsn=d3182cd2_0\" title=\"Annex A\">Annex A</a>&nbsp;for additional details on the preliminary recommendations, and <a href=\"/docs/librariesprovider5/default-document-library/annex-bbca4584ca2894522ae405c3cedbc2e4f.pdf?sfvrsn=c382b929_0\" title=\"Annex B\">Annex B</a>&nbsp;for illustrations of how the preliminary recommendations can improve coverage for patients.&nbsp;<br><br><strong>Details on Public Consultation<br></strong><br>14.&nbsp; &nbsp; &nbsp; &nbsp;The MediShield Life Council would like to invite the public to contribute their views and feedback on the preliminary recommendations. The Council will carefully consider the feedback received from the public consultation before making the final recommendations by end 2020. The public consultation paper with details on the preliminary recommendations can be viewed at <a href=\"http://www.moh.gov.sg/e-consultation/mshl2020\" title=\"\" class=\"\" target=\"\">http://www.moh.gov.sg/e-consultation/mshl2020</a>.&nbsp;<br><br>15.&nbsp; &nbsp; &nbsp; All feedback can be submitted from 6.00pm, 29 September to 6.00pm, 20 October 2020 via the online feedback form at <a href=\"http://www.moh.gov.sg/e-consultation/mshl2020\" title=\"\" class=\"\" target=\"\">http://www.moh.gov.sg/e-consultation/mshl2020</a>, or mailed to the following address: Quality Service, Ministry of Health, 16 College Road, College of Medicine Building, Singapore 169854. All responses received by the closing date will be carefully considered.&nbsp;<br><br><strong>MINISTRY OF HEALTH&nbsp;<br>29 SEPTEMBER 2020<br><br></strong>[1] Sub-acute care at community hospitals is for complicated medical conditions that require additional medical and nursing care, but at a lower intensity compared to acute hospitals.<br>[2] Amount patient pays once every policy year before MediShield Life payout starts. Ranges from $1,500 to $3,000, depending on age and ward.<br>[3] MediShield Life payouts are pegged at subsidised bills at public hospitals, which are generally much lower than private hospital bills. The pro-ration factor is applied on a private hospital bill to adjust it down to the equivalent level of a subsidised bill, before the payout is computed.</p>", "PressCategory": ["Press Releases"], "CustomDetailUrl": "", "UrlName": "public-consultation-on-medishield-life-review", "CurrentPageUrl": null}, {"Title": "27 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1601365140000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "29 Sep 2020", "Summary": "", "MainContent": "1. As of 29 September 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 27 cases of COVID-19 infection in Singapore. Based on our investigations so far, there is 1 case in the community, who is a Work Pass holder. \n<br>\n<br>2. There are 9 imported cases, who had all been placed on Stay-Home Notice upon arrival in Singapore.  \n<br>\n<br>3. We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH\n<br>29 SEPTEMBER 2020</strong>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "27-new-cases-of-covid-19-infection-29Sep", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}