{"pressItemDictionary": {"Press Releases": [{"Title": "Update On Local Situation Regarding Severe Pneumonia Cluster In Wuhan", "PublishedDate": "/Date(1579543200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "21 Jan 2020", "Summary": "", "MainContent": "<p>As of 3pm, 21 January 2020, the Ministry of Health (MOH) has not been notified of any new suspect cases.&nbsp;</p><p>Epidemiological investigations, clinical assessment and laboratory test results from the suspect case reported on 20 January 2020 involving a 44 year-old female Singapore resident with pneumonia and travel history to Wuhan has found that the case is not linked to the novel Coronavirus pneumonia cluster in Wuhan. The case has tested negative for coronavirus</p><p>MOH will continue to monitor the situation closely. As medical practitioners are on the lookout for cases with pneumonia who have recently returned from Wuhan, Singapore is likely to see more suspect cases that will need to be investigated for possible links to the Wuhan cluster, and we cannot rule out the possibility of imported cases.</p><p>We urge the public to remain vigilant and to adopt good personal hygiene practices at all times. Travellers to Wuhan should monitor their health closely and seek medical attention promptly if they feel unwell, and also inform their doctor of their travel history.</p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "update-on-local-situation-regarding-severe-pneumonia-cluster-in-wuhan-21-jan", "CurrentPageUrl": null}, {"Title": "Additional Precautionary Measures In Response to Novel Coronavirus Pneumonia In China", "PublishedDate": "/Date(1579536000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "21 Jan 2020", "Summary": "", "MainContent": "<div> </div> <p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The Ministry of Health (MOH) notes the increase in the number of cases and widened distribution of the novel coronavirus pneumonia in China. In view of the confirmation of human-to-human transmission by the Chinese authorities, MOH will put in place additional precautionary measures to reduce the risk of importation of the virus to Singapore.</p> <p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; To date, only suspect cases with fever and pneumonia and with travel history to Wuhan within 14 days before onset of symptoms would be isolated. From 22 January 2020, we have widened the definition of suspect cases to include persons with: </p> <p>(i)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; pneumonia and travel history to China within 14 days before onset of symptoms; or </p> <p>(ii)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; acute respiratory infection who had been to any hospital in China, within 14 days before onset of symptoms. </p> <p>These cases will be isolated in hospital as a precautionary measure to prevent transmission. </p> <p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; From 22 January 2020, temperature screening at Changi Airport will also be expanded to all inbound travellers on flights arriving from China, and suspect cases meeting the expanded definition above will be referred to hospitals for further assessment. Health Advisory Notices will be issued to all travellers arriving at Changi Airport from China, and health advisory posters will also be distributed at land and sea checkpoints. </p> <p>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; MOH has also reminded doctors and healthcare workers to be vigilant, and maintain strict infection control and prevention measures. </p> <p>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; To date, there have been no confirmed cases of the novel coronavirus reported in Singapore. However, given the high volume of international travel to Singapore, we expect to see more suspect cases, and possibly imported cases. Once a case is confirmed, contact tracing will be initiated, and we will implement strict isolation, quarantine, and infection control and prevention measures to prevent further transmission.</p> <p>Health Advisory</p> <p>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; MOH urges the public to remain vigilant and to adopt good personal hygiene practices. All travellers to China should monitor their health closely and seek medical attention promptly if they feel unwell, and also inform their doctor of their travel history. </p> <p>7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Members of the public should adopt the following precautions at all times: </p> <p style=\"margin-left: 80px;\">• Avoid contact with live animals including poultry and birds, and consumption of raw and &nbsp;undercooked meats;</p> <p style=\"margin-left: 80px;\">• Avoid close contact with people who are unwell or showing symptoms of illness;</p> <p style=\"margin-left: 80px;\">• Observe good personal hygiene; </p> <p style=\"margin-left: 80px;\">• Practise frequent hand washing with soap (e.g. before handling food or eating, after going to toilet, or when hands are dirtied by respiratory secretions after coughing or sneezing); </p> <p style=\"margin-left: 80px;\">• Wear a mask if you have respiratory symptoms such as a cough or runny nose;</p> <p style=\"margin-left: 80px;\">• Cover your mouth with a tissue paper when coughing or sneezing, and dispose the soiled tissue paper in the rubbish bin immediately; and</p> <p style=\"margin-left: 80px;\">• Seek medical attention promptly if you are feeling unwell.</p> <p>8.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Given the evolving situation and ongoing investigations in China, Singaporeans who need to travel to the affected areas are advised to regularly check MOH’s website (www.moh.gov.sg) for updates.</p> <br>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "additional-precautionary-measures-in-response-to-novel-coronavirus-pneumonia-in-china", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}