{"pressItemDictionary": {"Press Releases": [{"Title": "62 More Cases Discharged; 690 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1588168800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "29 Apr 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\">&nbsp; &nbsp; &nbsp; &nbsp; As of 29 April 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 690 cases of COVID-19 infection in Singapore. The breakdown is as follows:&nbsp;<br><br><strong>a) Imported cases: 0<br></strong><br>There are no imported cases today.&nbsp;<br><br><strong>b) Cases in the community: 11 </strong>(6 Singaporeans/Permanent Residents, 5 Work Passes)<br><br>The number of new cases in the community has decreased, from an average of 25 cases per day in the week before, to an average of 17 per day in the past week. The number of unlinked cases in the community has also decreased, from an average of 17 cases per day in the week before, to an average of 9 per day in the past week. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br><br><strong>c) Work Permit holders (residing outside dormitories): 19</strong><br><br>The number of new cases amongst Work Permit holders residing outside dormitories has decreased, from an average of 29 cases per day in the week before, to an average of 18 per day in the past week.&nbsp;&nbsp;<br><br><strong>d) Work Permit holders (residing in dormitories): 660</strong><br><br>The main increase today continues to be for Work Permit holders residing in dormitories, where we are picking up many more cases because of extensive testing. Most of these cases have a mild illness and are being monitored in the community isolation facilities or general ward of our hospitals. None of them is in the intensive care unit.&nbsp;<br><br>2. Details of these trends can be found in MOH’s daily situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\" title=\"\" class=\"\" target=\"\">www.moh.gov.sg/covid-19/situation-report</a>). Please refer to <a href=\"/docs/librariesprovider5/default-document-library/annex-a98cc9a5c5cc34be199ae80eddda1a8e6.pdf?sfvrsn=f018bd25_0\" title=\"Annex A\">Annex A</a>&nbsp;for the summary of the confirmed cases.&nbsp;<br><br>3. Of the new cases, 63% are linked to known clusters, while the rest are pending contact tracing.&nbsp;<br><br><strong>Links between previous cases found</strong><br><br>4. In the past week (22 April to 28 April), MOH has uncovered links for 1,019 previously unlinked cases.&nbsp;<br><br>5. Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <a href=\"/docs/librariesprovider5/default-document-library/annex-b0654990c38184a67b83c65a2b2bd9b74.pdf?sfvrsn=7ee7ae2e_0\" title=\"Annex B\">Annex B</a>&nbsp;for details.<br><br><strong>Cases from public healthcare sector<br></strong><br><span style=\"text-decoration: underline;\">Case 15237</span><br><br>6. Case 15237 is a 23 year-old female Malaysian national who has no recent travel history to affected countries or regions. She reported onset of symptoms on 23 April, and subsequent test results confirmed COVID-19 infection on 29 April. She is currently warded at the National Centre for Infectious Diseases (NCID).<br><br>7. She is employed as a nurse at NCID. Prior to hospital admission, she had mostly been on medical leave and had only gone to work for a few hours.<br><br><strong>Update on condition of confirmed cases<br></strong><br>8. 62 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 1,188 have fully recovered from the infection and have been discharged from hospitals or community isolation facilities.&nbsp;<br><br>9. There are currently 1,714 confirmed cases who are still in hospital. Of these, most are stable or improving, and 22 are in critical condition in the intensive care unit. 12,725 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 14 have passed away from complications due to COVID-19 infection.&nbsp;<br><br><strong>MINISTRY OF HEALTH<br>29 APRIL 2020</strong><br></p><div><br></div>", "PressCategory": ["Press Releases"], "CustomDetailUrl": "", "UrlName": "62-more-cases-discharged-690-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "690 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1588143900000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "29 Apr 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As of 29 April 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 690 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders residing in foreign worker dormitories. Six cases are Singaporeans/ Permanent Residents.<br><br>2.&nbsp; &nbsp; &nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;<br><br><strong>MINISTRY OF HEALTH<br>29 APRIL 2020<br></strong></p><div><br></div>", "PressCategory": ["Press Releases"], "CustomDetailUrl": "", "UrlName": "690-new-cases-of-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}