{"pressItemDictionary": {"Press Releases": [{"Title": "328 More Cases Discharged, 768 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1588951500000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "08 May 2020", "Summary": "", "MainContent": "<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; As of 8 May 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 768 cases of COVID-19 infection in Singapore. The breakdown is as follows: </p><p><strong>a)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Imported cases: 0</strong></p><p>There are no imported cases today. </p><p><strong>b)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Cases in the community: 11</strong> (10 Singaporeans/Permanent Residents, 1 Work Pass)</p><p>The number of new cases in the community has decreased, from an average of 12 cases per day in the week before, to an average of 10 per day in the past week. The number of unlinked cases in the community has also decreased, from an average of 6 cases per day in the week before, to an average of 5 per day in the past week. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.</p><p><strong>c)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Work Permit holders (residing outside dormitories): 7</strong></p><p>The number of new cases amongst Work Permit holders residing outside dormitories has decreased, from an average of 14 cases per day in the week before, to an average of 12 per day in the past week. </p><p><strong>d)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Work Permit holders (residing in dormitories): 750</strong></p><p>We continue to pick up many more cases amongst Work Permit holders residing in dormitories, including in factory-converted dormitories, because of extensive testing in these premises. </p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Details of these trends can be found in MOH’s daily situation Report (<a title=\"\" href=\"http://www.moh.gov.sg/covid-19/situation-report\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?q=http://www.moh.gov.sg/covid-19/situation-report&amp;source=gmail&amp;ust=1589037551034000&amp;usg=AFQjCNGxUtLO_xVDuQWT3CupvrKBFCTH6Q\">www.moh.gov.sg/covid-19/<wbr>situation-report</a>). Please refer to <a title=\"Annex A\" href=\"/docs/librariesprovider5/pressroom/annex-a-8-may.pdf?sfvrsn=b5bcc508_2\">Annex A</a>&nbsp;for the summary of the confirmed cases. </p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Of the new cases, 93% are linked to known clusters, while the rest are pending contact tracing. </p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; MOH has been monitoring existing clusters for any further transmission. As there have been no more cases linked to Dover Court International School (301 Dover Road), ICA Building (10 Kallang Road) and Lee Ah Mooi Old Age Home (1 Thomson Lane) for the past two incubation periods (i.e. 28 days), the clusters have now been closed.</p><p>&nbsp;</p><p><strong>Links between previous cases found</strong></p><p>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In the past week (1 May to 7 May), MOH has uncovered links for 324 previously unlinked cases. </p><p>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <a title=\"Annex B\" href=\"/docs/librariesprovider5/pressroom/annex-b-8-may.pdf?sfvrsn=71aa36b8_2\">Annex B</a>&nbsp;and <a title=\"Annex C\" href=\"/docs/librariesprovider5/pressroom/annex-c-8-may.pdf?sfvrsn=fa9c03c3_2\">Annex C</a>&nbsp;for details.</p><p>&nbsp;</p><p><strong>Cases from public healthcare sector</strong></p><p><u>Case 21161 </u></p><p>7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 21161 is a 34 year-old female Filipino national who is a Singapore Work Pass holder and has no recent travel history to affected countries or regions. She was tested for COVID-19 as part of MOH’s additional precautionary measures for nursing home staff, and was confirmed to have COVID-19 infection on 7 May. She is currently warded at the National Centre for Infectious Diseases.</p><p>8.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Prior to hospital admission, she had gone to work as a Resident Care Associate at Ren Ci @ Ang Mo Kio (Nursing Home). </p><p>&nbsp;</p><p><strong>Update on condition of confirmed cases</strong></p><p>9.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 328 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 2,040 have fully recovered from the infection and have been discharged from hospitals or community care facilities. </p><p>10.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; There are currently 1,245 confirmed cases who are still in hospital. Of these, most are stable or improving, and 22 are in critical condition in the intensive care unit. 18,402 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 20 have passed away from complications due to COVID-19 infection. </p><p>&nbsp;&nbsp;</p><p><strong>MINISTRY OF HEALTH<br>8 MAY 2020</strong></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "328-more-cases-discharged-768-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "Support Measures for Seniors During Covid-19", "PublishedDate": "/Date(1588935300000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "08 May 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Seniors are at higher risk of developing serious health complications if infected with COVID-19. As such, the Multi-Ministry Taskforce has implemented measures to safeguard the health and wellbeing of our seniors. Efforts include active testing and safe management measures at senior residential care homes, as well as outreach to vulnerable seniors at home.<br><br>2.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Globally, at least 80% of all COVID-19 deaths are seniors aged 60 and above. In Singapore, 412 confirmed cases were aged 60 and above. 95% of all COVID-19 deaths here are seniors. Nearly one in six (16%) seniors who were diagnosed with COVID-19 in Singapore developed severe symptoms and needed intensive care in the hospital. This is compared to just 0.2% of non-seniors. It is therefore critical that we make all effort to protect our seniors.<br><br><strong>Added Precautions at Residential Care Homes<br><br></strong>3.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Frail seniors in residential care homes are particularly vulnerable. Even though there have not been widespread outbreaks in residential care homes<sup>[1]</sup>&nbsp;serving the elderly (“the homes”) in Singapore, we cannot let our guard down. Overseas experiences show that such outbreaks can have catastrophic outcomes.<br><br>4.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Since January 2020, the Ministry of Health (MOH), Ministry of Social and Family Development (MSF), and Agency for Integrated Care (AIC) have worked with the homes on a range of safeguards. These include heightened infection control and prevention practices, access to a steady supply of Personal Protective Equipment for nursing home staff, safe distancing measures, split-zone arrangements, and suspension of visitors.<br><br>5.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;To further reduce the exposure of Homes to COVID-19 infection risks in the community, we have worked with the homes to arrange for resident-facing staff to stay at designated accommodation facilities on-site or at hotels during the circuit breaker period. About 3,000 are in the process of moving into hotels.<br><br>6.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Testing is an important strategy to detect COVID-19 infections amongst our vulnerable groups as early as possible to limit further transmission. MOH, AIC and MSF have initiated testing for all 30,000 residents and staff of nursing homes, welfare homes, sheltered homes and adult disability homes.<br><br>7.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;For the nursing homes, the testing of staff has been completed, and the testing of residents will commence soon. All the staff have tested negative, except for one staff in Ren Ci @ Ang Mo Kio who was tested positive on 7 May 2020. Contact tracing is underway. Residents who were cared for by the affected staff were tested negative, and have been quarantined. For the other residential care homes, the testing of all residents and staff have been completed. We are pending the test results of a few staff and residents, but all returns so far have been negative.<br><br>8.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Beyond this one-time test, we will also continue to maintain a comprehensive testing regime in these homes, in order to protect the seniors. In particular, all staff and residents will be tested periodically, at approximately two-week intervals for a start. All staff and residents who show symptoms of acute respiratory infection will also be immediately tested.<br><br>9.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Where there is a positive case, MOH, MSF, and AIC will support the homes to thoroughly disinfect affected areas, conduct contact tracing, and quarantine close contacts. All homes affected thus far have been able to continue their operations, with the support from healthcare workers from community care providers and public healthcare institutions. Active contact tracing and testing of close contacts have also found no further evidence of transmission within the residential care home environment.<br><br><strong>Support for Seniors Living at Home<br><br></strong>10.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; During the circuit breaker period, essential services have remained in operation, to ensure that seniors and their caregivers can receive the support they need at home. For example, service providers and charity organisations have worked together to conduct home visits and deliver cooked meals and groceries to seniors with inadequate family support. The Silver Generation Office under the AIC has also proactively checked in on about 20,000 seniors with weak family support via weekly telephone calls, and referred them to relevant support services where needed, including befriending services for those who need a listening ear. Volunteers have also engaged seniors who are found loitering, and to persuade them to return home.<br><br>11.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;While seniors can go out to buy food, groceries or other essential supplies, they should still try to keep such movement to a minimum, and protect themselves by staying at home as much as possible. We encourage seniors to exercise at home, keep in touch with their friends and family via phone, participate in online activities, and tune into the larger range of television and radio shows that Mediacorp and the telecommunications operators have made available in this time.<br><br><strong>Gradual Resumption of Selected Essential Services<br><br></strong>12.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;To support seniors in accessing essential services during the circuit breaker period, we have allowed specific places like wet markets and supermarkets to continue operating with the necessary safe distancing measures in place. From the start of the circuit breaker, we also allowed registered Traditional Chinese Medicine (TCM) practitioners to continue seeing patients and dispensing herbal medicine. Subsequently from 5 May onwards, medical halls with practitioners on-site could sell their herbal products to the general public. There are other TCM medical halls which sell herbal products but do not have a registered TCM practitioner on-site. We have considered the matter carefully and will allow such medical halls to commence operations from 12 May 2020, subject to the necessary safe management measures being in place.<br><br><strong>Look out for one another<br><br></strong>13.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Even as we gradually lift movement restrictions, we must stay vigilant and look out for the vulnerable amongst us. Safeguarding the wellbeing of seniors is a collective effort, and each of us can play our part to support one another. We urge Singaporeans to connect seniors to help where needed, and to make more frequent phone calls to your family members and loved ones. Neighbours may also step forward to help seniors in need. If you know of a senior who needs assistance during the COVID-19 situation, please contact the AIC Hotline at 1800-650-6060.</p> <p>&nbsp;</p> <div><br clear=\"all\"> <hr align=\"left\" size=\"1\" width=\"33%\"> <div id=\"ftn1\"> <p><sup>[1]</sup>&nbsp;Comprising nursing homes, welfare homes, sheltered homes, and adult disability homes.</p> </div> </div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "support-measures-for-seniors-during-covid-19", "CurrentPageUrl": null}, {"Title": "768 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1588921740000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "08 May 2020", "Summary": "", "MainContent": "<p align=\"center\" style=\"text-align: left;\"><span style=\"text-align: left;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;As of 8 May 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 768 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders residing in foreign worker dormitories. Ten cases are Singaporeans/ Permanent Residents.</span><br></p> <p style=\"text-align: left;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.</p>", "PressCategory": ["Press Releases"], "CustomDetailUrl": "", "UrlName": "768-new-cases-of-covid-19-infection", "CurrentPageUrl": null}, {"Title": "Man Charged In Court for Breaching Covid-19 (temporary Measures) Act 2020", "PublishedDate": "/Date(1588907700000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "08 May 2020", "Summary": "", "MainContent": "<div>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; A 38-year-old male Singapore Citizen, Soh Seng Chye Francis, was charged in court on 8 May 2020 for an offence under Section 34(7) of the COVID-19 (Temporary Measures) Act 2020, after allegedly contravening Regulation 6 of the COVID-19 (Temporary Measures) (Control Order) Regulations 2020, which prohibits social gatherings during the circuit breaker period.</div><div>&nbsp;</div><div>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; On the evening of 8 April 2020, Soh had attended a social gathering at Lye Bao Ru’s residence that lasted approximately an hour. The gathering involved five other individuals from Lye’s household.</div><div>&nbsp;</div><div>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Under Regulation 6 of the COVID-19 (Temporary Measures) (Control Order) Regulations 2020, all social gatherings among individuals not living in the same place of residence are prohibited from 7 April to 1 June 2020 (both dates inclusive).</div><div>&nbsp;</div><div>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Any person convicted of an offence under Section 34(7) of the COVID-19 (Temporary Measures) Act 2020 is liable to a fine of up to $10,000, or up to six months’ imprisonment, or both. </div><div>&nbsp;</div><div>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The Ministry of Health will not hesitate to take enforcement action against those who fail to comply with the COVID-19 regulations.</div><div>&nbsp;</div><div>&nbsp;</div><div><strong>MINISTRY OF HEALTH</strong></div><div><strong>8 MAY 2020</strong></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "man-charged-in-court-for-breaching-covid-19-(temporary-measures)-act-2020", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}