{"pressItemDictionary": {"Press Releases": [{"Title": "54 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1598771700000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "30 Aug 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As of 30 August 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 54 cases of COVID-19 infection in Singapore. Based on our investigations so far, there are 8 cases in the community, of whom 7 are Singaporeans/ Permanent Residents and 1 is a Work Pass holder.</p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; There are 7 imported cases, who had all been placed on Stay-Home Notice upon arrival in Singapore.&nbsp;</p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.</p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "54-new-cases-of-covid-19-infection", "CurrentPageUrl": null}, {"Title": "Advisory On the Increase In the Number of Invasive Group B Streptococcus Cases", "PublishedDate": "/Date(1598766840000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "30 Aug 2020", "Summary": "", "MainContent": "&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The Ministry of Health (MOH) and Singapore Food Agency (SFA) are investigating a recent uptrend in the number of Group B Streptococcus (GBS) cases. As GBS infections had earlier been associated with the consumption of raw freshwater fish, we advise members of the public who choose to consume ready-to-eat (RTE) raw fish to exercise caution.<br><br>&nbsp;2.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; In July 2020, MOH received reports of 50 GBS cases from public hospitals. This compares with an average of 25 GBS cases per month from January to June 2020. Further laboratory investigations showed that 18 of the cases reported in July were GBS Type III ST283. This compares with an average of 4 cases per month from April to June 2020. The majority of the cases with GBS Type III ST283 were aged 65 and above. Most have since been discharged and have recovered from the infection while one case has passed away due to an unrelated cause.<br><br>&nbsp;3.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; MOH and SFA are currently collecting information on the affected individuals’ food history and conducting field investigations at various locations, to determine possible sources of GBS in these cases.&nbsp;<br><br>&nbsp;<br><strong>No detection of GBS in fish samples so far</strong><br><br>&nbsp;4.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Based on SFA’s routine sampling and testing of fish samples for GBS between May 2019 and August 2020, the presence of ST283 has not been detected. SFA also conducted inspections at food stalls visited by recent cases and found that none of the stalls sold any RTE raw fish dishes.<br><br>&nbsp;5.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Nevertheless, SFA is issuing reminders to retail food establishments to adhere to the ban on<strong> the use of freshwater fish</strong> for sale of RTE raw fish dishes, which has been in force since December 2015. Food establishments selling RTE raw fish are also reminded to ensure good hygiene practices and proper handling of the RTE raw fish. MOH has also alerted doctors to remain vigilant and report suspected invasive GBS cases.<br><br>&nbsp;<br><strong>Health Advisory</strong><br><br>&nbsp;6.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; GBS is a common bacterium found in the human gut and urinary tract of about 15% to 30% of adults without causing disease. However, GBS may occasionally cause invasive infections of the skin, joints, heart and brain. The risk factors for GBS infection include underlying chronic or co-morbid conditions, such as diabetes. Transmission may also occur during childbirth. Most GBS infections are treatable with antibiotics.<br><br>&nbsp;7.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; GBS infections have previously been associated with the consumption of raw freshwater fish. Raw food is likely to contain more bacteria compared to well-cooked food. Members of the public who choose to consume RTE raw fish must be aware of the risks involved. Cooking raw food well is still the most effective way to kill bacteria. As a general precaution, vulnerable groups of people, especially young children, pregnant women, elderly persons, or people with chronic illness such as diabetes, may be more susceptible and should exercise caution by avoiding the consumption of raw food. Individuals can also reduce their risk of infection by:<br><br>•&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Thoroughly cooking food;<br>•&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Washing hands and kitchen utensils such as knives and cutting boards thoroughly before handling food; and<br>•&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Using separate sets of knives and cutting board for raw and cooked food.<br><br>&nbsp;<br><strong>MINISTRY OF HEALTH<br>SINGAPORE FOOD AGENCY<br>29 AUGUST 2020</strong><br><br><a href=\"/docs/librariesprovider5/pressroom/annex-a-gbs.pdf?sfvrsn=91fce52b_2\" title=\"Annex A\"><strong>Annex A</strong></a><strong> -</strong> Good Hygiene Practices and Proper Handling of Ready-to-Eat Raw Fish", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "advisory-on-the-increase-in-the-number-of-invasive-group-b-streptococcus-cases", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}