{"pressItemDictionary": {"Press Releases": [{"Title": "285 More Cases Discharged, 157 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1594135200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "07 Jul 2020", "Summary": "", "MainContent": "1. As of 7 July 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 157 cases of COVID-19 infection in Singapore. The breakdown is as follows: \n<br>\n<br><strong>a) Imported cases: 3</strong> (1 Work Pass holder, 2 Dependant’s Pass holders)\n<br>\n<br>Amongst the 3 imported cases, 2 (Cases 45123 and 45147) are Indian nationals who are Dependant’s Pass holders, and have returned to Singapore from India on 23 June. The remaining case (Case 45024) is a Filipino who returned to Singapore from the Philippines on 19 June. She is a Work Pass holder who is currently employed in Singapore. All of them had been placed on 14-day Stay-Home Notice (SHN) upon arrival in Singapore, and had been tested while serving their SHN.\n<br>\n<br><strong>b) Cases in the community: 20 </strong>(12 Singaporeans/ Permanent Residents, 3 Work Pass holders, 5 Work Permit holders)\n<br>\n<br>Of the 20 cases in the community, 6 were picked up as a result of our proactive surveillance and screening, and 11 had already been placed on quarantine earlier. 11 of the cases are asymptomatic, and were all detected through our proactive testing. \n<br>\n<br>12 of the community cases today are linked to previous cases or clusters. Of these, 11 had been identified as contacts of previously confirmed cases, and had been tested during their quarantine to determine their status. The remaining case (Case 45087) was swabbed as part of our proactive screening of workers in essential services, even though he is asymptomatic. \n<br>\n<br>8 of the community cases are currently unlinked. Of these, 5 cases (Cases 45085, 45089, 45090, 45091 and 45092) were tested as they work in essential services, even though they are all asymptomatic. The remaining cases (Cases 45027, 45149 and 45164) were swabbed under our enhanced community testing to test all individuals aged 13 and above who are diagnosed with acute respiratory infection at first presentation to a doctor. This allows us to detect infected individuals early and to quickly contain further spread.\n<br>\n<br>Overall, the number of new cases in the community has increased, from an average of 8 cases per day in the week before, to an average of 14 per day in the past week. The number of unlinked cases in the community has also increased, from an average of 4 cases per day in the week before, to an average of 6 per day in the past week.&nbsp;We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.\n<br>\n<br><strong>c) Cases residing in dormitories: 134\n</strong><br>\n<br>We continue to pick up cases amongst Work Permit holders residing in dormitories, including in factory-converted dormitories, because of extensive testing in these premises, as part of our process to verify and test the status of all workers. \n<br>\n<br>2. Details of these trends can be found in MOH’s daily situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\">www.moh.gov.sg/covid-19/situation-report</a>). Please refer to <a title=\"Annex A\" href=\"/docs/librariesprovider5/default-document-library/annex-a-(7-jul).pdf?sfvrsn=1e93486d_0\">Annex A</a>&nbsp;for the summary of the confirmed cases. \n<br>\n<br>3. Of the new cases, 94% are linked to known clusters, while the rest are pending contact tracing. \n<br>\n<br><strong>Links between previous cases found\n</strong><br>\n<br>4. In the past week (30 June to 6 July), MOH has uncovered links for 6 previously unlinked cases. \n<br>\n<br>5. Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <a title=\"Annex B\" href=\"/docs/librariesprovider5/default-document-library/annex-b-(7-jul).pdf?sfvrsn=6a8a54c5_0\">Annex B</a>&nbsp;and <a title=\"Annex C\" href=\"/docs/librariesprovider5/default-document-library/annex-c-(7-jul).pdf?sfvrsn=724bd7d8_0\">Annex C</a>&nbsp;for details. \n<br>\n<br><strong>Update on condition of confirmed cases\n</strong><br>\n<br>6. 285 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 41,002 have fully recovered from the infection and have been discharged from hospitals or community care facilities. \n<br>\n<br>7. There are currently 219 confirmed cases who are still in hospital. Of these, most are stable or improving, and 1 is in critical condition in the intensive care unit. 3,893 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 26 have passed away from complications due to COVID-19 infection. \n<br>\n<br>\n<strong><br>MINISTRY OF HEALTH\n<br>7 JULY 2020\n</strong><br>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "285-more-cases-discharged-157-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": " Controlling the Infection In Phase Two of Re-opening", "PublishedDate": "/Date(1594117800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "07 Jul 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;The Multi-Ministry Taskforce has been closely monitoring the COVID-19 situation. There has been an increase in the number of community cases as we resume more economic and social activities following the end of the Circuit Breaker.&nbsp; Proactive measures are in place to uncover and contain cases early. Linked cases are detected and isolated quickly through aggressive ring-fencing. Unlinked cases are picked up early from active surveillance and routine testing of targeted groups, and expanded testing for those diagnosed with acute respiratory infection (ARI)[1].</p><p style=\"text-align: justify;\">2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;While the number of unlinked current infections in the community remains low, it is indicative of undetected cases in the community. Apart from the early detection and isolation measures in place, continued vigilance and adherence to safe management measures on everyone’s part are important to reduce the spread of infection and protect our loved ones.&nbsp;</p><p style=\"text-align: justify;\"><strong>Decline in Total Daily Cases; Continued Effort to Clear Migrant Worker Dormitories</strong></p><p style=\"text-align: justify;\">3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The total daily new cases has been on the decline since the Circuit Breaker period in April and May 2020.&nbsp; While migrant worker dormitory cases continue to constitute the majority of daily cases, they have fallen. The Inter-agency Taskforce (ITF) is continuing its efforts to systematically test and clear workers and dormitories.</p><p style=\"text-align: justify;\"><strong>Some Imported Cases; Isolation under SHN Prevents Community Transmission</strong></p><p style=\"text-align: justify;\">4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Over the past week, 20 imported cases were detected. This is after a long period where we did not experience imported cases. The majority of these cases are returning Singapore Citizens and Permanent Residents, and a few are Work Pass or Dependant’s Pass holders who have been approved to return to Singapore.</p><p style=\"text-align: justify;\">5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Our border controls remain tight. Travellers are isolated under Stay-Home Notices (SHN) on arrival, and tested should they become unwell or before they end their SHN. This prevents community transmission from imported cases. Even as we gradually reopen our borders, we will continue to assess the risk, and have strict border controls to protect our Singapore community.</p><p style=\"text-align: justify;\"><strong>Uptick in Community Cases; Majority are Linked Cases Detected Early by Aggressive Ring-Fencing</strong></p><p style=\"text-align: justify;\">6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In the past week, we have seen an average of 12 new community cases a day, up from around 8 community cases a day in the prior week. Over half of the community cases (57%) since the start of Phase One are linked.</p><p style=\"text-align: justify;\">7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The majority of linked cases are detected through active case finding and aggressive ring-fencing efforts around confirmed cases. Through our contact tracing efforts, close contacts are identified early and put on quarantine quickly. This prevents onward transmission in the community. Our analysis of the recent cases indicate that households are the most common mode of transmission. There are also some transmissions happening at workplaces, especially in settings that are at the frontline of COVID-19 operations. There are fewer transmission taking place through social gatherings for now. This is partly because of the tight restrictions imposed on such activities.&nbsp;Continued vigilance is therefore necessary as we progressively resume more social activities in Phase Two.&nbsp;&nbsp;</p><p style=\"text-align: justify;\"><strong>Close to Half of Unlinked Cases are Past Infections; Many in Construction or Construction-related Occupations</strong></p><p style=\"text-align: justify;\">8.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;Regular testing of targeted groups[2]&nbsp;and testing for those diagnosed with ARI[3]. have helped detect unlinked cases in the community. Of the unlinked cases, about 6 in 10 were asymptomatic, and almost half are likely to be past infections as they tested positive under serology tests.</p><p style=\"text-align: justify;\">9.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Notably, about half of community unlinked cases have been from the construction sector or construction-related occupations such as building trades workers and electrical instrument fitters. Serology testing has found that about two-thirds of these construction-related cases are likely to be past infections that are unlikely to be currently infectious, which could have been transmissions from earlier construction or migrant worker clusters. This shows that the construction sector continues to be a higher risk setting for transmission, as the nature of work can make it more challenging to maintain strict safe management and distancing measures. The Building and Construction Authority has been working closely with the industry and relevant Trade Associations and Chambers to implement the COVID-Safe restart criteria before projects are allowed to resume. Regular testing is an important aspect for early detection of cases to reduce further spread.</p><p style=\"text-align: justify;\">10.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The remaining unlinked cases in the community continue to be in the low single digits currently. Our ARI testing has scaled up significantly in the recent two weeks, which has helped to pick up these cases. They are an important indicator of underlying community spread.&nbsp;</p><p style=\"text-align: justify;\"><strong>Staying Vigilant&nbsp;&nbsp;</strong></p><p style=\"text-align: justify;\">11.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; As we resume more activities under Phase Two, we must be prepared for the number of cases to increase. Apart from the early detection and isolation measures that are in place, adherence to strong safe management measures, safe distancing measures and strict infection control measures by everyone is key to reducing spread. Individuals should also use the TraceTogether and SafeEntry applications to facilitate contact tracing. We strongly encourage anyone who is not feeling well to see a doctor, who is best placed to provide clinical assessment including whether testing is needed as a safeguard and precaution, so that cases can be detected early. Through everyone’s collective efforts, we can keep COVID-19 under control while we progressively resume activities safely.&nbsp;</p><div><br clear=\"all\"><hr align=\"left\" size=\"1\" width=\"33%\" style=\"text-align: justify;\"><div id=\"ftn1\" style=\"text-align: justify;\"><p>[1] For those aged 13 and above.</p></div><div id=\"ftn2\" style=\"text-align: justify;\"><p>[2] With increased testing capacity, the Multi-Ministry Task Force has expanded community testing to include active surveillance testing of targeted groups who are more vulnerable or have higher risk of exposure to COVID-19. In this regard, we have been conducting regular testing of workers who returned to work in the construction, marine and process sectors, and workers supporting our frontline COVID-19 operations.</p></div><div id=\"ftn3\"><p>[3] For those aged 13 and above.</p></div></div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "controlling-the-infection-in-phase-two-of-re-opening", "CurrentPageUrl": null}, {"Title": "157 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1594107180000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "07 Jul 2020", "Summary": "", "MainContent": "<p>1. As of 7 July 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 157 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders residing in foreign worker dormitories. Based on our investigations so far, there are 20 cases in the community, of whom 12 are Singaporeans/ Permanent Residents and 8 are Work Pass holders. From our preliminary investigations, of these 20 cases, 12 were close contacts of earlier cases, and had already been placed on quarantine. Epidemiological investigations are ongoing for the other cases. <br><br>2. In addition, there are 3 imported cases, all of whom had been placed on Stay-Home Notice upon arrival in Singapore. <br><br>3. We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight. <br><strong><br>MINISTRY OF HEALTH<br>7 JULY 2020</strong></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "157-new-cases-of-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}