{"pressItemDictionary": {"Press Releases": [{"Title": "754 More Cases Discharged, 422 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1591885800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "11 Jun 2020", "Summary": "", "MainContent": "<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; As of 11 June 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 422 cases of COVID-19 infection in Singapore. The breakdown is as follows: </p><p><strong>a)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Imported cases: 0</strong></p><p>There are no imported cases today. </p><p><strong>b)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Cases in the community: 5<sup>1</sup>&nbsp;</strong>(1 Singaporean, 2 Work Pass holders, 2 Work Permit holders)</p><p>Of the 5 cases in the community, 2 had been picked up as a result of our proactive surveillance and screening, and 2 had already been placed on quarantine. </p><p>All 4 Work Pass/ Work Permit holders are asymptomatic but had been detected due to our proactive screening. Amongst them, 1 (Case 39071) was tested as she works as a security guard at a dormitory at Tampines Street 62. Another (Case 39321) was swabbed as part of our efforts to screen workers in essential services. The other 2 cases (Cases 39013 and 39039) are housemates of previously confirmed cases, and had already been quarantined earlier. They were swabbed during quarantine to verify their status. </p><p>Epidemiological investigations are ongoing for the Singaporean case (Case 39004). </p><p>Besides the polymerase chain reaction (PCR) test, we also conducted serological tests to determine if some of these cases are current or past infections.<sup>2&nbsp;</sup>The serological test results of 3 cases (Cases 39039, 39071 and 39321) have come back positive, which indicate likely past infections. Results are pending for the rest. </p><p>Overall, the number of new cases in the community has increased, from an average of 6 cases per day in the week before, to an average of 8 per day in the past week. The number of unlinked cases in the community has also increased, from an average of 1 case per day in the week before, to an average of 4 per day in the past week. This is partly due to our active surveillance and screening of targeted groups, which have picked up more cases in the past week. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.</p><p><strong>c)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Cases residing in dormitories: 416</strong></p><p>We continue to pick up cases amongst Work Permit holders residing in dormitories, including in factory-converted dormitories, because of extensive testing in these premises, as part of our process to verify and test the status of all workers. </p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Details of these trends can be found in MOH’s daily situation Report (<a title=\"\" href=\"http://www.moh.gov.sg/covid-19/situation-report\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?q=http://www.moh.gov.sg/covid-19/situation-report&amp;source=gmail&amp;ust=1591971853559000&amp;usg=AFQjCNFA8CfCNeQr230SDrJ_3OCY4fXolg\">www.moh.gov.sg/covid-19/<wbr>situation-report</a>). Please refer to <a title=\"Annex A\" href=\"/docs/librariesprovider5/pressroom/annex-a_11-jun.pdf?sfvrsn=64742b5c_2\">Annex A</a>&nbsp;for the summary of the confirmed cases. </p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Of the new cases, 99% are linked to known clusters, while the rest are pending contact tracing. </p><p>&nbsp;</p><p><strong>Links between previous cases found</strong></p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In the past week (4 June to 10 June), MOH has uncovered links for 10 previously unlinked cases. </p><p>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <a title=\"Annex B\" href=\"/docs/librariesprovider5/pressroom/annex-b-11-jun.pdf?sfvrsn=e1f9c14_2\">Annex B</a>&nbsp;and <a title=\"Annex C\" href=\"/docs/librariesprovider5/pressroom/annex-c-11-jun.pdf?sfvrsn=be166fe2_2\">Annex C</a>&nbsp;for details.</p><p>&nbsp;</p><p><strong>Update on condition of confirmed cases</strong></p><p>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 754 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 27,286 have fully recovered from the infection and have been discharged from hospitals or community care facilities. </p><p>7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; There are currently 227 confirmed cases who are still in hospital. Of these, most are stable or improving, and 2 are in critical condition in the intensive care unit. 11,849 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 25 have passed away from complications due to COVID-19 infection. </p><p>8.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 39327, a 44 year-old male Indian national, has passed away on 8 June 2020. He had developed chest and epigastric pain on 28 May, and had sought medical treatment at a General Practitioner clinic. He was found unconscious at his place of residence on 8 June and conveyed to Singapore General Hospital’s emergency department. He was confirmed to have COVID-19 infection on 10 June after his demise. The cause of death was ischaemic heart disease.<sup>3 </sup></p><p>&nbsp;</p><p><strong>MINISTRY OF HEALTH<br>11 JUNE 2020</strong></p><p><sup>1&nbsp; </sup>Besides these 5 cases, an additional case (Case 39327) has passed away on 8 June 2020. The cause of death was ischaemic heart disease. </p><p><sup>2&nbsp;</sup> Cases whose serological tests are positive are likely have a past infection, and could be shedding minute fragments of the virus RNA picked by the PCR test, which were no longer transmissible and infective to others.</p><p><sup>3&nbsp; </sup>Only cases where the attending doctor or pathologist attributes the primary or underlying cause of death as due to COVID-19 infection will be added to the COVID-19 death count. This is consistent with international practice for classifying deaths.</p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "754-more-cases-discharged-422-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "422 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1591859880000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "11 Jun 2020", "Summary": "", "MainContent": "<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; As of 11 June 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 422 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders residing in foreign worker dormitories. Based on our investigations so far, there are 5 cases in the community, of whom 1 is a Singaporean and 4 are Work Pass holders. </p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight. </p><p><br><strong>MINISTRY OF HEALTH<br>11 JUNE 2020</strong></p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "422-new-cases-of-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}