{"pressItemDictionary": {"Press Releases": [{"Title": "313 More Cases Discharged, 83 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1597413600000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "14 Aug 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;As of 14 August 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 83 cases of COVID-19 infection in Singapore. The breakdown of the cases is as follows:<br><br><strong>a) Imported cases: 4 </strong>(2 Work Pass holders, 2 Dependant’s Pass holders)<br><br>Amongst the 4 imported cases, 2 (Cases 55580 and 55606) are Dependant’s Pass holders who arrived from India on 30 July and 31 July. The remaining cases (Cases 55637 and 55650) arrived from India on 2 August. They are Work Pass holders who are currently employed in Singapore. All of them had been placed on 14-day Stay-Home Notice (SHN) upon arrival in Singapore, and were serving their SHN at dedicated facilities. They had been tested while serving their SHN.<br><br><strong>b) Cases in the community: 0<br></strong><br>There are no cases in the community today.&nbsp;<br><br>Overall, the number of new cases in the community has remained stable at an average of 2 cases per day in the past 2 weeks. The number of unlinked cases in the community has also remained stable at an average of 1 case per day in the past 2 weeks. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br><br><strong>c) Cases residing in dormitories: 79<br></strong><br>The Inter-agency Taskforce has completed the testing of all workers in the dormitories. There are currently about 21,300 workers who are still serving out their quarantine period. These workers will be tested when their quarantine ends, and we expect the case counts to remain high in the coming days, before tapering down thereafter.<br><br>2.&nbsp; &nbsp;Details of these trends can be found in MOH’s daily situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\" title=\"\" class=\"\" target=\"\">www.moh.gov.sg/covid-19/situation-report</a>). Please refer to <a href=\"/docs/librariesprovider5/default-document-library/annex-a51c19238909e433784517d6b0efe97b5.pdf?sfvrsn=18f54985_0\" title=\"Annex A\">Annex A</a>&nbsp;for the summary of the confirmed cases.&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; All the new cases are linked to known clusters.&nbsp;<br><br>4.&nbsp; &nbsp; &nbsp; &nbsp; The following dormitories have been cleared by the Inter-agency Taskforce, and now house only recovered individuals and those who have recently tested negative for COVID-19 infection. As such, the clusters have now been closed.&nbsp;<br><br>• Acacia Lodge (530-540 Bukit Batok Street 23)<br>• Westlite Toh Guan dormitory (18 Toh Guan Road East)<br>• North Coast Lodge (51 North Coast Avenue)<br>• 16 Fan Yoong Road&nbsp;<br>• 11 Tech Park Crescent&nbsp;<br>• 17 Soon Lee Road&nbsp;<br>&nbsp;<br><strong>Links between previous cases found<br></strong><br>5.&nbsp; &nbsp; &nbsp;Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <a href=\"/docs/librariesprovider5/default-document-library/annex-bc09910ec64f54eed939dcdb6b4060bf5.pdf?sfvrsn=f11aae89_0\" title=\"Annex B\">Annex B</a>&nbsp;and <a href=\"/docs/librariesprovider5/default-document-library/annex-c7092c3afefae4628a64730ec0154c30e.pdf?sfvrsn=75b5ab3e_0\" title=\"Annex C\">Annex C</a>&nbsp;for details.&nbsp;<br><br><strong>Update on condition of confirmed cases<br></strong><br>6.&nbsp; &nbsp; &nbsp;313 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 51,049 have fully recovered from the infection and have been discharged from hospitals or community care facilities.&nbsp;<br><br>7.&nbsp; &nbsp; &nbsp; &nbsp;There are currently 79 confirmed cases who are still in hospital. Of these, most are stable or improving, and none is in the intensive care unit. 4,425 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 27 have passed away from complications due to COVID-19 infection.&nbsp;<br><br><strong>MINISTRY OF HEALTH<br>14 AUGUST 2020</strong></p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "313-more-cases-discharged-83-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "83 New Cases of Covid-19 Infection ", "PublishedDate": "/Date(1597390860000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "14 Aug 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;As of 14 August 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 83 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders currently under quarantine. Based on our investigations so far, there are no cases in the community.&nbsp;<br><br>2&nbsp; &nbsp; &nbsp; In addition, there are 4 imported cases, who had all been placed on Stay-Home Notice upon arrival in Singapore.&nbsp;<br><br>3&nbsp; &nbsp; &nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;<br><br><strong>MINISTRY OF HEALTH<br>14 AUGUST 2020</strong></p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "83-new-cases-of-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}