{"pressItemDictionary": {"Press Releases": [{"Title": "78 More Cases Discharged, 741 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1588862280000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "07 May 2020", "Summary": "", "MainContent": "1. As of 7 May 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 741 cases of COVID-19 infection in Singapore. The breakdown is as follows: \n<br>\n<br><strong>a) Imported cases: 0\n</strong><br>\n<br>There are no imported cases today. \n<br>\n<br><strong>b) Cases in the community: 7</strong> (5 Singaporeans/Permanent Residents, 2 Work Passes)\n<br>\n<br>The number of new cases in the community has decreased, from an average of 14 cases per day in the week before, to an average of 10 per day in the past week. The number of unlinked cases in the community has also decreased, from an average of 7 cases per day in the week before, to an average of 4 per day in the past week.&nbsp;We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.\n<br>\n<br><strong>c) Work Permit holders (residing outside dormitories): 9\n</strong><br>\n<br>The number of new cases amongst Work Permit holders residing outside dormitories has decreased, from an average of 15 cases per day in the week before, to an average of 13 per day in the past week.&nbsp;\n<br>\n<strong><br>d) Work Permit holders (residing in dormitories): 725\n</strong><br>\n<br>We continue to pick up many more cases amongst Work Permit holders residing in dormitories, including in factory-converted dormitories, because of extensive testing in these premises. \n<br>\n<br>2. Details of these trends can be found in MOH’s daily situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\">www.moh.gov.sg/covid-19/situation-report</a>). Please refer to <a title=\"Annex A\" href=\"/docs/librariesprovider5/default-document-library/annex-a-(7-may).pdf?sfvrsn=e5935a13_0\">Annex A</a>&nbsp;for the summary of the confirmed cases. \n<br>\n<br>3. Of the new cases, 87% are linked to known clusters, while the rest are pending contact tracing. \n<br>\n<br>4. MOH has been monitoring existing clusters for any further transmission. As there have been no more cases linked to Black Tap (10 Bayfront Avenue) for the past two incubation periods (i.e. 28 days), the cluster has now been closed.\n<br>\n<br><strong>Links between previous cases found\n</strong><br>\n<br>5. In the past week (30 April to 6 May), MOH has uncovered links for 366 previously unlinked cases. \n<br>\n<br>6. Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <a title=\"Annex B \" href=\"/docs/librariesprovider5/default-document-library/annex-b-(7-may).pdf?sfvrsn=7983ee0c_0\">Annex B </a>&nbsp;and <a title=\"Annex C \" href=\"/docs/librariesprovider5/default-document-library/annex-c-(7-may).pdf?sfvrsn=6e7241eb_0\">Annex C </a>&nbsp;for details.\n<br>\n<br><strong>Cases from public healthcare sector\n</strong><br>\n<br><span style=\"text-decoration: underline;\">Case 20737 \n</span><br>\n<br>7. Case 20737 is a 33 year-old female Singapore Citizen who has no recent travel history to affected countries or regions. She was confirmed to have COVID-19 infection on 6 May, and is currently warded at the National Centre for Infectious Diseases (NCID).\n<br>\n<br>8. Prior to hospital admission, she had gone to work for a few hours as a healthcare assistant at Tan Tock Seng Hospital.\n<br>\n<br><span style=\"text-decoration: underline;\">Case 20844 \n</span><br>\n<br>9. Case 20844 is a 43 year-old male Singapore Citizen who has no recent travel history to affected countries or regions. He was confirmed to have COVID-19 infection on 7 May, and is currently warded at NCID.\n<br>\n<br>10. Prior to hospital admission, he had gone to work as a radiographer at the community care facility at Singapore EXPO.\n<br>\n<strong><br>Update on condition of confirmed cases\n</strong><br>\n<br>11. 78 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 1,712 have fully recovered from the infection and have been discharged from hospitals or community care facilities. \n<br>\n<br>12. There are currently 1,376 confirmed cases who are still in hospital. Of these, most are stable or improving, and 19 are in critical condition in the intensive care unit. 17,831 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 20 have passed away from complications due to COVID-19 infection. \n<br>\n<br>\n<br><strong>MINISTRY OF HEALTH\n<br>7 MAY 2020</strong>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "78-more-cases-discharged-741-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "741 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1588835340000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "07 May 2020", "Summary": "", "MainContent": "1. As of 7 May 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 741 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders residing in foreign worker dormitories. Five cases are Singaporeans/ Permanent Residents. \n<br>\n<br>2. We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight. \n<br>\n<br>\n<br><strong>MINISTRY OF HEALTH\n<br>7 MAY 2020\n</strong><br>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "741-new-cases-of-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}