{"pressItemDictionary": {"Press Releases": [{"Title": "No New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1608392040000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "19 Dec 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\">&nbsp; &nbsp; &nbsp; &nbsp;As of 19 December 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified that there are no new cases of locally transmitted COVID-19 infection. There are 17 imported cases, who had already been placed on Stay-Home Notice (SHN) or isolated upon arrival in Singapore. Amongst the new cases today, 15 are asymptomatic, and were detected from our proactive screening and surveillance, while 2 were symptomatic.&nbsp;&nbsp;<br><br><strong>Summary of new cases</strong><br></p><table border=\"1\" cellspacing=\"0\" cellpadding=\"0\" width=\"605\"><tbody><tr><td width=\"129\"><p align=\"right\">&nbsp;</p></td><td width=\"60\"><p>&nbsp;</p></td><td width=\"16\" valign=\"top\"><p>&nbsp;</p></td><td width=\"192\" colspan=\"2\"><p align=\"center\"><strong>Breakdown by</strong></p></td><td width=\"16\" valign=\"top\"><p>&nbsp;</p></td><td width=\"192\" colspan=\"2\"><p align=\"center\"><strong>Breakdown by</strong></p></td></tr><tr><td width=\"129\"><p align=\"right\">&nbsp;</p></td><td width=\"60\"><p><strong>Number of cases</strong></p></td><td width=\"16\" valign=\"top\"><p>&nbsp;</p></td><td width=\"96\"><p><strong>Already in quarantine/ isolation before detection</strong></p></td><td width=\"96\"><p><strong>Detected from surveillance</strong></p></td><td width=\"16\" valign=\"top\"><p>&nbsp;</p></td><td width=\"96\"><p><strong>Symptomatic</strong></p></td><td width=\"96\"><p><strong>Asymptomatic</strong></p></td></tr><tr><td width=\"129\"><p><strong>Cases in the community</strong></p></td><td width=\"60\"><p align=\"center\">0</p></td><td width=\"16\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">0</p></td><td width=\"96\"><p align=\"center\">0</p></td><td width=\"16\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">0</p></td><td width=\"96\"><p align=\"center\">0</p></td></tr><tr><td width=\"129\"><p><strong>Cases residing in dormitories</strong></p></td><td width=\"60\"><p align=\"center\">0</p></td><td width=\"16\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">0</p></td><td width=\"96\"><p align=\"center\">0</p></td><td width=\"16\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">0</p></td><td width=\"96\"><p align=\"center\">0</p></td></tr><tr><td width=\"129\"><p><strong>Imported cases</strong></p></td><td width=\"60\"><p align=\"center\">17</p></td><td width=\"16\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">17</p></td><td width=\"96\"><p align=\"center\">0</p></td><td width=\"16\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">2</p></td><td width=\"96\"><p align=\"center\">15</p></td></tr><tr><td width=\"129\"><p><strong>Total</strong></p></td><td width=\"60\"><p align=\"center\">17</p></td><td width=\"16\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">&nbsp;</p></td><td width=\"16\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">&nbsp;</p></td></tr></tbody></table><p style=\"text-align: justify;\"><br>2.&nbsp; &nbsp; &nbsp;Overall, the number of new cases in the community has remained low, with no new cases in the past week. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br><br><strong>Case Details<br></strong><br><strong>a) Cases in the community: 0<br></strong><br>There are no cases in the community today.<br><br><strong>b) Cases residing in dormitories: 0<br></strong><br>There are no cases residing in dormitories today.&nbsp;<br><br><strong>c) Imported cases: 17<br></strong><br>Amongst the 17 imported cases, 1 (Case 58636) is a Singaporean and 2 (Cases 58633 and 58635) are Singapore Permanent Residents who returned from the UK, India and US. Another 8 (Cases 58619, 58620, 58622, 58623, 58624, 58625, 58626 and 58627) are Work Permit holders currently employed in Singapore who arrived from Indonesia and India. The remaining 6 cases are Short-Term Visit Pass holders. Of these, 2 (Cases 58628 and 58631) arrived from the UK and India to visit their family members who are Singaporeans or Singapore Permanent Residents. 3 (Cases 58617, 58618 and 58632) are crew members of a ship which arrived from Indonesia. They had not disembarked from the ship and were tested onboard and subsequently conveyed to the hospital when their results came back positive for COVID-19 infection. The remaining case (Case 58629) arrived from Malaysia for a work project in Singapore.&nbsp;<br><br>They had all already been placed on SHN or isolated upon arrival in Singapore and were tested while serving SHN or during isolation.<br><br>3.&nbsp; &nbsp; Please refer to the <a href=\"/docs/librariesprovider5/default-document-library/annexes00a26151d71042eeb23386a3945b6e33.pdf?sfvrsn=782bc436_0\" title=\"Annexes\">Annexes</a>&nbsp;and MOH’s daily Situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\" title=\"\" class=\"\" target=\"\">www.moh.gov.sg/covid-19/situation-report</a>) for details.&nbsp;<br><br>4.&nbsp; &nbsp; &nbsp; Epidemiological investigations are in progress. In the meantime, all the identified close contacts of the cases have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for the close contacts to determine if the cases could have been infected by them.<br><br><strong>Investigations into 13 cases who served SHN at Mandarin Orchard Singapore<br></strong><br>5.&nbsp; &nbsp; &nbsp; As announced this afternoon, MOH is investigating 13 cases<sup>1</sup> of COVID-19 infection amongst individuals who had served SHN at Mandarin Orchard Singapore between 22 October and 11 November 2020. The cases, who were confirmed between 2 November and 11 November to have COVID-19 infection, were observed to have high genetic similarity despite having arrived from different countries. From MOH’s preliminary investigations, we cannot exclude that transmissions could have occurred at Mandarin Orchard Singapore.<br><br>6.&nbsp; &nbsp; &nbsp; As a precautionary measure to ensure the safety of all guests, the hotel has stopped accepting new guests and is checking out existing guests progressively. Persons serving SHN will be transported via dedicated vehicles to an alternative SHN dedicated facility. Deep cleaning and disinfection will be carried out by the hotel, in consultation with MOH and the National Environment Agency. MOH has commenced a special testing operations to test around 500 staff of the hotel for COVID-19 infection. We have also tested most of those who are currently serving SHN at Mandarin Orchard Singapore, and are pending the results of their tests.&nbsp;<br><br><strong>Update on condition of confirmed cases<br></strong><br>7.&nbsp; &nbsp; 9 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 58,274 have fully recovered from the infection and have been discharged from hospitals or community care facilities.&nbsp;<br><br>8.&nbsp; &nbsp; &nbsp; There are currently 38 confirmed cases who are still in hospital. Of these, most are stable or improving, and none is in the intensive care unit. 62 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 29 have passed away from complications due to COVID-19 infection.&nbsp;<br><br><strong>MINISTRY OF HEALTH<br>19 DECEMBER 2020<br><br></strong><sup>1&nbsp;</sup>Cases 58204, 58235, 58233, 58236, 58237, 58234, 58244, 58245, 58253, 58252, 58268, 58281 and 58284. These cases were classified as imported cases due to their recent travel history.&nbsp;<br></p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "no-new-cases-of-locally-transmitted-covid-19-infection-19dec-update", "CurrentPageUrl": null}, {"Title": "Investigations Into 13 Covid-19 Cases Who Served Shn At Mandarin Orchard Singapore", "PublishedDate": "/Date(1608362700000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "19 Dec 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\"><span style=\"font-size: 13px; font-family: Arial;\"><span style=\"color: black;\">1.&nbsp; &nbsp; &nbsp;The Ministry of Health (MOH) is investigating 13 cases of COVID-19 infection amongst individuals who had served Stay-Home Notice (SHN) at Mandarin Orchard Singapore (333 Orchard Road)</span></span><span style=\"font-size: 13px; font-family: Arial;\"><span>.</span></span><span style=\"font-size: 13px; font-family: Arial;\"><span> </span></span><span style=\"font-size: 13px; font-family: Arial;\">As a precautionary measure, Mandarin Orchard Singapore will stop accepting new guests with immediate effect. Those currently serving SHN at the hotel will be moved to another SHN dedicated facility. The hotel has made arrangements to check out existing guests progressively. Restaurant and event spaces within the hotel will also be closed.</span></p> <p style=\"text-align: justify;\"><span style=\"text-align: left; font-size: 13px; font-family: Arial;\">2.&nbsp; &nbsp; &nbsp;As part of routine laboratory surveillance, the National Public Health Laboratory conducts whole genome sequencing and phylogenetic analysis on all COVID-19 cases. It takes about four weeks to culture the virus and complete the genome sequencing. 13 imported cases, who were confirmed between 2 November and 11 November to have COVID-19 infection, were observed to have high genetic similarity despite the cases having arrived from different countries, including Bahrain, Canada, Indonesia, Myanmar, Netherlands, Philippines, South Korea, UAE, UK and US. This suggests that these cases were likely infected from a similar source. Further investigations by MOH found that these 13 cases [1]</span><span style=\"text-align: left; font-size: 13px; font-family: Arial;\"> had served SHN at </span><span style=\"text-align: left; font-size: 13px; font-family: Arial;\">Mandarin Orchard Singapore</span><span style=\"text-align: left; font-size: 13px; font-family: Arial;\"> between 22 October and 11 November 2020. Genome sequencing and analysis are continuing for cases beyond 11 November. [2]<br><br>3.&nbsp; &nbsp; &nbsp;</span><span style=\"text-align: left; font-size: 13px; font-family: Arial;\">Epidemiological investigations were immediately initiated to determine if there is a potential link between these 13 cases, and to study if transmission could have occurred locally, and not from their country of origin. From MOH’s preliminary investigations, we cannot exclude that transmissions could have occurred at </span><span style=\"text-align: left; font-size: 13px; font-family: Arial;\">Mandarin Orchard Singapore</span><span style=\"text-align: left; font-size: 13px; font-family: Arial;\">.<br><br>4.&nbsp; &nbsp; &nbsp;</span><span style=\"text-align: left; font-size: 13px; font-family: Arial;\">Persons on SHN are housed in a dedicated tower and floors at the hotel, segregated from all other guests, with no interaction amongst them. However as a precautionary measure to ensure the safety of all guests in the hotel, the hotel will check out all its occupants. Persons serving SHN will be transported via dedicated vehicles to an alternative SHN dedicated facility. Deep cleaning and disinfection will be carried out by the hotel, in consultation with MOH and the National Environment Agency.<br><br>5.&nbsp; &nbsp; &nbsp;</span><span style=\"text-align: left; font-size: 13px; font-family: Arial;\">MOH has commenced a special testing operations to test around 500 staff of the hotel for COVID-19 infection. These include both staff serving those on SHN, and those who serve other guests in other parts of the hotel. We will also test all who are currently serving SHN at Mandarin Orchard Singapore for COVID-19 infection to determine their status, instead of waiting till their SHN exit swab.<br><br>6.&nbsp; &nbsp; &nbsp;</span><span style=\"text-align: left; font-size: 13px; font-family: Arial;\">Guests who have stayed at Mandarin Orchard Singapore between 11 November and 19 December are advised to monitor their health closely for 14 days from their last date of stay. They should see a doctor promptly if they develop symptoms of acute respiratory infection (such as cough, sore throat and runny nose), as well as fever and loss of taste or smell, and inform the doctor of their exposure history.</span></p> <p><span style=\"font-size: 13px; font-family: Arial;\">7.&nbsp; &nbsp; &nbsp;</span><span style=\"font-size: 13px; font-family: Arial;\">Hotels used as SHN dedicated facilities must have in place strict protocols to segregate persons on SHN from all other guests. These include placing persons on SHN in segregated blocks, wings or floors, and ensuring their route of movement is clearly demarcated from other guests. Persons on SHN are also not allowed to leave their rooms during their stay, and rooms are thoroughly disinfected and sanitised upon completion of SHN according to strict infection control measures. They will also not be allowed access to common facilities in the hotels. The Singapore Tourism Board and Singapore Police Force conduct regular checks on these hotels to ensure that safe management measures are complied with, and that security measures are in place. The Government takes a serious view of any breach in protocols and will investigate and take actions should there be non-compliance.</span></p><p><span style=\"font-size: 13px; font-family: Arial;\"><br clear=\"all\"> </span></p><div><hr align=\"left\" size=\"1\" width=\"33%\"> <div id=\"ftn1\"> <p style=\"text-align: justify;\"><span style=\"font-size: 13px; font-family: Arial;\">[1] Cases 58204, 58235, 58233, 58236, 58237, 58234, 58244, 58245, 58253, 58252, 58268, 58281 and 58284. These cases were classified as imported cases due to their recent travel history. </span></p> </div> <div id=\"ftn2\"> <p style=\"text-align: justify;\"><span style=\"font-size: 13px; font-family: Arial;\">[2] Mandarin Orchard Singapore has stopped taking in persons on SHN from 13 December as its contract to serve as a dedicated SHN facility will expire at the end of the month. </span></p> </div> </div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "investigations-into-13-covid-19-cases-who-served-shn-at-mandarin-orchard-singapore", "CurrentPageUrl": null}, {"Title": "No New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1608362100000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "19 Dec 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\"> &nbsp;&nbsp;&nbsp;&nbsp;As of 19 December 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed that there are no new cases of locally transmitted COVID-19 infection.&nbsp;<br><br>2.&nbsp; &nbsp; There are 17 imported cases, who had already been placed on Stay-Home Notice or isolated upon arrival in Singapore.<br><br>3.&nbsp; &nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;<br><br><strong>MINISTRY OF HEALTH<br>19 DECEMBER 2020</strong></p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "no-new-cases-of-locally-transmitted-covid-19-infection-19dec", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}