{"pressItemDictionary": {"Press Releases": [{"Title": "Additional Precautionary Measures to Prevent Further Importation of COVID-19 Cases", "PublishedDate": "/Date(1584266400000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "15 Mar 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\"><span style=\"font-size: 14px;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Singapore will implement additional precautionary measures to further reduce the risk of importation of COVID-19 to Singapore. These include travel advisories against <u>all</u> non-essential travel abroad, and further restrictions on travellers coming into Singapore.<br><br>2.&nbsp; &nbsp; &nbsp; &nbsp; Globally, there are now more than 150,000 COVID-19 cases and more than 5,000 deaths across 135 countries, and the numbers are increasing rapidly. There have been more than 25,000 new cases since as recently as 12 March (when the Multi-Ministry Taskforce last issued precautionary measures) and a majority of these cases were reported outside of China. The World Health Organization (WHO) has indicated that the epicentre of the outbreak has now shifted to Europe, and there are now more cases reported outside of China daily than that reported in China at the height of its epidemic. The number of new cases imported into mainland China from overseas has also surpassed its number of locally transmitted new infections.<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp; In the past three days<a href=\"file:///C:/Users/Truda/Downloads/Press%20Release-Further%20border%20control%20measures-Draft%2015Mar%201615h%20(Final).docx#_ftn1\" name=\"_ftnref1\" title=\"\"><sup><span style=\"font-size: 11px;\">[1]</span></sup></a> alone, Singapore has seen an increase of 25 new cases. Of these, more than three-quarters were imported cases, of which close to 90 percent were Singapore Residents (Singapore Citizens and Permanent Residents) and Singapore Long Term Pass holders who had returned to Singapore from overseas. During the same period, more than one quarter of imported cases were from ASEAN countries. We have seen a number of these cases entering Singapore for the purpose of seeking medical care, which imposes a significant burden on Singapore’s healthcare resources during this critical period when we are focused on containing the situation within Singapore.<br><br><strong>Border restrictions<br><br></strong>4.&nbsp; &nbsp; &nbsp;<strong> &nbsp;&nbsp;</strong>Based on this latest situation, the Multi-Ministry Taskforce will put in place additional border restriction measures. From 16 March 2020, 2359 hours, all travellers (including Singapore Residents, Long Term Pass holders, and short-term visitors) entering Singapore with recent travel history to ASEAN countries<a href=\"file:///C:/Users/Truda/Downloads/Press%20Release-Further%20border%20control%20measures-Draft%2015Mar%201615h%20(Final).docx#_ftn2\" name=\"_ftnref2\" title=\"\"><sup><span style=\"font-size: 11px;\">[2]</span></sup></a>, Japan, Switzerland, or the United Kingdom within the last 14 days will be issued with a 14-day Stay-Home Notice (SHN).<a href=\"file:///C:/Users/Truda/Downloads/Press%20Release-Further%20border%20control%20measures-Draft%2015Mar%201615h%20(Final).docx#_ftn3\" name=\"_ftnref3\" title=\"\"><sup><sup><span style=\"font-size: 11px;\">[3]</span></sup></sup></a> In addition, they will have to provide proof of the place where they will serve the 14-day SHN, for example a hotel booking covering the entire period, or a place of residence they or their family members own. They may also be swabbed for testing for COVID-19, even if asymptomatic. This is because of the risk of community transmission in these countries and evidence of cases that have been imported from these countries into Singapore.<br><br>5.&nbsp; &nbsp; &nbsp; &nbsp; In addition to the SHN requirement, from 16 March 2020, 2359 hours, all short-term visitors who are nationals of any ASEAN country will have to submit requisite information on their health to the Singapore Overseas Mission in the country they are resident before their intended date of travel. The submission will have to be approved by Singapore’s Ministry of Health (MOH) before travel to Singapore, and the approval will be verified by the Immigration and Checkpoints Authority (ICA) officers at the Singapore checkpoints. Short-term visitors who arrive in Singapore without the necessary approval will be denied entry into Singapore.They are therefore advised to secure the approval before making definitive travel bookings.<br><br>6.&nbsp; &nbsp; &nbsp; &nbsp; The Ministry of Manpower (MOM) will also introduce new measures for Foreign Domestic Workers entering Singapore. More details will be announced by MOM.<br><br>7.&nbsp; &nbsp; &nbsp; &nbsp; As previously announced, residents and long-term pass holders returning from mainland China (outside Hubei province<a href=\"file:///C:/Users/Truda/Downloads/Press%20Release-Further%20border%20control%20measures-Draft%2015Mar%201615h%20(Final).docx#_ftn4\" name=\"_ftnref4\" title=\"\"><sup><sup><span style=\"font-size: 11px;\">[4]</span></sup></sup></a>), Iran, Italy, France, Germany, Republic of Korea, and Spain will continue to be issued a 14-day SHN upon return to Singapore, while short-term visitors from these areas will not be allowed to enter or transit through Singapore.<br><br>8.&nbsp; &nbsp; &nbsp; &nbsp; All travellers entering Singapore and exhibiting fever and/or other symptoms of respiratory illness are required to undergo a COVID-19 swab test at the checkpoints, regardless of travel history. Such travellers will also be issued a 14-day SHN, which they will have to serve in full even if the result of the swab test is negative. Those who meet the clinical suspect case definition will be conveyed to the hospital for follow-up.<br><br>9.&nbsp; &nbsp; &nbsp; &nbsp; Persons under SHN will have to remain in their place of residence at all times for 14 days after entering Singapore.<br><br>10.&nbsp; &nbsp; &nbsp; &nbsp;Singapore’s border control measures in relation to COVID-19, including the new ones announced in this press statement, are summarised in the <u>Annex</u>. These border restrictions will be reviewed in 30 days. The Taskforce may extend the border restriction measures to more countries as the global and local situation evolves.<br><br><strong>Travel advisory<br><br></strong>11.&nbsp; <strong>&nbsp; &nbsp; &nbsp;</strong>With immediate effect, Singaporeans are advised to defer <u>all</u> non-essential travel abroad. This advisory will apply for 30 days, and will be reviewed thereafter. This is to reduce the risk of Singaporeans contracting COVID-19 infection while overseas during this global pandemic.<br><br>12.&nbsp; &nbsp; &nbsp; &nbsp;Singaporeans who have made plans to travel abroad during the March school holidays are advised to review their plans<em>.</em> All travellers will be subject to the prevailing travel measures imposed by their destination countries, and those imposed by Singapore upon their return home. As the situation remains uncertain and will continue to evolve, Singaporeans are advised to review their travel plans for the coming months after the March school holidays as well.<br><br>13.&nbsp; &nbsp; &nbsp; &nbsp;As Singapore’s measures will evolve according to the global situation, Singaporeans should check the MOH website (<a href=\"https://www.moh.gov.sg/covid-19\">https://www.moh.gov.sg/covid-19</a>) for the latest measures.</span></p> <p style=\"text-align: justify;\"><span style=\"font-size: 14px;\"><strong>MINISTRY OF HEALTH</strong></span></p> <p style=\"text-align: justify;\"><strong><span style=\"font-size: 14px;\">15 MARCH 2020</span></strong></p> <div><span style=\"font-size: 12px;\"><br clear=\"all\"> </span><div id=\"ftn1\"><p><span style=\"font-size: 12px;\">[1] As of 14 March, 12pm.<br><br>[2] ASEAN countries besides Singapore: Brunei Darussalam, Cambodia, Indonesia, Lao PDR, Malaysia, Myanmar, Philippines, Thailand, Vietnam.<br><br>[3] The SHN will not apply to travellers transiting in Singapore without leaving the transit area.<br><br>[4] Persons returning from Hubei province are subject to quarantine.</span></p></div><div id=\"ftn4\"><p><span style=\"font-size: 12px;\"><br></span><br>+++++<br><strong><u>Annex</u><br></strong></p><p align=\"center\" style=\"text-align: left;\"><strong>List of Countries/ Regions and Border Control Measures</strong></p><table border=\"1\" cellspacing=\"0\" cellpadding=\"0\"> <tbody><tr> <td width=\"236\" valign=\"top\"> <p><strong>Travel History in the last 14-days in Countries/Regions </strong></p> </td> <td width=\"182\" valign=\"top\"> <p><strong>For Singapore Residents and Long-Term Pass Holders</strong></p> </td> <td width=\"182\" valign=\"top\"> <p><strong>For Short-Term Visitors</strong></p> </td> </tr> <tr> <td width=\"236\" valign=\"top\"> <p>Hubei province (mainland China)</p> </td> <td width=\"182\" valign=\"top\"> <p>14-day quarantine</p> </td> <td width=\"182\" valign=\"top\"> <p>Not allowed entry or transit</p> </td> </tr> <tr> <td width=\"236\" valign=\"top\"> <p>Mainland China (except Hubei province), France, Germany, Italy, Iran, Republic of Korea, and Spain</p> </td> <td width=\"182\" valign=\"top\"> <p>14-day SHN</p> </td> <td width=\"182\" valign=\"top\"> <p>Not allowed entry or transit</p> </td> </tr> <tr> <td width=\"236\" valign=\"top\"> <p><strong><span style=\"color: rgb(255, 0, 0);\">[New]</span></strong> ASEAN countries </p> <p>&nbsp;</p> </td> <td width=\"182\" valign=\"top\"> <p>14-day SHN</p> </td> <td width=\"182\" valign=\"top\"> <p>14-day SHN </p> <p>Short-term visitors who are ASEAN nationals will also be required to submit requisite health information for approval before travelling </p> </td> </tr> <tr> <td width=\"236\" valign=\"top\"> <p><strong><span style=\"color: rgb(255, 0, 0);\">[New]</span></strong> Japan, Switzerland, and the United Kingdom </p> </td> <td width=\"182\" valign=\"top\"> <p>14-day SHN</p> </td> <td width=\"182\" valign=\"top\"> <p>14-day SHN</p> </td> </tr> </tbody></table><p>&nbsp;</p><p><strong>&nbsp;</strong></p> </div> </div>", "PressCategory": ["Press Releases"], "CustomDetailUrl": "", "UrlName": "additional-precautionary-measures-to-prevent-further-importation-of-covid-19-cases", "CurrentPageUrl": null}, {"Title": "Fourteen new cases of COVID-19 infection confirmed ", "PublishedDate": "/Date(1584201600000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "15 Mar 2020", "Summary": "", "MainContent": "<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; As of 15 March 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified 14 more cases of COVID-19 infection in Singapore. Of these:</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Two are part of the cluster involving the private dinner function at SAFRA Jurong on 15 February (Cases 218 and 224);<br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Nine are imported cases (Cases 213, 215, 216, 217, 220, 222, 223, 225 and 226); and <br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Three are linked to previous cases (Case 219 is linked to Cases 142 and 211; Case 214 is linked to Case 208; and Case 221 is linked to Case 204).</p> <p>&nbsp;</p><p><strong>Links between previous cases found</strong></p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. This was made possible with the assistance of the Singapore Police Force.</p><p>a)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Eight of the locally transmitted confirmed cases (Cases 31, 33, 38, 83, 90, 91, 138 and 151), as well as Cases 8 and 9, are linked to The Life Church and Missions Singapore. These cases are linked to another 23 confirmed cases (Cases 48, 49, 51, 53, 54, 57, 58, 60, 61, 62, 63, 66, 67, 68, 70, 71, 73, 74, 78, 80, 81, 84, 88) who are linked to the Grace Assembly of God. <br>b)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 14 of the confirmed cases (Cases 93, 95, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 108 and 110) are linked to Wizlearn Technologies Pte Ltd.<br>c)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 47 of the confirmed cases (Cases 94, 96, 107, 112, 114, 115, 116, 117, 118, 120, 121, 122, 125, 127, 128, 129, 130, 131, 133, 134, 137, 139, 140, 142, 144, 145, 146, 148, 149, 150, 155, 156, 157, 158, 159, 160, 161, 164, 166, 174, 179, 185, 186, 196, 201, 218 and 224) are linked to a private dinner function at SAFRA Jurong on 15 February. <br>d)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Three of the confirmed cases (Cases 142, 162 and 163) are linked to boulder+ Gym (12 Kallang Avenue).</p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Investigations on these clusters are ongoing. In addition to the clusters, our investigations have identified the following links between cases:</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 72 is linked to Cases 59 and 79; <br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 86 is linked to Case 82;<br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 126 is linked to Case 109; <br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 143 is linked to Case 132; <br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 167 is linked to Case 178; <br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 190 is linked to Cases 172 and 184; <br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 200 is linked to Case 165; <br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 219 is linked to Cases 142 and 211;<br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 214 is linked to Case 208; and <br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 221 is linked to Case 204.</p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Contact tracing is underway for the other 11 locally transmitted cases to establish any links to previous cases or travel history to affected countries or regions.</p> <p><strong>&nbsp;</strong></p><p><strong>About the confirmed cases </strong></p><p><u>Case 213</u></p><p>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 213 is an imported case involving a 48 year-old male Singapore Citizen who had been in Indonesia from 4 March to 13 March. He is currently warded in an isolation room at Sengkang General Hospital (SKH).</p><p>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; He reported onset of symptoms on 8 March while in Indonesia. He presented at the emergency department of SKH on 13 March. Subsequent test results confirmed COVID-19 infection on 14 March afternoon.</p><p>7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; He stays at Serangoon North Avenue 3. </p><p><u>Case 214</u></p><p>8.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 214 is a 29 year-old male Singapore Citizen with no recent travel history to affected countries and region. He is currently warded in an isolation room at the National Centre for Infectious Diseases (NCID). He is linked to Case 208.</p><p>9.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; He reported onset of symptoms on 5 March and had sought treatment at a general practitioner (GP) clinic on 6 March and 8 March. He presented at NCID on 14 March, and subsequent test results confirmed COVID-19 infection on 14 March afternoon. </p><p>10.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Prior to hospital admission, he had visited Youth Go! (403 Fajar Road), Project 180 @ Simei (145 Simei Street 2) and Singapore University of Social Sciences (463 Clementi Road). He stays at Jurong West Street 71.</p><p><u>Case 215</u></p><p>11.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 215 is an imported case involving a 65 year-old Singapore Citizen who had been in Thailand from 7 March to 10 March. He is currently warded in an isolation room at Singapore General Hospital (SGH). </p><p>12.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; He reported onset of symptoms on 13 March and had sought treatment at a GP clinic on the same day. He presented at the emergency department of SGH on 13 March, and subsequent test results confirmed COVID-19 infection on 14 March afternoon.</p><p>13.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Prior to hospital admission, he had gone to work at Cash Box (1 Jurong West Central 2). He stays at Mei Ling Street. </p><p><u>Case 216</u></p><p>14.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 216 is an imported case involving a 30 year-old Singapore Citizen who had been in Germany from 28 February to 1 March, and again on 5 March to 6 March, and Czech Republic from 1 March to 5 March. He is currently warded in an isolation room at NCID. </p><p>15.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; He reported onset of symptoms on 9 March, and had sought treatment at a GP clinic on 10 March and 12 March. He was referred to NCID on 12 March, and subsequent test results confirmed COVID-19 infection on 14 March afternoon. </p><p>16.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Prior to hospital admission, he had gone to work at SAP Asia (30 Pasir Panjang Road). He stays at Bukit Batok West Avenue 6. </p><p><u>Case 217</u></p><p>17.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 217 is an imported case involving a 22 year-old Spanish national who is a Singapore Long Term Pass holder, and had been in Spain from 9 March to 13 March. He is currently warded in an isolation room at NCID.</p><p>18.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; He reported onset of symptoms on 13 March, and was referred to NCID on the same day. Subsequent test results confirmed COVID-19 infection on 14 March afternoon.</p><p>19.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; He stays in the Mount Sophia area. </p><p><u>Case 218</u></p><p>20.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 218 is a 55 year-old female Singapore Citizen with no recent travel history to affected countries and regions. She is currently warded in an isolation room at the National University Hospital (NUH). She is linked to the cluster involving the private dinner function at SAFRA Jurong.</p><p>21.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; She reported onset of symptoms on 2 March, and had sought treatment at two GP clinics on 2 March, 3 March, 4 March, 6 March and 8 March. She presented at NUH on 9 March, and subsequent test results confirmed COVID-19 infection on 14 March afternoon. </p><p>22.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Prior to hospital admission, she mostly stayed at her home at Pending Road except to seek medical treatment.</p><p><u>Case 219</u></p><p>23.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 219 is a 30 year-old male Singapore Citizen with no recent travel history to affected countries and regions. He was confirmed to have COVID-19 infection on 15 March morning, and is currently warded in an isolation room at SKH. He is linked to Cases 142<sup>1</sup>&nbsp;and 211.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </p> <p><u>Case 220</u></p><p>24.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 220 is an imported case involving a 53 year-old male Singapore Permanent Resident who had been in France from 10 March to 12 March. He was confirmed to have COVID-19 infection on 15 March morning, and is currently warded in an isolation room in NCID.&nbsp;&nbsp;</p><p><u>Case 221</u></p><p>25.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 221 is a 28 year-old female Filipino national who is a Singapore Work Pass holder, and has no recent travel history to affected countries and regions. She was confirmed to have COVID-19 infection on 15 March morning and is currently warded in an isolation room at NCID. She is a contact of Case 204<sup>2</sup>. She is employed as a teaching staff at MY World Preschool Ltd (52&nbsp;Lengkok Bahru).&nbsp; </p> <p><u>Case 222</u></p><p>26.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 222 is an imported case involving a 41 year-old male French national who is a Singapore Work Pass holder, and had been to France from 28 February to 7 March and 9 March to 10 March, Spain from 7 March to 9 March, and the Philippines from 12 March to 13 March. He was confirmed to have COVID-19 infection on 15 March morning, and is currently warded in an isolation room at NCID. </p><p><u>Case 223</u></p><p>27.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 223 is an imported case involving a 60 year-old male Singapore Citizen, and had been in the United States from 28 February to 7 March and Australia from 7 to 13 March. He was confirmed to have COVID-19 infection on 15 March morning, and is currently warded in an isolation room at NCID. </p><p><u>Case 224</u></p><p>28.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 224 is a 50 year-old male Singapore Citizen, who had been in Malaysia from 1 March to 4 March. He was confirmed to have COVID-19 infection on 15 March morning, and is currently warded in an isolation room at NCID. He is a contact of Case 117<sup>3</sup> and is linked to the cluster involving the private dinner function at SAFRA Jurong.</p><p><u></u><u>Case 225</u></p><p>29.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 225 is an imported case involving a 63 year-old male Singapore Citizen, who had been in Indonesia from 3 March to 7 March. He was confirmed to have COVID-19 infection on 15 March morning, and is currently warded in an isolation room at NCID.&nbsp; </p><p><u>Case 226</u></p><p>30.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 226 is an imported case involving a 49 year-old male Dutch national. He was confirmed to have COVID-19 infection on 15 March morning, and is currently warded in an isolation room at NCID. </p><p><u>Case 205 (Announced on 14 March)</u></p><p>31.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 205 is an imported case involving a 30 year-old female Filipino national who is a Singapore Long Term Visit Pass holder<em>, </em>and had been in the Philippines from 27 February to 6 March. She is currently warded in an isolation room at NCID.</p><p>32.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; She reported onset of symptoms on 8 March and had sought treatment at a GP clinic on 11 March. She presented at NCID on 14 March, and subsequent test results confirmed COVID-19 infection on 14 March morning. </p><p>33.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Prior to hospital admission, she had gone to work at DNATA Cargo (45 Airport Cargo Road). She stays at Flora Drive. </p><p><u>Case 206 (Announced on 14 March)</u></p><p><u></u>34.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 206 is an imported case involving a 33 year-old female New Zealand national who is a Singapore Long Term Visit Pass holder, and had been to the United States from 28 February to 13 March. She is currently warded in an isolation room at NCID.</p><p>35.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; She reported onset of symptoms on 12 March, and had sought treatment at a GP clinic on 13 March. She was referred to NCID on the same day. Subsequent test results confirmed COVID-19 infection on 14 March morning. </p><p>36.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Prior to hospital admission, she mostly stayed at her home at Upper Paya Lebar Road.</p><p><u>Case 207 (Announced on 14 March)</u></p><p>37.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 207 is an imported case involving a 40 year-old female Singapore Citizen who had been in the United Kingdom from 6 March to 11 March. She is currently warded in an isolation room at NCID. </p><p>38.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; She reported onset of symptoms on 10 March while she was in the UK and had sought treatment at a GP clinic on 13 March. She was referred to NCID on the same day. Subsequent test results confirmed COVID-19 infection on 14 March morning.</p><p>39.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Prior to hospital admission, she mostly stayed at her home at Yishun Central.</p><p><u></u><u>Case 208 (Announced on 14 March)</u></p><p><u></u>40.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 208 is a 26 year-old female Singapore Citizen who has no recent travel history to affected countries and regions. She is currently warded in an isolation room at NCID. </p><p>41.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; She reported onset of symptoms on 3 March and had sought treatment at Singapore General Hospital’s (SGH) staff clinic on 4 March and 13 March. Subsequent test results confirmed COVID-19 infection on 14 March morning.</p><p>42.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Prior to hospital admission, she had gone to work as a Medical Social Worker at SGH (Outram Road). She stays at Tiong Bahru Road. </p> <p><u>Case 209 (Announced on 14 March)</u></p><p>43.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 209 is an imported case involving a 32 year-old female Singapore Citizen who had been in the United States from 2 March to 7 March. She is currently warded in an isolation room at SGH. </p><p>44.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; She reported onset of symptoms on 11 March, and had sought treatment at SGH’s staff clinic on 13 March. Subsequent test results confirmed COVID-19 infection on 14 March morning.</p><p>45.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Prior to hospital admission, she had gone to work as a Psychologist at SGH. She stays at Serangoon Avenue 3.</p><p><u>Case 210 (Announced on 14 March)</u></p><p>46.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 210 is an imported case involving a 56 year-old male German national who is a Singapore Long Term Visit Pass holder, and had been in Germany from 27 February to 3 March, and again from 11 March to 12 March, and Switzerland from 3 March to 10 March. He is currently warded in an isolation room at NCID.</p><p>47.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; He reported onset of symptoms on 13 March and had sought treatment at a GP clinic on the same day. He was referred to NCID on 13 March, and subsequent test results confirmed COVID-19 infection on 14 March morning.</p><p>48.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; He stays at Leedon Park.</p><p><u>Case 211 (Announced on 14 March)</u></p><p>49.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 211 is a 35 year-old female Filipino national who is a Singapore Long Term Visit Pass holder with no recent travel history to affected countries and regions. She is currently warded in an isolation room at NCID. She is linked to Case 142<sup>1</sup>.</p><p>50.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; As she had been identified as a contact of Case 142, she was placed under quarantine on 9 March. She was referred to NCID on 13 March, and subsequent test results confirmed COVID-19 infection on 14 March morning.</p><p>51.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; She stays at Crawford Lane.</p><p><u>Case 212 (Announced on 14 March)</u></p><p>52.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 212 is an imported case involving a 64 year-old male Indonesian national who arrived in Singapore from Indonesia on 13 March. He is currently warded in an isolation room at NCID.</p><p>53.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; He reported onset of symptoms on 9 March and had been hospitalised in a hospital in Indonesia for pneumonia. Upon arrival in Singapore on 13 March, he had sought treatment at Mount Elizabeth Hospital, and was referred to NCID on 13 March. Subsequent test results confirmed COVID-19 infection on 14 March morning. </p><p>54.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Prior to hospital admission, he stayed at Ibis Hotel Novena (6 Irrawaddy Road).&nbsp;</p><p>&nbsp;</p> <p><strong>Update on condition of confirmed cases</strong></p><p>55.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; To date, a total of 105 cases have fully recovered from the infection and have been discharged from hospital. Of the 121 confirmed cases who are still in hospital, most are stable or improving. 13 are in critical condition in the intensive care unit. </p><p><strong>&nbsp;</strong></p><p><strong>Update on contact tracing for confirmed cases </strong></p><p>56.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Contact tracing for the confirmed cases is ongoing. Once identified, MOH will closely monitor all close contacts. As a precautionary measure, they will be quarantined for 14 days from their last exposure to the patient. In addition, all other identified contacts who have a low risk of being infected will be under active surveillance, and will be contacted daily to monitor their health status. </p><p>57.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; As of 15 March 2020, 12pm, MOH has identified 5,472 close contacts who have been quarantined. Of these, 1,817 are currently quarantined, and 3,655 have completed their quarantine. </p> <p><strong>&nbsp;</strong></p><p><strong>Health advisory<br><br></strong>58.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Singaporeans are advised to defer all non-essential travel abroad. </p><p>59.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; All travellers should monitor their health closely for two weeks upon return to Singapore and seek medical attention promptly if they feel unwell. Travellers should inform their doctor of their travel history. If they have a fever or respiratory symptoms (e.g. cough, shortness of breath), they should wear a mask and call the clinic ahead of the visit.</p><p>60.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Travellers and members of the public should adopt the following precautions at all times: </p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Avoid close contact with people who are unwell or showing symptoms of illness; ·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Observe good personal hygiene; <br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Practise frequent hand washing with soap (e.g. before handling food or eating, after going to toilet, or when hands are dirtied by respiratory secretions after coughing or sneezing); <br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Wear a mask if you have respiratory symptoms such as a cough or shortness of breath; <br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Cover your mouth with a tissue paper when coughing or sneezing, and dispose the soiled tissue paper in the rubbish bin immediately; and <br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Seek medical attention promptly if you are feeling unwell.</p><p>61.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; MOH will continue to monitor the situation closely. As medical practitioners are on the lookout for suspect cases, Singapore is likely to see more cases that will need to be investigated. </p><p><strong>&nbsp;</strong></p><p><strong>MINISTRY OF HEALTH<br></strong><strong>15 MARCH 2020</strong></p><p><strong>&nbsp;</strong><sup>[1]</sup> Case 142 is a 26 year-old male Singapore Citizen who was confirmed to have COVID-19 infection on 7 March. He is linked to the cluster involving the private dinner function at SAFRA Jurong. <br><sup>[2] </sup>Case 204 is an imported case involving a 32 year-old male American national who had been in Japan from 29 February to 8 March. He was confirmed to have COVID-19 infection on 13 March.<br><sup>[3]</sup> Case 117 is a 52 year-old female Singapore Citizen who was confirmed to have COVID-19 infection on 5 March. She is linked to the cluster involving a private dinner function at SAFRA Jurong.</p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "fourteen-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}