{"pressItemDictionary": {"Press Releases": [{"Title": "1,018 More Cases Discharged; 373 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1590681360000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "28 May 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As of 28 May 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 373 cases of COVID-19 infection in Singapore. The breakdown is as follows:<br><strong><br>&nbsp; a)&nbsp;&nbsp;Imported cases: 0<br><br></strong>There are no imported cases today.<br><strong><br>&nbsp; b)&nbsp;&nbsp;Cases in the community: 1 </strong>(1 Work Pass holder)<br><br>The number of new cases in the community has decreased, from an average of 6 cases per day in the week before, to an average of 5 per day in the past week. The number of unlinked cases in the community has remained stable at an average of 2 per day in the past two weeks.&nbsp;We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br><br>Today’s community case was picked up through our active screening of preschool staff, and was asymptomatic. MOH will conduct a serological test to determine if this was a past or current infection.<br><strong><br>&nbsp; c)&nbsp;&nbsp;Cases residing in dormitories: 372<br><br></strong>We continue to pick up many cases amongst Work Permit holders residing in dormitories, including in factory-converted dormitories, because of extensive testing in these premises, as part of our process to verify and test the status of all workers.<br><br>2.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Details of these trends can be found in MOH’s daily situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\">www.moh.gov.sg/covid-19/situation-report</a>). Please refer to <u><a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-a-(28-may-2020).pdf?sfvrsn=d30916fd_0\" title=\"Annex A\">Annex A</a></u> for the summary of the confirmed cases.<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Of the new cases, 99% are linked to known clusters, while the rest are pending contact tracing.<br><br>4.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;More than 39,000 preschool staff<sup>[1]</sup>&nbsp;have so far been tested as part of our proactive screening. Of these, 13 staff had tested positive using the polymerase chain reaction (PCR) test, which is a sensitive test that could pick up minute fragments of the COVID-19 virus ribonucleic acid (RNA). To determine if these were past or current infections, MOH has done an epidemiological study of these cases. Of the 13 cases, 11 of their serological tests have come back positive, which is indicative of past infections. These individuals were unlikely to be infectious by the time they were tested during the recent screening, but could be shedding minute fragments of the virus RNA, which were no longer transmissible and infective to others. Two test results are pending, including today’s case.<br><br><strong>Links between previous cases found<br><br></strong>5.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;In the past week (21 May to 27 May), MOH has uncovered links for 2 previously unlinked cases.<br><br>6.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <u><a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-b---28-may-2020.pdf?sfvrsn=578d1588_0\" title=\"Annex B\">Annex B</a></u> and <u><a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-c---28-may-2020.pdf?sfvrsn=2e0335f3_0\" title=\"Annex C\">Annex C</a></u> for details.<br><br><strong>Update on condition of confirmed cases<br></strong><br>7.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;1,018 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 18,294 have fully recovered from the infection and have been discharged from hospitals or community care facilities.<br><br>8.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;There are currently 510 confirmed cases who are still in hospital. Of these, most are stable or improving, and 7 are in critical condition in the intensive care unit. 14,422 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 23 have passed away from complications due to COVID-19 infection.</p> <div><br clear=\"all\"> <hr align=\"left\" size=\"1\" width=\"33%\"> <div id=\"ftn1\"> <p><sup>[1]</sup>&nbsp;Includes ECDA’s preschools, MOE kindergartens and pre-school sections in private education institutes. </p> </div> </div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "1-018-more-cases-discharged-373-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "Roadmap Ahead to Phase Two", "PublishedDate": "/Date(1590665400000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "28 May 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\">&nbsp; &nbsp; &nbsp; Singapore will be exiting the Circuit Breaker and embarking on Phase One of re-opening on 2 June 2020. We expect more than three quarters of the economy to resume operations by then. The Multi-Ministry Taskforce will carefully monitor the effects of increased activity in this phase. If the community infection rates remain low and stable over the subsequent two weeks, we can decide by the middle of June to proceed with Phase Two, which could then happen before the end of June.&nbsp;&nbsp;<br><br><strong>Plans for Phase Two&nbsp;<br></strong><br>2.&nbsp; &nbsp; &nbsp;Phase Two will entail the resumption of a broader range of activities. We expect almost the entire economy to re-open, subject to safe management measures being in place. This broader re-opening will see the resumption of the following:&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp;<strong><span style=\"text-decoration: underline;\">Retail, F&amp;B, and Other Services.</span></strong> Most business activities will be allowed to resume operations in Phase Two, subject to safe management measures, group size and capacity limits being met. These businesses include retail, food and beverage dine-in, personal health and wellness, as well as home-based services. Sports and other public facilities, e.g. stadia, swimming pools, will be opened too. Further details on sector-specific safe management measures will be provided by relevant agencies closer to the start of Phase Two.<br><br>4.&nbsp; &nbsp; We will adopt a more cautious approach for higher-risk activities. These typically involve large numbers of people interacting with one another, often in enclosed spaces, and for prolonged periods of time. Overseas and local experience has indicated that these settings can seed large clusters of infected persons. Such activities include:<br><br>a. Religious services and congregations;<br>b. Cultural venues such as art galleries, libraries and museums;<br>c. Large-scale events and venues, such as conferences, exhibitions, concerts and trade fairs; and<br>d. Entertainment venues such as bars, nightclubs, karaoke outlets, cinemas, theatres, and other indoor and outdoor attractions.<br><br>5.&nbsp; &nbsp; &nbsp; For such activities, the relevant government agencies will be engaging businesses and organisations on how they might resume safely, with the necessary safe management measures and safeguards needed. Subject to the appropriate measures being in place, we will discuss with these entities the timing of when they can resume activities in Phase Two.&nbsp;<br><br>6.&nbsp; &nbsp;<strong><span style=\"text-decoration: underline;\">Social Interactions and Family Visits.</span></strong> Under Phase Two, masks will remain compulsory whenever outside one’s home. Small-group social gatherings of up to five persons will be allowed. Within the home, households may receive up to five visitors per day.&nbsp;&nbsp;<br><br>7.&nbsp; &nbsp; &nbsp;As seniors are especially vulnerable, they should continue to exercise extra caution and stay at home as much as possible. We recognise that this can be challenging, especially for seniors with care and/or psychosocial needs. To better support them and their caregivers, more senior services and programmes (e.g. senior care centres) will resume with the appropriate safe management measures in place. Some face-to-face social services for other vulnerable groups will resume with safe management measures.&nbsp;<br><br>8.&nbsp; &nbsp; &nbsp;<span style=\"text-decoration: underline;\"><strong>Schools.</strong></span>&nbsp;As announced on 19 May 2020, schools will fully re-open from end June, while Institutes of Higher Learning will gradually increase the number of students back on campus at any one time for face-to-face learning.<br><br>9.&nbsp; &nbsp; &nbsp; We have provided a broad overview of the timeline leading up to Phase Two and the likely easing of measures that will take place. Depending on the COVID-19 situation and our risk assessment, we will continue to ease measures (e.g. on the size of gatherings) gradually until we reach a new normal in Phase Three, a state in which we expect to remain until an effective vaccine or treatment for COVID-19 is developed.&nbsp;<br><br><strong>Social Responsibility is Key&nbsp;<br></strong><br>10.&nbsp; &nbsp;Phase Two is a significant step in transiting to a new COVID-safe normal. As restrictions are eased, it becomes even more critical that each of us exercises social responsibility to ensure that community transmission remains low as we resume more activities. As we have seen both locally and overseas, it takes only a single person acting irresponsibly to cause a cluster. We need everyone to play their part, observe good personal hygiene, adhere to safe management measures, and avoid crowded places. Employers and employees will need to continue implementing safe management measures and act in a responsible manner at all times.&nbsp;<br><br>11.&nbsp; &nbsp; We can look forward to moving to Phase Two and beyond if each of us plays our part. Together, we can and we must achieve a COVID-safe Singapore.<br><br><strong>MINISTRY OF HEALTH<br>28 MAY 2020</strong><br></p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "roadmap-ahead-to-phase-two", "CurrentPageUrl": null}, {"Title": "Revised Discharge Criteria for Covid-19 Patients", "PublishedDate": "/Date(1590665400000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "28 May 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\">&nbsp; &nbsp; &nbsp; &nbsp;The Multi-Ministry Taskforce has studied and evaluated the latest local and international clinical and scientific evidence which show that viable virus was not found in COVID-19 patients after the second week of illness despite the persistence of polymerase chain reaction (PCR) detection of ribonucleic acid (RNA). This means that COVID-19 patients are not likely to be infectious after Day 14 of illness and are not infectious by Day 21 of illness.&nbsp;<br><br>2.&nbsp; &nbsp; &nbsp; &nbsp; The Taskforce will therefore revise the discharge criteria for COVID-19 patients in Singapore. With immediate effect, all COVID-19 patients who are assessed to be clinically well by Day 21 of onset of illness can be discharged without the need for further PCR tests. This revised approach will allow recovered patients who are well and no longer infectious to return to the community in a timely manner.&nbsp;<br><br><strong>Scientific evidence strongly supports time-based discharge&nbsp;<br></strong><br>3.&nbsp; &nbsp; &nbsp; &nbsp; There is consensus amongst infectious diseases experts based on the clinical data presented locally and internationally that the risk of secondary transmission of COVID-19 is unlikely by Day 14 of onset of illness [1] . COVID-19 patients are usually most infectious one to two days before the onset of symptoms and the infectivity declines thereafter. After Day 14, while PCR tests may pick up minute fragments of the COVID-19 virus RNA, these RNA fragments are no longer transmissible and infective to others and the virus is no longer viable. This means the patient is no longer infectious beyond this period.<br><br>4.&nbsp; &nbsp; &nbsp; &nbsp; This is corroborated by local research. The recent position statement on the period of infectivity by the National Centre for Infectious Diseases and the Chapter of Infectious Disease Physicians, Academy of Medicine, Singapore, noted that viable COVID-19 virus was not found after the second week of illness despite the persistence of PCR detection of RNA. Local and international clinical observations therefore support the discharge of well patients after Day 14 from the onset of illness.&nbsp;<br><br>5.&nbsp; &nbsp; &nbsp; Internationally, various countries that adopt or recommend a time-based discharge policy include the South Korea, United Kingdom, United States, Estonia and Ireland. These countries have typically discharged patients after a range of seven to 14 days from onset of symptoms. South Korea discharges asymptomatic patients from isolation after three weeks from date of confirmation. More recently, on 27 May 2020, the World Health Organization (WHO) has also recommended a time-based discharge criteria. WHO recommends that patients who are clinically well can now be discharged after 10 days from the onset of illness, plus at least three days without respiratory symptoms or fever.<br><br><strong>Extra precaution of discharge after Day 21<br></strong><br>6.&nbsp; &nbsp; &nbsp; The majority of COVID-19 patients in Singapore have mild or no symptoms, and the majority are admitted to a community care facility where most recover with minimal intervention. Those with higher risk or more serious conditions requiring close medical care are admitted to hospitals. Patients will remain isolated in a community facility until after 21 days.&nbsp;<br><br>7.&nbsp; &nbsp; &nbsp; &nbsp;While clinical evidence has shown that patients are generally non-infectious from Day 14 of illness, we will continue to isolate all patients until Day 21 of onset of illness as an extra precaution. All COVID-19 patients who are assessed to be clinically well after 21 days from the onset of illness can be discharged from isolation without the need for further tests, but they will be given leave to remain at home (or place of residence like dormitories) for a further 7 days to rest and recover. After Day 28, these recovered individuals can return to work.<br><br>8.&nbsp; &nbsp; &nbsp;This revised discharge criteria will not be applied to patients who have a history of being immunocompromised. Such patients will still require two negative PCR tests before discharge, as they may still continue to shed viable virus for prolonged period because of their impaired immunity.&nbsp;<br><br>9.&nbsp; &nbsp; &nbsp;The Multi-Ministry Taskforce will continue to review the latest evidence with medical experts as the situation evolves, and make evidence-based adjustments to Singapore’s medical plan for COVID-19 patients, to ensure the wellbeing of all patients.<br><br><strong>MINISTRY OF HEALTH<br>28 MAY 2020</strong><br></p><div style=\"text-align: justify;\">[1] In clinical practice, the onset of illness is defined as the date when the symptoms are reported by symptomatic patients or the date of first positive polymerase chain reaction (PCR) test or seven days before first positive serology test for asymptomatic patients.<br></div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "revised-discharge-criteria-for-covid-19-patients", "CurrentPageUrl": null}, {"Title": "373 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1590650340000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "28 May 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As of 28 May 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 373 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders residing in foreign worker dormitories. There are no Singaporean/ Permanent Resident cases.&nbsp; <br><br>2.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;</p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "373-new-cases-of-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}