{"pressItemDictionary": {"Press Releases": [{"Title": "314 More Cases Discharged 908 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1596636900000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "05 Aug 2020", "Summary": "", "MainContent": "<span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;As of 5 August 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 908 cases of COVID-19 infection in Singapore. The breakdown of the cases is as follows:<br><br><strong>a) Imported cases: 4 (3 Dependant’s Pass holders, 1 Short-Term Visit Pass holder)</strong><br><br>All 4 imported cases arrived in Singapore from India on 22 July. Amongst them, 3 (Cases 53877, 54265 and 54266) are Dependant’s Pass holders. The remaining case (Case 53756) is a Short-Term Visit Pass holder whose application to enter Singapore was approved as she is an elderly whose family are Singapore residents. All of them had been placed on 14-day Stay-Home Notice (SHN) upon arrival in Singapore, and were serving their SHN at dedicated facilities. They had been tested while serving their SHN.<br><br><strong>b) Cases in the community: 1&nbsp; &nbsp;(1 Work Permit holder)</strong><br><br>There is 1 case in the community today who is currently unlinked. Case 54284 was identified from our proactive screening of workers in essential services who are living outside the dormitories, even though he is asymptomatic. To determine if this is a current or past infection, we also conducted a serological test for him, and the result has come back positive, which indicates likely past infection .<br><br>Epidemiological investigations of the case are in progress. In the meantime, all the identified close contacts have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases.<br><br>Overall, the number of new cases in the community has decreased, from an average of 4 cases per day in the week before, to an average of 2 per day in the past week. The number of unlinked cases in the community has also decreased, from an average of 2 cases per day in the week before, to an average of 1 per day in the past week. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br><br><strong>c) Cases residing in dormitories: 903</strong><br><br>Of the 903 cases, the vast majority are dormitory residents who were tested during their isolation/ quarantine period, even though they are asymptomatic. They are amongst the final batch of workers being cleared and they come from dormitories with a relatively high prevalence of COVID-19. Hence we expect the daily case counts to be high for the coming days, before tapering down thereafter as the Inter-agency Taskforce completes the dormitory clearance.<br><br>We remain on track to clear all the dormitories by 7 August, except for a few standalone blocks in the dormitories that serve as quarantine facilities. There are presently about 9,700 workers in these quarantine facilities. They will have to serve out their 14-day isolation periods, and be subject to an exit test before they are able to resume work.<br><br>2.&nbsp; &nbsp; &nbsp;Details of these trends can be found in MOH’s daily situation Report (www.moh.gov.sg/covid-19/situation-report). Please refer to <span style=\"text-decoration: underline;\"><a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-a2b223101c6e84f6ea50707fb849fa3c4.pdf?sfvrsn=a94f5ab0_2\" title=\"Annex A\">Annex A</a></span> for the summary of the confirmed cases.&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp;&nbsp;Of the new cases, 99% are linked to known clusters, while the rest are pending contact tracing.&nbsp;<br><br>4.&nbsp; &nbsp; &nbsp; MOH has been monitoring existing clusters for any further transmission. As there have been no more cases linked to Micron Semiconductor Asia Pte Ltd (1 North Coast Drive) for the past two incubation periods (i.e. 28 days), the cluster has now been closed.<br><br><strong>Links between previous cases found<br></strong><br>5.&nbsp; &nbsp; &nbsp;&nbsp;In the past week (29 July to 4 August), MOH has uncovered links for 1 previously unlinked case in the community.&nbsp;<br><br>6.&nbsp; &nbsp; &nbsp;&nbsp;Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-bd600770ef00044d68f06a4def0579b22.pdf?sfvrsn=dddf47f5_0\" title=\"Annex B\"><span style=\"text-decoration: underline;\">Annex B</span></a>&nbsp;and <a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-c3bfb754c2c3d4f468bc26924d2f24473.pdf?sfvrsn=30f2ca51_0\" title=\"Annex C\"><span style=\"text-decoration: underline;\">Annex C</span></a>&nbsp;for details.&nbsp;<br><br><strong>Update on condition of confirmed cases</strong><br><br>7.&nbsp; &nbsp; &nbsp;&nbsp;314 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 47,768 have fully recovered from the infection and have been discharged from hospitals or community care facilities.&nbsp;<br><br>8.&nbsp; &nbsp; &nbsp;&nbsp;There are currently 126 confirmed cases who are still in hospital. Of these, most are stable or improving, and 1 is in critical condition in the intensive care unit. 6,333 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 27 have passed away from complications due to COVID-19 infection.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>5 AUGUST 2020<br></strong></span><div><span style=\"font-size: 16px;\"><br></span></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "314-more-cases-discharged-908-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "908 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1596613800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "05 Aug 2020", "Summary": "", "MainContent": "<span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;As of 5 August 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 908 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders residing in foreign worker dormitories. Of these, the vast majority are dormitory residents who were tested during their isolation/ quarantine period, even though they are asymptomatic. They are amongst the final batch of workers being cleared and they come from dormitories with a relatively high prevalence of COVID-19. Hence we expect the daily case counts to be high for the coming days, before tapering down thereafter as the Inter-agency Taskforce completes the dormitory clearance.&nbsp;&nbsp;<br><br>2&nbsp; &nbsp; &nbsp; &nbsp;We remain on track to clear all the dormitories by 7 August, except for a few standalone blocks in the dormitories that serve as quarantine facilities. There are presently about 9,700 workers in these quarantine facilities. They will have to serve out their 14-day isolation periods, and be subject to an exit test before they are able to resume work.&nbsp;&nbsp;<br><br>3&nbsp; &nbsp; &nbsp; &nbsp;Based on our investigations so far, there are 4 cases in the community, of whom 3 are Singaporeans/ Permanent Residents and 1 is a Work Pass holder. In addition, there are 4 imported cases, who had all been placed on Stay-Home Notice upon arrival in Singapore.&nbsp;&nbsp;<br><br>4&nbsp; &nbsp; &nbsp; &nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;<br></span><div><span style=\"font-size: 16px;\"><br></span><div><span style=\"font-size: 16px;\"><strong>MINISTRY OF HEALTH<br>5 AUGUST 2020</strong><br></span><div><span style=\"font-size: 16px;\"><br></span></div></div><span style=\"font-size: 16px;\"><br></span></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "908-new-cases-of-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}