{"pressItemDictionary": {"Press Releases": [{"Title": "253 More Cases Discharged; 226 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1596469140000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "03 Aug 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp;As of 3 August 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 226 cases of COVID-19 infection in Singapore. The breakdown of the cases is as follows:</p> <p><strong>a)&nbsp; &nbsp;Imported cases: 9 </strong>(1 Permanent Resident, 3 Work Pass holders, 2 Work Permit holders, 3 Dependant’s Pass holders) <br><br>Amongst the 9 imported cases, 1 (Case 53077) is a Singapore Permanent Resident who returned to Singapore from India on 22 July. Another 5 (Cases 53073, 53074, 53076, 53084 and 53085) are Work Pass/ Work Permit holders who are currently employed in Singapore, and had arrived from India, Japan and the Philippines on 22 July. The remaining 3 (Cases 53017, 53075 and 53078) are Dependant’s Pass holders who arrived from India on 20 July and 22 July.&nbsp;<br><br>All of them had been placed on 14-day Stay-Home Notice (SHN) upon arrival in Singapore, and were serving their SHN at dedicated facilities. They had been tested while serving their SHN.</p><p><p><strong>b)&nbsp; Cases in the community: 1 </strong>(1 Short-Term Visit Pass holder) <br><br>There is 1 case in the community today who is currently unlinked. Case 53086 is a Prison inmate on Short-Term Visit Pass, who had arrived in Singapore before the implementation of border measures. He had served an earlier sentence in Prison prior to his current admission. As part of the Singapore Prison Service’s proactive screening of inmates, he had tested negative for COVID-19 for his entry and exit swabs on 2 July and 22 July respectively. He was subsequently tested again for COVID-19 (even though he is asymptomatic), and his test came back positive. <br><br>Epidemiological investigations of the case are in progress. In the meantime, all the identified close contacts have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. <br><br>Overall, the number of new cases in the community has decreased, from an average of 5 cases per day in the week before, to an average of 2 per day in the past week. The number of unlinked cases in the community has also decreased, from an average of 3 cases per day in the week before, to an average of 1 per day in the past week.&nbsp;We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.&nbsp;<br><br><strong>c)&nbsp;</strong> &nbsp;<strong>Cases residing in dormitories: 216&nbsp;&nbsp;<br><br><span style=\"font-size: 13px;\"></span></strong><span style=\"font-size: 13px;\"><span style=\"font-size: 13px;\">We continue to pick up cases amongst Work Permit holders residing in dormitories, including in factory-converted dormitories, because of extensive testing in these premises, as part of our process to verify and test the status of all workers.&nbsp;<br><br></span></span><span style=\"font-size: 18px;\"><span style=\"font-size: 13px;\">2.</span>&nbsp; &nbsp; &nbsp;</span>Details of these trends can be found in MOH’s daily situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\">www.moh.gov.sg/covid-19/situation-report</a>). Please refer to <u><u><a href=\"/docs/librariesprovider5/default-document-library/annex-a727e587a39e2418fbe8afcc180335cf7.pdf?sfvrsn=ee62b3b8_0\">Annex A</a>&nbsp;</u></u>for the summary of the confirmed cases. <br><br>3.&nbsp; &nbsp; &nbsp; Of the new cases, 99% are linked to known clusters, while the rest are pending contact tracing. <br><br>4.&nbsp; &nbsp; &nbsp; MOH has been monitoring existing clusters for any further transmission. As there have been no more cases linked to Keppel Shipyard (51 Pioneer Sector 1) and Paya Lebar Quarter Tower 2 (1 Paya Lebar Link) for the past two incubation periods (i.e. 28 days), the clusters have now been closed.&nbsp;<br><br><strong>Links between previous cases found&nbsp;<br><br></strong>5.&nbsp;<strong> &nbsp; &nbsp;&nbsp;</strong>Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <u><a href=\"/docs/librariesprovider5/default-document-library/annex-b2474f455a3d147bcbfe7433277c68d43.pdf?sfvrsn=eedddb21_0\" title=\"Annex B\">Annex B</a></u> and <u><a href=\"/docs/librariesprovider5/default-document-library/annex-c2ee7a1362cac4c96a85b568d82a80b67.pdf?sfvrsn=4dbaddb_0\" title=\"Annex C\">Annex C</a></u> for details.&nbsp;<br><br><strong>Update on condition of confirmed cases&nbsp;<br><br></strong>6<strong>.&nbsp; &nbsp; &nbsp;&nbsp;</strong>253 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 47,179 have fully recovered from the infection and have been discharged from hospitals or community care facilities. <br><br>7.&nbsp; &nbsp; &nbsp; There are currently 115 confirmed cases who are still in hospital. Of these, most are stable or improving, and 1 is in critical condition in the intensive care unit. 5,730 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 27 have passed away from complications due to COVID-19 infection.<br></p></p> <div> <p><strong>MINISTRY OF HEALTH<br></strong><strong>3 AUGUST 2020</strong></p> <p>&nbsp;</p> </div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "253-more-cases-discharged-226-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "226 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1596439800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "03 Aug 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; As of 3 August 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 226 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders residing in foreign worker dormitories. Based on our investigations so far, there is 1 case in the community involving a Prison inmate on Short-Term Visit Pass, who had arrived in Singapore before the implementation of border measures. He had been segregated from the general inmate population since his admission to Changi Prison Complex on 30 July, and was tested as part of the Singapore Prison Service’s proactive screening of newly admitted inmates. <br><br>2.&nbsp; &nbsp; &nbsp; In addition, there are 9 imported cases, who had all been placed on Stay-Home Notice upon arrival in Singapore. <br><br>3.&nbsp; &nbsp; &nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.</p> <p>&nbsp;</p> <p>&nbsp;</p> <div> <p><strong>MINISTRY OF HEALTH<br></strong><strong>3 AUGUST 2020</strong></p> </div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "226-new-cases-of-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}