{"pressItemDictionary": {"Press Releases": [{"Title": "332 More Cases Discharged, 175 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1596986460000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "09 Aug 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\"><span style=\"font-size: 16px;\"><span style=\"font-family: Arial;\">&nbsp; &nbsp; &nbsp; &nbsp;As of 9 August 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 175 cases of COVID-19 infection in Singapore. The breakdown of the cases is as follows:<br><br><strong>a) Imported cases: 3</strong> (1 Singaporean, 2 Work Pass holders)<br><br>Amongst the 3 imported cases, 1 (Case 55143) is a Singaporean who returned to Singapore from India on 25 July. The remaining 2 (Cases 55138 and 55142) are Work Pass holders who are currently employed in Singapore. They arrived in Singapore from India on 26 July. All of them had been placed on 14-day Stay-Home Notice (SHN) upon arrival in Singapore, and were serving their SHN at dedicated facilities. They had been tested while serving their SHN.<br><br><strong>b) Cases in the community: 1</strong>&nbsp; (1 Singaporean)<br><br>There is 1 case in the community today who is currently unlinked. Case 55169 was tested after she sought medical treatment for prolonged acute respiratory infection (ARI) symptoms. Epidemiological investigations of the case are in progress. In the meantime, all the identified close contacts have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases.<br><br>Overall, the number of new cases in the community has remained stable at an average of 2 cases per day in the past 2 weeks. The number of unlinked cases in the community has also remained stable at an average of 1 case per day in the past 2 weeks. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br><br><strong>c) Cases residing in dormitories: 171</strong><br><br>The Inter-agency Taskforce has completed the testing of all workers in the dormitories on 7 August, and some of the test results are still being processed. There are currently about 23,500 workers who are still serving out their isolation period at quarantine facilities. These workers will be tested when their isolation ends, and we expect the case counts to remain high in the coming days, before tapering down thereafter.<br><br>2.&nbsp; &nbsp; &nbsp;Details of these trends can be found in MOH’s daily situation Report (<a href=\"https://www.moh.gov.sg/covid-19/situation-report/\" title=\"\" class=\"\" target=\"\">www.moh.gov.sg/covid-19/situation-report</a>). Please refer to <a href=\"/docs/librariesprovider5/default-document-library/annex-ab8e7cd0264f94409ac2a53079caaaff8.pdf?sfvrsn=164c9710_0\" title=\"Annex A\">Annex A</a>&nbsp;for the summary of the confirmed cases.&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp;Of the new cases, 98% are linked to known clusters, while the rest are pending contact tracing.&nbsp;<br><br><strong>Links between previous cases found</strong><br><br>4.&nbsp; &nbsp; &nbsp;In the past week (2 August to 8 August), MOH has uncovered links for 1 previously unlinked case in the community.&nbsp;<br><br>5.&nbsp; &nbsp; &nbsp;Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <a href=\"/docs/librariesprovider5/default-document-library/annex-b6890c317a730417583442fd4930c3b7e.pdf?sfvrsn=b6088ddd_0\" title=\"Annex B\">Annex B</a>&nbsp;and <a href=\"/docs/librariesprovider5/default-document-library/annex-c7225dc205cef466caa6565eb555c7465.pdf?sfvrsn=7698c4df_0\" title=\"Annex C\">Annex C</a>&nbsp;for details.&nbsp;<br><br><strong>Update on condition of confirmed cases<br></strong><br>6.&nbsp; &nbsp; &nbsp;332 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 48,915 have fully recovered from the infection and have been discharged from hospitals or community care facilities.&nbsp;<br><br>7.&nbsp; &nbsp; &nbsp;There are currently 135 confirmed cases who are still in hospital. Of these, most are stable or improving, and none is in the intensive care unit. 6,027 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 27 have passed away from complications due to COVID-19 infection.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>9 AUGUST 2020</strong><br></span></span></p><div style=\"text-align: justify;\"><span style=\"font-size: 16px; font-family: Arial;\"><br></span></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "332-more-cases-discharged-175-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "175 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1596958500000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "09 Aug 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\">&nbsp; &nbsp; &nbsp; &nbsp; <span style=\"font-size: 16px;\">As of 9 August 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 175 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders currently under quarantine and workers tested in previous days due to dormitory clearance. Based on our investigations so far, there is 1 case in the community, who is a Singaporean.<br><br>2.&nbsp; &nbsp; &nbsp;In addition, there are 3 imported cases, who had all been placed on Stay-Home Notice upon arrival in Singapore.&nbsp;&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>9 AUGUST 2020</strong></span><br></p><div><br></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "175-new-cases-of-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}