{"pressItemDictionary": {"Press Releases": [{"Title": "Five More Cases Discharged; Two New Cases of COVID-19 Infection Confirmed", "PublishedDate": "/Date(1581940800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "17 Feb 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp;Five more cases of COVID-19 infection have been discharged from hospital today (Cases 14, 15, 31, 48 and 65). In all, 24 have fully recovered from the infection and have been discharged from hospital. </p> <p>2 &nbsp;&nbsp;&nbsp;&nbsp;As of 17 February 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified two additional cases of COVID-19 infection in Singapore. Of these, one was among the group of Singaporeans who were evacuated from Wuhan on 9 February and one is linked to a previous case.</p><p><p><strong>Links between previous cases found</strong></p><p>3&nbsp; &nbsp; &nbsp; Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. This was made possible with the assistance of the Singapore Police Force.<br><br>a)&nbsp; &nbsp; &nbsp; Cases 8 and 9, as well as Cases 31, 33 and 38, are linked to The Life Church and Missions Singapore (146B Paya Lebar Road). This is a possible cluster involving five cases (Cases 8, 9, 31, 33 and 38).<br><br>b)&nbsp; &nbsp; &nbsp; Nine of the confirmed cases (Cases 19, 20, 21, 24, 25, 27, 28, 34 and 40) are linked to the cluster associated with Yong Thai Hang (24 Cavan Road).<br><br>c)&nbsp; &nbsp; &nbsp; Three of the confirmed cases (Cases 30, 36 and 39) are linked to the private business meeting held at Grand Hyatt Singapore from 20 to 22 January. <br><br>d)&nbsp; &nbsp; &nbsp; Five of the confirmed cases (Cases 42, 47, 52, 56 and 69) are linked to the Seletar Aerospace Heights construction site.<br><br>e)&nbsp; &nbsp; &nbsp; Eighteen of the confirmed cases (Cases 48, 49, 51, 53, 54, 57, 58, 60, 61, 62, 63, 66, 67, 68, 70, 71, 73 and 74) are linked to the Grace Assembly of God.<br><br><br>4&nbsp; &nbsp; &nbsp; &nbsp;Investigations on these clusters are ongoing. In addition to the clusters, our investigations have identified the following links between cases:</p></p><p><ul><li>Case 44 was a contact of Cases 13 and 26;</li><li>Case 77 is linked to Case 50, and Case 50 is linked to 55 and 65;</li><li>Case 72 is linked to Case 59; and</li><li>Case 75 is linked to Case 41.<br></li></ul><p>5&nbsp; &nbsp; &nbsp; Contact tracing is underway for the other seven locally transmitted cases to establish any links to previous cases or travel history to mainland China.</p></p><p><strong>About the confirmed cases</strong></p><p><u>Case 76</u></p><p>6&nbsp; &nbsp; &nbsp; Case 76 is a 1 year-old male Singapore Citizen who was among the group of Singaporeans who were evacuated from Wuhan on 9 February. He was without symptoms when he boarded the flight and was put under quarantine upon landing in Singapore. He is currently warded in an isolation room at the KK Women’s and Children’s Hospital (KKH).<br><br>7&nbsp; &nbsp; &nbsp; All Singaporeans evacuated from Wuhan were tested for COVID-19 as an added precaution. He was confirmed to have COVID-19 infection on 16 February afternoon.</p><p><p><u>Case 77</u></p><p>8&nbsp; &nbsp; &nbsp;Case 77 is a 35 year-old male Singapore Citizen with no recent travel history to China. He is a contact of Case 50. He was confirmed to have COVID-19 infection on 17 February morning and is currently warded in an isolation room at the National Centre for Infectious Diseases.</p></p><p><p><strong>Update on condition of confirmed cases</strong></p><p>9&nbsp; &nbsp; &nbsp; To date, a total of 24 cases have fully recovered from the infection and have been discharged from hospital. Of the 53 confirmed cases who are still in hospital, most are stable or improving. Four are in critical condition in the intensive care unit.</p></p><p><p><strong>Update on suspect cases </strong></p><p>10&nbsp; &nbsp; &nbsp; As of 17 February 2020, 12pm, 937 of the suspect cases have tested negative for COVID-19, and 77 have tested positive. Test results for the remaining 103 cases are pending.</p></p><p><p><strong>Update on contact tracing for confirmed cases</strong></p><p>11&nbsp; &nbsp; &nbsp; Contact tracing for the confirmed cases is ongoing. Once identified, MOH will closely monitor all close contacts. As a precautionary measure, they will be quarantined for 14 days from their last exposure to the patient. In addition, all other identified contacts who have a low risk of being infected will be under active surveillance, and will be contacted daily to monitor their health status.<br><br>12&nbsp; &nbsp; &nbsp; As of 17 February 2020, 12pm, MOH has identified 2,358 close contacts who have been quarantined. Of these, 1,081 are currently quarantined, and 1,277 have completed their quarantine.<br><strong><br>Health advisory</strong><br></p></p><p>13&nbsp; &nbsp; &nbsp;Singaporeans are advised to defer all travel to Hubei Province and all non-essential travel to Mainland China.<br><br>14&nbsp; &nbsp; &nbsp; All travellers should monitor their health closely for two weeks upon return to Singapore and seek medical attention promptly if they feel unwell. Travellers should inform their doctor of their travel history. If they have a fever or respiratory symptoms (e.g. cough, shortness of breath), they should wear a mask and call the clinic ahead of the visit.<br><br>15&nbsp; &nbsp; &nbsp; Travellers and members of the public should adopt the following precautions at all times:</p><ul><li>Avoid close contact with people who are unwell or showing symptoms of illness; </li><li>Observe good personal hygiene; </li><li>Practise frequent hand washing with soap (e.g. before handling food or eating, <p>after going to toilet, or when hands are dirtied by respiratory secretions after coughing or sneezing); </p></li><li>Wear a mask if you have respiratory symptoms such as a cough or shortness of breath; </li><li>Cover your mouth with a tissue paper when coughing or sneezing, and dispose the soiled tissue paper in the rubbish bin immediately; and </li><li>Seek medical attention promptly if you are feeling unwell.<br></li></ul><p>16&nbsp; &nbsp; &nbsp; MOH will continue to monitor the situation closely. As medical practitioners are on the lookout for suspect cases, Singapore is likely to see more cases that will need to be investigated.</p><p><strong>MINISTRY OF HEALTH</strong></p><p><strong>17 FEBRUARY 2020</strong></p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </p><p>&nbsp;</p><p> <strong><br clear=\"all\"> </strong> </p><p><strong>&nbsp;</strong></p> <p>&nbsp;</p>", "PressCategory": ["Press Releases"], "CustomDetailUrl": "", "UrlName": "five-more-cases-discharged-two-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "Implementation of New Stay-Home Notice", "PublishedDate": "/Date(1581876000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "17 Feb 2020", "Summary": "", "MainContent": "<div>&nbsp; &nbsp; &nbsp; Since 31 January 2020, we have implemented a 14-day leave of absence (LOA) for all travellers returning from mainland China (outside of Hubei) who are Singapore residents or long-term pass holders.</div><div>&nbsp;</div><div>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We took this precautionary measure because travellers from mainland China might be infected with COVID-19 and to reduce the risk of community spread of the virus within Singapore. Since introducing the measure, we have progressively tightened the LOA and stepped up enforcement. To date, we have not had any confirmed COVID-19 case among this group of returnees.</div><div>&nbsp;</div><div><strong>Need for enhanced measures</strong></div><div>&nbsp;</div><div>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The number of confirmed cases in mainland China (outside of Hubei) has increased from over 4,000 cases on 31 January 2020 to over 12,000 today.&nbsp;</div><div>&nbsp;</div><div>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; At the same time, there remains a substantial number of Singapore residents and long-term pass holders in China, including Singapore Citizens. Many of them are expected to return to Singapore in the coming weeks, and to their workplaces or schools, after the Chinese New Year holidays in China. There is a higher chance that returnees could be carrying the virus.</div><div>&nbsp;</div><div><strong>New “Stay-Home Notice”</strong></div><div>&nbsp;</div><div>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The Multi-Ministry Taskforce has therefore decided to introduce a new “Stay-Home Notice” (SHN) for Singapore residents and long-term pass holders returning to Singapore from mainland China (outside of Hubei).</div><div>&nbsp;</div><div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; a.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; This SHN will take effect from 18 February 2020, 23:59 hours, and will apply to all returnees with recent travel history to China (outside Hubei) within the last 14 days.&nbsp;</div><div>&nbsp;</div><div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; b.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Under the SHN, they will have to remain in their place of residence at all times during the 14-day period. This is stricter than the existing LOA regime, which had allowed returnees to leave their homes briefly, for example for their meals or to buy household supplies.</div><div>&nbsp;</div><div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; c.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Those placed on the SHN will be reminded to monitor their health closely and minimise contact with others.</div><div>&nbsp;</div><div>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The SHN will also cover returning workers from mainland China on work passes. For such workers, we already require employers to seek prior approval from the Ministry of Manpower (MOM) before they travel back to Singapore. If the employers need help, MOM will link them up with hotels or dormitory operators for their workers to serve out the SHN.</div><div>&nbsp;</div><div>7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We recognise that during the SHN period, some may need special assistance, for example, for their food and daily necessities. We will provide support for those who need help:</div><div>&nbsp;</div><div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; a.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Singapore Citizens, Permanent Residents (PRs) and Long Term Visit Pass (LTVP) holders can seek assistance from the People’s Association.</div><div>&nbsp;</div><div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; b.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Students can seek assistance from their schools and institutions, or the Ministry of Education.</div><div>&nbsp;</div><div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; c.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Those on work passes can seek assistance from their employers or MOM.</div><div>&nbsp;</div><div>8.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We will continue to implement surveillance and enforcement measures to ensure compliance with the SHN, so that the wellbeing of the community is not put at risk:</div><div>&nbsp;</div><div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; a.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Those who flout the SHN may face penalties and can be prosecuted under Section 21A of the Infectious Diseases Act.</div><div>&nbsp;</div><div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; b.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Foreign workers may have their work passes revoked and be repatriated. Employers too may have their work pass privileges withdrawn. Students may face disciplinary actions from their schools or institutions. PRs, LTVP and Dependant’s Pass (DP) holders may have their Re-Entry Permit, LTVP or DP revoked or the validity shortened.</div><div>&nbsp;</div><div>9.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; With the introduction of the SHN, the Government will no longer be issuing any more new LOAs to returnees with recent travel history to mainland China (outside Hubei). The vast majority on the present regime would have served out their LOAs in the coming days, and we will continue to ensure their compliance in the meantime.</div><div>&nbsp;</div><div><strong>General advisories</strong></div><div>&nbsp;</div><div>10.&nbsp;&nbsp;&nbsp;&nbsp; The SHN is another precautionary measure we are taking to minimise the risk of additional imported cases of COVID-19. Similar to those placed on LOA previously, those issued SHNs are not suspected to have been in close contact with confirmed cases, nor are they unwell or displaying symptoms of the virus. These individuals are bearing inconvenience for the benefit of the wider community.</div><div>&nbsp;</div><div>11.&nbsp;&nbsp;&nbsp;&nbsp; We therefore urge all landlords to cooperate and to allow their tenants who are placed on SHN to serve out their full 14-day requirements. Guidelines for landlords are available at the Ministry of Health website (<a href=\"https://www.moh.gov.sg/covid-19\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?q=https://www.moh.gov.sg/covid-19&amp;source=gmail&amp;ust=1582016995174000&amp;usg=AFQjCNE38cozCgc9fA2FvOO6KIVu-G1Zrw\">https://www.moh.gov.sg/covid-<wbr>19</a>) should they have a tenant who is placed on SHN.</div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "implementation-of-new-stay-home-notice", "CurrentPageUrl": null}, {"Title": "Meeting with Religious Leaders on COVID-19", "PublishedDate": "/Date(1581868800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "17 Feb 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Minister for Health Mr Gan Kim Yong, Minister for Culture, Community &amp; Youth Ms Grace Fu and Minister for Education Mr Ong Ye Kung met with Buddhist, Taoist, Sikh and Hindu religious leaders today to update them on the COVID-19 situation, and to provide guidance on precautionary measures that can be taken to reduce the risk of transmission of the virus.</p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The Ministry of Health (MOH) advises that religious events and worship at temples may continue, but with appropriate precautionary measures and enhanced emphasis on personal hygiene practices to reduce the risk of transmission.</p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The Ministers thanked the religious leaders for their understanding and support. Many of the religious leaders shared at the meeting that they have already put in place several measures to protect their worshippers.</p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The Ministers highlighted the role of social responsibility in reducing the risk of transmission. Those who are unwell, including worshippers, volunteers and staff, should consult a doctor immediately and avoid going to religious events or places of worship. This includes having mild symptoms such as cough, sore throat and runny nose, as not all cases of COVID-19 infection had a fever at onset of symptoms.&nbsp;</p><p>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; MOH shared additional measures that can be adopted, including reminding worshippers not to attend religious events if they have recent travel history to mainland China in the last 14 days, or are under leave of absence, increasing the frequency of cleaning of commonly used areas, and minimising sharing of common items where possible. There should also be good ventilation at venues where large events are held.</p><p>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The most effective method to prevent transmission remains through good personal hygiene of regular hand washing with soap and water, and to avoid touching our face unnecessarily.</p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "meeting-with-religious-leaders-on-covid-19", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}