{"pressItemDictionary": {"Press Releases": [{"Title": "Additional Measures to Minimise Further Spread of Covid-19 Within Foreign Worker Dormitories", "PublishedDate": "/Date(1586085420000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "05 Apr 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\"><span style=\"font-family: Arial;\"><span style=\"font-size: 14px;\">&nbsp; &nbsp; The Ministry of Manpower (MOM) had issued advisories on enhanced precautionary measures in dormitories to minimise the risk of COVID-19 transmission. However transmissions within foreign worker dormitories have continued to rise and we are seeing more confirmed cases and workers who are ill. The S11 Dormitory @ Punggol (2 Seletar North Link) and Westlite Toh Guan dormitory (18 Toh Guan Road East) are of particular concern.<br><br>2.&nbsp; &nbsp; The Multi-Ministry Taskforce has decided that further measures are necessary to contain the risk of further transmission among the foreign workers within these two dormitories. This would keep the workers safe, as well as protect the wider community from widespread transmission from these clusters. Both S11 Dormitory @ Punggol and Westlite Toh Guan dormitory have been declared as isolation areas. Onsite medical support has been deployed, along with provision of food and essential supplies.<br><br><strong>Measures to contain further outbreak<br><br></strong>3.&nbsp; &nbsp; The S11 Dormitory @ Punggol, with 13,000 resident workers, and Westlite Toh Guan dormitory, with 6,800 resident workers, have been gazetted as isolation areas. Given the rising number of confirmed cases, this is necessary to avoid the risk of further transmissions from any potentially infected workers to others in the dormitories, as well as into the community. Workers who are symptomatic have already been isolated.<br><br>4.&nbsp; &nbsp; Within these two dormitories, precautionary steps have also been taken to protect workers who are well. All the affected workers will not go to work. Access to recreational facilities will be regulated to reduce the inter-mixing of workers. Movement between blocks is prohibited. Workers have also been advised to cease social interactions with others who do not reside in the same room or floor.<br><br>5.&nbsp; &nbsp; MOM is working closely with all dormitory operators, to implement similar measures within their premises with immediate effect. Efforts are also underway in the larger dormitories to reduce the density of their resident workers, by transferring some among them to alternative accommodation during this period.<br><br><strong>Support provided to workers<br><br></strong>6.&nbsp; &nbsp; The workers will continue to be paid their salaries for the duration of the quarantine. Their period of absence from work is treated as paid hospitalisation leave as part of the worker’s leave eligibility under the Employment of Foreign Manpower Act (EFMA). Their employers are eligible to claim for the $100 daily quarantine allowance.<br><br>7.&nbsp; &nbsp; Arrangements will be made to cater three meals a day for all affected workers for the duration of the quarantine. They will also be issued with reusable masks, surgical masks, thermometers, hand sanitisers and other essentials so they can keep themselves safe and comfortable.<br><br>8.&nbsp; &nbsp; Onsite medical support has been deployed to support the workers residing at both dormitories. The dormitories have also implemented enhanced health screening measures, such as requiring workers to check and report their temperature twice daily, as well as the regular monitoring for fever and respiratory symptoms. Those who are unwell will be isolated and will be assessed by medical personnel for further attention.&nbsp;<br><br><strong>Support provided to companies with affected workers<br><br></strong>9.&nbsp; &nbsp; Companies that are providing essential services with workers affected by this quarantine order will be supported and arrangements will be made to ensure these essential services can continue to be provided.<br><br><strong>Advisory to dormitory operators<br><br></strong>10.&nbsp; &nbsp;Dormitory operators and workers living in dormitories are reminded of the importance of maintaining high standards of hygiene and cleanliness to safeguard their own health and those of others who are living in the same space. Safe distancing measures must be strictly adhered to. These include measures such as no inter-mixing of workers between dormitory blocks and floors, and for workers to stay within their rooms and to minimise interactions.<br><br>11.&nbsp; &nbsp;Social responsibility is critical in slowing the transmission of the virus. We need every individual to play their part in the fight against the virus. Those who are unwell, even with mild flu-like symptoms, should not be at work. They must see a doctor immediately to prevent spreading illness to others.<br><br><strong>MINISTRY OF HEALTH &amp; MINISTRY OF MANPOWER<br></strong><strong>5 APRIL 2020</strong></span></span></p>", "PressCategory": ["Press Releases"], "CustomDetailUrl": "", "UrlName": "additional-measures-to-minimise-further-spread-of-covid-19-within-foreign-worker-dormitories", "CurrentPageUrl": null}, {"Title": " 23 More Cases Discharged; 120 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1586016000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "05 Apr 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;23 more cases[1]&nbsp;of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 320 have fully recovered from the infection and have been discharged from hospitals or community isolation facilities. </p><p style=\"text-align: justify;\">2.&nbsp; &nbsp; &nbsp; &nbsp;As of 5 April 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 120 cases of COVID-19 infection in Singapore, of which four are imported and 116 are local cases who have no recent travel history abroad. Among the local cases, we have established links to existing clusters for 50 cases.&nbsp;Contact tracing is ongoing for the remaining 66 cases.</p><p style=\"text-align: justify;\"><p><strong>Links between previous cases found</strong></p><p>3.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases.</p></p><p style=\"text-align: justify;\"><p>a)&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Three of the newly confirmed cases (Cases 1193, 1226, 1299) are linked to two previous cases (Case 1049 and 1140), forming a new cluster at Tampines Dormitory (2 Tampines Place).</p></p><p style=\"text-align: justify;\"><p>b)&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Two of the earlier confirmed cases (Cases 1018 and 1144) have now been linked to a new cluster at Cochrane Lodge I (51 Admiralty Road West).</p></p><p style=\"text-align: justify;\"><p>c)&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Four of the earlier confirmed cases (Cases 1049, 1012,1183, 1184) have now been linked to a new cluster at a construction site at 6 Battery Road.</p></p><p style=\"text-align: justify;\"><p>d)&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; 22 additional cases are linked to the cluster at S11 Dormitory @ Punggol (2 Seletar North Link), which has a total of 63 confirmed cases[2]&nbsp;now.</p></p><p style=\"text-align: justify;\"><p>e)&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;10 additional case is linked to the cluster at Westlite Toh Guan dormitory (18 Toh Guan Road East), which has a total of 28 confirmed cases[3]&nbsp;now.</p></p><p style=\"text-align: justify;\"><p>f)&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Three additional cases are linked to the cluster at Toh Guan Dormitory (19A Toh Guan Road East), which has a total of eight confirmed cases now (Cases 963, 1079, 1106, 1148, 1150, 1195, 1254 and 1273).</p></p><p style=\"text-align: justify;\"><p>g)&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;One additional case is linked to the cluster at Sungei Tengah Lodge (500 Old Choa Chu Kang Road), which has a total of four confirmed cases now (Cases 1054, 1077, 1124 and 1267).</p></p><p style=\"text-align: justify;\"><p>h)&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Three additional cases are linked to the cluster at a construction site at Project Glory (50 Market Street), which has a total of 15 confirmed cases now (Cases 956, 967, 1019, 1065, 1078, 1079, 1104, 1120, 1124, 1149, 1162, 1181, 1191, 1226 and 1273).</p></p><p style=\"text-align: justify;\"><p>i)&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Nine additional cases are linked to the cluster at Mustafa Centre (145 Syed Alwi Road), which has a total of 28 confirmed cases[4]&nbsp;now.</p></p><p style=\"text-align: justify;\"><p><br>j)&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;One additional case is linked to the cluster at Keppel Shipyard (51 Pioneer Sector 1), which has a total of seven cases now (Cases 878, 898, 907, 1076, 1158, 1172 and 1270).</p></p><p style=\"text-align: justify;\"><p>4.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Contact tracing is underway for unlinked cases to establish any links to previous cases or travel history to affected countries or regions.</p></p><p style=\"text-align: justify;\"><p>5.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Please refer to the MOH website for the situation report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\">www.moh.gov.sg/covid-19/situation-report</a>).</p></p><p style=\"text-align: justify;\"><p><strong>Cases from public healthcare sector</strong></p><p><u>Case 1237 </u></p><p>6.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Case 1237 is a 35 year-old female Singapore Citizen with no recent travel history to affected countries or regions. She reported onset of symptoms on 3 April, and subsequent test results confirmed COVID-19 infection on 4 April. She is currently warded in an isolation room at the Singapore General Hospital.</p></p><p style=\"text-align: justify;\"><p>7.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; She is employed as a doctor at the KK Women’s and Children’s Hospital but had not gone to work since onset of symptoms.</p></p><p style=\"text-align: justify;\"><p><u>Case 1238</u></p><p>8.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Case 1238 is a 27 year-old male Indian national who is a Singapore Work Pass holder and has no recent travel history to affected countries or regions. He reported onset of symptoms on 3 April, and subsequent test results confirmed COVID-19 infection on 4 April afternoon. He is currently warded in an isolation room at Ng Teng Fong General Hospital (NTFGH).</p></p><p style=\"text-align: justify;\"><p>9.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; He is employed as a technician at NTFGH and had been at work for less than an hour after onset of symptoms.</p></p><p style=\"text-align: justify;\"><p><strong>Update on condition of confirmed cases</strong></p><p>10.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; To date, a total of 320 cases have fully recovered from the infection and have been discharged from hospitals or community isolation facilities.</p></p><p style=\"text-align: justify;\"><p>11.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Of the 569 confirmed cases who are still in hospital, most are stable or improving. 25 are in critical condition in the intensive care unit. 414 cases who are clinically well but still test positive for COVID-19 are isolated and cared for at Concord International Hospital, Mount Elizabeth Hospital, Gleneagles Hospital and the Community Isolation Facility at D’Resort NTUC. Six have passed away from complications due to COVID-19 infection.</p></p><p style=\"text-align: justify;\"><p><strong>Update on contact tracing for confirmed cases </strong></p><p>12.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Contact tracing for the confirmed cases is ongoing. Once identified, MOH will closely monitor all close contacts. As a precautionary measure, they will be quarantined for 14 days from their last exposure to the patient. In addition, all other identified contacts who have a low risk of being infected will be under active surveillance, and will be contacted daily to monitor their health status.</p></p><p style=\"text-align: justify;\"><p>13,&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As of 5 April 2020, 12pm, MOH has identified 17,345 close contacts who have been quarantined. Of these, 5,995 are currently quarantined, and 11,350 have completed their quarantine.</p></p><div style=\"text-align: justify;\"><br clear=\"all\"> <hr align=\"left\" size=\"1\" width=\"33%\"> <div id=\"ftn1\"> </div></div><p style=\"text-align: justify;\">[1] Cases 145, 163, 169, 177, 191, 204, 250, 267, 312, 373, 430, 443, 480, 614, 643, 645, 727, 745, 748, 752, 783, 832 and 1000.</p><p style=\"text-align: justify;\">[2] Cases 826, 829, 852, 860, 946, 947, 966, 979, 982, 993, 1035, 1039, 1047, 1050, 1061, 1066, 1074, 1083, 1084, 1089, 1107, 1108, 1110, 1111, 1112, 1117, 1118, 1119, 1126, 1135, 1138, 1145, 1153, 1155, 1156, 1171, 1173, 1174, 1185, 1186, 1187, 1213, 1222, 1223, 1224, 1225, 1236, 1275, 1279, 1280, 1283, 1284, 1285, 1286, 1287, 1288, 1289, 1290, 1291, 1292, 1293, 1300 and 1302.&nbsp;</p><p style=\"text-align: justify;\">[3] Cases 655, 875, 922, 924, 925, 926, 934, 977, 1011, 1012, 1054, 1062, 1068, 1072, 1100, 1101, 1113, 1176, 1194, 1202, 1216, 1218, 1238, 1251, 1252, 1253, 1255 and 1256.</p><p style=\"text-align: justify;\">[4] Cases 616, 788, 866, 908, 911, 938, 1001, 1015, 1024, 1025, 1026, 1046, 1056, 1093, 1096, 1127, 1180, 1188, 1189, 1199, 1200, 1201, 1209, 1219, 1259, 1260, 1277 and 1282.</p><p><div><div id=\"ftn4\"> </div> </div><br><div id=\"ftn4\"> </div> </p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "23-more-cases-discharged-120-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}