{"pressItemDictionary": {"Press Releases": [{"Title": "Expanded Covid-19 Testing to Specific Community Groups and Updated Guidance On Use of Masks", "PublishedDate": "/Date(1598697240000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "29 Aug 2020", "Summary": "", "MainContent": "<span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The Multi-Ministry Taskforce will expand the COVID-19 testing regime to identified community groups in the upcoming weeks. These tests will be offered to these groups to provide a better picture of population prevalence and facilitate the early containment of any cryptic cases in the community.<br><br>2.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;The Taskforce also recommends that makeshift face coverings such as bandanas, scarves, and neck gaiters should not be used.<br><br><strong>Expanded COVID-19 Testing to Specific Community Groups<br></strong><br>3.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;The Ministry of Health (MOH) regularly reviews our testing strategies to enhance and step up our surveillance regime for the community. Beyond the comprehensive surveillance testing on individuals above the age of 12 diagnosed with acute respiratory infections (ARI), the Government has activated numerous testing operations for targeted groups such as preschool teachers and staff and residents of residential homes serving the elderly<sup>[1]</sup>.<br><br>4.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Although the number of community cases remains low and stable today, we must not let our guard down. As we gradually reopen our economy and resume social activities, we will be testing more extensively in the community. MOH, together with other government agencies, will be progressively reaching out to identified community groups to offer COVID-19 testing on a one-time basis. These testing operations aim to provide a better picture of population prevalence.<br><br>5.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;For a start, we have plans to provide testing to community groups such as taxi and Private Hire Car (PHC) drivers, food delivery personnel, key vendors servicing foreign worker dormitories, as well as stallholders at hawker centres, markets and similar F&amp;B establishments such as coffeeshops. While there has been no local evidence that these community groups are of higher risks of getting infected, MOH will be offering tests to them given the nature of their working environment, such as the high frequency of interactions with members of public.<br><br>6.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;We strongly encourage individuals in the identified community groups to come forward and utilise the tests offered. The costs of the tests will be fully borne by the government.<br><br>Updated Guidance on Use of Masks<br><br>7.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;There have been recent queries on the efficacy of makeshift coverings such as bandanas, scarves, and neck gaiters in preventing disease transmission. As these makeshift coverings may not have a good fit around the person’s nose and mouth and are made from materials that are not specific for disease prevention, they may not perform as well as purpose-built masks.<br><br>8.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;To ensure transmission rates in the community are kept low, it is critical for every member of public to put on masks that are designed or made specifically to prevent disease transmission. A mask should be worn such that it closely and completely covers the wearer’s nose and mouth, without leaving a gap between the mask and the face. Therefore, face coverings such as neck gaiters, bandanas, scarves, or handkerchiefs should not be used.<br><br><strong>Playing Our Part in the Fight Against COVID-19<br></strong><br>9.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Everyone has a role to play to ensure the safe resumption of social and economic activities. To be socially responsible, those who are unwell, including those showing early/mild symptoms of fever, cough, sore throat, runny nose and loss of smell, should seek medical attention immediately and stay at home to prevent the spread of illness to others. We strongly urge everyone to do their part by observing safe distancing and practicing good personal hygiene to reduce the risk of transmission. Together, we can continue in our fight against COVID-19 to protect ourselves, our loved ones and our community.<br><br>&nbsp;<br><strong>MINISTRY OF HEALTH<br>29 AUGUST 2020</strong></span>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "expanded-covid-19-testing-to-specific-community-groups-and-updated-guidance-on-use-of-masks", "CurrentPageUrl": null}, {"Title": "51 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1598686200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "29 Aug 2020", "Summary": "", "MainContent": "<span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;As of 29 August 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 51 cases of COVID-19 infection in Singapore. Based on our investigations so far, there is 1 case in the community, who is a Work Pass holder.&nbsp;<br><br>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;There are 3 imported cases, who had all been placed on Stay-Home Notice upon arrival in Singapore.&nbsp;&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>29 AUGUST 2020</strong><br></span><div><span style=\"font-size: 16px;\"><br></span></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "51-new-cases-of-covid-19-infection-29Aug", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}