{"pressItemDictionary": {"Press Releases": [{"Title": "Joint Statement by MOH, MPA and STB: Precautionary Measures taken for Cruise Ship’s Scheduled Call at Singapore ", "PublishedDate": "/Date(1583755200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "09 Mar 2020", "Summary": "", "MainContent": "&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The Maritime and Port Authority of Singapore (MPA) and Singapore Tourism Board (STB) confirm that the scheduled call by the Singapore-based Costa Fortuna at Singapore is one of the scheduled calls made by cruise ships at our terminals. <br><br>2.&nbsp; &nbsp; &nbsp; &nbsp; Over the past two weeks, Singapore has handled more than 10 scheduled calls by cruise ships and disembarked more than 5,000 passengers. <br><br>3.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Costa Fortuna began its journey from Singapore as a home-ported ship and is returning as scheduled on 10 March 2020. Like all other cruise ships departing from Singapore’s cruise terminals, Costa Fortuna was disinfected prior to its departure from Singapore. All its passengers also completed pre-embarkation checks based on prevailing policies for travel history and temperature screening as required by the cruise line and the terminal operator prior to boarding. This is its 16th call since December 2019. <br><br>4.&nbsp; &nbsp; &nbsp; &nbsp; Costa Fortuna has not picked up any new passengers since it left Singapore on 3 March 2020<sup>[1]</sup> . <br><br>5.&nbsp; &nbsp; &nbsp; &nbsp; After Costa Fortuna berths, doctors, licensed by the Ministry of Health, will conduct enhanced, one-on-one checks on passengers who have recent travel history to northern Italy within the last 14 days. Those who exhibit fever and/or other symptoms of respiratory illness will be conveyed directly to the National Centre for Infectious Diseases. Those without symptoms will be conveyed directly to the airport for their onward flights.&nbsp;<br><br>6.&nbsp; &nbsp; &nbsp; &nbsp; All remaining passengers entering Singapore will also undergo temperature screening as a precautionary measure. Those who exhibit fever and/or other symptoms of respiratory illness will be required to undergo a COVID-19 swab test. Passengers who are identified for COVID-19 swab testing but refuse to do so will not be allowed entry into Singapore.&nbsp;<br><br>______<br><sup>[1]</sup>&nbsp;<span style=\"font-size: 12px;\">From 4 March 2020, 2359 hours, all new visitors with recent travel history to Iran, northern Italy or the Republic of Korea within the last 14 days will not be allowed entry into Singapore, or transit through Singapore.&nbsp;<br><br><span style=\"font-size: 13px;\">Issued by: <br>Ministry of Health <br>Maritime and Port Authority of Singapore <br>Singapore Tourism Board&nbsp;</span></span>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "joint-statement-by-moh-mpa-and-stb-precautionary-measures-taken-for-cruise-ship-s-scheduled-call-at-singapore", "CurrentPageUrl": null}, {"Title": "Three more cases discharged, ten new cases of COVID-19 infection confirmed", "PublishedDate": "/Date(1583755200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "09 Mar 2020", "Summary": "", "MainContent": "1. Three more cases of COVID-19 infection have been discharged from hospital (Cases 112, 138 and 151). In all, 93 have fully recovered from the infection and have been discharged from hospital.&nbsp; \n<br>\n<br>2.\tAs of 9 March 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified 10 more cases of COVID-19 infection in Singapore. Of these:\n<br>\n<br>•\tSix are part of the cluster involving a private dinner function at SAFRA Jurong (333 Boon Lay Way) on 15 February;\n<br>•\tOne is linked to the cluster at The Life Church and Missions Singapore (146B Paya Lebar Road); and\n<br>•\tThree are imported cases.\n<br>\n<br><strong>Links between previous cases found\n</strong><br>\n<br>3.\tFurther epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. This was made possible with the assistance of the Singapore Police Force.\n<br>\n<br>a)\tEight of the locally transmitted confirmed cases (Cases 31, 33, 38, 83, 90, 91, 138 and 151), as well as Cases 8 and 9, are linked to The Life Church and Missions Singapore. These cases are linked to another 23 confirmed cases (Cases 48, 49, 51, 53, 54, 57, 58, 60, 61, 62, 63, 66, 67, 68, 70, 71, 73, 74, 78, 80, 81, 84, 88) who are linked to the Grace Assembly of God. \n<br>\n<br>b)\tNine of the confirmed cases (Cases 19, 20, 21, 24, 25, 27, 28, 34 and 40) are linked to Yong Thai Hang.&nbsp; \n<br>\n<br>c)\tThree of the confirmed cases (Cases 30, 36 and 39) are linked to the business meeting held at Grand Hyatt Singapore from 20 to 22 January. \n<br>\n<br>d)\tFive of the confirmed cases (Cases 42, 47, 52, 56 and 69) are linked to the Seletar Aerospace Heights construction site. \n<br>\n<br>e)\t14 of the confirmed cases (Cases 93, 95, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 108 and 110) are linked to Wizlearn Technologies Pte Ltd.\n<br>\n<br>f)\t36 of the confirmed cases (Cases 94, 96, 107, 112, 114, 115, 116, 117, 118, 120, 121, 122, 125, 127, 128, 129, 130, 131, 133, 134, 137, 139, 140, 142, 144, 145, 146, 148, 149, 150, 155, 156, 157, 158, 159 and 160) are linked to a private dinner function at SAFRA Jurong on 15 February. \n<br>\n<br>4.\tInvestigations on these clusters are ongoing. In addition to the clusters, our investigations have identified the following links between cases:\n<br>\n<br>•\tCase 44 is linked to Cases 13 and 26;\n<br>•\tCase 72 is linked to Cases 59 and 79; \n<br>•\tCase 50 is linked to Cases 55, 65 and 77; \n<br>•\tCase 75 is linked to Case 41; \n<br>•\tCase 86 is linked to Case 82;\n<br>•\tCase 126 is linked to Case 109; and \n<br>•\tCase 143 is linked to Case 132.\n<br>\n<br>5.\tContact tracing is underway for the other 14 locally transmitted cases to establish any links to previous cases or travel history to affected countries or regions.\n<br>\n<br><strong>Prioritisation of resources at public hospitals\n</strong><br>\n<br>6.\tIn view of the rising number of COVID-19 infections globally, and the expected rise in the number of confirmed cases in Singapore, we will need to prioritise the resources at our public hospitals. \n<br>\n<br>7.\tFrom 7 March 2020, foreigners who are short-term visit pass holders (STVP) who seek treatment for COVID-19 in Singapore will need to pay for their treatment. MOH will continue to waive COVID-19 testing fees for all STVP holders as part of our public health measures to identify and initiate contact tracing for confirmed cases who may have been infectious while in Singapore. \n<br>\n<br>8.\tThe government will continue to pay for the COVID-19 testing fees and hospital bill in full for Singapore Residents and long term pass holders  who are admitted to public hospitals for COVID-19. \n<br>\n<br><strong>About the confirmed cases \n</strong><br>\n<br><span style=\"text-decoration: underline;\">Case 151\n</span><br>\n<br>9.\tCase 151 is a 51 year-old male Singapore Citizen who has no recent travel history to affected countries and regions. He is a contact of Cases 66 and 91, and is linked to the cluster at The Life Church and Missions Singapore. \n<br>\n<br>10.\tHe reported onset of symptoms on 4 February and had sought treatment at a general practitioner (GP) clinic on 5 February and 13 February, and at Yishun Polyclinic on 8 February and 13 February. As he had been identified to have attended the Chinese New Year gathering at Mei Hwan Drive on 25 January, he was referred by MOH to the National Centre for Infectious Diseases (NCID) on 22 February even though he had recovered by then. Subsequent serological test results on 8 March afternoon confirmed that he had an earlier COVID-19 infection.\n<br>\n<br>11.\tHe stays at Yishun Ring Road. \n<br>\n<br><span style=\"text-decoration: underline;\">Case 152\n</span><br>\n<br>12.\tCase 152 is an imported case involving a 65 year-old male Indonesian national who arrived in Singapore on 7 March. He is currently warded in an isolation room at Singapore General Hospital (SGH).\n<br>\n<br>13.\tHe reported onset of symptoms on 28 February while he was in Indonesia, and had sought treatment at a hospital in Jakarta on 2 March. He presented at SGH on 7 March. Subsequent test results confirmed COVID-19 infection on 8 March afternoon.\n<br>\n<br><span style=\"text-decoration: underline;\">Case 153</span>\n<br>\n<br>14.\tCase 153 is likely to be an imported case involving a 65 year-old female Singapore Citizen who had been in Indonesia from 25 February to 28 February. She reported that while she was in Indonesia, she had visited her sister who had pneumonia. She is currently warded in an isolation room at SGH.\n<br>\n<br>15.\tShe reported onset of symptoms on 3 March and had sought treatment at Choa Chu Kang Polyclinic on the same day and on 7 March. She presented at the emergency department at SGH on 7 March, and subsequent test results confirmed COVID-19 infection on 8 March afternoon.\n<br>\n<br>16.\tPrior to hospital admission, she had mostly stayed at her home at Jalan Teck Whye.\n<br>\n<br><span style=\"text-decoration: underline;\">Case 154\n</span><br>\n<br>17.\tCase 154 is an imported case involving a 52 year-old male British national. He arrived in Singapore on 6 March and was confirmed to have COVID-19 infection on 9 March morning and is currently warded in an isolation room at NCID.\n<br>\n<br><span style=\"text-decoration: underline;\">Case 155\n</span><br>\n<br>18.\tCase 155 is a 47 year-old female Malaysian national who is a Singapore Work Pass holder, and who has no recent travel history to affected countries and regions. She was confirmed to have COVID-19 infection on 9 March morning and is currently warded in an isolation room at NCID. She is a contact of Case 128, and is linked to the cluster involving the private dinner function at SAFRA Jurong. \n<br>\n<br><span style=\"text-decoration: underline;\">Case 156\n</span><br>\n<br>19.\tCase 156 is a 50 year-old female Singapore Permanent Resident who has no recent travel history to affected countries and regions. She is currently warded in an isolation room at NCID. She is linked to the cluster involving the private dinner function at SAFRA Jurong.\n<br>\n<br><span style=\"text-decoration: underline;\">Case 157\n</span><br>\n<br>20.\tCase 157 is a 54 year-old female Singapore Permanent Resident who has no recent travel history to affected countries and regions. She was confirmed to have COVID-19 infection on 9 March morning, and is currently warded in an isolation room at NCID. She is a contact of Case 137, and is linked to the cluster involving the private dinner function at SAFRA Jurong.\n<br>\n<br><span style=\"text-decoration: underline;\">Case 158\n</span><br>\n<br>21.\tCase 158 is a 53 year-old female Singapore Citizen who has no recent travel history to affected countries and regions. She was confirmed to have COVID-19 infection on 9 March morning, and is currently warded in an isolation room at Ng Teng Fong General Hospital (NTFGH). She is linked to the cluster involving the private dinner function at SAFRA Jurong.\n<br>\n<br><span style=\"text-decoration: underline;\">Case 159\n</span><br>\n<br>22.\tCase 159 is a 59 year-old male Singapore Citizen who has no recent travel history to affected countries and regions. He was confirmed to have COVID-19 infection on 9 March morning, and is currently warded in an isolation room at NTFGH. He is linked to the cluster involving the private dinner function at SAFRA Jurong.\n<br>\n<br><span style=\"text-decoration: underline;\">Case 160\n</span><br>\n<br>23.\tCase 160 is a five year-old male Singapore Citizen who has no recent travel history to affected countries and regions. He was confirmed to have COVID-19 infection on 9 March morning, and is currently warded in an isolation room at KK Women’s and Children’s Hospital. He is a family member of Case 145, and is linked to the cluster involving the private dinner function at SAFRA Jurong. \n<br>\n<br><span style=\"text-decoration: underline;\">Case 145 (Announced on 8 March)\n</span><br>\n<br>24.\tCase 145 is a 67 year-old female Singapore Citizen who has no recent travel history to affected countries and regions. She is currently warded in an isolation room at NCID. She is a contact of Case 134, and is linked to the cluster involving the private dinner function at SAFRA Jurong.\n<br>\n<br>25.\tShe reported onset of symptoms on 29 February, and had sought treatment at a GP clinic on 3 March and 6 March. She was referred to NCID on 7 March. Subsequent test results confirmed COVID-19 infection on 8 March morning.\n<br>\n<br>26.\tPrior to hospital admission, she had visited a shop at 16 Teck Whye Lane. She stays at Teck Whye Lane. \n<br>\n<br><span style=\"text-decoration: underline;\">Case 146 (Announced on 8 March)\n</span><br>\n<br>27.\tCase 146 is a 64 year-old female Singapore Citizen who has no recent travel history to affected countries and regions. She is currently warded in an isolation room at NCID. She is a contact of Case 134, and is linked to the cluster involving the private dinner function at SAFRA Jurong.\n<br>\n<br>28.\tShe reported onset of symptoms on 4 March, and had sought treatment at a GP clinic on 5 March. She presented at NCID on 7 March, and subsequent test results confirmed COVID-19 infection on 8 March morning.\n<br>\n<br>29.\tPrior to hospital admission, she mostly stayed at her home in the Yio Chu Kang Road area.  \n<br>\n<br><span style=\"text-decoration: underline;\">Case 147 (Announced on 8 March)\n</span><br>\n<br>30.\tCase 147 is an imported case involving a 64 year-old male Indonesian national who arrived in Singapore on 7 March. He is currently warded in an isolation room at NCID. \n<br>\n<br>31.\tHe reported onset of symptoms on 3 March while he was in Indonesia. He had a fever when he arrived at Seletar Airport, and underwent a COVID-19 swab test at the checkpoint. He was conveyed by ambulance to NCID on 7 March night, and subsequent test results confirmed COVID-19 infection on 8 March morning.\n<br>\n<br>32.\tPrior to hospitalisation, he mostly stayed at his rental apartment in the Oxley Road area. \n<br>\n<br><span style=\"text-decoration: underline;\">Case 148 (Announced on 8 March)\n</span><br>\n<br>33.\tCase 148 is a 67 year-old female Singapore Citizen who had been in Indonesia from 11 February to 14 February. She is currently warded in an isolation room at NCID. She is a contact of Case 107, and is linked to the cluster involving the private dinner function at SAFRA Jurong.\n<br>\n<br>34.\tShe reported onset of symptoms on 24 February. As she had been identified as a contact of Case 107, she was referred by MOH to NCID on 2 March. Subsequent test results confirmed COVID-19 infection on 8 March morning.\n<br>\n<br>35.\tPrior to hospital admission, she had visited Marina Bay Sands Casino (10 Bayfront Avenue). She stays at Jalan Lim Tai See. \n<br>\n<br><span style=\"text-decoration: underline;\">Case 149 (Announced on 8 March)\n</span><br>\n<br>36.\tCase 149 is a 62 year-old male Singapore Citizen who has no recent travel history to affected countries and regions. He is currently warded in an isolation room at NCID. He is linked to the cluster involving the private dinner function at SAFRA Jurong.\n<br>\n<br>37.\tHe reported onset of symptoms on 23 February and had sought treatment at a GP clinic on 7 March. He was conveyed in an ambulance to Tan Tock Seng Hospital on 7 March, and subsequent test results confirmed COVID-19 infection on 8 March morning.\n<br>\n<br>38.\tPrior to hospital admission, he had gone for singing classes at various community clubs and residents’ committees. He also visited Tong Whye Temple Senior Citizen Club (306 Jurong East Street 32). He stays at Jurong East Street 32. \n<br>\n<br><span style=\"text-decoration: underline;\">Case 150 (Announced on 8 March)\n</span><br>\n<br>39.\tCase 150 is a 53 year-old female Singapore Permanent Resident who has no recent travel history to affected countries and regions. She is currently warded in an isolation room at NCID. She is a contact of Cases 115 and 134, and is linked to the cluster involving the private dinner function at SAFRA Jurong.\n<br>\n<br>40.\tShe reported onset of symptoms on 29 February. As she had been identified to be a contact of Cases 115 and 134, she was referred by MOH to NCID on 7 March, and subsequent test results confirmed COVID-19 infection on 8 March morning. \n<br>\n<br>41.\tPrior to hospital admission, she had gone for singing classes and other activities at Nanyang Community Club. She stays at Jurong West Street 64.\n<br>\n<br><strong>Update on condition of confirmed cases\n</strong><br>\n<br>42.\tTo date, a total of 93 cases have fully recovered from the infection and have been discharged from hospital. Of the 67 confirmed cases who are still in hospital, most are stable or improving. Ten are in critical condition in the intensive care unit. \n<br>\n<br><strong>Update on contact tracing for confirmed cases</strong> \n<br>\n<br>43.\tContact tracing for the confirmed cases is ongoing. Once identified, MOH will closely monitor all close contacts. As a precautionary measure, they will be quarantined for 14 days from their last exposure to the patient. In addition, all other identified contacts who have a low risk of being infected will be under active surveillance, and will be contacted daily to monitor their health status. \n<br>\n<br>44.\tAs of 9 March 2020, 12pm, MOH has identified 3,784 close contacts who have been quarantined. Of these, 724 are currently quarantined, and 3,060 have completed their quarantine. \n<br>\n<br><strong>Health advisory\n</strong><br>\n<br>45.\tSingaporeans are advised to defer all travel to Hubei Province and all non-essential travel to mainland China, Iran, northern Italy, Japan and the Republic of Korea. \n<br>\n<br>46.\tAll travellers should monitor their health closely for two weeks upon return to Singapore and seek medical attention promptly if they feel unwell. Travellers should inform their doctor of their travel history. If they have a fever or respiratory symptoms (e.g. cough, shortness of breath), they should wear a mask and call the clinic ahead of the visit.\n<br>\n<br>47.\tTravellers and members of the public should adopt the following precautions at all times: \n<br>\n<br>•\tAvoid close contact with people who are unwell or showing symptoms of illness; \n<br>•\tObserve good personal hygiene; \n<br>•\tPractise frequent hand washing with soap (e.g. before handling food or eating, after going to toilet, or when hands are dirtied by respiratory secretions after coughing or sneezing); \n<br>•\tWear a mask if you have respiratory symptoms such as a cough or shortness of breath; \n<br>•\tCover your mouth with a tissue paper when coughing or sneezing, and dispose the soiled tissue paper in the rubbish bin immediately; and \n<br>•\tSeek medical attention promptly if you are feeling unwell.\n<br>\n<br>48.\tMOH will continue to monitor the situation closely. As medical practitioners are on the lookout for suspect cases, Singapore is likely to see more cases that will need to be investigated. \n<br>\n<br>\n<br><strong>MINISTRY OF HEALTH\n<br>9 MARCH 2020\n</strong><br>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "three-more-cases-discharged-ten-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}