{"pressItemDictionary": {"Press Releases": [{"Title": "Tracetogether and Safeentry to Be Enhanced In Preparation for Further Opening of the Economy", "PublishedDate": "/Date(1599651000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "09 Sep 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\"><span style=\"font-family: Arial;\"><span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;The TraceTogether (TT) Programme has helped to raise the speed and effectiveness of our contact tracing. We will commence nation-wide distribution of TT Tokens starting from 14 September and aim to complete the distribution by November. This will enable more Singapore residents to be protected by the TT Programme, particularly the elderly who may not have a suitable smart phone to operate the App.<br><br>2&nbsp; &nbsp; &nbsp;We will enhance SafeEntry to work more closely with TT. For certain venues with higher-risk activities such as larger-scale business-to-business events, SafeEntry will require the TT App or Token to check in. Supplementing SafeEntry with proximity data from TT will enhance safety for participants, as they will be ensured of coverage under the TT Programme. This “TT-only SafeEntry” will first be piloted at selected venues, and will be expanded over time once the national distribution of the TT Tokens is well underway.&nbsp;<br><br>3&nbsp; &nbsp; &nbsp; &nbsp; From 10 September, a new Self-Check service and SMS service will be launched so that people can be alerted if they have visited the same venues at the same time as COVID-19 cases. Both services will be based on individuals’ SafeEntry records.<br><br>4&nbsp; &nbsp; &nbsp; &nbsp; These measures will support the further opening of the economy by ensuring more effective contact tracing for the community.<br><br><strong>TT PROGRAMME HAS AUGMENTED THE CONTACT TRACING PROCESS</strong><br><br>5&nbsp; &nbsp; &nbsp; &nbsp;The TT Programme – comprising the TT App on smart phones and the TT Token – provides the initial list of close contacts of COVID-19 positive cases. Together with SafeEntry and associated digital systems, the TT Programme has enabled the contact tracing teams to reduce the time taken to identify and quarantine a close contact, from 4 days to less than 2 days currently. TT has also expanded the coverage of contact tracing, and has reduced the possibility of a close contact being inadvertently left out of quarantine.&nbsp;<br><br><strong>TT TOKEN DISTRIBUTION TO THE GENERAL PUBLIC TO START FROM 14 SEP 2020</strong><br><br>6&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;The first batch of TT Tokens was distributed to 10,000 vulnerable seniors from 28-30 June. In a survey conducted by the Silver Generation Office, close to 90% of the recipients found it convenient to carry the Token with them when they leave home, and more than 70% would bring the Token out most of the time.<br><br>7&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Over the next few months, the Government will begin nation-wide distribution of TT Tokens to the general public at community sites. As the elderly are at greater health risk from COVID-19, and are also less likely to own a smart phone, distribution of the Tokens will begin at communities with higher concentrations of elderly. Distribution will start in the Jalan Besar and Tanjong Pagar regions, at 20 community centres/clubs (CCs) from 14 September 2020 .&nbsp;<br><br>8&nbsp; &nbsp; &nbsp; The distribution exercise will be progressively extended throughout Singapore, according to the tentative schedule listed in <a href=\"/docs/librariesprovider5/default-document-library/annex-a53ebf72b9f554a37868783e876666d7a.pdf?sfvrsn=8b4981e4_0\" title=\"Annex A\">Annex A</a>. As the actual distribution progresses, scheduled dates might be adjusted. Residents can go to the TokenGoWhere website (<a href=\"https://token.gowhere.gov.sg/\" title=\"\" class=\"\" target=\"\">https://token.gowhere.gov.sg</a>) to find the latest schedule and locate a site convenient for them. Residents can also refer to community notice boards, digital display panels, or their local CC social media channels for more information on the distribution exercise. Those who do not mind travelling further and wish to collect the Token earlier can visit any of the sites listed on the TokenGoWhere website to do so.&nbsp;<br><br>9&nbsp; &nbsp; &nbsp; &nbsp; Besides the elderly, individuals who do not have a smart phone on which to download the TT App will benefit from using the Token. The Tokens also provide an option for those who prefer a separate device to contribute to the national effort to support digital contact tracing, rather than downloading the App on their phone.&nbsp;&nbsp;<br><br>10&nbsp; &nbsp; &nbsp; &nbsp; More details about the TT Token can be found in <a href=\"/docs/librariesprovider5/default-document-library/annex-bcd14ef8c896f404b9c73dd77b1e037bc.pdf?sfvrsn=971a3cdf_0\" title=\"Annex B\">Annex B</a>.&nbsp;<br><br><strong>TRACETOGETHER-ONLY SAFEENTRY CHECK-IN FOR DESIGNATED PLACES</strong><br><br>11&nbsp; &nbsp; &nbsp; &nbsp;Since 3 July 2020, GovTech has updated the TT App to enable the App to be used for SafeEntry check-in by scanning the QR code of the activity or venue through the App.&nbsp;<br><br>12&nbsp; &nbsp; &nbsp; Starting from October 2020, larger-scale business-to-business (B2B) events such as meetings and conferences that are being piloted will require all participants to have a TT App or Token to conduct SafeEntry check-in. SNDGG and MOH will work with the event organisers to ensure that TT Tokens are available on-site for distribution and registration for individuals without the TT App. This was trialled at the first MICE pilot event held at the end of August which was attended physically by Singapore-based attendees, and virtually by international attendees.&nbsp; &nbsp;&nbsp;<br><br>13&nbsp; &nbsp; &nbsp;Beyond the B2B events, more activities and venues would progressively trial TT-only SafeEntry to make such activities safer for the rest of Singapore by reducing the risk of onward spread, and facilitating future relaxations where possible. These are settings where there may be close interaction among attendees, where masks may not be worn at all times due to the nature of the activities, and/or where there is high human traffic that is harder to monitor. This would include venues such as hotels (e.g. for wedding functions), F&amp;B outlets, cinemas, gyms and certain workplaces. As such settings have the potential to spark off large outbreaks from a single positive COVID-19 case that spread beyond the activity or venue, the use of TT can facilitate rapid and comprehensive contact tracing to stem onward spread.&nbsp;<br><br>14&nbsp; &nbsp; &nbsp; &nbsp; To give the public time and opportunity to collect the Token, we will first implement TT-only SafeEntry at a few selected venues (where TT Tokens will be distributed on-site for those who need them). We will progressively expand TT-only SafeEntry to other venues only after the national distribution of the TT Tokens is well underway. We are also working with the private sector who are interested in supplying contact tracing tokens to companies, to ensure that these Tokens and the national TT Token can mutually detect one another and contribute to a unified contact tracing ecosystem.&nbsp;<br><br>15&nbsp; &nbsp; &nbsp; &nbsp;Where TT-only SafeEntry is implemented, SafeEntry check-in must be performed either by (a) scanning the activity or venue QR code using the TT App on your mobile phone; or (b) having the activity organisers or venue staff scan the unique QR code on the TT Token registered to you.&nbsp;&nbsp;<br><br>16&nbsp; &nbsp; &nbsp; &nbsp;GovTech will also be testing new solutions that can help increase the convenience and improve the user experience of TT-only SafeEntry.&nbsp;<br><br><strong>NEW SERVICE LAUNCHED FOR PUBLIC TO SELF-MONITOR HEALTH BASED ON SAFEENTRY RECORDS</strong><br><br>17&nbsp; &nbsp; &nbsp;MOH currently publishes a list of public locations visited by COVID-19 cases during their infectious period.&nbsp;<br><br>18&nbsp; &nbsp; &nbsp; &nbsp;Responding to public feedback, we will introduce a SafeEntry Location Matching Self-Check service for individuals to check whether they have been in close proximity to COVID-19 cases, based on their own SafeEntry records. This Self-Check service will be available on an updated version of the TT App that is available from 10 September. Individuals can also access the Self-Check service via SingPass Mobile, or at <a href=\"https://wereyouthere.safeentry.gov.sg\" title=\"\" class=\"\" target=\"\">https://wereyouthere.safeentry.gov.sg</a>&nbsp;(with SingPass login).<br><br>19&nbsp; &nbsp; &nbsp; &nbsp; In addition, SMS notification alerts will be sent to a smaller group of individuals who were at locations that are assessed to pose a higher risk of transmission, such as dining places and gyms where people do not wear masks for extended periods of time. Those whose SafeEntry check-in and check-out timings overlap with the COVID-19 case in such locations will receive an SMS alert. The SMS notification service will begin from 10 September.<br><br>20&nbsp; &nbsp; To ensure the accuracy of the Self-Check service and SMS service, we need businesses to provide accurate SafeEntry address records, including postal codes. Individuals are reminded to provide updated phone numbers for their TT App (or SingPass Mobile/ SafeEntry QR webform, as the case may be). Individuals should check-in and check-out of locations promptly using SafeEntry to avoid any erroneous notifications from these 2 services. This also helps our contact tracers more accurately establish links and transmission chains. Please refer to <a href=\"/docs/librariesprovider5/default-document-library/annex-cdd3a6e8a37374d99bbf5c5471f042d51.pdf?sfvrsn=71ed6f6c_0\" title=\"Annex C\">Annex C</a>&nbsp;for details on who will receive the targeted SMS, and who will be able to access SafeEntry records for the Self-Check service.<br><br>21&nbsp; &nbsp; &nbsp; &nbsp;The above measures and features will help prepare us for the further reopening of our economy and society. By actively participating in the TT Programme and using SafeEntry, we can all play our part to stay ahead of the pandemic and keep ourselves and our loved ones safe.</span></span></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "tracetogether-and-safeentry-to-be-enhanced-in-preparation-for-further-opening-of-the-economy", "CurrentPageUrl": null}, {"Title": "Further Resumption of Activities for Seniors", "PublishedDate": "/Date(1599649200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "09 Sep 2020", "Summary": "", "MainContent": "1.&nbsp; &nbsp; &nbsp; The Multi-Ministry Taskforce will be resuming more senior-centric activities carefully as community infection rates have remained generally low and stable. As more activities resume, we urge seniors to remain vigilant, conscientiously practise hand hygiene and safe distancing and to continue to keep to a small regular circle of contacts when going out.<br><br><strong>Resuming activities to address the psycho-social needs of seniors&nbsp;</strong><br><br>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Small group activities of up to 5 pax may resume for senior-centric programmes organised by the People's Association, Health Promotion Board, Sport Singapore, and the Council for Third Age. They will also be allowed to resume in our eldercare facilities (i.e. Nursing Homes, Senior Care Centres, Active Ageing Hubs, Senior Activity Centres, Community Resource, Engagement and Support Team centres). Examples of group activities include board games and group exercise classes. At the start of Phase Two, we had limited activities in such settings to only those that can be done individually so as to keep interactions low. Nevertheless, group activities are an integral part of senior-centric programmes as they help address psychosocial needs and contribute to better health outcomes. From 9 September 2020, we will ease the earlier restrictions so that more seniors can benefit from these programmes, so long as safe distancing measures are in place.<br><br><strong>Outreach activities by eldercare programmes and Silver Generation Office to resume</strong><br><br>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We will also resume proactive outreach by Silver Generation Ambassadors, Senior Activity Centres, Community Resource, Engagement and Support Teams and diabetes outreach activities from 9 September 2020 with safe distancing measures in place. While health and social care services are available, some seniors may not know where to seek help and may have deferred accessing community care services. This would affect their health if the deferment is prolonged. We will resume outreach programmes to ensure we can proactively engage seniors with care needs and render assistance in a timely manner.<br><br><strong>Staying safe and healthy in the new COVID-normal</strong><br><br>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; During this COVID-19 pandemic, some seniors may be hesitant to go for medical appointments for fear of being exposed to COVID-19 at healthcare institutions or care facilities. To avoid potential deterioration of their medical conditions and allow for timely attention to other health needs, we urge seniors to continue to attend their medical appointments. Healthcare providers would have put in place the necessary precautions for patients to access services and receive treatments safely. Older patients in need of assistance may reach out to their respective public healthcare institutions or contact the AIC Hotline at 1800-650-6060.<br><br>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We will continue to monitor the situation closely, with the aim of continuing to ease measures until we reach a new normal in Phase Three. We will be able to stay safe and progress towards a new normal so long as everyone plays their part and exercises social responsibility.", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "further-resumption-of-activities-for-seniors", "CurrentPageUrl": null}, {"Title": "Strengthening Measures for Safe Re-opening  of Activities", "PublishedDate": "/Date(1599648900000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "09 Sep 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;The Multi-Ministry Taskforce (MTF) has been closely monitoring the local and global COVID-19 situation. While local community transmission is currently low, we cannot let our guard down. The MTF will continue to review the latest evidence on COVID-19, and put in place strategies to manage new infections at the dormitories, ensure a calibrated safe reopening of activities including enhancing our TraceTogether (TT) programme and SafeEntry, and safe reopening of our borders.</p><p><strong>Management of Dormitory Cases</strong></p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We have observed cases of COVID-19 infections among the cleared dormitories. The dormitory residents who have never been infected remain susceptible to COVID-19. Since the dormitories were declared cleared on 11 August, there have been about 45 of such cases daily. These were detected primarily through active surveillance testing such as Rostered Routine Testing (RRT), and through aggressive tracing and testing whenever a new case is detected. About 2% of these cases have positive serological tests, which indicate past infections.</p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The Ministry of Manpower (MOM) has put in place<strong> </strong>a multi-layered strategy to detect any new COVID-19 cases in the dormitories and to contain infections quickly and decisively:</p><p style=\"margin-left: 40px;\">a.&nbsp;&nbsp;&nbsp; To prevent the spread and formation of large clusters, MOM has put in place “Safe Living, Safe Working and Safe Rest Day” measures in the dormitories. Before dormitory residents are allowed to return to work, the dormitory operators have to implement various physical distancing measures in the dormitories to limit inter-mixing of residents across rooms, levels and blocks, as well as when using common facilities and during transport to and from worksites. Dormitory operators must also monitor their residents’ health and take necessary precautions, so that residents who are unwell are quickly isolated and provided with medical treatment.</p><p style=\"margin-left: 40px;\">b.&nbsp;&nbsp;&nbsp; To swiftly detect new cases of infection, MOM has deployed a number of strategies including (i) self-monitoring by migrant workers and regular updating of their health status; (ii) close monitoring of workers who report sick at medical posts with acute respiratory illnesses; (iii) conducting wastewater testing at selected dormitories for traces of the virus as a means of early sentinel surveillance; and (iv) conducting RRT for dormitory residents every 14 days. In particular, the RRT has helped to pick up new COVID-19 cases in the dormitories. It is therefore critical for employers to enrol all their workers who are required to be tested under the RRT.</p><p style=\"margin-left: 40px;\">c.&nbsp;&nbsp;&nbsp;&nbsp; If a new case is detected, MOM will quickly ring-fence and test close contacts to contain its spread. Close contacts will be quarantined and must be tested negative at the end of their quarantine period before they are able to return to work. Aggressive testing operations will also be conducted within the dormitories based on an assessment of the risk of potential spread.</p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; MOM will continue to update and adjust its multi-layered strategy to proactively manage cases in the dormitory, in consultation with health experts as new insights are gained about how the virus spreads. MOM will also continue to engage employers and dormitory operators on the measures to safeguard our migrant workers.&nbsp;</p><p><strong>Enhancement to TT Programme and SafeEntry</strong></p><p>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; To support the safe and gradual resumption of activities, the MTF will also be enhancing the TT Programme and SafeEntry to facilitate rapid and comprehensive contact tracing, so as to mitigate risks of onward transmission and formation of large clusters.</p><p><u>TT Token Distribution to the General Public</u></p><p>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; To enable more Singapore residents to be protected by the TT Programme, the Government will commence nation-wide distribution of the TT Tokens from 14 September 2020,<strong> </strong>and we aim to complete the distribution by November. The TT Token is available for free for all residents in Singapore. We encourage every resident in Singapore to either download the TT App onto their mobile phone, or to collect a TT Token. A higher adoption rate makes the TT programme and contact tracing efforts more efficient and effective.</p><p>7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We will begin distribution starting with the Jalan Besar and Tanjong Pagar regions, where there is a higher concentration of elderly who may have more challenges using the TT App and are more vulnerable to COVID-19. Collection points will be extended throughout Singapore progressively. Residents can go to the TokenGoWhere website (https://token.gowhere.gov.sg) for more details on the collection sites and timing. Those who wish to collect the Token earlier can visit any of the active collection sites listed on the TokenGoWhere website to do so.</p><p><u>Pilot TraceTogether-Only SafeEntry Check-in for Designated Places</u></p><p>8.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; To facilitate contact tracing efforts,<strong> </strong>we will be<strong> </strong>piloting the deployment of SafeEntry that requires the use of either the TT App or Token to check in at selected venues, to facilitate the further easing of measures at these settings.</p><p>9.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; This “TT-only SafeEntry” will first be piloted at selected venues, and will be expanded over time, once the national distribution of the TT tokens is well under way. These could include venues where there may be larger groups coming together, especially where there is close interaction among attendees; or where masks may not be worn at all times due to the nature of the activities. Supplementing SafeEntry with proximity data from TT will enhance safety for participants, as they will be ensured of coverage under the TT Programme. This will ensure better confidence in mitigating the risk of formation of large clusters, and could allow for a safer increase in capacity limits at these events and premises with any potential future easing of measures.<strong> </strong>This was trialled at the first Meetings, Incentives, Conferences and Exhibitions (MICE) event held at the end of August, with more pilots&nbsp;starting progressively from September 2020.</p><p><u>New Service launched to Self-Monitor Health based on SafeEntry Records</u></p><p>10.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; From 10 September, we will introduce a new Self-Check service and SMS service so that people can be alerted if they have visited the same venues at the same time as COVID-19 cases, based on their own SafeEntry records.</p><p>11.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Self-Check service will be available on the TraceTogether app. Individuals can also access the Self-Check service via SingPass Mobile, or wereyouthere.safeentry.gov.sg (with SingPass login). In addition, from 10 September, SMS alerts will be sent to a smaller group of individuals who were at locations assessed to pose a higher risk of transmission at the same time as COVID-19 cases. These include dining places and gyms where people do not wear masks for extended periods of time.</p><p>12.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; These features will help everyone to play their part to stay ahead of the pandemic, and keep ourselves and our loved ones safe. The Smart Nation and Digital Government Group (SNDGG) will be providing more details on the various TT and SafeEntry measures in a separate press release.&nbsp;&nbsp;</p><p><strong>Safe Re-opening of Activities</strong></p><p><strong></strong><u>Enabling More Workers to Return to Workplaces Safely</u></p><p>13.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; MOM is working with tripartite partners on the next phase of Safe Management Measures (SMMs) for workplaces. As we gradually resume more economic activities, many employers have sought guidance on ways to enable more employees to return to the workplace safely so as to better support work and business operations. With increased interactions at the workplace, the risk of COVID-19 transmission increases. Therefore it is critical that employers implement their safe management measures seriously, and ensure that safe distancing is adhered to.</p><p>14.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Further, employers need to implement flexible workplace hours, so that a good part of workers are able to travel off-peak, i.e. after 0930 hours. This would help to mitigate the risk of crowding in public places as well as office buildings with more individuals commuting to and from work especially during peak hours. It is in the interest of the employers to protect your workers against the risk of COVID-19. Otherwise, if a cluster is formed at the workplace, it would disrupt business severely.</p><p><u>Stepping up Enforcement of SMM Breaches at Food and Beverage (F&amp;B) outlets</u></p><p>15.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We remain very concerned about SMM breaches at F&amp;B outlets. Dining out is an activity that involves considerable risks because people are gathered together in an enclosed space, without their masks on, and for a prolonged duration. That is why the SMMs are in place to ensure that our F&amp;B outlets can be safe spaces for all.&nbsp; While the majority are complying with the rules, we continue to observe SMM breaches at some F&amp;B outlets, especially those at popular nightspots. These breaches include the sale and consumption of alcohol after 10.30pm, individuals not wearing masks as required, gathering in groups of more than five and intermingling between groups (especially in a private room), seating customers less than one-metre apart, and the playing of loud music.</p><p>16.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; For example, Enterprise Singapore fined five establishments for failing to ensure a minimum one-metre safe distance between groups of diners on 6 September 2020; Singapore Food Agency (SFA) issued fines and suspended the operations of a bar and two restaurants for SMM breaches last week, and Singapore Tourism Board (STB) ordered a restaurant to cease operations for flouting SMMs on 5 September 2020. Since the start of Phase II, around 20 F&amp;B establishments have been suspended.</p><p>17.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We will continue to step up enforcement checks at F&amp;B outlets and will take appropriate action against businesses and individuals who breach the SMMs. Thus far, agencies have typically issued warnings for the first offence. By now, sufficient time has been given for everyone to adjust to the SMMs.&nbsp; So with immediate effect, agencies will take enforcement actions even for the first offenders. This will be in the form of a fine or a closure of the premise, depending on the severity of the offence.&nbsp; For example, if there are multiple breaches of SMMs in any one place, we will require the premise to be closed and also surface the case to the Attorney-General’s Chambers (AGC) for possible prosecution. We urge premise owners to ensure SMMs are properly implemented and members of the public to be socially responsible, and do their part to observe the SMMs.</p><p><strong>Requiring Pre-Departure Tests (PDT) for Travellers from India</strong></p><p>18.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We have been closely monitoring the COVID-19 situation in India. There have been reports of a resurgence of infections in India. Singapore has also observed a significant number of imported cases with recent travel history to India.</p><p>19.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; To reduce the risk of importation of cases from India,<strong> </strong>travellers who are not Singapore Citizens or Permanent Residents and who have recent travel history to India within the last 14 days prior to entry will be required to take a COVID-19 polymerase chain reaction (PCR) test within 72 hours before departure. Travellers will need to present a valid negative COVID-19 test result as a condition of approval to enter Singapore. This requirement will take effect for those arriving in Singapore from 17 September 2020, 0000 hours, and will apply on top of the existing requirements of a 14-day Stay-Home Notice (SHN) at dedicated SHN facilities and a negative COVID-19 test before the end of their SHN.</p><p>20.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; As the global situation evolves, we will continue to adjust our border measures to manage the risk of importation and any onward transmission to the community. Travellers planning to enter Singapore should be prepared to be subjected to the prevailing border measures upon entry, including payment for their stay at dedicated SHN facilities and tests, where applicable.</p><p><strong>Everyone Plays a Part</strong></p><p>21.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; To keep Singapore COVID-safe, everyone, including individuals and business owners, will need to play their part, by adhering to the safe distancing measures and SMMs in place. We also urge everyone to see a doctor if they are unwell. Together, we can ensure continued safe reopening of activities and borders, while keeping ourselves and our loved ones safe.</p><p><strong>&nbsp;</strong></p><p><strong>&nbsp;</strong></p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "strengthening-measures-for-safe-re-opening-of-activities", "CurrentPageUrl": null}, {"Title": "75 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1599637200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "09 Sep 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As of 9 September 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 75 cases of COVID-19 infection in Singapore. Based on our investigations so far, there is 1 case in the community, who is a Work Pass holder.</p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; There are 14 imported cases, who had all been placed on Stay-Home Notice upon arrival in Singapore.&nbsp;<br></p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Amongst the 60 cases residing in dormitories today, 31 are from Westlite Toh Guan dormitory, the vast majority of whom had been placed on quarantine earlier and were tested during quarantine to determine their status. The remaining cases were detected through surveillance testing, such as our bi-weekly Rostered Routine Testing. This allows us to pick up cases in the dormitory early, including asymptomatic ones, so that we are able to ring-fence them quickly to prevent further transmission.<br></p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.<br></p><p><br><strong>MINISTRY OF HEALTH<br>9 SEPTEMBER 2020</strong></p><p style=\"text-align: justify;\">&nbsp;</p><div><br></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "75-new-cases-of-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}