{"pressItemDictionary": {"Press Releases": [{"Title": "33 More Cases Discharged; 528 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1588086480000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "28 Apr 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;As of 28 April 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 528 cases of COVID-19 infection in Singapore. The breakdown is as follows: </p> <p><strong>a) Imported cases: 0<br></strong>There are no imported cases today.</p><p><p><strong>b) Cases in the community: 10 </strong>(7 Singaporeans/Permanent Residents [1], 2 Work Passes, 1 Visit Pass)</p></p><p><p>The number of new cases in the community has decreased, from an average of 28 cases per day in the week before, to an average of 17 per day in the past week. The number of unlinked cases in the community has also decreased, from an average of 18 cases per day in the week before, to an average of 10 per day in the past week.&nbsp;We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.</p><p><strong>c)&nbsp;</strong>&nbsp;<strong>Work Permit holders (residing outside dormitories): 7<br><br></strong>The number of new cases amongst Work Permit holders residing outside dormitories has decreased, from an average of 25 cases per day in the week before, to an average of 20 per day in the past week.&nbsp;<br><br><strong>d)&nbsp;Work Permit holders (residing in dormitories): 511</strong></p></p> <p>The main increase today continues to be for Work Permit holders residing in dormitories, where we are picking up many more cases because of extensive testing. Most of these cases have a mild illness and are being monitored in the community isolation facilities or general ward of our hospitals. None of them is in the intensive care unit.</p> <p>2.&nbsp; &nbsp; &nbsp; Details of these trends can be found in MOH’s daily situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\">www.moh.gov.sg/covid-19/situation-report</a>). Please refer to <u><a href=\"/docs/librariesprovider5/default-document-library/annex-a271de619700d47998412071716c4785d.pdf?sfvrsn=2dcc0e3e_0\" title=\"Annex A\">Annex A</a></u> for the summary of the confirmed cases.</p><p><p>3.&nbsp; &nbsp; &nbsp;Of the new cases, 83% are linked to known clusters, while the rest are pending contact tracing.<br><br><strong>Links between previous cases found</strong></p></p><p><p>4.&nbsp; &nbsp; In the past week (21 April to 27 April), MOH has uncovered links for 1,203 previously unlinked cases.</p></p><p><p>5.&nbsp; &nbsp; Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <u><a href=\"/docs/librariesprovider5/default-document-library/annex-bc0df169eec53416abf2f33e252966eee.pdf?sfvrsn=d9fef80d_0\" title=\"Annex B\">Annex B</a></u> for details.</p></p><p><p><strong>Cases from public healthcare sector</strong></p><p><u>Case 14693</u></p><p>6.&nbsp; &nbsp; Case 14693 is a 24 year-old male Singapore Permanent Resident who has no recent travel history to affected countries or regions. He reported onset of symptoms on 27 April, and subsequent test results confirmed COVID-19 infection on the same day. He is currently warded at Changi General Hospital (CGH).</p></p><p><p>7.&nbsp; &nbsp; He is employed as a nurse at CGH but had not gone to work since onset of symptoms.</p></p><p><p><strong>Update on condition of confirmed cases</strong></p><p>8.&nbsp; &nbsp; 33 more cases<span style=\"font-size: 9.02778px;\">&nbsp;[2]</span>&nbsp;of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 1,128 have fully recovered from the infection and have been discharged from hospitals or community isolation facilities.</p></p><p><p>9.&nbsp; &nbsp; There are currently 1,689 confirmed cases who are still in hospital. Of these, most are stable or improving, and 21 are in critical condition in the intensive care unit. 12,120 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 14 have passed away from complications due to COVID-19 infection.</p></p><div> <p><strong>MINISTRY OF HEALTH</strong></p> <p><strong>28 APRIL 2020</strong></p></div><div> <hr align=\"left\" size=\"1\" width=\"33%\"> <div id=\"ftn1\"> <p>[1] Updated from the afternoon press release as one case had been re-classified following contact tracing.</p> </div> <div id=\"ftn2\"> <p>[2] Cases 658, 685, 761, 811, 813, 820, 914, 950, 1007, 1016, 1053, 1409, 1454, 1461, 1607, 1618, 1624, 1633, 1961, 2107, 2235, 4680, 4893, 2283, 4053, 4401, 4802, 4926, 5262, 7436, 8407, 8790 and 10407.</p> </div> </div>", "PressCategory": ["Press Releases"], "CustomDetailUrl": "", "UrlName": "33-more-cases-discharged-528-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "Comprehensive Medical Strategy for Covid-19", "PublishedDate": "/Date(1588070400000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "28 Apr 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;The Multi-Ministry Taskforce has a comprehensive medical strategy to ensure that individuals infected with COVID-19 receive prompt and quality medical treatment. Since the start of the outbreak, a total of 1,095 COVID-19 patients, out of 14,423 confirmed cases, have recovered and been discharged. The number of COVID-19 related deaths has remained low, at 14 deaths.<sup>[1]</sup>&nbsp;Our healthcare workers will continue to do their best to keep the complications and deaths arising from COVID-19 as low as possible.&nbsp;<br><br><strong>Medical Plan<br><br></strong>2.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;The clinical and scientific data from managing COVID-19 patients, as well as the current epidemiological evidence on the infection, have provided the bases for a comprehensive medical plan. The plan guides the admission of patients into the appropriate tiered facilities for medical care and support, the transfer of patients between these facilities according to their needs, and the discharge of patients who are well and no longer infectious. The aim here is to deploy our medical resources optimally so as to prevent our healthcare system from being overwhelmed.<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;The majority of patients picked up by our testing have mild or no symptoms. Such patients are generally admitted to a Community Care Facility (CCF) where most recover with minimal intervention. Patients in these facilities are monitored closely in case they need to be transferred to hospital for better management and support. Those with severe conditions are cared for in Intensive Care Units (ICU). Such patients may display serious symptoms or have other risk factors and co-morbidities. As of 27 April, 12pm, there are 1,451 COVID-19 cases in hospitals, and 20 in ICU.<br><br>4.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Infectious disease experts have studied the progression of COVID-19 infections in patients. Patients who remain well at Day 14 of illness are likely to remain clinically stable and generally do not require any further medical care. We transfer such patients to a step-down Community Recovery Facility (CRF). Those who have been previously admitted into our hospitals may also be transferred to a CRF when they recover from their acute illness.<br><br>5.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;To support this plan, we have established a number of CCFs and CRFs. We have also augmented our healthcare workforce and deployed them to provide the appropriate level of care in the different facilities and settings, according to the needs of patients.<br><br><strong>Scaling Up of Medical Facilities<br><br></strong>6.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Persons with acute respiratory infections but are clinically well are issued with five-day medical certificates and are asked to isolate themselves at home. Those who meet the clinical case definitions for COVID-19 are tested and asked to self-isolate at home as they await their test results. Those who are unable to self-isolate in their homes can do so in a Swab Isolation Facility (SIF) while awaiting their test results. To date, we have built a capacity of 4,000 beds in the SIFs, in locations such as Civil Service Club @ Loyang and hotels. Those who are clinically unwell are referred immediately to hospitals for further assessment and treatment.<br><br>7.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;The CCF capacity has been rapidly increased, starting with about 500 beds at D’Resort NTUC to about 10,000 spaces currently, including at the Singapore EXPO and Changi Exhibition Centre. We are continuing to expand our CCFs, aiming to double their capacity to 20,000 beds by end-June. This includes the CCFs we are setting up within some of the migrant worker dormitories so that workers with mild symptoms can be quickly isolated and monitored, with the medical posts deployed in the dormitories providing the necessary medical support.<br><br>8.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;We now have a capacity of over 2,000 beds in CRF sites, situated in several SAF camps. We have started to move some patients from CCF to CRF and will monitor their progress with a view to scaling up the CRF to accommodate more patients. We intend to ramp up our CRF capacity to more than 10,000 beds by end-June.<br><br>9.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;To ensure that there is available hospital capacity to care for COVID-19 patients, public hospitals have postponed non-urgent elective procedures. New capacity in isolation wards and intensive care units have been created by repurposing existing beds and hospital facilities, and acquiring additional medical equipment such as ventilators. In addition, public hospitals have established collaborations with private sector healthcare providers to provide further treatment capacity, and to help care for existing patients with chronic medical conditions. Private hospitals continue to support our public hospitals in attending to patients with less serious acute clinical conditions. Healthcare institutions have also started teleconsultation services for follow-up on their patients.<br><br><strong>Augmenting our Healthcare Workforce<br><br></strong>10.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;This expansion of our medical facilities has to be supported by a healthcare workforce. We have taken a two-pronged approach: One, we have tapped on private sector healthcare professionals, retirees and volunteers; and two, we are making full use of technology as an enabler.<br><br>11.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;The Ministry of Health (MOH) has sought the support of healthcare professionals in the private sector, and encouraged them to join the newly launched SG Healthcare Corps. Since its launch on 7 April, about 3,000 healthcare professionals across all job groups have signed up. MOH will be expanding the SG Healthcare Corps to include more healthcare professionals, as well as non-healthcare professionals. We are also re-deploying manpower from industries affected by COVID-19 to enable them to take on new roles in our hospitals. For example, Singapore Airlines (SIA) cabin crew are filling the role of care ambassadors. They provide administrative support and attend to patients, under the supervision of nursing staff.<br><br>12.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;We are also leveraging technology to deliver the same or enhanced outcomes with less time and effort. For instance, round-the-clock care in CCFs is made possible by the use of medical kiosks and teleconsultations. Devices such as pulse oximeters and health apps are used to monitor patient well-being.<br><br><strong>Whole-of-Society Effort<br><br></strong>13.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;We have been able to mobilise our medical facilities and provide such enhanced support within a very short time because of a Whole-of-Society effort, bringing together government agencies and the private sector.</p> <ul><li>For example, the CCF site at Singapore Expo was made possible through the hard work of people across multiple organisations including Temasek Holdings, Singapore Expo (as venue operator), Surbana Jurong (to set up the facility), IHiS (tech enablement such as care management, electronic medical records and vital signs monitoring), Resorts World Sentosa (as managing agent), PSA (project management), ST Engineering (tech solutions), Certis Cisco (to provide security), Parkway Pantai, Woodlands Health Campus and the Singapore Armed Forces (to provide the medical teams).</li><li>Likewise, the CCF at Changi Exhibition Centre was set up and run by MINDEF-affiliated organisations, along with partners such as Experia Events (venue owner), Surbana Jurong (as design consultant), the Defence Science and Technology Agency as well as DSO National Laboratories (tech solution providers like temperature screening and cleaning of PPEs), ST Engineering (to provide robots for food delivery), Mandarin Oriental (managing agent) and Raffles Medical Group (for medical care). &nbsp;<p>&nbsp;</p></li></ul> <p>14.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;We appreciate the contributions of everyone who has worked round the clock to make all this happen, and who are continuing to serve in different roles in our national medical plan. Through their combined efforts, we are able to take care of all infected patients, and ensure we have sufficient healthcare capacity for the longer term. COVID-19 may be with us for a long time, and we must have sufficient capacity to care for everyone who is ill. The expanded healthcare facilities and manpower will put us on a strong footing as we plan ahead for the gradual relaxation of the circuit breaker measures.</p> <div><br clear=\"all\"> <hr align=\"left\" size=\"1\" width=\"33%\"> <div id=\"ftn1\"> <p><sup>[1]</sup>&nbsp;As of 27 April 2020, 12pm. </p> </div> </div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "comprehensive-medical-strategy-for-covid-19", "CurrentPageUrl": null}, {"Title": "528 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1588057740000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "28 Apr 2020", "Summary": "&nbsp;", "MainContent": "<p align=\"center\" style=\"text-align: left;\"><span style=\"text-align: left;\">As of 28 April 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 528 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders residing in foreign worker dormitories. Eight cases are Singaporeans/ Permanent Residents.</span><br></p> <p style=\"text-align: left;\">2&nbsp; &nbsp; &nbsp; &nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.</p>", "PressCategory": ["Press Releases"], "CustomDetailUrl": "", "UrlName": "528-new-cases-of-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}