{"pressItemDictionary": {"Press Releases": [{"Title": "774 More Cases Discharged, 257 New Cases of Covid-19 Infection Confirmed ", "PublishedDate": "/Date(1592493300000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "18 Jun 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\">&nbsp; &nbsp; &nbsp; &nbsp; As of 18 June 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 257 cases of COVID-19 infection in Singapore. The breakdown is as follows:&nbsp;<br><br><strong>a) Imported cases: 0<br></strong><br>There are no imported cases today.&nbsp;&nbsp;<br><br><strong>b) Cases in the community: 4</strong> (1 Permanent Resident, 3 Work Permit holders)<br><br>Of the 4 cases in the community, 3 had already been placed on quarantine earlier, and the remaining case had been picked up as a result of our proactive surveillance and screening.<br><br>The Permanent Resident case (Case 41273) was detected due to our proactive screening of workers in essential services, although he is asymptomatic.&nbsp;<br><br>All 3 Work Permit holders (Cases 41297, 41315 and 41410) had been identified as contacts of previously confirmed cases, and had already been quarantined at government quarantine facilities. They were swabbed during quarantine to verify their status, even though 2 of them (Cases 41297 and 41410) are asymptomatic.&nbsp;<br><br>Besides the polymerase chain reaction (PCR) test, we also conducted serological tests to determine if these cases are current or past infections [1]. The serological test results for Cases 41297, 41315 and 41273 have come back positive, which indicate likely past infections. The test result for the remaining case is pending.&nbsp;<br><br>Overall, the number of new cases in the community has decreased, from an average of 8 cases per day in the week before, to an average of 7 per day in the past week. The number of unlinked cases in the community has also decreased, from an average of 4 cases per day in the week before, to an average of 3 per day in the past week. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br><br><strong>c) Cases residing in dormitories: 253<br></strong><br>We continue to pick up cases amongst Work Permit holders residing in dormitories, including in factory-converted dormitories, because of extensive testing in these premises, as part of our process to verify and test the status of all workers.&nbsp;<br><br>2.&nbsp; &nbsp;Details of these trends can be found in MOH’s daily situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report)\" title=\"\" class=\"\" target=\"\">www.moh.gov.sg/covid-19/situation-report)</a>. Please refer to <a href=\"/docs/librariesprovider5/default-document-library/annex-a9aa02538d5c34b5b8ca31d345ea043c5.pdf?sfvrsn=3b1f317c_0\" title=\"Annex A\">Annex A</a>&nbsp;for the summary of the confirmed cases.&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp; Of the new cases, 99% are linked to known clusters, while the rest are pending contact tracing.&nbsp;<br><br>4.&nbsp; &nbsp; &nbsp; &nbsp;MOH has been monitoring existing clusters for any further transmission. As there have been no more cases linked to Orange Valley Nursing Home (6 Simei Street 3) for the past two incubation periods (i.e. 28 days), the cluster has now been closed.<br><br><strong>Links between previous cases found<br></strong><br>5.&nbsp; &nbsp; &nbsp; &nbsp;In the past week (11 June to 17 June), MOH has uncovered links for 5 previously unlinked cases.&nbsp;<br><br>6.&nbsp; &nbsp; &nbsp;Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <a href=\"/docs/librariesprovider5/default-document-library/annex-baabfea68a97f4c6991c4c1d85d3210a9.pdf?sfvrsn=19931d64_0\" title=\"Annex B\">Annex B</a>&nbsp;and <a href=\"/docs/librariesprovider5/default-document-library/annex-cee7d5a36c9e14f7e869673a808362142.pdf?sfvrsn=940ed55d_0\" title=\"Annex C\">Annex C</a>&nbsp;for details.<br><br><strong>Update on condition of confirmed cases<br></strong><br>7.&nbsp; &nbsp; &nbsp;774 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 32,712 have fully recovered from the infection and have been discharged from hospitals or community care facilities.&nbsp;<br><br>8.&nbsp; &nbsp; &nbsp; &nbsp;There are currently 225 confirmed cases who are still in hospital. Of these, most are stable or improving, and 2 are in critical condition in the intensive care unit. 8,510 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 26 have passed away from complications due to COVID-19 infection.&nbsp;<br><br><strong>MINISTRY OF HEALTH<br>18 JUNE 2020<br><br></strong>[1] Cases whose serological tests are positive are likely to have a past infection, and could be shedding minute fragments of the virus RNA picked by the PCR test, which were no longer transmissible and infective to others.</p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "774-more-cases-discharged-257-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "Enablers to Support Safe Re-opening", "PublishedDate": "/Date(1592487000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "18 Jun 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;The Multi-Ministerial Taskforce has announced the start of Phase 2 after 18 June 2020, 2359 hours. As we ease the restrictions under Phase 1, we will need to continue to step up our precautionary measures to enable a safe resumption of activities. Our expanded COVID-19 testing regime, and the use of technology to facilitate efficient contact tracing, are part of these efforts and key enablers to support a safe re-opening of our economy and society.<br><br><strong>Expansion of Testing Strategy<br><br></strong>2.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Our current testing strategy is focused on active case finding among the community and active surveillance testing amongst targeted groups who are more vulnerable or have a higher risk of exposure to COVID-19. We have plans to increase capacity to 40,000 tests/day.<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;We have applied this increased testing capacity in several ways.First, we have <strong>stepped up the testing of close contacts.&nbsp;</strong>Previously we would only quarantine the close contacts of confirmed cases. Now we test all of them before the start of quarantine.If anyone tests positive, we start contract tracing again based on this person’s activity map. In this way, we broaden the list of suspect cases, and are able to isolate them early, and stop the virus from spreading.<br><br>4.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Second, we aim to <strong>test</strong> <strong>all individuals</strong> <strong>who are diagnosed with acute respiratory infection (ARI)</strong> <strong>at first presentation to a doctor</strong>. There is clinical and scientific evidence to show that a person is most infectious right before and immediately after the start of symptoms. Testing individuals diagnosed with ARI would therefore allow us to detect infected individuals early to quickly contain further spread. We have since the start of June done this for selected individuals including seniors 65 years old and above, healthcare workers, and staff and older students<sup>[1]</sup>&nbsp;at our educational institutions<sup>[2]</sup>. With more individuals returning to workplaces as our economy re-opens, we will <strong>ex</strong><strong>tend</strong><strong> testing to all individuals aged 45 and above who are diagnosed with ARI</strong> from later next week, as the risks of severe COVID-19 infection increases from age 45. This will progressively be extended to more groups subsequently.<br><br>5.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;We encourage all individuals with respiratory symptoms to see a doctor immediately, so that they can be tested if necessary. The COVID-19 tests ordered by the doctors at our polyclinics and Public Health Preparedness Clinics (PHPCs) are fully subsidised.<br><br>6.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Finally, we will continue to do<strong> more active surveillance testing in the community</strong><strong>.</strong> In May, we had completed testing of all staff and residents of the Ministry of Health and Ministry of Social and Family Development residential homes, and all preschool and early intervention staff before resumption of full preschool services. We have also started regular testing of workers returning to work in the construction, marine and process sectors, and frontline workers supporting our COVID-19 operations. We will continue to monitor the situation, and based on our assessment of risks, we will progressively expand our screening tests to more groups in the community.<br><br>7.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;To make testing more convenient, we will be <strong>setting up more Regional Screening Centres (RSC)</strong> to support the needs of our population. This will help to bring testing services closer to our people, so that individuals with ARI, or those requiring regular routine testing because they work in higher risk sectors, can gain access to such services conveniently.<br><br><strong>SafeEntry and TraceTogether to Strengthen Contact Tracing<br><br></strong>8.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Quick and effective contract tracing is critical in containing the pandemic. Once someone tests positive for COVID-19, the work of contact tracing begins. We need to do activity mapping, and identify close contacts, so as to ring-fence and contain any further spread of the virus. Technology is a key enabler to allow us to conduct meticulous contact tracing in a fast and efficient manner. Digital tools like SafeEntry and TraceTogether help augment the manual contact tracing process, and enable us to re-open confidently.<br><br>9.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Currently, all businesses and services that are in operation are required to use SafeEntry, which helps to establish specific times of entry and exit in enclosed venues for all visitors, employees, associates and vendors. SafeEntry data helps to fill a patient’s activity map quickly, so that activity mappers do not start on a blank slate. The records also help to jog the patient’s memory, which again helps to cut the time needed to do activity mapping. In parallel, TraceTogether’s proximity data helps the authorities to quickly identify people who have been in close contact with the patient. These digital tools work in tandem to facilitate more accurate and faster contact tracing.<br><br>10.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;As we re-open and resume more activities in Phase 2, we should be prepared for more community cases to emerge. As such, raising the adoption level of TraceTogether is even more critical in this phase, and beyond. There are currently 2 million users of the TraceTogether app in Singapore. We encourage everyone to download and use the app. To ensure everyone benefits from the TraceTogether Programme, we will be providing TraceTogether Tokens to those who do not have smartphones or the requisite smartphones for the app to work properly. The TraceTogether Tokens will be rolled out from end June onwards, starting with the elderly and then progressively to the rest of the population. Details will be provided at a later date.<br><br>11.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;These tools will help us improve the speed and accuracy of our contact tracing efforts. When close contacts are quickly notified and quarantined, we can stem the transmission, and prevent further spread in the community.<br><br><strong>Collective Effort for a Safe Transition<br><br></strong>12.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Along with our testing strategy and contract tracing efforts, the implementation of strong infection control measures by all stakeholders will help us to re-open in a safe way. All individuals must play their part, and continue to practice strict safe distancing and good personal hygiene, to reduce the risk of transmissions. With our collective efforts, we can look forward to a safe re-opening and resumption of activities.</p> <p>&nbsp;</p> <p><strong>&nbsp;</strong></p> <p><strong>MINISTRY OF HEALTH<br></strong><strong>18 JUNE </strong><strong>2020</strong></p> <div><br clear=\"all\"> <hr align=\"left\" size=\"1\" width=\"33%\"> <div id=\"ftn1\"> <p><sup>[1]</sup>&nbsp;This refers to students aged 13-years-old and above. For younger students, doctors will assess if a test is required, as younger children require different clinical considerations than older children.</p> </div> <div id=\"ftn2\"> <p><sup>[2]</sup>&nbsp;This includes preschools (including early intervention centres), primary and secondary schools (including student care centres), special education schools, Institutes of Higher Learning and Private Education Institutions.</p> </div> </div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "enablers-to-support-safe-re-opening", "CurrentPageUrl": null}, {"Title": "257 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1592466000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "18 Jun 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As of 18 June 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 257 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders residing in foreign worker dormitories. Based on our investigations so far, there are 4 cases in the community, of whom 1 is a Singapore Permanent Resident and 3 are Work Pass holders.&nbsp;<br><br>2&nbsp; &nbsp; &nbsp; &nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;<br><br><strong>MINISTRY OF HEALTH<br>18 JUNE 2020</strong></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "257-new-cases-of-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}