{"pressItemDictionary": {"Press Releases": [{"Title": "Implementing Safeentry and Safe Management Practices", "PublishedDate": "/Date(1589004300000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "09 May 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The Multi-Ministry Taskforce had earlier announced a set of safe management practices and technologies for individuals and businesses to adopt to support the safe and gradual resumption of normal activities.&nbsp;<br><br><strong>Need for Safe Management Practices<br><br></strong>2.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;The Ministry of Health’s (MOH) study of linked cases in the community found that outside of the household setting, the majority of cases arose from workplace interactions, including work activities such as meetings and discussions, as well as meals or social interactions among colleagues.<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;To reduce the risk of transmission as we gradually resume activities, all businesses and individuals must uphold good practices and measures that minimise the need for prolonged interactions. Good safe management measures like telecommuting, avoiding face-to-face meetings, and regular disinfection of common touch points and equipment should continue. At work premises, workers should avoid all social interactions with their colleagues, including during meals and break times. Everyone must wear masks when outside of the home. Basic hygiene practices such as staying home when unwell, and practising good hand and personal hygiene must continue.<br><br>4.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;In line with these, the Ministry of Manpower and other relevant agencies will be issuing more details on the safe management measures which employers are required to implement in various workplace settings, including offices, common meeting and rest areas, factories, customer-facing settings and transportation.<br><br><strong>Implementation of SafeEntry<br><br></strong>5.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Alongside measures to reduce the risk of transmission in daily interactions and activities, we need to continue to strengthen our contact tracing regime through the use of technology.&nbsp; <br><br>6.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;As announced previously, businesses and services that are in operation must come on board SafeEntry to log the check-in of employees and visitors. As a start, deployment will be made mandatory for places where individuals are likely to be in close proximity for prolonged periods or in enclosed spaces, or where there is higher traffic. To date, SafeEntry has been deployed at over 16,000 premises. The list of facilities/places where SafeEntry must be deployed from 12 May 2020 is found in the <strong><u><a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-for-press-release---implementing-safeentry-and-safe-management-practices.pdf?sfvrsn=282d84cd_0\" title=\"Annex\">Annex</a></u></strong>. This list will be updated at <a href=\"https://www.safeentry.gov.sg/\">https://www.safeentry.gov.sg</a>/deployment as more activities and services resume.&nbsp; &nbsp;<br><br>7.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Employees and visitors should check-in and check-out of workplaces and other venues using SafeEntry to help our contact tracers establish cluster links and transmission chains. It is important that everyone plays their part and uses SafeEntry, so that we can collectively prevent new clusters from forming.&nbsp;&nbsp;<br><br><strong>Social Responsibility is Key<br><br></strong>8.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Social responsibility is critical in slowing the spread of COVID-19. Even as the circuit breaker measures are gradually eased, all of us should continue to stay at home as much as possible, and minimise movement outside the home. Individuals should adopt good practices and abide by safe distancing measures, and businesses should put in place safe management measures, so that we can resume activities safely and gradually as we exit the circuit breaker period.&nbsp;&nbsp;<br><br></p><p><strong>MINISTRY OF HEALTH<br></strong><strong>SMART NATION AND DIGITAL GOVERNMENT OFFICE</strong></p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "implementing-safeentry-and-safe-management-practices", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}