{"pressItemDictionary": {"Press Releases": [{"Title": "171 More Cases Discharged, 469 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1595859600000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "27 Jul 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\"><span style=\"font-family: Arial;\"><span style=\"font-size: 14px;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As of 27 July 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 469 cases of COVID-19 infection in Singapore. The breakdown of the cases is as follows:<br><br><strong>a) Imported cases: 15</strong> (2 Singaporeans, 7 Work Pass holders, 4 Work Permit holders, 2 Dependant’s Pass holders)<br><br>Amongst the 15 imported cases, 2 (Cases 50694 and 50695) are Singaporeans who returned to Singapore from India on 15 July. Another 11 cases are Work Pass or Work Permit holders who are currently employed in Singapore. They arrived in Singapore from India or the Philippines between 14 July and 15 July. Another 2 cases (Cases 50454 and 50696) are Dependant’s Pass holders who arrived from India on 12 July and 14 July.<br><br>All of them had been placed on 14-day Stay-Home Notice (SHN) upon arrival in Singapore, and had been tested while serving their SHN.<br><br><strong>b) Cases in the community: 2</strong> (1 Singaporean, 1 Work Pass holder)<br><br>Both cases in the community are linked to previous cases or clusters, and were detected due to our proactive screening of persons working at dormitories, even though they are asymptomatic.<br><br>Overall, the number of new cases in the community has decreased, from an average of 10 cases per day in the week before, to an average of 5 per day in the past week. The number of unlinked cases in the community has also decreased, from an average of 5 cases per day in the week before, to an average of 3 per day in the past week. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br><br><strong>c) Cases residing in dormitories: 452<br></strong><br>We continue to pick up cases amongst Work Permit holders residing in dormitories, including in factory-converted dormitories, because of extensive testing in these premises, as part of our process to verify and test the status of all workers.&nbsp;<br><br>2.&nbsp; &nbsp; &nbsp;Details of these trends can be found in MOH’s daily situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report/\" title=\"\" class=\"\" target=\"\">www.moh.gov.sg/covid-19/situation-report</a>). Please refer to <a href=\"/docs/librariesprovider5/pressroom/press-releases/moh-press-release---annex-a-(27-jul-2020).pdf?sfvrsn=1f83f756_0\" title=\"Annex A\">Annex A</a>&nbsp;for the summary of the confirmed cases.&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp; Of the new cases, 99% are linked to known clusters, while the rest are pending contact tracing.&nbsp;<br><br><strong>Links between previous cases found<br></strong><br>4.&nbsp; &nbsp; &nbsp; Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <a href=\"/docs/librariesprovider5/pressroom/press-releases/moh-press-release---annex-b-(27-jul-2020).pdf?sfvrsn=478054e5_0\" title=\"Annex B\">Annex B</a>&nbsp;and <a href=\"/docs/librariesprovider5/pressroom/press-releases/moh-press-release---annex-c-(27-jul-2020).pdf?sfvrsn=59eeb931_0\" title=\"Annex C\">Annex C</a>&nbsp;for details.&nbsp;<br><br><strong>Update on condition of confirmed cases<br></strong><br>5.&nbsp; &nbsp; &nbsp; 171 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 45,692 have fully recovered from the infection and have been discharged from hospitals or community care facilities.&nbsp;<br><br>6.&nbsp; &nbsp; &nbsp; There are currently 179 confirmed cases who are still in hospital. Of these, most are stable or improving, and none is in the intensive care unit. 4,940 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 27 have passed away from complications due to COVID-19 infection.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>27 JULY 2020</strong></span></span></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "171-more-cases-discharged-469-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "469 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1595835900000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "27 Jul 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\">&nbsp; &nbsp; &nbsp; &nbsp;As of 27 July 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 469 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders residing in foreign worker dormitories. Based on our investigations so far, there are 2 cases in the community, of whom 1 is a Singaporean and 1 is a Work Pass holder.&nbsp;<br><br>2.&nbsp; &nbsp; In addition, there are 15 imported cases who had all been placed on Stay-Home Notice upon arrival in Singapore.&nbsp;&nbsp;<br><br>3.&nbsp; &nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>27 JULY 2020</strong><br></p><div><br></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "469-new-cases-of-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}