{"pressItemDictionary": {"Press Releases": [{"Title": "3 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1603550640000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "24 Oct 2020", "Summary": "", "MainContent": "1.&nbsp; &nbsp; &nbsp; As of 24 October 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified 3 new cases of locally transmitted COVID-19 infection. Of these, 2 are in the community, and 1 resides in a dormitory. In addition, there are 11 imported cases, who had all been placed on Stay-Home Notice (SHN) upon arrival in Singapore. Amongst the new cases today, 12 are asymptomatic, and were detected from our proactive screening and surveillance, while 2 were symptomatic.&nbsp;<br><br><br><strong>Summary of new cases<br></strong><table width=\"605\" bordercolor=\"#00000a\" border=\"1\" rules=\"GROUPS\" frame=\"VOID\" cellspacing=\"0\" cellpadding=\"7\"><colgroup><col width=\"115\"><col width=\"46\"><col width=\"2\"><col width=\"82\"><col width=\"82\"><col width=\"2\"><col width=\"27\"></colgroup><colgroup><col width=\"41\"><col width=\"82\"></colgroup><tbody><tr><td width=\"115\" height=\"10\" bgcolor=\"#ffffff\"><p align=\"RIGHT\">&nbsp;</p></td><td width=\"46\" bgcolor=\"#ffffff\"><p>&nbsp;</p></td><td width=\"2\" valign=\"TOP\" bgcolor=\"#ffffff\"><p>&nbsp;</p></td><td width=\"178\" bgcolor=\"#e7e6e6\" colspan=\"2\"><p align=\"CENTER\"><strong>Breakdown by</strong></p></td><td width=\"2\" valign=\"TOP\" bgcolor=\"#ffffff\"><p>&nbsp;</p></td><td width=\"27\" bgcolor=\"#e7e6e6\"><p align=\"CENTER\"><strong>Breakdown by</strong></p></td><td width=\"137\" bgcolor=\"#e7e6e6\" colspan=\"2\"><p>&nbsp;</p></td></tr><tr><td width=\"115\" height=\"111\" bgcolor=\"#fff2cc\"><p align=\"RIGHT\">&nbsp;</p></td><td width=\"46\" bgcolor=\"#fff2cc\"><p><strong>Number of cases</strong></p></td><td width=\"2\" valign=\"TOP\" bgcolor=\"#ffffff\"><p>&nbsp;</p></td><td width=\"82\" bgcolor=\"#fff2cc\"><p><strong>Already in quarantine/ isolation before detection</strong></p></td><td width=\"82\" bgcolor=\"#fff2cc\"><p><strong>Detected from surveillance</strong></p></td><td width=\"2\" valign=\"TOP\" bgcolor=\"#ffffff\"><p>&nbsp;</p></td><td width=\"82\" bgcolor=\"#fff2cc\" colspan=\"2\"><p><strong>Symptomatic</strong></p></td><td width=\"82\" bgcolor=\"#fff2cc\"><p><strong>Asymptomatic</strong></p></td></tr><tr><td width=\"115\" height=\"22\" bgcolor=\"#fff2cc\"><p><strong>Cases in the community</strong></p></td><td width=\"46\"><p align=\"CENTER\">2</p></td><td width=\"2\" valign=\"TOP\" bgcolor=\"#ffffff\"><p align=\"CENTER\">&nbsp;</p></td><td width=\"82\"><p align=\"CENTER\">0</p></td><td width=\"82\"><p align=\"CENTER\">2</p></td><td width=\"2\" valign=\"TOP\" bgcolor=\"#ffffff\"><p align=\"CENTER\">&nbsp;</p></td><td width=\"82\" colspan=\"2\"><p align=\"CENTER\">2</p></td><td width=\"82\"><p align=\"CENTER\">0</p></td></tr><tr><td width=\"115\" height=\"22\" bgcolor=\"#fff2cc\"><p><strong>Cases residing in dormitories</strong></p></td><td width=\"46\"><p align=\"CENTER\">1</p></td><td width=\"2\" valign=\"TOP\" bgcolor=\"#ffffff\"><p align=\"CENTER\">&nbsp;</p></td><td width=\"82\"><p align=\"CENTER\">0</p></td><td width=\"82\"><p align=\"CENTER\">1</p></td><td width=\"2\" valign=\"TOP\" bgcolor=\"#ffffff\"><p align=\"CENTER\">&nbsp;</p></td><td width=\"82\" colspan=\"2\"><p align=\"CENTER\">0</p></td><td width=\"82\"><p align=\"CENTER\">1</p></td></tr><tr><td width=\"115\" height=\"22\" bgcolor=\"#fff2cc\"><p><strong>Imported cases</strong></p></td><td width=\"46\"><p align=\"CENTER\">11</p></td><td width=\"2\" valign=\"TOP\" bgcolor=\"#ffffff\"><p align=\"CENTER\">&nbsp;</p></td><td width=\"82\"><p align=\"CENTER\">11</p></td><td width=\"82\"><p align=\"CENTER\">0</p></td><td width=\"2\" valign=\"TOP\" bgcolor=\"#ffffff\"><p align=\"CENTER\">&nbsp;</p></td><td width=\"82\" colspan=\"2\"><p align=\"CENTER\">0</p></td><td width=\"82\"><p align=\"CENTER\">11</p></td></tr><tr><td width=\"115\" height=\"22\" bgcolor=\"#fff2cc\"><p><strong>Total</strong></p></td><td width=\"46\"><p align=\"CENTER\">14</p></td><td width=\"2\" valign=\"TOP\" bgcolor=\"#ffffff\"><p align=\"CENTER\">&nbsp;</p></td><td width=\"82\"><p align=\"CENTER\">&nbsp;</p></td><td width=\"82\"><p align=\"CENTER\">&nbsp;</p></td><td width=\"2\" valign=\"TOP\" bgcolor=\"#ffffff\"><p align=\"CENTER\">&nbsp;</p></td><td width=\"82\" colspan=\"2\"><p align=\"CENTER\">&nbsp;</p></td><td width=\"82\"><p align=\"CENTER\">&nbsp;</p></td></tr></tbody></table><strong><br></strong>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Overall, the number of new cases in the community has decreased from 4 cases in the week before, to 3 in the past week. The number of unlinked cases in the community has increased from 1 case in the week before, to 3 in the past week. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<strong><br><br>Case Details<br><br>a)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Cases in the community: 2<br><br></strong>There are 2 cases in the community today who are currently unlinked. Case 58125 is a security officer at Changi Airport Terminal 3. Prior to hospital admission, he had gone to work, as well as visited the Singapore National Eye Centre for treatment of a non-related medical condition. Case 58138 is a temperature screener and swab assistant at Raffles Medical at Changi Airport Terminal 3, and had gone to work prior to hospital admission. Both cases were detected under our enhanced community testing to test all individuals aged 13 and above who are diagnosed with acute respiratory infection (ARI) at first presentation to a doctor. This allows us to identify infected individuals early and to quickly contain further spread.<br><br>While both cases work at Changi Airport Terminal 3, they had not interacted with each other, and epidemiological investigations so far have not established any link between them. As a precautionary measure, all individuals working at Changi Airport Terminal 3 who may have contact with travellers will be tested for COVID-19.<strong><br><br></strong>As travel volume is expected to pick up in the coming months, MOH has been in discussion with relevant agencies to ramp up Rostered Routine Testing of frontline staff working at Changi Airport. More details will be provided later.<strong><br><br>b)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Cases residing in dormitories: 1<br><br></strong>There is 1 case residing in a dormitory today. He was detected through our bi-weekly Rostered Routine Testing of workers living in dormitories. This allows us to pick up cases early, including asymptomatic ones, so that we are able to ring-fence them quickly to prevent further transmission, by aggressively containing, tracing and isolating the close contacts.<strong><br><br>c)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Imported cases: 11<br><br></strong>Amongst the 11 imported cases, 3 (Cases 58131, 58135 and 58136) are Singaporeans and 1 (Case 58130) is a Singapore Permanent Resident who returned from India and the Philippines. Another 3 (Cases 58126, 58127 and 58128) are Work Permit holders currently employed in Singapore who arrived from Indonesia and the Philippines. 3 more cases are a Student's Pass holder (Case 58133) who arrived from France and 2 Long-Term Visit Pass holders (Cases 58129 and 58134) who arrived from India and Indonesia. The remaining case (Case 58137) is a Short-Term Visit Pass holder who arrived from India. She was allowed entry into Singapore as her parent is a Singapore Permanent Resident.<br><br>They had all been placed on SHN upon arrival in Singapore and were tested while serving SHN.<strong><br><br></strong>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Details of these trends can be found in MOH's daily situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\" title=\"\" class=\"\" target=\"\">www.moh.gov.sg/covid-19/situation-report</a>).<strong><br><br></strong>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Epidemiological investigations are in progress. In the meantime, all the identified close contacts of the cases have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for the close contacts to determine if the cases could have been infected by them.<strong><br><br>Links between previous cases found<br><br></strong>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-a---24-oct-2020.pdf?sfvrsn=d9c6261d_2\" title=\"Annex A\">Annex A</a>&nbsp;and <a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-b---24-oct-2020.pdf?sfvrsn=dca7f892_2\" title=\"Annex B\">Annex B</a>&nbsp;for details.<strong><br><br>Update on condition of confirmed cases<br><br></strong>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 12 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 57,844 have fully recovered from the infection and have been discharged from hospitals or community care facilities.<br><br>7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; There are currently 53 confirmed cases who are still in hospital. Of these, most are stable or improving, and none is in the intensive care unit. 40 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 28 have passed away from complications due to COVID-19 infection.<br>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "3-new-cases-of-locally-transmitted-covid-19-infection-24Oct2020-update", "CurrentPageUrl": null}, {"Title": "Precautionary Tuberculosis Screening for Residents of Block 174d Hougang Avenue 1", "PublishedDate": "/Date(1603530000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "24 Oct 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;The Ministry of Health (MOH) will offer voluntary Tuberculosis (TB) screening to residents and former residents of Block 174D Hougang Avenue 1. This is a precautionary measure following the detection of a cluster of four individuals diagnosed with TB[1]&nbsp;residing in four different units at the block. Screening will be conducted free of charge, at the Tuberculosis Control Unit (TBCU) located at Moulmein Road from 26 October onwards.</p> <p>2.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Officers from the TBCU and the National Centre for Infectious Diseases (NCID) will be conducting house visits to all units at Block 174D Hougang Avenue 1 between 25 and 27 October, to engage affected residents and encourage them to go for the screening. Residents will be able to make appointments for TB screening at TBCU during the house visits. Residents who are not at home at the time of the visit can call the TBCU to make an appointment for screening. Former residents who had lived in the block from February 2020, and wish to be screened, may call the TBCU hotline at 6248 4430.</p><p><p><strong>Identification of TB cluster </strong></p><p>3.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; MOH was notified on 10 October 2020 of four TB cases involving residents of the same HDB block at 174D Hougang Avenue 1, who were diagnosed between January 2018 to June 2020. All four individuals live in different units of Block 174D. The cases had immediately started on treatment following diagnosis. Amongst them, two have completed treatment, while the remaining two are currently undergoing treatment and are no longer infectious. As individuals diagnosed with TB will rapidly become non-infectious once treatment starts, the cases are not an ongoing public health risk.</p></p><p><p>4.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; In line with MOH’s TB prevention strategy, the Singapore TB Elimination Programme (STEP) had initiated contact investigations upon notification of the four cases. Close contacts of the cases had already been identified and contacted by STEP for screening. Investigations for each of four cases at the time of their diagnosis did not identify each other as close contacts.</p></p><p><p>5.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The cluster was subsequently determined due to the results of the genetic sequencing performed in October 2020 as part of retrospective testing of TB cases to determine possible linkages. This revealed that all four cases have similar genetic make-up. Investigations into the cases did not reveal any common links, other than that they live in the same block. They did not know or interact with one another, or congregate at the same common areas, and had also not identified each other as close contacts. The TB cluster therefore does not fit the usual pattern of TB spread.</p></p><p><p>6.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;TB is typically spread through close and prolonged contact with an infectious individual, and not by contact with items or surfaces touched by a person with TB. Therefore, persons who are contacted and screened following the detection of a TB individual typically comprise family members, close workplace colleagues and acquaintances from common social activities with close and regular interaction. This approach is recommended by the World Health Organization (WHO) and is practised in Singapore.</p></p><p><p><strong>Precautionary TB Screening beyond close contacts</strong></p><p>7.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The expanded TB screening offered by MOH is a precautionary measure to assure and protect residents living in the same block. The exercise could help detect any undiagnosed TB cases. While screening is not compulsory, MOH strongly encourages residents to be screened. Those with positive screening results will be offered appropriate advice and follow-up. Those with active TB will be treated immediately while those with latent non-infectious TB will be monitored and treated if necessary.</p></p><p><p>8.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The risk of transmission to persons who are not close contacts of a TB case is very low. Screening is thus not necessary for individuals who had occasionally visited the block or vicinity.</p></p><p><p><strong>Health Advisory</strong></p><p>9.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;TB is endemic in Singapore and latent TB infection is not uncommon in our population, as TB had been prevalent in Singapore until the 1970s and older Singaporeans could have been exposed to TB and acquired latent TB infection when they were younger. Persons with latent TB do not experience symptoms of TB and are not infectious.</p></p><p><p>10.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; TB is curable and the spread of TB is preventable. Early detection and prompt treatment of cases remain important in helping those infected and rendering them non-infectious. For individuals diagnosed with active TB, adherence to treatment is important.</p></p> <div><a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-(1).pdf?sfvrsn=b1b2b5f0_0\" title=\"Annex \">Annex </a><br clear=\"all\"> <hr align=\"left\" size=\"1\" width=\"33%\"> <div id=\"ftn1\"> <p>[1] TB can be cured with anti-TB drugs. Treatment of active TB, which is sensitive to first-line anti TB drugs, usually involves a combination of different drugs, taken for six to nine months.</p> </div> </div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "precautionary-tuberculosis-screening-for-residents-of-block-174d-hougang-avenue-1", "CurrentPageUrl": null}, {"Title": "3 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1603468800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "24 Oct 2020", "Summary": "", "MainContent": "1.&nbsp; &nbsp; &nbsp; As of 24 October 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 3 new cases of locally transmitted COVID-19 infection. Based on our investigations so far, 2 are in the community, and 1 resides in a dormitory.<br><br>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In addition, there are 11 imported cases, who had all been placed on Stay-Home Notice upon arrival in Singapore. In total, there are 14 new cases of COVID-19 infection in Singapore today.<br><br>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "3-new-cases-of-locally-transmitted-covid-19-infection-24Oct2020", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}