{"pressItemDictionary": {"Press Releases": [{"Title": "169 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1593760200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "03 Jul 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\"><span style=\"font-family: Arial;\"><span style=\"font-size: 14px;\">&nbsp; &nbsp; &nbsp;As of 3 July 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 169 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders residing in foreign worker dormitories. Based on our investigations so far, there are 11 cases in the community, of whom 3 are Singaporeans/ Permanent Residents and 8 are Work Pass holders. In addition, there are 3 imported cases, all of whom had been placed on Stay-Home Notice upon arrival in Singapore.&nbsp;<br><br>2.&nbsp; &nbsp; &nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;<br><br>3.&nbsp; &nbsp; We announced yesterday that MOH has placed 58 households residing at Block 111 Tampines Street 11 under active phone surveillance and is facilitating COVID-19 testing for them and their visitors. This is a precautionary measure after MOH had detected 9 confirmed cases from 2 households residing at the block. As these households and visitors are not close contacts of the confirmed cases, they are assessed to have a low risk of being infected. Of the 85 tests that have been completed so far, all the results have come back negative for COVID-19.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>3 JULY 2020</strong></span></span></p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "169-new-cases-of-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}