{"pressItemDictionary": {"Press Releases": [{"Title": "1 New Case of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1608540300000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "21 Dec 2020", "Summary": "", "MainContent": "<p><strong></strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; As of 21 December 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 1 new case of locally transmitted COVID-19 infection. Based on our investigations so far, the case is in the community, and there are no new cases in the dormitories. </p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In addition, there are 9 imported cases, who had already been placed on Stay-Home Notice (SHN) or isolated upon arrival in Singapore. In total, there are 10 new cases of COVID-19 infection in Singapore today.</p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight. </p><p>&nbsp;</p><p><strong>Investigations into 13 cases who served SHN at Mandarin Orchard Singapore</strong></p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; As announced on 19 December, MOH is investigating 13 cases&nbsp; of COVID-19 infection amongst individuals who had served SHN at Mandarin Orchard Singapore between 22 October and 11 November 2020. As a precautionary measure to ensure the safety of all guests, the hotel has stopped accepting new guests since 19 December, and all existing guests checked out by 9pm on 20 December. All individuals serving SHN at Mandarin Orchard Singapore have been transported via dedicated vehicles to an alternative SHN dedicated facility on 20 December.</p><p>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; MOH has completed our special testing operations to test all individuals serving SHN at Mandarin Orchard Singapore, as well as staff of the hotel. In total, 394 persons serving SHN at the hotel have been swabbed. Of these, 391 were tested negative while 3 (Cases 58656, 58657 and 58658) were tested positive on 20 December and were immediately conveyed to the hospital via ambulance. As they have recent travel history, it is likely that these are imported cases who were infected while they were overseas. Nevertheless the National Public Health Laboratory will conduct whole genome sequencing and phylogenetic analysis to determine if they could be linked to the 13 cases. These cases were announced by MOH on 20 December, and included in our daily case count. </p><p>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In total, we have tested 571 staff of Mandarin Orchard Singapore, and 570 Polymerase Chain Reaction (PCR) test results have come back negative for COVID-19 infection. MOH is facilitating testing for the remaining individual who has yet to be PCR tested. The serological tests of 8 more staff have come back positive, indicating likely past infections, in addition to the 3 announced yesterday. Epidemiological investigations of these 11 cases are in progress. In the meantime, we will test their identified close contacts as a precautionary measure, and also conduct serological tests to determine if these individuals could have been infected by them.</p><p>7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Singapore reports COVID-19 cases in accordance with international practice. Every case who tested positive through a PCR test and is assessed to be an acute infection is reported and included in our case count. We follow the World Health Organization’s criterion that only positive results from confirmatory tests (i.e. PCR tests) are included in the case count. This ensures consistency in reporting cases across countries. The 11 cases whose serological tests have come back positive, but whose PCR test results are negative for COVID-19 infection, are therefore not included in our daily case count. </p><p>8.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Travellers entering Singapore are subjected to the prevailing border measures upon entry, including SHN and COVID-19 tests, where applicable. Hotels used as SHN dedicated facilities have strict protocols to which all travellers subjected to SHN must adhere to. Regular checks on these hotels are conducted to ensure that safe management measures are complied with, and security measures are in place. These&nbsp; measures have helped to mitigate the risk of importation and transmission, but travellers must themselves also remain vigilant, and take all precautionary measures to protect themselves and their travelling companions.&nbsp; </p><p><br><strong>MINISTRY OF HEALTH<br>21 DECEMBER 2020</strong></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "1-new-case-of-locally-transmitted-covid-19-infection_21Dec", "CurrentPageUrl": null}, {"Title": "Government Accepts Medishield Life Council’s Recommendations and Commits S$2.2 Billion for Premium Subsidies and Support", "PublishedDate": "/Date(1608532800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "21 Dec 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\"><span style=\"font-size: 16px;\"><span style=\"font-family: Arial;\"><strong>Higher MediSave top-ups for Pioneer Generation and premium payment deferred for those who are unable to pay</strong><br><br>&nbsp; &nbsp; &nbsp; The Government has accepted all the recommendations of the MediShield Life Council on the MediShield Life 2020 review which will ensure that MediShield Life continues to provide adequate and meaningful protection to Singaporeans. The changes will be implemented in March 2021.<br><br>2.&nbsp; &nbsp;The Government has announced earlier that we will provide premium subsidies and support of up to $2.2 billion over the next three years to help Singapore Residents with their MediShield Life premiums. Following the public consultation held on the MediShield Life Council’s recommendations, we will defer premium payment until end December 2021 for those who do not have sufficient MediSave balances to pay their premiums in the coming year. We will also enhance the annual MediSave top-ups for Pioneer Generation (PG) seniors.<br><br>3.&nbsp; &nbsp;These measures will keep the net premium increases for all Singapore Citizens to no more than about 10% in the first year.<br><br><strong>MediShield Life Council’s Recommendations</strong><br><br>4.&nbsp; &nbsp;The Government has reviewed the MediShield Life Council’s recommendations, and is satisfied that the recommended benefit changes will ensure that MediShield Life continues to provide adequate and meaningful protection to Singaporeans. The actuarially determined premium adjustments are necessary to support the rising number of claims and payouts as well as the benefit changes, and will ensure that MediShield Life remains sustainable in the coming years. We also note that the Council will appoint a committee to review MediShield Life coverage for cancer therapies, in response to feedback on the need to contain rising healthcare costs.<br><br>5.&nbsp; &nbsp; &nbsp;The key recommended benefits include updating and refining the claim limits to provide better coverage, introducing treatment-specific claim limits for costlier types of community hospital care and outpatient radiotherapy, raising the policy year claim limit from $100,000 to $150,000, and allowing higher daily claim limits for the first two days of acute hospital stays, amongst others.<br>&nbsp;<br>6.&nbsp; &nbsp; &nbsp; The higher daily claim limits for the first two days of acute hospital stays will provide better coverage for short stays for patients who can be discharged earlier. In support of this recommendation, the Government will also adjust the MediSave withdrawal limits for acute hospital stays in tandem, as shown in <span style=\"text-decoration: underline;\">Table A</span>. Taken together, the new MediShield Life and MediSave limits will result in lower out-of-pocket costs for patients.&nbsp;<br><br><strong>Table A:</strong> New MediShield Life and MediSave daily ward and treatment limits for acute hospital stays*<br><br></span></span></p><table border=\"1\" cellspacing=\"0\" cellpadding=\"0\"> <tbody><tr> <td width=\"96\" valign=\"top\"> <p><span style=\"font-size: 16px; font-family: Arial;\"><strong>Day</strong></span></p> </td> <td width=\"125\" valign=\"top\"> <p><span style=\"font-size: 16px; font-family: Arial;\"><strong>MediShield Life</strong></span></p> <p><span style=\"font-size: 16px; font-family: Arial;\"><strong>claim limit^</strong></span></p> </td> <td width=\"127\" valign=\"top\"> <p><span style=\"font-size: 16px; font-family: Arial;\"><strong>MediSave withdrawal limit</strong></span></p> </td> <td width=\"123\" valign=\"top\"> <p><span style=\"font-size: 16px; font-family: Arial;\"><strong>Cumulative limit<sup>#</sup></strong></span></p> </td> </tr> <tr> <td width=\"96\" valign=\"top\"> <p><span style=\"font-size: 16px; font-family: Arial;\">1</span></p> </td> <td width=\"125\" valign=\"top\"> <p><span style=\"font-size: 16px; font-family: Arial;\">$1,000 ($700)</span></p> </td> <td width=\"127\" valign=\"top\"> <p><span style=\"font-size: 16px; font-family: Arial;\">$550 ($450)</span></p> </td> <td width=\"123\" valign=\"top\"> <p><span style=\"font-size: 16px; font-family: Arial;\">$1,550 ($1,150)</span></p> </td> </tr> <tr> <td width=\"96\" valign=\"top\"> <p><span style=\"font-size: 16px; font-family: Arial;\">2</span></p> </td> <td width=\"125\" valign=\"top\"> <p><span style=\"font-size: 16px; font-family: Arial;\">$1,000 ($700)</span></p> </td> <td width=\"127\" valign=\"top\"> <p><span style=\"font-size: 16px; font-family: Arial;\">$550 ($450)</span></p> </td> <td width=\"123\" valign=\"top\"> <p><span style=\"font-size: 16px; font-family: Arial;\">$3,100 ($2,300)</span></p> </td> </tr> <tr> <td width=\"96\" valign=\"top\"> <p><span style=\"font-size: 16px; font-family: Arial;\">3 and beyond</span></p> </td> <td width=\"125\" valign=\"top\"> <p><span style=\"font-size: 16px; font-family: Arial;\">$800 ($700) per day</span></p> </td> <td width=\"127\" valign=\"top\"> <p><span style=\"font-size: 16px; font-family: Arial;\">$400 ($450) per day</span></p> </td> <td width=\"123\" valign=\"top\"> <p><span style=\"font-size: 16px; font-family: Arial;\">$4,300 ($3,450) in Day 3; additional $1,200 ($1,150) for each subsequent day </span></p> </td> </tr> </tbody></table><p style=\"text-align: justify;\"><span style=\"font-size: 16px;\"><span style=\"font-family: Arial;\"><br>* (Original limits shown in parentheses)<br>^ This is the limit for normal ward stays. ICU ward stays are subject to a MediShield Life claim limit of $2,400 per day for the first two days, and $2,200 per day from the third day onwards. The same MediSave withdrawal limit applies for both normal ward and ICU ward stays.<br>#&nbsp; Sum total of MediShield Life and MediSave limits, accumulated over the days.&nbsp;&nbsp;<br><br><strong>Government’s Premium Support Measures</strong><br><br>7.&nbsp; &nbsp;The Government will provide up to $2.2 billion for premium subsidies and support over the next three years to help Singapore Residents with their premiums. This comprises $1.8 billion for existing premium subsidies and support measures for lower and middle-income households, PG and Merdeka Generation (MG) seniors, and the financially needy (see details in <a href=\"/docs/librariesprovider5/default-document-library/annex-a387065748bee44ffa47134ec48f716ad.pdf?sfvrsn=4cdd3749_0\" title=\"Annex A\">Annex A</a>), and $360 million for the new COVID-19 Subsidy.&nbsp;<br><br>8.&nbsp; &nbsp; &nbsp;<span style=\"text-decoration: underline;\">COVID-19 Subsidy.</span> The Government earlier announced a one-off COVID-19 subsidy for all Singapore Citizens for two years to further cushion the impact of the premium adjustments during this exceptional period. This will subsidise 70% of the net increase in premiums (after taking into account existing premium subsidies) in the first year, followed by 30% in the second year. Taken together with the existing premium support measures, the net premium increases for all Singapore Citizens will be kept to no more than about 10% in the first year.&nbsp;<br><br>9.&nbsp; &nbsp;<span style=\"text-decoration: underline;\">Deferment of Premium Payment for those with Insufficient MediSave balances.</span> MediShield Life premiums can be fully paid using MediSave. The vast majority of Singaporeans have sufficient MediSave for their premiums. Family members can also utilise their MediSave to help pay the premiums for their loved ones. Nonetheless, to further allay concerns about premium payment during this exceptional period due to the economic impact of COVID-19, the Government will defer the payment of outstanding premiums until end December 2021 for Singapore Residents who have insufficient MediSave balances and are unable to pay their premiums. In addition, the financially needy can apply for Additional Premium Support for assistance with their premiums.&nbsp;<br><br><strong>Enhancements to PG MediSave Top-Ups</strong><br><br>10.&nbsp; &nbsp;Currently, PG seniors receive $200 to $800 in annual MediSave top-ups, which can be used to pay for their MediShield Life premiums. As part of our commitment to keep premiums affordable for PG seniors, the Government will provide higher lifetime annual MediSave top-ups of $250 to $900 to all PG seniors from 2021. For older PG seniors (aged 81 years old and above in 2020) who have serious pre-existing conditions and need to pay higher premiums, we will also provide a one-off MediSave top-up of $50 to $200 per year for five years, from 2021 to 2025. Please refer to <a href=\"/docs/librariesprovider5/default-document-library/annex-bb3513b1d4df3423e921f436ae5e0ae09.pdf?sfvrsn=7242de16_0\" title=\"Annex B\">Annex B</a>&nbsp;for details on the enhanced annual PG MediSave top-up amounts.<br><br>11.&nbsp; &nbsp; After these enhancements, all PG seniors who are 86 years old and above in 2020 will continue to have their MediShield Life premiums fully covered by the special PG premium subsidies and MediSave top-ups, while younger PGs will have about two-thirds of their MediShield Life premiums covered.&nbsp;<br><br>12.&nbsp; &nbsp; &nbsp;For example, the revised MediShield Life premium for an 89-year-old PG senior is $2,025. After taking into account the special PG premium subsidy, the net premium payable is $831, which can be fully covered by the senior’s enhanced PG MediSave top-up of $900. The revised premium for a 74-year-old PG senior’s premium is $1,320 and the net premium payable after the special PG premium subsidy is $674. With the enhanced MediSave top-up of $250, the senior pays the remaining $424 or about one-third of his original premium using his own MediSave or cash. The COVID-19 subsidy will further reduce the net premium payable in 2021 and 2022. Please refer to <a href=\"/docs/librariesprovider5/default-document-library/annex-c09378459322c4a74be46480866fdf1bb.pdf?sfvrsn=5f1adc8e_0\" title=\"Annex C\">Annex C</a>&nbsp;for the detailed illustrations after the COVID-19 subsidy is phased out.&nbsp; &nbsp;<br><br>13.&nbsp; &nbsp; Please refer to <a href=\"/docs/librariesprovider5/default-document-library/annex-d.pdf?sfvrsn=96cbbe44_0\" title=\"Annex D\">Annex D</a>&nbsp;for additional details on net premiums after taking into account Government support.<br><br>14.&nbsp; &nbsp; &nbsp;Mr Gan Kim Yong, Minister for Health, said, “MediShield Life was created to ensure that Singaporeans would be protected against large hospital bills for life. To ensure that the scheme can continue to be relevant and sustainable, the Government has accepted the MediShield Life Council’s recommendations to enhance the scheme and adjust the premiums. At the same time, we understand that Singaporeans will need more support during this period. We will provide up to $2.2 billion in premium subsidies and support, including an additional COVID-19 subsidy for all Singapore Citizens. We will ensure that MediShield Life continues to provide coverage for all Singaporeans, for life, and ensure that the premiums remain affordable.”<br><br>15.&nbsp; The Government thanks the Council for the time and effort committed to the comprehensive review.<br><br><br><strong>MINISTRY OF HEALTH&nbsp;<br>21 DECEMBER 2020</strong></span></span></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "government-accepts-medishield-life-council-s-recommendations-and-commits-2.2-billion-for-premium-subsidies-and-support", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}