{"pressItemDictionary": {"Press Releases": [{"Title": "Updates On Border Measures for Travellers From the Republic of Korea", "PublishedDate": "/Date(1608786900000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "24 Dec 2020", "Summary": "", "MainContent": "<p><strong></strong>&nbsp; &nbsp; &nbsp; The Multi-Ministry Taskforce has been closely monitoring the global COVID-19 situation, and will be tightening border measures given the sustained surge in cases in the Republic of Korea (ROK). All travellers entering Singapore from <strong>26 December 2020, 2359 hours</strong>, who have a travel history in the past 14 days to the Republic of Korea will now be required to serve a 14-day Stay-Home Notice (SHN) at dedicated SHN facilities.</p> <p><strong>Travellers from Republic of Korea to serve 14-Day SHN at dedicated SHN facilities</strong></p> <p>2.&nbsp; &nbsp;We had earlier announced that travellers from the Republic of Korea are allowed to serve their 14-day SHN at a suitable place of residence.</p><p><p>3.&nbsp; &nbsp;Given the increased risk of community spread recently, <u>all travellers</u> entering Singapore from <strong>26 December 2020, 2359 hours</strong> who have a travel history (including transit) in the past 14 days to the Republic of Korea will be required to serve a 14-day SHN at dedicated SHN facilities. The 14-day SHN at dedicated SHN facilities also applies to returning Singapore-based travellers under the Singapore-ROK Reciprocal Green Lane (RGL).</p></p><p><p>4.&nbsp; &nbsp;Travellers from Hong Kong, Fiji, Sri Lanka and Thailand are still allowed to apply to opt out of dedicated SHN facilities and serve their 14-day SHN at their place of residence, if they fulfil the following criteria:<br></p><p>a)&nbsp; Travelled to no other country/ region than above-mentioned countries/ regions [1], in the last consecutive 14 days prior to entry; and </p><p>b)&nbsp; Are occupying their place of residence (i.e. residential address) alone, or only with household members who are also persons serving SHN with the same travel history and duration of SHN.<br></p></p><p><p>The COVID-19 tests will continue to be administered before the end of the SHN.</p><p><strong></strong><strong>Regular Review of Border Measures</strong></p><p>5.&nbsp; &nbsp;As the global situation evolves, we will continue to adjust our border measures to manage the risk of importation and transmission to the community. Any changes to border measures will be updated on the <a href=\"http://www.safetravel.ica.gov.sg/health\">SafeTravel website</a>. Travellers are advised to visit the website to check for the most updated border measures before entering Singapore and be prepared to be subjected to the prevailing border measures upon entry, including payment for their stay at dedicated SHN facilities, tests and treatment.</p></p><p><p>6. All travellers are reminded to accurately declare their travel history. Strict enforcement actions will be taken against false declarations. </p></p> <div><br clear=\"all\"> <hr align=\"left\" size=\"1\" width=\"33%\"> <div id=\"ftn1\"> <p>[1] Including the following countries/regions: Australia, Brunei Darussalam, Macao, Mainland China, New Zealand, Taiwan and Vietnam (correct as of 24 December 2020).</p> </div> </div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "updates-on-border-measures-for-travellers-from-the-republic-of-korea", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}