{"pressItemDictionary": {"Press Releases": [{"Title": "New Inpatient Palliative Care Service From 1 April 2020", "PublishedDate": "/Date(1585584000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "31 Mar 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp;&nbsp;<span style=\"font-family: Arial;\"><span style=\"font-size: 13px;\"> The Ministry of Health (MOH) will launch the Inpatient Hospice Palliative Care Service (IHPCS) on 1 April 2020 to provide patient-centric and seamless care to patients receiving inpatient palliative care. This new service is in line with MOH’s ongoing efforts to improve the quality, accessibility and affordability of palliative care.<br><br><strong>Continued Enhancements to Palliative Care in the Community<br></strong><strong></strong><br>2 &nbsp; &nbsp;&nbsp; In view of the varied models of care across inpatient palliative care services, the Inpatient Palliative Care Review Workgroup, co-chaired by Dr Angel Lee (Medical Director of St Andrew’s Community Hospital and then-Chairman of the Singapore Hospice Council), and then-Deputy Director of Medical Services Associate Professor Kenneth Mak, was set up to review the inpatient palliative care landscape.<br><br>3 &nbsp; &nbsp;&nbsp; The Workgroup recommended consolidating the existing inpatient services offered in community hospitals and inpatient hospices into a single service type, with a standardised service framework centred around patients’ needs instead of defining it by setting. MOH accepted the recommendation and has been working closely with inpatient palliative care providers to launch IHPCS.</span></span></p><p><span style=\"font-family: Arial; font-size: 13px;\"><strong>Launch of IHPCS<br></strong></span></p><p><span style=\"font-family: Arial; font-size: 13px;\">4 &nbsp; &nbsp;&nbsp; With the IHPCS, a common service framework will be introduced to ensure that all service providers are able to provide a standard scope of services to meet the needs of palliative patients, tiered into general and specialised palliative care.<a name=\"_ftnref1\" title=\"\" href=\"file:///C:/Users/shireen/Desktop/200331%20IHPCS%20Press%20Release%20(final).docx#_ftn1\">[1]</a><br></span></p><ul><li><span style=\"font-family: Arial; font-size: 13px;\">General palliative care is for patients with palliative care needs that require inpatient management. Examples include relieving symptoms such as pain and breathlessness through oral and subcutaneous medication, as well as socio-emotional support for patients and caregivers during this difficult time in their lives.</span></li></ul><ul><li><span style=\"font-family: Arial; font-size: 13px;\">Specialised palliative care is for patients with complex needs that require higher levels of care (compared with general palliative care). Examples include the administration of intravenous medication and specialised wound care for complex wounds.</span></li></ul><p><span style=\"font-family: Arial; font-size: 13px;\">5 &nbsp; &nbsp;&nbsp; Patients will be assigned to the appropriate tier based on their goals of care and needs. Each patient’s assigned tier will be regularly reviewed and updated by doctors as needed.<br><br>6 &nbsp; &nbsp;&nbsp; The framework will also allow patients with fluctuating care needs due to changes in their health condition to be cared for in the same location. This promotes continuity of care and minimises the need for transfers to different care facilities. As all providers will be required to provide a standard scope of services, patients also have the option of a wider range of providers and can be more assured that their care needs will be fulfilled regardless of setting.<br><br>7 &nbsp; &nbsp;&nbsp; All existing inpatient hospices and community hospitals offering inpatient palliative services will transit to offer IHPCS with effect from 1 April 2020.<a name=\"_ftnref2\" title=\"\" href=\"file:///C:/Users/shireen/Desktop/200331%20IHPCS%20Press%20Release%20(final).docx#_ftn2\">[2]</a> Patients can be admitted to IHPCS from acute hospitals. In addition, under IHPCS, we will also allow direct referrals from the community, such as from General Practitioners and Home Palliative Care providers. The expansion of referral pathways will improve the accessibility of inpatient palliative care for patients who require it and facilitate the right-siting of patients.</span></p><p><span style=\"font-family: Arial; font-size: 13px;\"><strong>Extension of subsidies to patients on IHPCS </strong></span></p><p><span style=\"font-family: Arial; font-size: 13px;\">8 &nbsp; &nbsp;&nbsp; Singapore residents admitted into IHPCS are eligible for means-tested Government subsidies of up to 75%. To better support patients who require inpatient palliative care, MediShield Life coverage will be extended to all IHPCS patients, and MediSave withdrawal limits will be increased for patients with more complex needs (see <u>Table 1</u>).<br><br>9 &nbsp; &nbsp;&nbsp; The extension of MediShield Life coverage to IHPCS was recommended by the MediShield Life Council as part of their on-going review of MediShield Life benefits and premiums, which is expected to be completed by end 2020.<br><br>10 &nbsp; &nbsp; With the launch of IHPCS on 1 April, this enhancement is implemented ahead of the completion of the MediShield Life review so that patients can benefit earlier. Singaporeans who cannot afford their bills after subsidies, MediShield Life and MediSave, may apply for MediFund.</span></p><p><span style=\"font-family: Arial; font-size: 13px;\"><u><br>Table 1</u>: MediShield Life and MediSave Limits for IHPCS</span></p><table><tbody><tr><td><span style=\"font-family: Arial; font-size: 13px;\">&nbsp;</span></td><td><span style=\"font-family: Arial; font-size: 13px;\">MediShield Life limits&nbsp;</span></td><td><span style=\"font-family: Arial; font-size: 13px;\">MediSave limits &nbsp;</span></td></tr><tr><td><span style=\"font-family: Arial; font-size: 13px;\">General palliative care&nbsp;</span></td><td><span style=\"font-family: Arial; font-size: 13px;\">&nbsp;$250/day<br></span></td><td><span style=\"font-family: Arial; font-size: 13px;\">&nbsp;$250/day</span></td></tr><tr><td><span style=\"font-family: Arial; font-size: 13px;\">&nbsp;Specialised palliative care</span></td><td><span style=\"font-family: Arial; font-size: 13px;\">&nbsp;$350/day</span></td><td><span style=\"font-family: Arial; font-size: 13px;\">&nbsp;$350/day</span></td></tr></tbody></table><p><span style=\"font-family: Arial; font-size: 13px;\"><br> </span></p><p><span style=\"font-family: Arial; font-size: 13px;\">11 &nbsp; &nbsp; Minister for Health Mr Gan Kim Yong said, “The introduction of the IHPCS will improve patients’ access to high quality, patient-centric and holistic inpatient palliative care. In particular, patients using IHPCS will be able to access inpatient palliative care in a single setting even if their care needs change. With the various affordability enhancements, including the extension of MediShield Life coverage to IHPCS, we seek to provide greater reassurance to end-of-life patients and their caregivers.”<br><br>12 &nbsp; &nbsp; The launch of IHPCS complements MOH’s enhancements to palliative care to better address the needs of the community. As most Singaporeans wish to be cared for at home at the end of life, we have expanded the capacity of home palliative care and day hospice services and increased financial support for these services. Since 2019, we have also introduced a home-based respite care service for home palliative care patients and their caregivers.<br><br>13 &nbsp; &nbsp; For more information on IHPCS and other Intermediate and Long-Term Care Services, patients and their caregivers can visit the Agency for Integrated Care’s website or approach their regular doctors or medical social workers.</span></p> <div><span style=\"font-family: Arial; font-size: 13px;\"><br clear=\"all\"> </span><hr width=\"33%\" size=\"1\" align=\"left\"> <div id=\"ftn1\"> <p><span style=\"font-family: Arial; font-size: 13px;\"><a name=\"_ftn1\" title=\"\" href=\"file:///C:/Users/shireen/Desktop/200331%20IHPCS%20Press%20Release%20(final).docx#_ftnref1\">[1]</a> With the exception of St Joseph’s Home, which will only provide general palliative care. </span></p> </div> <div id=\"ftn2\"> <p><span style=\"font-family: Arial;\"><span style=\"font-size: 13px;\"><a name=\"_ftn2\" title=\"\" href=\"file:///C:/Users/shireen/Desktop/200331%20IHPCS%20Press%20Release%20(final).docx#_ftnref2\">[2]</a> Existing inpatient hospice providers are: Assisi Hospice, Bright Vision Hospital, Dover Park Hospice and St Joseph’s Home. Existing Community Hospital-Palliative providers are: Ang Mo Kio-Thye Hua Kwan Hospital, Sengkang Community Hospital, St Andrew’s Community Hospital, St Luke’s Hospital and Yishun Community Hospital.</span></span><br></p></div></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "new-inpatient-palliative-care-service-from-1-april-2020", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}