{"pressItemDictionary": {"Press Releases": [{"Title": "Updated Border Measures for Travellers From Malaysia and Japan", "PublishedDate": "/Date(1605866400000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "20 Nov 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\">&nbsp; &nbsp; &nbsp; &nbsp;The Multi-Ministry Taskforce has been closely monitoring the global COVID-19 situation and will be tightening border measures given the resurgence of cases in Malaysia and Japan. All travellers entering Singapore from <strong>22 November 2020, 2359 hours</strong>, who have a travel history in the past 14 days to <strong>Malaysia</strong> will now be required to serve a 14-day Stay-Home Notice (SHN) at dedicated SHN facilities. All travellers [except Singapore Citizens (SCs) and Permanent Residents (PRs)] entering Singapore from <strong>27 November 2020, 2359 hours</strong>, who have a travel history in the past 14 days to <strong>Malaysia</strong> will be required to take a COVID-19 polymerase chain reaction (PCR) test within 72 hours before departure.<br><br>2.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;All travellers entering Singapore from <strong>22 November 2020, 2359 hours</strong>, who have a travel history in the past 14 days to <strong>Japan</strong> will be required to serve a 14-day SHN at dedicated SHN facilities, even if they have obtained approval to opt out earlier.&nbsp;<br><br><strong>Travellers from Malaysia to serve 14-Day SHN at dedicated SHN facilities and have pre-departure test&nbsp;<br></strong><br>3.&nbsp; &nbsp; &nbsp; We had earlier announced that travellers from Malaysia (excluding Sabah) are allowed to serve a 7-day SHN at their place of residence while travellers with travel history to Sabah, Malaysia are required to serve a 14-day SHN at dedicated SHN facilities.<br><br>4.&nbsp; &nbsp; &nbsp; Given the sharp increase in cases in Malaysia recently, all travellers entering Singapore from <strong>22 November 2020, 2359 hours</strong> who have a travel history (including transit) in the past 14 days to Malaysia will be required to serve a 14-day SHN at dedicated SHN facilities. This also applies to travellers entering Singapore to work under the Periodic Commuting Arrangement and returning Singapore-based travellers under the Singapore – Malaysia Reciprocal Green Lane (RGL).&nbsp;<br><br>5.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; In addition, travellers who are not SCs or PRs, and who have recent travel history to <strong>Malaysia</strong> within the last 14 days prior to entry will be required to take a COVID-19 PCR test within 72 hours before departure. Travellers will need to present a valid negative COVID-19 test result as a condition of approval to enter Singapore. This requirement will take effect for those arriving in Singapore from <strong>27 November 2020, 2359 hours</strong>. This requirement will not apply for returning Singapore-based travellers under the Singapore – Malaysia RGL.<br><br><strong>Travellers from Japan to serve 14-Day SHN at dedicated SHN facilities<br></strong><br>6.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;As there has been a sharp increase in cases in Japan in the past week, all travellers entering Singapore from <strong>22 November 2020, 2359 hours</strong> who have a travel history to <strong>Japan</strong> in the past 14 days will be required to serve a 14-day SHN at dedicated SHN facilities. These travellers will no longer be able to opt out of dedicated SHN facilities and serve their 14-day SHN at their place of residence, even if they have obtained approval to opt out earlier. The 14-day SHN at dedicated SHN facilities also applies to returning Singapore-based travellers under the Singapore – Japan RGL.<br><br>7.&nbsp; &nbsp; &nbsp; &nbsp;This is revised from our announcement on 27 October 2020 that travellers from Japan were allowed to opt out of serving their 14-day SHN at a dedicated SHN facility if they had a suitable place of residence.&nbsp;<br><br>8.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Travellers from Fiji, Finland, Republic of Korea, Sri Lanka, Thailand and Turkey will continue to be allowed to apply to opt out of dedicated SHN facilities and serve their 14-day SHN at their place of residence, if they fulfil the following criteria:&nbsp;<br><br>a. Travelled to no other country/ region than above-mentioned countries [1], in the last consecutive 14 days prior to entry; and&nbsp;<br> <br>b. Are occupying their place of residence (i.e. residential address) alone, or only with household members who are also persons serving SHN with the same travel history and duration of SHN.&nbsp;<br><br>The COVID-19 tests will continue to be administered before the end of the SHN.<br><br><strong>Regular Review of Border Measures<br></strong><br>9.&nbsp; &nbsp; &nbsp; &nbsp; As the global situation evolves, we will continue to adjust our border measures to manage the risk of importation and transmission to the community. Any changes to border measures will be updated on the <a href=\"https://safetravel.ica.gov.sg\" title=\"\" class=\"\" target=\"\">Safe Travel Office website</a>&nbsp;(<a href=\"https://safetravel.ica.gov.sg\" title=\"\" class=\"\" target=\"\">https://safetravel.ica.gov.sg</a>). Travellers are advised to visit the website to check for the most updated border measures before entering Singapore and be prepared to be subjected to the prevailing border measures upon entry, including payment for their stay at dedicated SHN facilities, tests and treatment.<br><br>10.&nbsp; &nbsp; &nbsp;All travellers are reminded to accurately declare their travel history. Strict enforcement actions will be taken against false declarations.&nbsp;<br><br><strong>MINISTRY OF HEALTH<br>20 NOVEMBER 2020<br><br></strong>[1] Including the following countries/regions: Australia, Brunei Darussalam, Hong Kong, Macao, Mainland China, New Zealand, Taiwan and Vietnam (correct as of 20 November 2020).</p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "updated-border-measures-for-travellers-from-malaysia-and-japan", "CurrentPageUrl": null}, {"Title": "No New Cases of Locally Transmitted Covid-19 Infection ", "PublishedDate": "/Date(1605858360000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "20 Nov 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;As of 20 November 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed that there are no new cases of locally transmitted COVID-19 infection.&nbsp;&nbsp;</p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; There are 4 imported cases, who had already been placed on Stay-Home Notice upon arrival in Singapore.</p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.</p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "no-new-cases-of-locally-transmitted-covid-19-infection-20-nov", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}