{"pressItemDictionary": {"Press Releases": [{"Title": "Special Video Conference of Health Ministers of Asean and the United States On Covid-19", "PublishedDate": "/Date(1588258200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "30 Apr 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Minister for Health Mr Gan Kim Yong participated in the Special Video Conference of Health Ministers of ASEAN and the United States, held on 30 April 2020.<br><br>2.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;The Special Video Conference was convened by the Republic of Indonesia, in its capacity as the chair of the ASEAN Health Ministers Meeting, to enhance cooperation between ASEAN and the US on the response towards the COVID-19 pandemic. The attendees comprised Health Ministers from ASEAN Member States, US Secretary of Health and Human Services, and the ASEAN Secretary General.<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Mr Gan shared on three areas where ASEAN and the US can expand cooperation to manage the pandemic, one of which is the conduct of joint research for the development of therapeutics and vaccines for COVID-19. This is the only way to shorten the crisis and until then, countries should continue to flatten the curve and keep infections low for as long as possible in order to ensure healthcare systems are not overwhelmed. Mr Gan also emphasised the importance of ensuring supply chain connectivity and minimising the impact on the welfare of peoples and societies.<br><br>4.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Noting that the COVID-19 crisis will test our institutions, healthcare systems, standards of governance, social capital and resilience, Mr Gan highlighted the need for unity amongst the international community in the fight against COVID-19.</p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "special-video-conference-of-health-ministers-of-asean-and-the-united-states-on-covid-19", "CurrentPageUrl": null}, {"Title": "528 New Cases of Covid-19 Infection (30 Apr)", "PublishedDate": "/Date(1588230360000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "30 Apr 2020", "Summary": "", "MainContent": "<p>1.&nbsp; &nbsp; &nbsp;As of 30 April 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 528 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders residing in foreign worker dormitories. Six cases are Singaporeans/ Permanent Residents.</p> <p>2.&nbsp; &nbsp; &nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.</p> <div> <p><strong>MINISTRY OF HEALTH</strong></p> </div> <strong>30 APRIL 2020</strong>", "PressCategory": ["Press Releases"], "CustomDetailUrl": "", "UrlName": "528-new-cases-of-covid-19-infection-(30-apr)", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}