{"pressItemDictionary": {"Press Releases": [{"Title": "418 More Cases Discharged; 188 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1593702360000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "02 Jul 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As of 2 July 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 188 cases of COVID-19 infection in Singapore. The breakdown is as follows:<br><strong><br>&nbsp; a)&nbsp;&nbsp;Imported cases: 1 </strong>(1 Work Pass holder)<br><br>There is an imported case today involving a Filipino national who had returned to Singapore from the United Kingdom on 20 June 2020. She is a Work Pass holder who is currently employed in Singapore. She was placed on Stay-Home Notice upon arrival in Singapore, and had been conveyed in a dedicated transport to an SHN facility to commence her 14-day isolation. She is asymptomatic, and had been tested while serving SHN.<br><strong><br>&nbsp; b)&nbsp;&nbsp;Cases in the community: 10 </strong>(8 Singaporeans/Permanent Residents, 2 Work Permit holders)<br><br>Of the 10 cases in the community, 3 had been picked up as a result of our proactive surveillance and screening, and 5 had already been placed on quarantine earlier.<br><br>Amongst the 8 Singaporeans/ Permanent Residents cases, 3 (Cases 44193, 44256 and 44299) had been identified as contacts of previously confirmed cases and had already been quarantined earlier. Another 3 cases (Cases 44261, 44262 and 44263) were detected due to our proactive surveillance of persons working at dormitories, or those deployed to frontline COVID-19 operations, even though they are asymptomatic. Epidemiological investigations are ongoing for the remaining 2 cases (Cases 44167 and 44199)&nbsp; who had been swabbed under our enhanced community testing after being diagnosed with acute respiratory infection.<br><br>Both Work Permit holders (Cases 44258 and 44298) had been identified as contacts of previously confirmed cases, and had already been quarantined earlier. They were tested during quarantine to verify their status.<br><br>Besides the polymerase chain reaction (PCR) test, we also conducted serological tests to determine if some of these cases are current or past infections.<sup>[1]</sup>&nbsp;The serological test result for Cases 44261 and 44262 have come back positive, which indicate likely past infections. The test results for the remaining cases are pending.<br><br>Overall, the number of new cases in the community has increased, from an average of 4 cases per day in the week before, to an average of 9 per day in the past week. The number of unlinked cases in the community has also increased, from an average of 2 cases per day in the week before, to an average of 4 per day in the past week.&nbsp;We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br><strong><br>&nbsp; c)&nbsp;&nbsp;Cases residing in dormitories: 177<br><br></strong>We continue to pick up cases amongst Work Permit holders residing in dormitories, including in factory-converted dormitories, because of extensive testing in these premises, as part of our process to verify and test the status of all workers.&nbsp;<br><br>2.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Details of these trends can be found in MOH’s daily situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\">www.moh.gov.sg/covid-19/situation-report</a>). Please refer to <u><a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-a---2-jul-2020.pdf?sfvrsn=7e555c53_0\" title=\"Annex A\">Annex A</a></u> for the summary of the confirmed cases.<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Of the new cases, 98% are linked to known clusters, while the rest are pending contact tracing.<br><br><strong>Links between previous cases found<br><br></strong>4.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;In the past week (25 June to 1 July), MOH has uncovered links for 11 previously unlinked cases.<br><br>5.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <u><a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-b---2-jul-2020.pdf?sfvrsn=4eafbaff_0\" title=\"Annex B\">Annex B</a></u> and <u><a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-c---2-jul-2020.pdf?sfvrsn=cc31ddd9_0\" title=\"Annex C\">Annex C</a></u> for details.<br><br><strong>Update on condition of confirmed cases<br><br></strong>6.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;418 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 39,429 have fully recovered from the infection and have been discharged from hospitals or community care facilities.<br><br>7.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;There are currently 201 confirmed cases who are still in hospital. Of these, most are stable or improving, and 1 is in critical condition in the intensive care unit. 4,654 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 26 have passed away from complications due to COVID-19 infection.<br><br><strong>MINISTRY OF HEALTH<br></strong><strong>2 JULY 2020</strong></p> <div><br clear=\"all\"> <hr align=\"left\" size=\"1\" width=\"33%\"> <div id=\"ftn1\"> <p><sup>[1]</sup>&nbsp;Cases whose serological tests are positive are likely to have a past infection, and could be shedding minute fragments of the virus RNA picked by the PCR test, which were no longer transmissible and infective to others.</p> </div> </div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "418-more-cases-discharged-188-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "Continued Vigilance Needed With Reopening", "PublishedDate": "/Date(1593685140000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "02 Jul 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As we resume more of our economic and social activities, we must continue to stay vigilant and uphold safe distancing measures. The Ministry of Health (MOH) has stepped up surveillance and contact tracing of the community cases in June. These have been cases that were identified through our expanded testing strategy including regular surveillance testing in higher risk settings, and also testing of those diagnosed with acute respiratory infection (ARI) at first presentation to a doctor. Once a case is detected, MOH will quickly identify all potential close contacts, and test and isolate individuals to protect the community from further transmission. But we will also need everyone to do their part to help control the spread of the infection.<br><br><strong>Closely Monitoring and Aggressive Ring-fencing of Community Cases<br><br></strong>2.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;In the past week, we have seen an average of 8 new community cases a day, of which an average of 4 cases a day are unlinked. This is an increase from around 5 community cases a day in the last week of Phase One, with about 2 a day being unlinked.<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Many of these cases are picked up from our expanded testing strategy, where we test more extensively among key population groups in the community.<br><br>&nbsp; a.&nbsp; We carry out active surveillance of population groups who are deemed vulnerable or who have a higher risk of exposure to COVID-19. These include workers in the construction, marine and process sectors, and frontline workers supporting our COVID-19 operations.<br><br>&nbsp; b.&nbsp; As we re-open our borders and to facilitate travel, we have started testing incoming travellers before the end of their Stay-Home Notice period.<br><br>&nbsp; c.&nbsp; We have also expanded our strategy to test all individuals aged 13 and above who are diagnosed with ARI at first presentation to a doctor.<br><br>4.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Once cases are identified, MOH will utilise a combination of technology tools such as TraceTogether and SafeEntry, as well as professional judgment, to contact trace rapidly and quarantine close contacts. Over time, our speed to isolation has improved, and the average time taken between identification of case to the issuance of a quarantine order to close contacts is now less than a day. To ring-fence and prevent further spread, we also test all close contacts of confirmed COVID-19 cases in the community, at the start and end of their quarantine period.<br><br><strong>Management of Cases at 111 Tampines Street 11<br><br></strong>5.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Our early detection and aggressive case finding efforts have helped us to quickly pick up and ring-fence cases. One example is our management of the cases at Block 111 Tampines Street 11. As part of our proactive screening of COVID-19 frontline workers, MOH picked up a positive case on 23 June involving a 66-year-old&nbsp;Singaporean male<sup>[1]</sup>&nbsp;who works at a dormitory which is a known cluster.&nbsp;Six&nbsp;of his household members<sup>[2]</sup>&nbsp;were subsequently tested positive for COVID-19 as part of contact tracing. Separately, on 27 June, a 15 year-old female Singaporean<sup>[3]</sup>&nbsp;residing in the same block reported sick and was confirmed to have COVID-19 infection after testing. One of her household members<sup>[4]</sup>&nbsp;also tested positive for COVID-19 as part of contact tracing.<br><br>6.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Epidemiological investigations are ongoing to establish if the cases across these two households are linked. However, as a precautionary measure, MOH has placed the 58 households residing within the same section of the block as the two households with confirmed cases under active phone surveillance and is facilitating COVID-19 testing for them and their visitors. Other households within the same block do not need to be tested as they do not share the same set of lifts and stairwell.<br><br>7.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Thus far, MOH has contacted 160 individuals, comprising residents and visitors of the affected households, and have facilitated testing for them at a nearby clinic. Of the 60 individuals who have been tested, so far all have been found to be negative for COVID-19.<br><br>8.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;As these households and visitors are not close contacts of the confirmed cases, they are assessed to have a low risk of being infected. They are therefore not placed on quarantine but put under active phone surveillance as a precautionary measure. They will be contacted daily by MOH to monitor their health status, for up to 14 days, till 12 July. Identified residents can continue their essential daily activities if they are well, including going to work or school, but are encouraged to minimise non-essential activities especially while awaiting their COVID-19 test results. They are advised to monitor their health. Should they develop acute respiratory infection symptoms, they should seek immediate medical attention at nearby Public Health Preparedness Clinics (PHPCs) or polyclinics.<br><br>9.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;In addition to our testing and contact tracing efforts, the Town Council has also taken steps to clean and disinfect the common areas in the entire block.As a further precautionary measure, the Town Council has also stepped up cleaning and disinfection of surrounding blocks.<br><br>10.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Residents can call MOH at 1800-333-9999 if they have queries.<br><br><strong>Staying Vigilant&nbsp;&nbsp;<br><br></strong>11.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As we resume more activities under Phase Two, we must expect the number of cases to increase. We will need to continue to stay vigilant. The implementation of strong safe management measures, safe distancing measures and strict infection control measures by everyone is also key to reducing spread. Individuals should also use the TraceTogether and SafeEntry applications to facilitate contact tracing, and quickly see a doctor if they have respiratory symptoms. Together with everyone’s collective efforts, we can keep COVID-19 under control while we progressively resume activities safely.<br><br><br><strong>MINISTRY OF HEALTH<br></strong><strong>2 JULY 2020</strong></p> <div><br clear=\"all\"> <hr align=\"left\" size=\"1\" width=\"33%\"> <div id=\"ftn1\"> <p><sup>[1]&nbsp;</sup>Case 42616<br><sup>[2]</sup>&nbsp;Cases 42943, 43261, 43263, 43146, 43262 and 44052<br><sup>[3]</sup>&nbsp;Case 43297<br><sup>[4]</sup>&nbsp;Case 44053</p></div> </div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "continued-vigilance-needed-with-reopening", "CurrentPageUrl": null}, {"Title": "188 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1593673680000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "02 Jul 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;As of 2 July 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 188 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders residing in foreign worker dormitories. Based on our investigations so far, there are 10 cases in the community, of whom 8 are Singaporeans/ Permanent Residents and 2 are Work Pass holders. In addition, there is an imported case who had been placed on Stay-Home Notice upon arrival in Singapore.<br><br>2.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.<br><br><strong><br>MINISTRY OF HEALTH<br></strong><strong>2 JULY 2020</strong></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "188-new-cases-of-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}