{"pressItemDictionary": {"Press Releases": [{"Title": "291 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1593187200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "27 Jun 2020", "Summary": "", "MainContent": "1.&nbsp; &nbsp; &nbsp; As of 27 June 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 291 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders residing in foreign worker dormitories. Based on our investigations so far, there are 11 cases in the community, of whom 5 are Singaporeans/ Permanent Residents and 6 are Work Pass holders.<br><br>2.&nbsp; &nbsp; &nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "291-new-cases-of-covid-19-infection", "CurrentPageUrl": null}, {"Title": "338 More Cases Discharged, 291 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1593187200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "27 Jun 2020", "Summary": "", "MainContent": "1.&nbsp; &nbsp; &nbsp; As of 27 June 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 291 cases of COVID-19 infection in Singapore. The breakdown is as follows:<br><br><strong>a)&nbsp; &nbsp; &nbsp; Imported cases: 0</strong><br><br>There are no imported cases today.&nbsp;<br><br><strong>b)&nbsp; &nbsp; &nbsp; Cases in the community: 11</strong> (5 Singaporeans, 2 Work Pass holders, 4 Work Permit holders)<br><br>Of the 11 cases in the community,&nbsp; 5 had been picked up as a result of our proactive surveillance and screening, and 5 had already been placed on quarantine earlier.<br><br>Amongst the 5 Singaporean cases, 3 (Cases 43261, 43262 and 43263) are from a family cluster. They were contacts of a previously confirmed case who had been tested as he works at a dormitory. All 3 cases had already been quarantined, and were swabbed during quarantine to verify their status. Another case (Case 43278) was detected due to our proactive surveillance of persons working at dormitories, even though he is asymptomatic. Epidemiological investigations are ongoing for the remaining case (Case 43099).<br><br>Amongst the 6 Work Pass/ Work Permit holders, 2 (Cases 43100 and 43146<sup>1</sup>) had been identified as contacts of previously confirmed cases, and had already been quarantined earlier. They were swabbed during quarantine to verify their status. The remaining 4 cases (Cases 43228, 43229, 43264 and 43280) were detected as part of our screening of workers in essential services.<br><br>Overall, the number of new cases in the community has increased, from an average of 4 cases per day in the week before, to an average of 6 per day in the past week. The number of unlinked cases in the community has also increased, from an average of 2 cases per day in the week before, to an average of 3 per day in the past week. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br><br>With more activities resuming in Phase Two, it is critical that we continue to exercise caution to keep the number of new cases under control. All of us must adhere to safe management principles. Irresponsible behaviour that disregards the spirit of the rule to limit social gatherings to not more than 5 persons endangers others, and may lead to the formation of large infection clusters. We urge everyone to continue to exercise personal responsibility and not put the community at risk. We take a serious view of such breaches and will not hesitate to take actions against individuals who breach the rules.<br><br><strong>c)&nbsp; &nbsp; &nbsp; Cases residing in dormitories: 280</strong><br><br>We continue to pick up cases amongst Work Permit holders residing in dormitories, including in factory-converted dormitories, because of extensive testing in these premises, as part of our process to verify and test the status of all workers.<br><br>2.&nbsp; &nbsp; &nbsp; Details of these trends can be found in MOH's daily situation Report (www.moh.gov.sg/covid-19/situation-report). Please refer to <a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-a---27-jun-2020.pdf?sfvrsn=e8574dc4_4\" title=\"Annex A\">Annex A</a>&nbsp;for the summary of the confirmed cases.<br><br>3.&nbsp; &nbsp; &nbsp; Of the new cases, 97% are linked to known clusters, while the rest are pending contact tracing.<br><br>4.&nbsp; &nbsp; &nbsp; MOH has been monitoring existing clusters for any further transmission. As there have been no more cases linked to 564 A-E Balestier Road for the past two incubation periods (i.e. 28 days), the cluster has now been closed.<br><br>5.&nbsp; &nbsp; &nbsp; We have completed a round of surveillance tests for non-residential community staff including staff from kidney dialysis centres, home care and senior care centres. Out of more than 5,700 staff tested, all were tested negative with the exception of one staff who had been announced on 26 June.<br><br><strong>Links between previous cases found</strong><br><br>6.&nbsp; &nbsp; &nbsp; In the past week (20 June to 26 June), MOH has uncovered links for 7 previously unlinked cases.<br><br>7.&nbsp; &nbsp; &nbsp; Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-b---27-jun-2020.pdf?sfvrsn=3f5a2f2d_4\" title=\"Annex B\">Annex B</a>&nbsp;and <a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-c---27-jun-2020.pdf?sfvrsn=b563480c_4\" title=\"Annex C\">Annex C</a>&nbsp;for details.<br><br><strong>Update on condition of confirmed cases</strong><br><br>8.&nbsp; &nbsp; &nbsp; 338 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 37,163 have fully recovered from the infection and have been discharged from hospitals or community care facilities.<br><br>9.&nbsp; &nbsp; &nbsp; There are currently 174 confirmed cases who are still in hospital. Of these, most are stable or improving, and 1 is in critical condition in the intensive care unit. 5,883 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 26 have passed away from complications due to COVID-19 infection.<br><br>10.&nbsp; &nbsp; &nbsp; Case 38238, a 27 year-old male Bangladeshi national, has passed away on 25 June 2020. He was confirmed to have COVID-19 infection on 6 June. The cause of death was multiple injuries consistent with those resulting from a fall from height<sup>2</sup>.&nbsp;<br>&nbsp;<br>[1] Case 43146 is part of the family cluster with the other 3 Singaporean cases (Cases 43261, 43262 and 43263) today.<br><br>[2] Only cases where the attending doctor or pathologist attributes the primary or underlying cause of death as due to COVID-19 infection will be added to the COVID-19 death count. This is consistent with international practice for classifying deaths.<br><div><br></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "338-more-cases-discharged-291-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}