{"pressItemDictionary": {"Press Releases": [{"Title": "135 More Cases Discharged; 191 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1594395000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "10 Jul 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; As of 10 July 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 191 cases of COVID-19 infection in Singapore. The breakdown is as follows:</p> <p><strong>a) Imported cases: 1 </strong>(1 Permanent Resident) <br><br>There is an imported case today involving a Singapore Permanent Resident who returned to Singapore from India on 6 July. She had been placed on 14-day Stay-Home Notice (SHN) upon arrival in Singapore, and had been tested while serving SHN.&nbsp;<br><br><strong>b)</strong>&nbsp;<strong>Cases in the community: 16 </strong>(7 Singaporeans, 5 Work Pass holders, 4 Work Permit holders) <br><br>Of the 16 cases in the community, 5 were picked up as a result of our proactive surveillance and screening, and 8 had already been placed on quarantine earlier. 10 of the cases are asymptomatic, and were all detected through our proactive testing. <br><br>8 of the community cases today are linked to previous cases or clusters. All of them had been identified as contacts of previously confirmed cases, and had been tested during their quarantine to determine their status. Of these, two cases (Cases 45482 and 45495) are family members of a known family cluster at 111 Tampines Street 11, and had earlier been quarantined. Thus far there is no evidence of spread beyond the 2 affected households that were previously announced. [1]&nbsp;MOH will continue to closely monitor the situation. <br><br>8 of the community cases are currently unlinked. Of these, 5 cases were detected from our proactive testing. 4 of them (Cases 45497, 45498, 45499 and 45500) were detected as a result of our proactive screening of workers in essential services, even though 3 of them are asymptomatic. Another (Case 45496) was swabbed as part of our efforts to screen individuals working in frontline COVID-19 operations. The remaining 3 cases (Cases 45479, 45481 and 45597) were symptomatic, and had been tested under our enhanced community testing to test all individuals aged 13 and above who are diagnosed with acute respiratory infection at first presentation to a doctor. The serological test result for Case 45479 is positive, which indicates likely past infection.[2]<br><br>Epidemiological investigations of the unlinked cases are in progress. In the meantime, all the identified close contacts of the cases have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for their household contacts to determine if these cases could have been infected by them. <br><br>Overall, the number of new cases in the community has increased, from an average of 9 cases per day in the week before, to an average of 16 per day in the past week. The number of unlinked cases in the community has also increased, from an average of 5 cases per day in the week before, to an average of 9 per day in the past week.&nbsp;We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.&nbsp;<br><br><strong>c)&nbsp;</strong>&nbsp;<strong>Cases residing in dormitories: 174&nbsp;&nbsp;<br><br><span style=\"font-size: 13px;\"></span></strong><span style=\"font-size: 13px;\">We continue to pick up cases amongst Work Permit holders residing in dormitories, including in factory-converted dormitories, because of extensive testing in these premises, as part of our process to verify and test the status of all workers.&nbsp;<br><br>2.&nbsp; &nbsp;</span>Details of these trends can be found in MOH’s daily situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\">www.moh.gov.sg/covid-19/situation-report</a>). Please refer to <u><a href=\"/docs/librariesprovider5/default-document-library/annex-a44240acef63745c6987ef513baa3a639.pdf?sfvrsn=ff3a107c_0\" title=\"Annex A\">Annex A</a></u> for the summary of the confirmed cases. <br><br>3.&nbsp; &nbsp;Of the new cases, 94% are linked to known clusters, while the rest are pending contact tracing.&nbsp;<br><br><strong>Links between previous cases found&nbsp;<br><br></strong>4<strong>.&nbsp; &nbsp;</strong>In the past week (3 July to 9 July), MOH has uncovered links for 4 previously unlinked cases. <br><br>5.&nbsp; &nbsp;Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <u><a href=\"/docs/librariesprovider5/default-document-library/annex-b7f10e67f466043efaebbc8680afbce32.pdf?sfvrsn=94cb79ea_0\" title=\"Annex B\">Annex B</a></u> and <u><a href=\"/docs/librariesprovider5/default-document-library/annex-c0d0da465d65e4c48bbbf1a908e4775e8.pdf?sfvrsn=25b56162_0\" title=\"Annex C\">Annex C</a></u> for details.&nbsp;<br><br><strong>Update on condition of confirmed cases&nbsp;<br><br></strong>6.&nbsp; &nbsp;135 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 41,780 have fully recovered from the infection and have been discharged from hospitals or community care facilities.&nbsp; <br><br>7.&nbsp; &nbsp;There are currently 203 confirmed cases who are still in hospital. Of these, most are stable or improving, and 1 is in critical condition in the intensive care unit. 3,604 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 26 have passed away from complications due to COVID-19 infection.&nbsp;<br><br><strong>MINISTRY OF HEALTH<br></strong><strong>10 JULY 2020</strong></p><div> <p><strong>&nbsp;</strong></p> </div> <div><br clear=\"all\"> <hr align=\"left\" size=\"1\" width=\"33%\"> <div id=\"ftn1\"> <p>[1] In total, 123 residents and visitors have been tested so far, and all the results have come back negative for COVID-19.</p> </div> <div id=\"ftn2\"> <p>[2] Cases whose serological tests are positive are likely to have a past infection, and could be shedding minute fragments of the virus RNA picked by the PCR test, which were no longer transmissible and infective to others.</p> </div> </div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "135-more-cases-discharged-191-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "191 New Cases of Covid-19 Infection (10 July)", "PublishedDate": "/Date(1594364700000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "10 Jul 2020", "Summary": "", "MainContent": "<p align=\"center\" style=\"text-align: left;\"><span style=\"text-align: left;\">&nbsp; &nbsp; &nbsp; As of 10 July 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 191 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders residing in foreign worker dormitories. Based on our investigations so far, there are 16 cases in the community, of whom 7 are Singaporeans/ Permanent Residents and 9 are Work Pass holders. From our preliminary investigations, of these 16 cases, 8 were close contacts of earlier cases, and had already been placed on quarantine. Epidemiological investigations are ongoing for the other cases.&nbsp;<br><br>2.&nbsp; &nbsp; &nbsp;&nbsp;</span>In addition, there is 1 imported case who had been placed on Stay-Home Notice upon arrival in Singapore. <br><br>3.&nbsp; &nbsp; &nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.</p> <p>&nbsp;</p> <p>&nbsp;</p> <div> <p><strong>MINISTRY OF HEALTH<br></strong><strong>10 JULY 2020</strong></p> <p>&nbsp;</p> </div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "191-new-cases-of-covid-19-infection-(10-july)", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}