{"pressItemDictionary": {"Press Releases": [{"Title": "1 New Case of Locally Transmitted Covid-19 Infection ", "PublishedDate": "/Date(1607182080000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "05 Dec 2020", "Summary": "", "MainContent": "&nbsp; &nbsp; &nbsp; &nbsp; As of 5 December 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified that there is 1 new case of locally transmitted COVID-19 infection. The case is in the community, and there are no new cases in the dormitories. There are 12 imported cases, of whom 11 who had already been placed on Stay-Home Notice (SHN) or isolated upon arrival in Singapore. Amongst the new cases today, 10 are asymptomatic, and were detected from our proactive screening and surveillance, while 3 were symptomatic.&nbsp;&nbsp;<br><br><strong>Summary of new cases</strong><br><div><br><div dir=\"ltr\" align=\"left\"><table><colgroup><col width=\"129\"><col width=\"60\"><col width=\"16\"><col width=\"96\"><col width=\"96\"><col width=\"16\"><col width=\"96\"><col width=\"96\"></colgroup><tbody><tr><td><br></td><td><strong><br></strong></td><td colspan=\"2\"><p dir=\"ltr\"><strong>Breakdown by</strong></p></td><td colspan=\"2\"><p dir=\"ltr\"><strong>Breakdown by</strong></p></td></tr><tr><td><strong><br></strong></td><td><p dir=\"ltr\"><strong>Number of cases</strong></p></td><td><p dir=\"ltr\"><strong>Already in quarantine/ isolation before detection</strong></p></td><td><p dir=\"ltr\"><strong>Detected from surveillance</strong></p></td><td><p dir=\"ltr\"><strong>Symptomatic</strong></p></td><td><p dir=\"ltr\"><strong>Asymptomatic</strong></p></td></tr><tr><td><p dir=\"ltr\"><strong>Cases in the community</strong></p></td><td><p dir=\"ltr\">1</p></td><td><p dir=\"ltr\">1</p></td><td><p dir=\"ltr\">0</p></td><td><p dir=\"ltr\">0</p></td><td><p dir=\"ltr\">1</p></td></tr><tr><td><p dir=\"ltr\"><strong>Cases residing in dormitories</strong></p></td><td><p dir=\"ltr\">0</p></td><td><p dir=\"ltr\">0</p></td><td><p dir=\"ltr\">0</p></td><td><p dir=\"ltr\">0</p></td><td><p dir=\"ltr\">0</p></td></tr><tr><td><p dir=\"ltr\"><strong>Imported cases</strong></p></td><td><p dir=\"ltr\">12</p></td><td><p dir=\"ltr\">11</p></td><td><p dir=\"ltr\">1</p></td><td><p dir=\"ltr\">3</p></td><td><p dir=\"ltr\">9</p></td></tr><tr><td><p dir=\"ltr\"><strong>Total</strong></p></td><td><p dir=\"ltr\">13</p></td><td><br></td><td><br></td><td><br></td><td><br></td></tr></tbody></table></div><br>2.&nbsp; &nbsp; &nbsp;Overall, the number of new cases in the community has remained low, with a total of 4 cases in the past week, of whom 3 are currently unlinked. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br><br><strong>Case Details</strong><br><br><strong>a)&nbsp; Cases in the community: 1</strong><br><br>There is 1 case in the community today. Case 58461 is a Filipino sea crew who arrived from the Philippines on the Normand Australis, which docked at Tuas Port on 18 November. He had earlier been identified as a close contact of Case 58357 <sup>1</sup>, and was already placed on quarantine at a government quarantine facility since 22 November. Prior to that, he had not disembarked from the ship.<br><br>Before boarding the ship, Case 58461 had undergone a COVID-19 pre-departure test on 2 November which came back negative. Upon the ship’s arrival in Singapore, all 18 crew members had been swabbed on 19 November, and all of them tested negative except for Case 58357. As a precautionary measure, the crew members were placed on quarantine, and Case 58461 was moved to a government quarantine facility to serve his quarantine. He is asymptomatic, and was swabbed during quarantine to verify his status. His serological test has come back positive.<br><br><strong>b)&nbsp; Cases residing in dormitories: 0</strong><br><br>There are no cases residing in dormitories today.&nbsp;<br><br><strong>c)&nbsp; Imported cases: 12<br></strong><br>Amongst the 12 imported cases, 2 (Cases 58459 and 58465) are Singaporeans who returned from the US and Indonesia, and 4 (Cases 58460, 58462, 58469 and 58470) are Singapore Permanent Residents who returned from the US, India and Indonesia. Another 4 (Cases 58464, 58467, 58471 and 58472) are Work Permit holders currently employed in Singapore who arrived from Indonesia and the Philippines. The remaining cases are a Dependant’s Pass holder (Case 58466) who arrived from Nepal and a Short-Term Visit Pass holder (Case 58463) who arrived from Indonesia to visit her relatives who are Singaporeans.&nbsp;<br><br>Case 58465 is a Singaporean who had travelled to Indonesia under the Business Travel Pass. He had undergone a COVID-19 Polymerase Chain Reaction (PCR) test upon return to Singapore on 28 November, and self-isolated while waiting for his test result. His test came back negative but he developed symptoms on 2 December, and was tested for COVID-19&nbsp; when he sought medical treatment at a General Practitioner clinic. He was confirmed to have COVID-19 infection on 4 December, and is currently isolated at the National Centre for Infectious Diseases. Prior to hospitalisation, he had gone to work at ASL Shipyard Pte Ltd (19 Pandan Road), but had not interacted with his colleagues. His serological test has come back negative, which indicates likely current infection. All his identified close contacts have been isolated and placed on quarantine.<br><br>All the other 11 imported cases had already been placed on SHN or isolated upon arrival in Singapore and were tested while serving SHN or during isolation.&nbsp;&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp;Please refer to the <a href=\"/docs/librariesprovider5/default-document-library/annexes13ef76c7e837409dbf66d6618b3c595e.pdf?sfvrsn=7fe9166a_0\" title=\"Annexes \">Annexes </a>and MOH’s daily Situation Report (<a href=\"https://www.moh.gov.sg/covid-19/situation-report\" title=\"\" class=\"\" target=\"\">www.moh.gov.sg/covid-19/situation-report</a>) for details.&nbsp;<br><br>4.&nbsp; &nbsp; &nbsp;Epidemiological investigations are in progress. In the meantime, all the identified close contacts of the cases have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for the close contacts to determine if the cases could have been infected by them.<br><br><strong>Update on condition of confirmed cases</strong><br><br>5.&nbsp; &nbsp; &nbsp;6 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 58,158 have fully recovered from the infection and have been discharged from hospitals or community care facilities.&nbsp;<br><br>6.&nbsp; &nbsp; &nbsp;There are currently 26 confirmed cases who are still in hospital. Of these, most are stable or improving, and none is in the intensive care unit. 42 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 29 have passed away from complications due to COVID-19 infection.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>5 DECEMBER 2020</strong><br>&nbsp;<br><br><hr><br><div><sup>1 </sup><span style=\"font-size: 11px;\">Case 58357 is a Special Pass holder who is a crew member of the Normand Australis. He was confirmed to have COVID-19 infection on 21 November, and announced as a case in MOH’s press release on 22 November.&nbsp;</span></div><br></div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "1-new-case-of-locally-transmitted-covid-19-infection-5Dec-updated", "CurrentPageUrl": null}, {"Title": "Seoul Garden Restaurant In Tampines Mall to Suspend Operations for Breaching Safe Management Measures", "PublishedDate": "/Date(1607162400000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "05 Dec 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\"><span style=\"font-family: Arial;\"><span style=\"font-size: 14px;\">&nbsp; &nbsp; &nbsp; The Ministry of Health (MOH) has ordered the Seoul Garden restaurant located in Tampines Mall (4 Tampines Central 5 #04-01 Tampines Mall) to suspend its full operations (inclusive of both dining in and take-away) for 10 days between 5 December and 14 December 2020, with both dates inclusive, after investigations revealed that the restaurant had failed to ensure safe management measures (SMMs) on its premises.&nbsp;<br><br>2.&nbsp; &nbsp; &nbsp;MOH commenced investigations in respect of potential breaches of SMMs upon receiving information that an individual (Case 58401 <sup><span style=\"font-size: 11px;\">[1]</span></sup>) had tested positive for COVID-19 infection after having dinner with 12 other family members at the restaurant on 21 November 2020. Although the family members were seated at separate tables of up to five persons per table, investigations revealed that there had been mingling among them. The restaurant did not take reasonable steps to prevent the intermingling between tables on its premises.&nbsp;&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp;Investigations against the restaurant, as well as Case 58401 and his family members are ongoing, and further enforcement action may be taken pending the outcome of investigations.&nbsp; &nbsp;<br><br>4.&nbsp; &nbsp; MOH will not hesitate to take enforcement action against operators and individuals who fail to comply with the safe distancing and safe management measures. Any person convicted of an offence under the COVID-19 (Temporary Measures) Act 2020 is liable to a fine of up to $10,000, or up to six months’ imprisonment, or to both. In the case of second or subsequent offence, to a fine not exceeding $20,000 or to imprisonment for a term not exceeding 12 months or to both.&nbsp;<br><br>5.&nbsp; &nbsp; &nbsp;We urge everyone to continue to exercise social responsibility, and to comply with the prevailing measures. A resurgence of COVID-19 cases and clusters can easily emerge in our community if we let our guard down and become lax in adherence to SMMs.<br><br><br><strong>MINISTRY OF HEALTH<br>5 DECEMBER 2020</strong><br><br>==<br><span style=\"font-size: 12px;\">[1]&nbsp;Case 58401 is a 32 year-old male Singaporean who was confirmed to have COVID-19 infection on 25 November. MOH had earlier announced this on 26 November.</span></span></span></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "seoul-garden-restaurant-in-tampines-mall-to-suspend-operations-for-breaching-safe-management-measures", "CurrentPageUrl": null}, {"Title": "1 New Case of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1607154360000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "05 Dec 2020", "Summary": "", "MainContent": "&nbsp; &nbsp; &nbsp; As of 5 December 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 1 new case of locally transmitted COVID-19 infection. Based on our investigations so far, the case is in the community and had already been placed on quarantine earlier. There are no new cases in the dormitories.&nbsp;<br><br>2.&nbsp; &nbsp;In addition, there are 12 imported cases. Of these, 11 had already been placed on Stay-Home Notice or isolated upon arrival in Singapore. The remaining case is a Singaporean who had travelled to Indonesia under the Business Travel Pass. He had undergone a COVID-19 Polymerase Chain Reaction (PCR) test upon return to Singapore on 28 November, and self-isolated while waiting for his test result. His test came back negative on 29 November but he developed symptoms on 2 December, and was confirmed to have COVID-19 infection on 4 December.&nbsp;<br><br>3.&nbsp; &nbsp;In total, there are 13 new cases of COVID-19 infection in Singapore today.&nbsp;<br><br>4.&nbsp; &nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;<br><br><strong><br>MINISTRY OF HEALTH<br>5 DECEMBER 2020</strong><br><div><br></div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "1-new-case-of-locally-transmitted-covid-19-infection-5Dec", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}