{"pressItemDictionary": {"Press Releases": [{"Title": "216 More Cases Discharged, 102 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1597327680000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "13 Aug 2020", "Summary": "", "MainContent": "1.&nbsp; &nbsp; &nbsp; As of 13 August 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 102 cases of COVID-19 infection in Singapore. The breakdown of the cases is as follows:<br><br><strong>a)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Imported cases: 6</strong> (2 Singaporeans, 4 Special Pass holders)<br><br>Amongst the 6 imported cases, 2 are Singaporeans who returned to Singapore from the Philippines on 11 August (Case 55482) and from the UAE on 1 August (Case 55561). They had both been placed on 14-day Stay-Home Notice (SHN) upon arrival in Singapore, and were serving their SHN at dedicated facilities. They had been tested while serving their SHN.<br><br>The remaining cases (Cases 55555, 55556, 55557 and 55558) are seamen who are Special Pass holders. They arrived in Singapore from India on 8 August on a vessel, where they had not disembarked from. They subsequently reported symptoms and were swabbed while on the vessel, where they had remained until their test results came back positive for COVID-19. They were then conveyed in ambulances to a hospital.<br><br><strong>b)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Cases in the community: 5</strong> (1 Permanent Resident, 4 Work Permit holders)<br><br>Of the 5 cases in the community, 4 were picked up as a result of our proactive surveillance and screening, and 1 had already been placed on quarantine earlier. All of them are asymptomatic, and were detected through our proactive testing.<br><br>There is 1 case in the community today (Case 55562) who had been identified as a contact of a previously confirmed case. She had been placed on quarantine earlier, and was tested during quarantine to determine her status.<br><br>4 of the community cases are currently unlinked. Of these, 3 cases (Cases 55559, 55570 and 55576) were identified as a result of our periodic screening of workers in essential services who are living outside the dormitories. The remaining case (Case 55577) was tested as part of our efforts to screen individuals working in frontline COVID-19 operations. To determine if these cases are current or past infections, we also conducted serological tests for them, and the results for all 4 cases have come back positive, which indicate likely past infections<sup>1</sup>.<br><br>Epidemiological investigations of the unlinked cases are in progress. In the meantime, all the identified close contacts of the cases have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for their household contacts to determine if these cases could have been infected by them.<br><br>Overall, the number of new cases in the community has remained stable at an average of 2 cases per day in the past 2 weeks. The number of unlinked cases in the community has also remained stable at an average of 1 case per day in the past 2 weeks. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br><br><strong>c)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Cases residing in dormitories: 91</strong><br><br>The Inter-agency Taskforce has completed the testing of all workers in the dormitories. There are currently about 21,700 workers who are still serving out their quarantine period. These workers will be tested when their quarantine ends, and we expect the case counts to remain high in the coming days, before tapering down thereafter.<br><br>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Details of these trends can be found in MOH’s daily situation Report (<a href=\"https://www.moh.gov.sg/covid-19/situation-report\" title=\"\" class=\"\" target=\"\">www.moh.gov.sg/covid-19/situation-report</a>). Please refer to <a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-a---13-aug-2020.pdf?sfvrsn=4bb6c462_2\" title=\"Annex A\">Annex A</a>&nbsp;for the summary of the confirmed cases.<br><br>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Of the new cases, 95% are linked to known clusters, while the rest are pending contact tracing.<br><br>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The following dormitories have been cleared by the Inter-agency Taskforce, and now house only recovered individuals and those who have recently tested negative for COVID-19 infection. As such, the clusters have now been closed.<br><br>&nbsp;<br>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 79 Kaki Bukit Industrial Terrace<br>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 9A Tech Park Crescent<br>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 10 Tech Park Crescent<br>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 55 Tuas South Avenue 1<br>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 15 Tuas View Close<br>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 36 Tuas View Square<br>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 38 Tuas View Square<br>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 54/56 Tuas View Square<br>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 145 Tuas View Square<br>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Hai Leck Engineering Pte Ltd (12 Tuas Drive 1)<br>&nbsp;<br>&nbsp;<br><strong>Links between previous cases found</strong><br><br>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-b---13-aug-2020.pdf?sfvrsn=b907c3a9_2\" title=\"Annex B\">Annex B</a>&nbsp;and <a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-c---13-aug-2020.pdf?sfvrsn=e3198df8_2\" title=\"Annex C\">Annex C</a>&nbsp;for details.<br><br><strong>Update on condition of confirmed cases</strong><br><br>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 216 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 50,736 have fully recovered from the infection and have been discharged from hospitals or community care facilities.<br><br>7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; There are currently 91 confirmed cases who are still in hospital. Of these, most are stable or improving, and none is in the intensive care unit. 4,643 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 27 have passed away from complications due to COVID-19 infection.<br><br>[1] Cases whose serological tests are positive are likely to have a past infection, and could be shedding minute fragments of the virus RNA picked by the PCR test, which were no longer transmissible and infective to others.<br>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "216-more-cases-discharged-102-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "102 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1597248000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "13 Aug 2020", "Summary": "", "MainContent": "1.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; As of 13 August 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 102 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders currently under quarantine. Based on our investigations so far, there are 5 cases in the community, of whom 1 is a Singapore Permanent Resident and 4 are Work Pass holders.<br><br>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In addition, there are 6 imported cases, who had all been placed on Stay-Home Notice upon arrival in Singapore.&nbsp;<br><br>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "102-new-cases-of-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}