{"pressItemDictionary": {"Press Releases": [{"Title": "15 More Cases Discharged; 75 More Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1586001600000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "04 Apr 2020", "Summary": "", "MainContent": "<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 15 more cases<sup>[1] </sup>of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 297 have fully recovered from the infection and have been discharged from hospitals or community isolation facilities. </p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; As of 4 April 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 75 cases of COVID-19 infection in Singapore, of which six are imported and 69 are local cases who have no recent travel history abroad. </p><p>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The six imported cases<sup>[2] </sup>had travel history to Europe, North and South America and ASEAN.<br>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 40 cases<sup>[3] </sup>are linked to previous cases or clusters.<br>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 29 cases<sup>[4] </sup>are currently unlinked, and contact tracing is ongoing. </p><p>&nbsp;</p><p><strong>Links between previous cases found</strong></p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases.</p><p>a)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; One of the newly confirmed case (Case 1124) is linked to two previous cases (Cases 1054 and 1077), forming a new cluster at Sungei Tengah Lodge (500 Old Choa Chu Kang Road).</p><p>b)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Two of the newly confirmed cases (Cases 1148 and 1150) are linked to three previous cases (Cases 963, 1079 and 1106), forming a new cluster at Toh Guan Dormitory (19A Toh Guan Road East).</p><p>c)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Four of the earlier confirmed cases (Cases 956, 967, 1104 and 1018) have now been linked to a new cluster at Cochrane Lodge II (49 Admiralty Road West).</p><p>d)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; One of the newly confirmed cases (Case 1115) is linked to three previous cases (Cases 510, 511 and 1007), forming a new cluster at The Orange Ballroom (845 Geylang Road).</p><p>e)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 17 additional cases are linked to the cluster at S11 Dormitory @ Punggol (2 Seletar North Link), which has a total of 41 confirmed cases<sup>[5] </sup>now.</p><p>f)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; One additional case is linked to the cluster at Westlite Toh Guan dormitory (18 Toh Guan Road East), which has a total of 18 confirmed cases now (Cases 655, 875, 922, 924, 925, 926, 934, 977, 1011, 1012, 1054, 1062, 1068, 1072, 1100, 1101, 1113 and 1176).</p><p>g)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Three additional cases are linked to the cluster at a construction site at Project Glory (50 Market Street), which has a total of nine confirmed cases now (Cases 956, 967, 1019, 1078, 1079, 1104, 1120, 1124 and 1149).</p><p>h)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Four additional cases are linked to the cluster at Mustafa Centre (145 Syed Alwi Road), which has a total of 19 cases now (Cases 616, 788, 866, 908, 911, 938, 1001, 1015, 1024, 1025, 1026, 1046, 1056, 1093, 1096, 1127, 1180, 1188 and 1189). </p><p>i)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Two additional cases are linked to the cluster at Keppel Shipyard (51 Pioneer Sector 1), which has a total of six cases now (Cases 878, 898, 907, 1076, 1158 and 1172). </p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Contact tracing is underway for 145 locally transmitted cases to establish any links to previous cases or travel history to affected countries or regions. </p><p>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Please refer to the <a title=\"Annex\" href=\"/docs/librariesprovider5/pressroom/annex4-4b.pdf?sfvrsn=10812ddd_2\">Annex</a>&nbsp;for a summary of the confirmed cases, and the MOH website for the situation report (<a title=\"\" href=\"http://www.moh.gov.sg/covid-19/situation-report\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?q=http://www.moh.gov.sg/covid-19/situation-report&amp;source=gmail&amp;ust=1586091584359000&amp;usg=AFQjCNGs1pIQ7MFuLEamI5x0e-M9ym9rVw\">www.moh.gov.sg/covid-19/<wbr>situation-report</a>). </p><p>&nbsp;</p><p><strong>Cases from public healthcare sector</strong></p><p><u>Case 1137 </u></p><p>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 1137 is a 24 year-old female Malaysian national who is a Long Term Pass holder with no recent travel history to affected countries or regions. </p><p>7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; As she had been identified as a contact of Case 853, she was issued a home quarantine order on 31 March. She reported onset of symptoms on 2 April, and subsequent test results confirmed COVID-19 infection on 3 April afternoon. She is currently warded in an isolation room at the National Centre for Infectious Diseases (NCID). </p><p>8.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; She is employed as porter at Tan Tock Seng Hospital. Prior to hospital admission, she had not gone to work. </p><p>&nbsp;</p><p><u>Case 1151</u></p><p>9.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 1151 is a 20 year-old female Malaysian national who is a Singapore Work Pass holder and has no recent travel history to affected countries or regions. She reported onset of symptoms on 31 March, and subsequent test results confirmed COVID-19 infection on 3 April. She is currently warded in an isolation room at Sengkang General Hospital (SKH). </p><p>10.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; She is employed as a healthcare assistant at SKH but had not gone to work since onset of symptoms. </p><p>&nbsp;</p><p><u>Case 1159 </u></p><p>11.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 1159 is a 33 year-old female Singapore Citizen who has no recent travel history to affected countries or regions. She reported onset of symptoms on 3 April, and subsequent test results confirmed COVID-19 infection on the same day. She is currently warded in an isolation room at NCID. </p><p>12.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; She is employed as a patient service associate at NCID, but had not interacted with any patients or visitors since onset of symptoms. </p><p>&nbsp;</p><p><u>Case 1170 </u></p><p>13.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 1170 is a 54 year-old female Singapore Permanent Resident who has no recent travel history to affected countries or regions. </p><p>14.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; As she had been identified as a family member of Case 953, she was issued a home quarantine order on 3 April. She reported onset of symptoms on 2 April, and subsequent test results confirmed COVID-19 infection on 4 April. She is currently warded in an isolation room at NCID. </p><p>15.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; She is employed as an administrative staff at KK Women’s and Children’s Hospital but had not gone to work since onset of symptoms. </p><p>&nbsp;</p><p><strong>Update on condition of confirmed cases</strong></p><p>16.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; To date, a total of 297 cases have fully recovered from the infection and have been discharged from hospitals or community isolation facilities. </p><p>17.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Of the 500 confirmed cases who are still in hospital, most are stable or improving. 26 are in critical condition in the intensive care unit. 386 cases who are clinically well but still test positive for COVID-19 are isolated and cared for at Concord International Hospital, Mount Elizabeth Hospital, Gleneagles Hospital and the Community Isolation Facility at D’Resort NTUC. Six have passed away from complications due to COVID-19 infection.</p><p>&nbsp;</p><p><strong>Update on contact tracing for confirmed cases </strong></p><p>18.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Contact tracing for the confirmed cases is ongoing. Once identified, MOH will closely monitor all close contacts. As a precautionary measure, they will be quarantined for 14 days from their last exposure to the patient. In addition, all other identified contacts who have a low risk of being infected will be under active surveillance, and will be contacted daily to monitor their health status. </p><p>19.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; As of 4 April 2020, 12pm, MOH has identified 16,910 close contacts who have been quarantined. Of these, 5,984 are currently quarantined, and 10,926 have completed their quarantine.</p><p>&nbsp;</p><p><strong>MINISTRY OF HEALTH<br>4 APRIL 2020</strong></p><p><sup>[1]&nbsp;</sup> Cases 176, 266, 282, 297, 319, 340, 381, 415, 431, 448, 465, 468, 651, 724 and 895.<br><sup>[2]&nbsp; </sup>Cases 1121, 1122, 1143, 1165, 1175 and 1177.<br><sup>[3]&nbsp;</sup> Cases 1115, 1116, 1117, 1118, 1119, 1120, 1123, 1124, 1126, 1127, 1130,1134, 1135, 1136, 1137, 1138, 1145, 1148, 1149, 1150, 1153, 1155, 1156, 1158, 1162, 1168, 1170, 1171, 1172, 1173, 1174, 1176, 1180, 1183, 1184, 1185, 1186, 1187, 1188 and 1189.<br><sup>[4] &nbsp;</sup>Cases 1125, 1128, 1129, 1131, 1132, 1133, 1139, 1140, 1141, 1142, 1144, 1146, 1147, 1151, 1152, 1154, 1157, 1159, 1160, 1161, 1163, 1164, 1166, 1167, 1169, 1178, 1179, 1181 and 1182.<br><sup>[5]&nbsp; </sup>Cases 826, 829, 852, 860, 946, 947, 966, 979, 982, 993, 1035, 1039, 1047, 1050, 1061, 1066, 1074, 1083, 1084, 1089, 1107, 1108, 1110, 1111, 1112, 1117, 1118, 1119, 1126, 1135, 1138, 1145, 1153, 1155, 1156, 1171, 1173, 1174, 1185, 1186 and 1187.</p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "15-more-cases-discharged-75-more-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "Passing of Patient With Covid-19 Infection, 4 April", "PublishedDate": "/Date(1585968120000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "04 Apr 2020", "Summary": "", "MainContent": "<p>1.&nbsp; &nbsp; &nbsp; The Ministry of Health has confirmed that a patient has passed away from complications due to COVID-19 infection on 4 April 2020 at 5.41am. He was an 88 year-old male Singapore Permanent Resident who had no recent travel history to affected countries and regions.<br><br>2.&nbsp; &nbsp; &nbsp; He was confirmed to have COVID-19 infection on 29 March, and admitted to the National Centre for Infectious Diseases (NCID) on 30 March. He had been cared for in the intensive care unit since 30 March. He developed serious complications and eventually succumbed to the infection. He had a history of heart and kidney disease, cancer and diabetes.<br><br>3.&nbsp; &nbsp; &nbsp;NCID has reached out to his family and is extending assistance to them.</p> <p><strong>MINISTRY OF HEALTH</strong></p><div> <p><strong>4 APRIL 2020</strong></p> <p>&nbsp;</p> </div>", "PressCategory": ["Press Releases"], "CustomDetailUrl": "", "UrlName": "passing-of-patient-with-covid-19-infection-4-april", "CurrentPageUrl": null}, {"Title": "Expansion of Enhanced Stay-home Notice Requirements to More Countries", "PublishedDate": "/Date(1585929600000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "04 Apr 2020", "Summary": "", "MainContent": "<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; To protect Singaporeans and further ring fence the risk of community transmission from imported cases, all Singapore Citizens, Permanent Residents and Long Term Pass holders returning from ASEAN countries, France, India and Switzerland from 5 April 2020, 2359 hours will be required to serve a 14-day self-isolation at dedicated Stay-Home Notice (SHN) facilities. This arrangement will continue to apply to returnees from the UK and US.&nbsp; </p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The dedicated SHN facilities are not just about the provision of hotel rooms. We also work with the hotel operators to provide training for their staff, and to put in place proper security arrangements, as well as infection control and precautions. It takes time to get ready such facilities, and we do not have enough at present to accommodate all returnees. Therefore based on the current capacity, we have prioritised the facilities for returnees from these specific countries. The countries are chosen based on our assessment of risks and the history of imported cases in Singapore. For those who are coming back from other countries, they can serve their 14-day SHN at their place of residence. </p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The Multi-Ministry Taskforce will continue to monitor the dynamic and evolving COVID-19 situation, and work closely with the private sector to adjust our capacity of SHN facilities accordingly. </p><p><strong>MINISTRY OF HEALTH<br>4 APRIL 2020</strong></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "expansion-of-enhanced-stay-home-notice-requirements-to-more-countries", "CurrentPageUrl": null}, {"Title": "Continuation of Essential Healthcare Services During Period of Heightened Safe Distancing Measures", "PublishedDate": "/Date(1585929600000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "04 Apr 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;The Multi-Ministry Taskforce has announced an elevated set of safe distancing measures as a circuit breaker to pre-empt the trend of increasing local transmission of COVID-19. These will be in place for four weeks (i.e. two incubation cycles) from 7 April 2020 until 4 May 2020 (inclusive). Essential services, including healthcare, will continue to operate during this period.</p> <p><strong>Healthcare Services </strong></p> <p>2.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;All public and private acute hospitals (including offsite specialist clinics and offsite Ambulatory Surgical Centres), community hospitals, polyclinics, Public Health Preparedness Clinics (PHPCs), and renal dialysis centres will remain open for the delivery of essential services.[1]</p><p><p>3.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Non-PHPC General Practitioner (GP) clinics, specialist clinics, dental clinics, and Traditional Chinese Medicine (TCM) clinics may remain open only for the delivery of essential services. All non-essential appointments should be deferred, and any on-site staffing kept to a minimum.</p></p><p><p>4.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Where possible, services that are suitable for tele-consultation should be delivered remotely. Examples of essential and non-essential face-to-face services are found in <u><a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-a3685da33172d4ed08bb310ec24a440f8.pdf?sfvrsn=1b80f51f_0\" title=\"Annex A\">Annex A</a></u>.</p></p><p><p>5.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Supporting services such as ambulance and patient transport, blood services, laboratories and radiological services, quarantine and isolation operations, and border health operations will continue operations. Essential supply chains required to provide the essential healthcare services should also continue operations.</p></p><p><p><strong>Community Care Services </strong></p><p>6.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Residential and home-based community care services such as nursing homes, psychiatric rehabilitation homes, psychiatric sheltered homes, inpatient palliative care, home medical, home nursing, home palliative care, interim caregiver service, and meals delivery services will continue to function.</p></p><p><p>7.&nbsp; &nbsp; &nbsp; &nbsp;Home personal care will be scaled down to serve only seniors with inadequate family support, for example, where caregivers are essential workers. Home therapy (except by tele-consult) and Medical Escort and Transport service will also be suspended.</p></p><p><p>8.&nbsp; &nbsp; &nbsp; &nbsp;Senior care centres, day rehab centres, psychiatric rehabilitation centres, and day hospices will be closed. Selected centres will remain open to support those with inadequate family support, as well as intensive care needs. Such seniors can also be supported with home care services including meals delivery if needed.</p></p><p><p>9.&nbsp; &nbsp; &nbsp; &nbsp; See <u><a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-bd654f2b14b1f4367b437166847b84224.pdf?sfvrsn=75bb563_0\" title=\"Annex B\">Annex B</a></u> for the status of community care services during this period. MOH and the Agency for Integrated Care (AIC) will provide further information separately to community care providers.</p></p><p><p><strong>Blood Donation</strong></p><p>10.&nbsp; &nbsp; &nbsp; Blood donation services will remain in operation, and residents are encouraged to continue donating blood during this period. As part of the additional precautions put in place for safe distancing, donors are highly encouraged to make appointments for their blood donations. Please visit HSA's website for more information: <a href=\"https://www.hsa.gov.sg/blood-donation\">https://www.hsa.gov.sg/blood-donation</a>.</p></p> <p>&nbsp;</p> <div><br clear=\"all\"> <hr align=\"left\" size=\"1\" width=\"33%\"> <div id=\"ftn1\"> <p>[1] Essential services/ procedures refer to those, if not provided or performed, would result in significant or rapid deterioration of the patient’s medical condition, and potentially threaten their health and wellbeing. </p> </div> </div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "continuation-of-essential-healthcare-services-during-period-of-heightened-safe-distancing-measures", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}