{"pressItemDictionary": {"Press Releases": [{"Title": "Updates to Stay-home Notice and Charging Policy for Travellers", "PublishedDate": "/Date(1603799460000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "27 Oct 2020", "Summary": "", "MainContent": "<span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The Multi-Ministry Taskforce regularly reviews our border measures to manage the risk of importation and onward local transmission from travellers. Given the surveillance regime that we have put in place for travellers serving Stay-Home Notice (SHN) at their own residence, we will also adopt a risk-based approach and allow more travellers to serve their 14-day SHN at a suitable place of residence. From 1 January 2021, all incoming travellers will also be required to pay for their stay at dedicated SHN facilities, and will be responsible for their inpatient medical bills if they have onset of symptoms of COVID-19 within 14 days of their entry to Singapore.<br><br><strong>More Travellers Allowed to Serve 14-Day SHN at Suitable Place of Residence<br></strong><br>2.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Currently, except for countries that we have unilaterally opened up to, travellers from selected low risk countries/ regions serve a 7-day SHN at their place of residence or suitable accommodation of their choice, and all other travellers serve a 14-day SHN at dedicated SHN facilities.<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Since 11 August 2020, all travellers serving SHN outside of dedicated SHN facilities are required to don an electronic monitoring device throughout their SHN. This complements agencies’ checks to ensure compliance with the SHN. With the enhanced surveillance regime in place, we will also adopt a risk-based approach and allow more <strong>travellers from Estonia, Fiji, Finland, Japan, Norway, Republic of Korea, Sri Lanka, Thailand and Turkey<sup>[1]</sup> to opt out of dedicated SHN facilities and serve their 14-day SHN at their place of residence,</strong> if they fulfil the following criteria:<br><br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;a.&nbsp; &nbsp; &nbsp;Travelled to no other country than above-mentioned countries, in the last consecutive 14 days prior to entry; and<br><br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;b.&nbsp; &nbsp; &nbsp;Are occupying their place of residence (i.e. residential address) alone, or only with household members who are also persons serving SHN with the same travel history and duration of SHN.<br><br>4.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Travellers from the abovementioned countries may apply to opt out of dedicated SHN facilities from <strong>2 November 2020</strong>, for arrivals on or after 4 November 2020. For Singapore Citizens (SCs) and Permanent Residents (PRs), the application must be made prior to arrival via the <a href=\"http://www.safetravel.ica.gov.sg/\" title=\"\" class=\"\" target=\"\">Safe Travel Office website</a>. Travellers who are not SCs or PRs may apply to opt out as part of the entry approval process. All travellers must present the approval to opt out upon arrival in Singapore. As the list of countries will be updated from time to time depending on the public health risk assessment, <strong>all travellers must be prepared to be subject to the prevailing border measures upon entry, including stay in dedicated SHN facilities and payment, where applicable.</strong><br><br>5.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;All travellers who opt to stay at their place of residence for SHN must remain in their declared place of residence at all times. They will be subject to close monitoring of their whereabouts, through electronic monitoring as well as physical spot-checks. Strict enforcement action will be taken against those who breach the requirements of the SHN or make false declarations. Such persons will also be required to utilise specially designated transport services from the checkpoint to their place of residence and to their respective testing facilities, and bear the costs<sup>[2]</sup> for these transport arrangements.<br><br><strong>All Travellers to Bear Costs of Stay at Dedicated SHN Facilities and COVID-19 Treatment</strong><br><br>6.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;The Government has thus far borne the costs of stay at dedicated SHN facilities and medical bills for COVID-19 treatment for SCs and PRs who last left Singapore before 27 March 2020. The Government has also borne the costs of COVID-19 medical bills for new SCs/ PRs/ Long-Term Pass Holders (LTPHs), and existing LTPHs who departed Singapore before 27 March 2020. All other incoming travellers have had to pay for these costs as part of their private expenses, subject to the applicable healthcare arrangements for their bills<sup>[3]</sup>.<br><br>7.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Stay in self-isolation facilities is now a widely-accepted requirement of international travel in a COVID-19 world. The vast majority of SCs and PRs who last left Singapore within the past year have returned. Hence with effect from <strong>1 January 2021</strong>, we will no longer waive the costs of stay at dedicated SHN facilities for SCs and PRs who last left Singapore before 27 March 2020.<br><br>&nbsp;8.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Similarly, with effect from <strong>1 January 2021</strong>, all returning SC/ PR/ LTPH travellers who last left Singapore before 27 March 2020, as well as new SCs/ PRs/ LTPHs will also be responsible for their inpatient medical bills, should they develop onset of symptoms within 14 days of their arrival in Singapore, but they will be able to tap on regular healthcare financial arrangements for their inpatient medical bills – SCs and PRs may access Government subsidies and MediShield Life / Integrated Shield Plan to help pay for their bills, while LTPHs may tap on their usual financing arrangements, such as private insurance.<br><br><strong>Regular Review of Border Measures</strong><br><br>9.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Singapore’s border measures will evolve as the global situation changes. We will continue to monitor the global health situation closely and update our border measures in accordance with the public health risk assessment. If the situation in a country/region deteriorates, more stringent measures will be put in place to limit the risk of importation and prevent community transmission from imported cases.<br><br><br></span><strong><span style=\"font-size: 16px;\">MINISTRY OF HEALTH<br>27 OCTOBER 2020</span><br></strong><div><br></div>[1] As of 27 October 2020. Please refer to the Safe Travel Office Website for updates to the countries/regions identified<br><br>[2] Transport is estimated to cost about $200-220 in total for travel from checkpoint to place of residence and roundtrip for COVID-19 test before end of SHN.<br><br>[3] SC/PR/LTPH who departed Singapore from 27 March 2020 are responsible for their medical bills if they develop onset of symptoms for COVID-19 within 14 days of their return to Singapore, but are subject to regular healthcare arrangements for their bills. All Short-Term Visit Pass (STVP) holders are responsible for their medical bills at unsubsidised rates throughout their stay in Singapore, should they test positive for COVID-19.<br><div> </div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "updates-to-stay-home-notice-and-charging-policy-for-travellers", "CurrentPageUrl": null}, {"Title": "1 New Case of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1603783800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "27 Oct 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As of 27 October 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 1 new case of locally transmitted COVID-19 infection. Based on our investigations so far, the case is in the community, and there are no new cases in the dormitories.&nbsp;</p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In addition, there are 6 imported cases, who had all been placed on Stay-Home Notice or isolated upon arrival in Singapore. In total, there are 7 new cases of COVID-19 infection in Singapore today.<br></p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.<br></p><p><br><strong>MINISTRY OF HEALTH<br></strong><strong>27 OCTOBER 2020</strong></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "1-new-case-of-locally-transmitted-covid-19-infection-27oct", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}