{"pressItemDictionary": {"Press Releases": [{"Title": "Ministry of Health Addendum to the President's Address", "PublishedDate": "/Date(1598350920000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "25 Aug 2020", "Summary": "", "MainContent": "MINISTRY OF HEALTH<br>ADDENDUM TO THE PRESIDENT’S ADDRESS<br>MR GAN KIM YONG<br>MINISTER FOR HEALTH<br><br>1 The Ministry of Health’s (MOH) mission is to deliver health and healthcare in a sustainable way so that all can benefit from a healthy life well-lived. To achieve this, we promote good health and reduce illness, ensure access to good and affordable healthcare appropriate to needs, and pursue medical excellence. The COVID-19 pandemic has presented an unprecedented challenge for our healthcare system. We are committed to continuing our fight against COVID-19, while also continuing to transform and strengthen our health systems in a sustainable way for the long term.<br><br><strong>Continuing the Fight Against COVID-19</strong><br><br>2 MOH will strive to keep the public safe by coordinating Singapore’s public health response against COVID-19. Following SARS in 2003 and H1N1 in 2009, we enhanced our capabilities in infectious disease management, expanded our laboratories and set up our national stockpiles of Personal Protective Equipment (PPE) and drugs. We established the National Centre for Infectious Disease, which had its official opening in September 2019. We will press on with our strategy to fight the disease: first, to collectively prevent spread of COVID-19 through practicing safe management in how we conduct our daily activities; second, detect new cases as early as possible; third, contain close contacts of new cases to prevent further transmission; and finally, provide quick and effective care for patients to allow them to recover and return to their normal lives.<br><br>3 We have been able to respond well and adapt quickly to COVID-19 because of our healthcare workers and partners who have led the charge against COVID-19. Their adaptability, resilience, and determination have led to innovations in caring for patients both within the existing healthcare institutions and in in new settings such as the various isolation and recovery facilities. We are grateful to them and the many Singaporeans who have stepped up to volunteer for the SG Healthcare Corps, and contributed their valuable time and skills to augment our manpower needs in many key areas of our COVID-19 defence.<br><br>4 COVID-19 will be with us for a long time, and until a vaccine becomes available, there is always a risk of further waves of the disease. MOH will ensure sufficient healthcare resources to care for our COVID-19 patients, and support our Public Healthcare Institutions (PHIs), private hospitals, community hospitals, Public Health Preparedness Clinics (PHPCs), and Nursing Homes (NHs), to help them continue their vital roles in the fight against COVID-19. We will also continue to maintain adequate quarantine and community isolation capacity, to remain prepared for any sudden surge in cases. We will continue to leverage data and technology to improve our capability to respond quickly to evolving situations and contain outbreaks.<br><br>5 We will continue to work with international partners to deepen international cooperation in the global fight against COVID-19, by sharing data and information on cases, and on the disease. We remain actively involved in vaccine and therapeutics development, including in clinical trials with global partners, and will continue to invest in and further develop our research capabilities in public health and strengthen our research partnerships.<br><br>6 In the meantime, for as long as COVID-19 is still with us, we must remain vigilant as a nation and continue to encourage the public to practice social responsibility and good personal hygiene habits. We will work together with businesses, workers, civil society, and members of the public alike to find new and safe ways to operate. We will all have to adapt our daily practices and develop new habits so that we can work, learn, and play in a safe manner. We will also learn from these experiences, to better prepare ourselves for future pandemics and other threats that can affect the health and lives of Singaporeans.<br><br><strong>Strengthening our Healthcare System for the Long Term</strong><br><br>7 Even as we tackle COVID-19, we must not lose sight of our long-term vision for health and healthcare. We must continue to ensure that quality healthcare remains accessible and affordable, and that our healthcare system can better and more sustainably serve the evolving health needs of Singaporeans. To achieve this, we will press on with three major shifts in our healthcare system, to move Beyond Healthcare to Health, Beyond Hospital to Community, and Beyond Quality to Value.<br><br>8 First, and most importantly, we will continue to strive for better health, and keep Singaporeans healthy. We will continue our efforts to improve the diets and lifestyle of Singaporeans, and we will find new ways to do this safely in light of COVID-19. We will also push on with our initiatives to make preventive healthcare more affordable and accessible, such as by enhancing subsidies for vaccinations in various settings. In addition, we will extend more help to proactively manage the health of vulnerable groups in the community such as our seniors through our review of the Action Plan for Successful Ageing, and by forging more partnerships with members of the public as well as corporate and community partners to transform our seniors’ lived experience. Beyond the elderly, we will also continue to collaborate with the relevant Ministries and agencies, as well as people and private sector partners, to support the mental wellness of our entire population, through targeted programmes like the Integrated Youth Service for youths at risk of mental health conditions. Our War on Diabetes will likewise continue, with screening for diabetics and those with pre-diabetes to detect those who have and are at risk of developing the condition, as well as continuing to optimise our care for diabetics and preventing long-term complications. Finally, we will look to identifying best practices that can help us in our fight to better manage other chronic diseases.<br><br>9 We also remain committed to enhancing healthcare accessibility and providing better care. While COVID-19 has pushed back the completion timelines for some of the upcoming new facilities, we will continue to expand our healthcare capacity, such as by building a new hospital in the east and new polyclinics across Singapore by 2030. We will enhance our community-based services, by progressively expanding the service scope of eldercare centres to include active ageing programmes for the well, befriending services for the lonely, and information and referral for care services for frail seniors. We will also evolve regulation of the healthcare sector through the implementation of the Healthcare Services Act (HCSA) and work with industry on the safe introduction of new care delivery models.<br><br>10 To provide better value, we will continue to keep healthcare affordable and sustainable for Singaporeans as our population ages, partnering with Singaporeans to prepare for their long-term care needs. These include three new initiatives from 2020: ElderFund, launched in January 2020, as well as CareShield Life and MediSave Care, to be launched by the end of this year. In addition, we are working with the MediShield Life Council to review MediShield Life benefits and premiums to ensure that the scheme continues to provide adequate protection against large medical bills and remains sustainable. Our subsidy frameworks will also be reviewed to ensure that they remain adequate and directed at those who need it most.<br><br><strong>Transforming and Maintaining a Future-Ready Healthcare Sector</strong><br><br>11 Although it has presented us with many challenges, COVID-19 has also strengthened our resolve to transform healthcare. We will push forward with digital transformation and research efforts which will support better and more integrated care across providers, facilitate better patient experience, and improve operating efficiency within our healthcare sector in all environments. We are accelerating several digitalisation projects to support telehealth initiatives, help our healthcare workforce work remotely, and improve pandemic preparedness. In research, we will build and support a greater pool of talent, improve data infrastructure, and strengthen research and development (R&amp;D) in a wide range of translatable areas. We will manage the rollout of these initiatives expeditiously and securely, whilst strengthening cybersecurity across MOH, its statutory boards, and the healthcare sector.<br><br>12 Our healthcare workers are integral to our transformation efforts. For our existing healthcare workers, who have played a crucial role in keeping Singapore safe during COVID-19, we will continue to explore how we can improve their career development and welfare. At the same time, MOH will create and facilitate new job opportunities and traineeship positions for Singaporeans over the next few years, in both the public healthcare sector and community care sector. To attract more to the community care sector, we will introduce leadership development and scholarship programmes, and review salaries for competitiveness as well as in recognition of the sacrifices made by our healthcare workers.<br><br><strong>Conclusion</strong><br><br>13 Our healthcare transformation journey is a multi-year endeavour. We must keep innovating and improving to make Singaporeans healthier and our healthcare system better for all, in partnership with public, community-based, and private healthcare providers. We will continue to reach out to all Singaporeans, to help us continue our journey to build a strong and sustainable health system for the future together, so that all Singaporeans can live well, longer, and with peace of mind.", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "ministry-of-health-addendum-to-the-president's-address-2020", "CurrentPageUrl": null}, {"Title": "7,500 Job Vacancies and 1,600 Traineeship, Attachment and Skills Training Opportunities Available In the Healthcare Sector", "PublishedDate": "/Date(1598347800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "25 Aug 2020", "Summary": "", "MainContent": "<div>1.&nbsp; &nbsp; &nbsp;The healthcare sector continues to offer meaningful employment opportunities for Singaporeans. From now until end 2021, the healthcare sector will be offering up to a total of about 7,500 jobs, and about 1,600 traineeships, attachments and skills training opportunities. The majority of these positions are suitable for fresh graduates entering the workforce and mid-career jobseekers with or without prior healthcare background. These vacancies and opportunities will help to fulfil current and future expanding needs for healthcare services, given Singapore’s ageing population.<br><br></div><div><strong>Job Opportunities in the Healthcare Sector</strong></div><div><br>2.&nbsp; &nbsp; &nbsp;Of the 7,500 job opportunities, about one-third are for healthcare professionals including nurses and allied health professionals. These vacancies will be mainly met by fresh graduates from healthcare training programmes, as well as graduates from our Professional Conversion Programmes (PCP) targetted at mid-career entrants into the healthcare sector. Currently, we have about 200 nursing and allied health PCP training places available each year, and we will be adding at least another 100 new training places in 2021.<br><br></div><div>3.&nbsp; &nbsp; &nbsp;The remaining vacancies are for various roles including support care, and administrative and ancillary roles, which will be suitable for fresh graduates and mid-career job seekers from non-healthcare backgrounds. These vacancies are available across both the public healthcare and community care sector, ranging from service management positions, such as patient service associates, to blended job roles which involve providing support in non-clinical care or administrative operations. There are also managerial and executive roles available for those who may have relevant administrative experience or training outside the healthcare sector, for example in financial management, accounting, human resources, or digitalisation of business processes. Training, on-boarding and orientation will be provided.<br><br></div><div><strong>Traineeships, Attachments and Skills Training Opportunities under SGUnited Jobs and Skills Package<br></strong><br></div><div>4.&nbsp; &nbsp; &nbsp;Workforce Singapore (WSG) and SkillsFuture Singapore are working with healthcare and community care providers in the public and private sectors, as well as training institutions and the healthcare union, to offer about 1,600 traineeship, attachments and skills training opportunities, for individuals to acquire relevant working experience and work-ready skills needed in the sector. Employers and trainees will receive funding support during the traineeship, attachment or skills training period.</div><br>•<strong> Traineeships and Attachments</strong><div>Fresh or recent graduates can tap on the SGUnited Traineeships Programme, while mid-career individuals can apply for attachments available under the SGUnited Mid-Career Pathways Programme, to join the healthcare sector. The traineeships and attachments last between four to nine months in duration, and are available for various roles, including patient service associates, dental surgery assistants and other admin and ancillary roles. Employers can consider hiring well-performing trainees and mid-career individuals at any time during or after the completion of the traineeship or attachment.<br><br></div><div><strong>• Skills Training</strong></div><div>Mid-career job seekers can tap on the SGUnited Skills programme to apply for skills training in healthcare roles, such as support staff and executives in clinical and non-clinical roles. Skills training lasts between six to 12 months for various job roles that include healthcare assistants, therapy assistants, community care coordinators, pharmacy technicians and health managers and administrators. Over 1,300 training opportunities will be offered by seven training partners, with classes starting progressively from August 2020.<br><br></div><div>The training providers are:</div><div>o HMI Institute of Health Sciences</div><div>o Institute of Technical Education</div><div>o NTUC Learning Hub</div><div>o Republic Polytechnic</div><div>o Singapore Management University</div><div>o Singapore University of Social Sciences</div><div>o Temasek Polytechnic<br><br></div><div>5.&nbsp; &nbsp; &nbsp;In all, these opportunities will allow more Singaporeans to join the healthcare workforce. The job vacancies and opportunities will be made available progressively over 2020 and 2021. Job seekers will be able to access these opportunities through WSG’s MyCareersFuture job portal, and various job fairs and recruitment platforms.</div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "7-500-job-vacancies-and-1-600-traineeship-attachment-and-skills-training-opportunities-available-in-the-healthcare-sector", "CurrentPageUrl": null}, {"Title": "31 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1598284800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "25 Aug 2020", "Summary": "", "MainContent": "1.&nbsp; &nbsp; &nbsp; As of 25 August 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 31 cases of COVID-19 infection in Singapore. Based on our investigations so far, there are no cases in the community.<br><br>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; There is 1 imported case, who had been placed on Stay-Home Notice upon arrival in Singapore.&nbsp;<br><br>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "31-new-cases-of-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}