{"pressItemDictionary": {"Press Releases": [{"Title": "No New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1607067060000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "04 Dec 2020", "Summary": "", "MainContent": "<p>1.&nbsp; &nbsp; &nbsp;As of 4 December 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed that there are no new cases of locally transmitted COVID-19 infection. </p> <p>2.&nbsp; &nbsp; &nbsp;There are 3 imported cases, who had already been placed on Stay-Home Notice or isolated upon arrival in Singapore.</p><p><p>3.&nbsp; &nbsp; &nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.</p></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "no-new-cases-of-locally-transmitted-covid-19-infection-4-Dec", "CurrentPageUrl": null}, {"Title": "Joint Press Statement by the Ministry of Foreign Affairs and the Ministry of Health: Singapore's Contribution to the Covid-19 Vaccine Global Access Advance Market Commitment", "PublishedDate": "/Date(1607050800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "04 Dec 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;The COVID-19 pandemic has had a significant impact on public health, society and the economy both at home and abroad. The virus does not respect borders, and no one is safe until everyone is safe. The successful development of safe and efficacious vaccines is a critical step towards overcoming the pandemic.&nbsp;&nbsp;<br>&nbsp;<br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Global solidarity is required for an effective international response to the pandemic. As part of our consistent support for vaccine multilateralism, and the fair and equitable access and allocation of vaccines, Singapore will contribute US$5,000,000 to the COVID-19 Vaccine Global Access (COVAX) Advance Market Commitment (AMC) mechanism, which will help support 92 low- and lower-middle-income countries’ access to COVID-19 vaccines through the COVAX Facility<sup>1</sup>. AMC eligible countries include several ASEAN countries as well as small states globally.&nbsp;&nbsp;<br><br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Singapore will continue to work closely with our international partners, in particular, the United Nations, the World Health Organisation, Gavi, the Vaccine Alliance, and the Coalition for Epidemic Preparedness Innovations to advance vaccine multilateralism and forge a global response to this pandemic.&nbsp;&nbsp;<br>&nbsp;<br><sup>1</sup> The COVAX Facility is a global risk-sharing mechanism which seeks to procure, equitably allocate and deliver 2 billion doses of COVID-19 vaccines by the end of 2021. Singapore is one of 97 self-financing participants (as of 25 November 2020) in the Facility. The Facility’s implementing partners are the World Health Organisation, Gavi, the Vaccine Alliance and the Coalition for Epidemic Preparedness Innovations. Singapore and Switzerland co-chair the Friends of the COVAX Facility to support the work of this Facility.<br><br><strong>MINISTRY OF FOREIGN AFFAIRS<br>MINISTRY OF HEALTH<br>&nbsp;<br>4 DECEMBER 2020</strong><br></p><div><br></div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "joint-press-statement-by-the-ministry-of-foreign-affairs-and-the-ministry-of-health-singapore's-contribution-to-the-covid-19-vaccine-global-access-advance-market-commitment", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}