{"pressItemDictionary": {"Press Releases": [{"Title": "Nine New Cases of COVID-19 Infection Confirmed", "PublishedDate": "/Date(1584013500000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "12 Mar 2020", "Summary": "", "MainContent": "<p>As of 12 March 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified nine more cases of COVID-19 infection in Singapore. Of these:</p><p>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Three (Cases 179, 185 and 186) are part of the cluster involving the private dinner function at SAFRA Jurong on 15 February;</p><p>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Five are imported cases (Cases 180, 181, 182, 183 and 187); and</p><p>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; One (Case 184) is linked to a previous case (Case 172).</p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The World Health Organization had on 11 March 2020 declared the COVID-19 outbreak a global pandemic, in view of the rising number of cases reported around the world. Singapore has been planning ahead, and we have been progressively putting in place a suite of measures in preparation for a possible escalation of the situation, both locally and globally. The situation in Singapore remains under control, and we are not changing the DORSCON level.<br></p><p><strong>Links between previous cases found</strong></p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. This was made possible with the assistance of the Singapore Police Force.</p><p>a)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Eight of the locally transmitted confirmed cases (Cases 31, 33, 38, 83, 90, 91, 138 and 151), as well as Cases 8 and 9, are linked to The Life Church and Missions Singapore. These cases are linked to another 23 confirmed cases (Cases 48, 49, 51, 53, 54, 57, 58, 60, 61, 62, 63, 66, 67, 68, 70, 71, 73, 74, 78, 80, 81, 84, 88) who are linked to the Grace Assembly of God.</p><p>b)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Five of the confirmed cases (Cases 42, 47, 52, 56 and 69) are linked to the Seletar Aerospace Heights construction site.</p><p>c)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 14 of the confirmed cases (Cases 93, 95, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 108 and 110) are linked to Wizlearn Technologies Pte Ltd.</p><p>d)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 43 of the confirmed cases (Cases 94, 96, 107, 112, 114, 115, 116, 117, 118, 120, 121, 122, 125, 127, 128, 129, 130, 131, 133, 134, 137, 139, 140, 142, 144, 145, 146, 148, 149, 150, 155, 156, 157, 158, 159, 160, 161, 164, 166, 174, 179, 185 and 186) are linked to a private dinner function at SAFRA Jurong on 15 February.</p><p>e)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Three of the confirmed cases (Cases 142, 162 and 163) are linked to boulder+ Gym (12 Kallang Avenue).</p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Investigations on these clusters are ongoing. In addition to the clusters, our investigations have identified the following links between cases:</p><p>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 72 is linked to Cases 59 and 79;<br>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 75 is linked to Case 41;<br>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 86 is linked to Case 82;<br>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 126 is linked to Case 109;<br>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 143 is linked to Case 132;<br>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 167 is linked to Case 178; and<br>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 184 is linked to Case 172.</p><p>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Contact tracing is underway for the other nine locally transmitted cases to establish any links to previous cases or travel history to affected countries or regions.</p><p>&nbsp;</p><p><strong>About the confirmed cases</strong></p><p><u>Case 179</u></p><p>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 179 is a 66 year-old female Singapore Citizen who had been in Malaysia on 22 February. She is currently warded in an isolation room at National University Hospital (NUH). She is a contact of Case 121 and is linked to the cluster involving the private dinner function at SAFRA Jurong.</p><p>7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; She reported onset of symptoms on 27 February and had sought treatment at a general practitioner (GP) clinic on 29 February, 9 March and 11 March. She was referred to NUH on 11 March, and subsequent test results confirmed COVID-19 infection on 11 March afternoon.</p><p>8.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Prior to hospital admission, she had mostly stayed at her home at Jurong West Street 73.</p><p><u>Case 180</u></p><p>9.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 180 is an imported case involving a 71 year-old male Singapore Citizen who had been in the US from 27 February to 10 March. He was confirmed to have COVID-19 infection on 12 March morning, and is currently warded at the National Centre for Infectious Diseases (NCID).</p><p><u>Case 181</u></p><p>10.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 181 is an imported case involving a 83 year-old male Indonesian national who had arrived in Singapore on 9 March. He was confirmed to have COVID-19 infection on 12 March morning, and is currently warded at Gleneagles Hospital. He is a family member of Case 182.</p><p> </p><p><u>Case 182</u></p><p>11.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 182 is an imported case involving a 76 year-old female Indonesian national who arrived in Singapore on 9 March. She was confirmed to have COVID-19 infection on 12 March morning, and is currently warded in an isolation room at Gleneagles Hospital. She is a family member of case 181.</p><p><u>Case 183</u></p><p>12.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 183 is a 29 year-old male Singapore Citizen who had been in Malaysia from 29 February to 4 March. He was confirmed to have COVID-19 infection on 12 March morning, and is currently warded in an isolation room at NCID. He had attended a mass religious gathering at a mosque in Malaysia, and the Malaysian authorities had subsequently reported several confirmed COVID-19 cases linked to the event.</p><p><u>Case 184</u></p><p>13.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 184 is a 35 year-old male Filipino national who is a Singapore Work Pass holder, and had been in the Philippines from 24 February to 1 March. He was confirmed to have COVID-19 infection on 12 March morning, and is currently warded in an isolation room at NCID. He is linked to Case 172.</p><p><u>Case 185</u></p><p>14.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 185 is a 34 year-old male Singapore Citizen who had been in Malaysia from 22 February to 23 February. He was confirmed to have COVID-19 infection on 12 March morning and is currently warded in an isolation room at NCID. He is linked to case 142.</p><p><u>Case 186</u></p><p>15.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 186 is a 64 year-old male Singapore Citizen who has no recent travel history to affected countries and regions. He was confirmed to have COVID-19 infection on 12 March morning and is currently warded in an isolation room at NCID. He is linked to Case 166.</p><p><u>Case 187</u></p><p>16.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 187 is a 48 year-old male Singapore Citizen who had been in Malaysia from 28 February to 2 March. He was confirmed to have COVID-19 infection on 12 March morning and is currently warded in an isolation room at NCID. He had attended a mass religious gathering at a mosque in Malaysia, and the Malaysian authorities had subsequently reported several confirmed COVID-19 cases linked to the event.</p><p><u>Case 171 (Announced on 11 March)</u></p><p>17.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 171 is an imported case involving a 27 year-old male Singapore Citizen who had been in France from 25 February to 1 March, and Spain from 1 March to 6 March. He is currently warded in an isolation room at NCID.</p><p>18.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; He reported onset of symptoms on 9 March and had sought treatment at a GP clinic on 10 March. He was referred to the emergency department of NCID on 10 March, and subsequent test results confirmed COVID-19 infection on 11 March morning.</p><p>19.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Prior to hospital admission, he had mostly stayed at his home at Jalan Haji Salam.</p><p><u>Case 172 (Announced on 11 March)</u></p><p>20.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 172 is a 42 year-old female Filipino national who is a Singapore Work Pass Holder, and had been in the Philippines from 27 February to 2 March. She is currently warded in an isolation room at NCID. She is a contact of Case 184.</p><p>21.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; She reported onset of symptoms on 5 March and had sought treatment at a GP clinic on 9 March. Subsequent test results confirmed COVID-19 infection on 11 March morning.</p><p>22.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Prior to hospital admission, she had gone to work at AXA Singapore (8 Shenton Way). She stays at Lorong 28 Geylang.</p><p><u>Case 173 (Announced on 11 March)</u></p><p>23.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 173 is a 31 year-old male Singapore Citizen who had been in France from 15 February to 7 March. He is currently warded in an isolation room at NCID. He is a contact of Cases 165, 169 and 175, and is one of the imported cases who had been in France on official duty.</p><p>24.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; He reported onset of symptoms on 9 March and presented at the emergency department of NCID on 10 March. Subsequent test results confirmed COVID-19 infection on 11 March morning.</p><p>25.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; He is a Republic of Singapore Air Force serviceman but had not gone to work since returning to Singapore. He stays at Telok Blangah Street 31.</p><p><u>Case 174 (Announced on 11 March)</u></p><p>26.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 174 is a 67 year-old female Singapore Citizen who has no recent travel history to affected countries and regions. She is currently warded in an isolation room at NCID. She is a contact of Case 122 and is linked to the cluster involving the private dinner function at SAFRA Jurong.&nbsp;</p><p>27.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;As she had been identified as a contact of Case 122, she was placed under quarantine on 6 March. She reported onset of symptoms on 7 March, and subsequent test results confirmed COVID-19 infection on 11 March morning.</p><p>28.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Prior to hospital admission, she had mostly stayed at her home at Gangsa Road.</p><p> </p><p><u>Case 175 (Announced on 11 March)</u></p><p>29.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 175 is a 44 year-old male Singapore Citizen who had been in France from 15 February to 7 March. He is currently warded in an isolation room at NCID. He is a contact of Cases 165, 169 and 173, and is one of the imported cases who had been in France on official duty.</p><p>30.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; He reported onset of symptoms on 10 March, and was conveyed by ambulance to NCID on the same day. Subsequent test results confirmed COVID-19 infection on 11 March morning.</p><p>31.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; He is a Republic of Singapore Air Force serviceman but had not gone to work since returning to Singapore. He stays at Toh Tuck Road.</p><p><u>Case 176 (Announced on 11 March)</u></p><p>32.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 176 is an imported case involving a 37 year-old female British national who works in Singapore, and had been in Japan from 24 February to 4 March, and the UK from 4 March to 8 March. She is currently warded in an isolation room at NCID.</p><p>33.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; She reported onset of symptoms on 7 March while in the UK and had sought treatment at Gleneagles Hospital on 10 March. She was conveyed by ambulance to NCID on the same day. Subsequent test results confirmed COVID-19 infection on 11 March morning.</p><p>34.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; She stays in the Dover Road area.</p><p><u>Case 177 (Announced on 11 March)</u></p><p>35.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 177 is an imported case involving a 26 year-old male Singapore Citizen who had been in the US from 14 February to 24 February, UK from 28 February to 1 March, and France from 2 March to 7 March. He is currently warded in an isolation room at NCID.</p><p>36.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; He reported onset of symptoms on 9 March and had sought treatment at a GP clinic on 10 March. He was conveyed by ambulance to NCID and subsequent test results confirmed COVID-19 infection on 11 March morning.</p><p>37.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Prior to hospital admission, he had mostly stayed at his home at Telok Blangah Street 31.</p><p><u>Case 178 (Announced on 11 March)</u></p><p>38.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Case 178 is an imported case involving a 37 year-old male Filipino national who is a Singapore Work Pass holder. He had been in the Philippines from 11 February to 19 February, and again from 23 February to 2 March to visit a relative with pneumonia who has since passed on. He is currently warded in an isolation room at Ng Teng Fong General Hospital (NTFGH). He is a family member of Case 167.</p><p>39.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; He reported onset of symptoms on 8 March and had sought treatment at a GP clinic on 9 March. He presented at NTFGH on 10 March and subsequent test results confirmed COVID-19 infection on 11 March morning.</p><p>40.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Prior to hospital admission, he mostly stayed at his home at Jurong East Street 21.</p><p>&nbsp;</p><p><strong>Update on condition of confirmed cases</strong></p><p>41.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; To date, a total of 96 cases have fully recovered from the infection and have been discharged from hospital. Of the 91 confirmed cases who are still in hospital, most are stable or improving. Nine are in critical condition in the intensive care unit.</p><p>&nbsp;</p><p><strong>Update on contact tracing for confirmed cases</strong></p><p>42.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Contact tracing for the confirmed cases is ongoing. Once identified, MOH will closely monitor all close contacts. As a precautionary measure, they will be quarantined for 14 days from their last exposure to the patient. In addition, all other identified contacts who have a low risk of being infected will be under active surveillance, and will be contacted daily to monitor their health status.</p><p>43.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; As of 12 March 2020, 12pm, MOH has identified 4,550 close contacts who have been quarantined. Of these, 1,248 are currently quarantined, and 3,302 have completed their quarantine.</p><p>&nbsp;</p><p><strong>Health advisory</strong></p><p>44.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Singaporeans are advised to defer all travel to Hubei Province and all non-essential travel to mainland China, Iran, northern Italy, Japan and the Republic of Korea.</p><p>45.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; All travellers should monitor their health closely for two weeks upon return to Singapore and seek medical attention promptly if they feel unwell. Travellers should inform their doctor of their travel history. If they have a fever or respiratory symptoms (e.g. cough, shortness of breath), they should wear a mask and call the clinic ahead of the visit.</p><p>46.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Travellers and members of the public should adopt the following precautions at all times:</p><p>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Avoid close contact with people who are unwell or showing symptoms of illness;<br>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Observe good personal hygiene;<br>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Practise frequent hand washing with soap (e.g. before handling food or eating, after going to toilet, or when hands are dirtied by respiratory secretions after coughing or sneezing);<br>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Wear a mask if you have respiratory symptoms such as a cough or shortness of breath;<br>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Cover your mouth with a tissue paper when coughing or sneezing, and dispose the soiled tissue paper in the rubbish bin immediately; and<br>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Seek medical attention promptly if you are feeling unwell.</p><p>47.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; MOH will continue to monitor the situation closely. As medical practitioners are on the lookout for suspect cases, Singapore is likely to see more cases that will need to be investigated.</p><p>&nbsp;</p><p><strong>MINISTRY OF HEALTH<br>12 MARCH 2020</strong></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "nine-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}