{"pressItemDictionary": {"Press Releases": [{"Title": "7 New Cases of Locally Transmitted  Covid-19 Infection ", "PublishedDate": "/Date(1601996100000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "06 Oct 2020", "Summary": "", "MainContent": "&nbsp; &nbsp; &nbsp; As of 6 October 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified 7 new cases of locally transmitted COVID-19 infection. Of these, 2 are in the community and 5 reside in dormitories. In addition, there are 4 imported cases, who had all been placed on Stay-Home Notice (SHN) upon arrival. All cases today are asymptomatic and were detected from our proactive screening and surveillance.<br><br><strong>Summary of new cases<br><br></strong><div dir=\"ltr\" align=\"left\"><table style=\"border-width: 2px; border-color: rgb(0, 0, 0);\" class=\"\"><colgroup><col width=\"129\"><col width=\"60\"><col width=\"16\"><col width=\"96\"><col width=\"96\"><col width=\"16\"><col width=\"96\"><col width=\"96\"></colgroup><tbody><tr><td><br></td><td><br></td><td colspan=\"2\"><p dir=\"ltr\">Breakdown by</p></td><td colspan=\"2\"><p dir=\"ltr\">Breakdown by</p></td></tr><tr><td><br></td><td><p dir=\"ltr\">Number of cases</p></td><td><p dir=\"ltr\">Already in quarantine/ isolation before detection</p></td><td><p dir=\"ltr\">Detected from surveillance</p></td><td><p dir=\"ltr\">Symptomatic</p></td><td><p dir=\"ltr\">Asymptomatic</p></td></tr><tr><td><p dir=\"ltr\">Cases in the community</p></td><td><p dir=\"ltr\">2</p></td><td><p dir=\"ltr\">2</p></td><td><p dir=\"ltr\">0</p></td><td><p dir=\"ltr\">0</p></td><td><p dir=\"ltr\">2</p></td></tr><tr><td><p dir=\"ltr\">Cases residing in dormitories</p></td><td><p dir=\"ltr\">5</p></td><td><p dir=\"ltr\">1</p></td><td><p dir=\"ltr\">4</p></td><td><p dir=\"ltr\">0</p></td><td><p dir=\"ltr\">5</p></td></tr><tr><td><p dir=\"ltr\">Imported cases</p></td><td><p dir=\"ltr\">4</p></td><td><p dir=\"ltr\">4</p></td><td><p dir=\"ltr\">0</p></td><td><p dir=\"ltr\">0</p></td><td><p dir=\"ltr\">4</p></td></tr><tr><td><p dir=\"ltr\">Total</p></td><td><p dir=\"ltr\">11</p></td><td><br></td><td><br></td><td><br></td><td><br></td></tr></tbody></table></div><br><br>2.&nbsp; &nbsp; &nbsp;Overall, the number of new cases in the community has increased from an average of 1 case per day in the week before, to an average of 2 cases in the past week. The number of unlinked cases in the community has remained stable at an average of fewer than 1 case per day in the past 2 weeks. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br><br>3.&nbsp; &nbsp; &nbsp;Of the new cases, 64% are imported or linked to known cases/ clusters, while the rest are pending contact tracing.&nbsp;<br><br><strong>Case Details</strong><br><br><strong>a) Cases in the community: 2&nbsp;</strong><br><br>Both cases in the community had been identified as household contacts of previously confirmed cases, and were placed on quarantine earlier. Cases 57970 and 57971 were placed on quarantine on 3 October, but had not left their home since 28 September. They were tested during quarantine to determine their status, even though they are both asymptomatic. Case 57970 is a student at a private school, and was last in school on 18 September. Case 57971 is a homemaker.&nbsp;<br><br><strong>b) Cases residing in dormitories: 5</strong><br><br>Amongst the 5 cases residing in dormitories, 1 had been identified earlier as a contact of previous cases, and had already been quarantined to prevent further transmission. He was tested during quarantine to determine his status.&nbsp;&nbsp;<br><br>The remaining 4 cases were detected through surveillance testing, such as our bi-weekly Rostered Routine Testing of workers living in dormitories. This allows us to pick up cases early, including asymptomatic ones, so that we are able to ring-fence them quickly to prevent further transmission, by aggressively containing, tracing and isolating the close contacts.&nbsp;&nbsp;<br><br><strong>c) Imported cases: 4&nbsp;</strong><br><br>There are 4 imported cases today who are asymptomatic. They had all been placed on 14-day SHN upon arrival in Singapore, and were tested while serving SHN at dedicated facilities.&nbsp;<br><br>4.&nbsp; &nbsp; &nbsp;Details of these trends can be found in MOH’s daily situation Report (<a href=\"https://www.moh.gov.sg/covid-19/situation-report\" title=\"\" class=\"\" target=\"\">www.moh.gov.sg/covid-19/situation-report</a>).<br><br>5.&nbsp; &nbsp; &nbsp;Epidemiological investigations are in progress. In the meantime, all the identified close contacts of the cases have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for the close contacts to determine if the cases could have been infected by them.&nbsp;<br><br><strong>Links between previous cases found</strong><br><br>6.&nbsp; &nbsp; &nbsp;Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <a href=\"/docs/librariesprovider5/default-document-library/annex-a50ecbd0068ad4d9597b9c1ea585d8504.pdf?sfvrsn=ab1d18c_0\" title=\"Annex A\">Annex A</a>&nbsp;and <a href=\"/docs/librariesprovider5/default-document-library/annex-b57e5a14bc0b241cc84dad2cbec225741.pdf?sfvrsn=34d9e905_0\" title=\"Annex B\">Annex B</a>&nbsp;for details.&nbsp;<br><br><strong>Update on condition of confirmed cases</strong><br><br>7.&nbsp; &nbsp; &nbsp;15 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 57,612 have fully recovered from the infection and have been discharged from hospitals or community care facilities.&nbsp;<br><br>8.&nbsp; &nbsp; &nbsp;There are currently 43 confirmed cases who are still in hospital. Of these, most are stable or improving, and 1 is in critical condition in the intensive care unit. 148 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 27 have passed away from complications due to COVID-19 infection.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>6 OCTOBER 2020</strong><br>&nbsp;<br><div><br></div><br>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "7-new-cases-of-locally-transmitted-covid-19-infection-update", "CurrentPageUrl": null}, {"Title": "Amendments to Medical Registration Act and Civil Law Act", "PublishedDate": "/Date(1601980920000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "06 Oct 2020", "Summary": "", "MainContent": "1. &nbsp; &nbsp; The Workgroup to Review the Taking of Informed Consent and the Singapore Medical Council’s (SMC) Disciplinary Process issued its Report on Recommendations on 29 November 2019, which the Ministry of Health (MOH) accepted in full in December 2019. Some of the Workgroup’s recommendations require legislative amendments, to be effected by way of the Civil Law (Amendment) Bill and the Medical Registration (Amendment) Bill. <br>&nbsp;<br>2.&nbsp;&nbsp;&nbsp;&nbsp; The doctor-patient relationship is built on trust. Patients need to be able to trust that their doctors will do their best for them. Correspondingly, doctors also need to be able to trust that the disciplinary system they operate in is a fair and transparent one which produces consistent outcomes, and which sets and applies clear standards on what is required of doctors. <br>&nbsp;<br>3.&nbsp;&nbsp;&nbsp;&nbsp; During the Workgroup’s many townhalls and consultations, doctors raised concerns over the uncertainty in the standards by which informed consent taking was to be judged.&nbsp; The amendments to the Civil Law Act (CLA) will provide clarity, certainty and consistency on the standards expected of doctors, through the codification of a new statutory test. At the same time, the changes to the Medical Registration Act (MRA) seek to establish an effective and robust self-regulatory system which acts expeditiously, and is consistent, proportionate, fair and independent. <br>&nbsp;<br><strong>A. Clarity, Certainty and Consistency in the Taking of Informed Consent</strong>&nbsp; <br>&nbsp;<br>4.&nbsp;&nbsp;&nbsp;&nbsp; The Civil Law (Amendment) Bill sets out a new statutory test for a healthcare professional’s duty in giving medical advice to his patient. The new CLA test should not be characterised as one that is binary in being either doctor- or patient-centric. Instead, the new test acknowledges and promotes the reality that doctor and patient are in fact on the same side, working towards the same outcome: the good health and recovery of the patient. <br>&nbsp;<br>5.&nbsp;&nbsp;&nbsp;&nbsp; Under the new test, a healthcare professional will meet the required standard if he acts in a manner which is accepted by peer professional opinion (i.e. a body of the healthcare professional’s peers) as reasonable professional practice in the circumstances. A doctor can therefore be assured that his conduct in providing medical advice to the patient will be assessed by his fellow doctors. The peer professional opinion must also be logical, i.e. the risks and benefits of the relevant matter have been assessed and compared by the peers holding the opinion, and the opinion itself is internally consistent and does not contradict relevant facts.<br>&nbsp;<br>6.&nbsp;&nbsp;&nbsp;&nbsp; At the same time, the new test will also preserve patient autonomy as the peer professional opinion assesses that the healthcare professional provided information that the patient reasonably requires, or is material to the patient for the purpose of making an informed decision. The assessment of what information is material is based on two factors. <br>&nbsp;<br>i) If the patient expressly communicates a specific concern or query to the healthcare professional, information relating to that is material; <br>&nbsp;<br>ii) Even if the patient does not expressly communicate a specific concern or query, if that ought to be apparent from medical records that the healthcare professional has reasonable access to and ought reasonably to review, information relating to that concern or query is also material. There must be reasonable justification if information is not provided to the patient. <br>&nbsp;<br><strong>B. Changes to Strengthen the Medical Disciplinary Process</strong> <br>&nbsp;<br>7. The Medical Registration (Amendment) Bill aims to strengthen the medical disciplinary process through more effective enforcement of professional standards, more expeditious resolution of complaints, and increased transparency of the disciplinary process. The amendments aim to: <br>&nbsp;<br>i) Improve the quality and consistency of processes and outcomes in the system;<br>ii) Reduce delays and facilitating the more expeditious resolution of complaints;<br>iii) Protect patients more effectively;<br>iv) Provide for greater representation within the SMC; and<br>v) Encourage the amicable resolution of complaints and facilitate a less adversarial disciplinary process. <br>&nbsp;<br>The key amendments are listed in <a title=\"Annex A\" href=\"/docs/librariesprovider5/default-document-library/annex-a5886072531a248ac8e7164201a175141.pdf?sfvrsn=3c7cbf44_0\">Annex A</a>. A flowchart with an overview of the revised medical disciplinary process is in <a title=\"Appendix 1\" href=\"/docs/librariesprovider5/default-document-library/appendix-1.pdf?sfvrsn=ffaa636e_0\">Appendix 1</a>. <br>&nbsp;<br>8.&nbsp;&nbsp;&nbsp;&nbsp; The MRA amendments also include other amendments arising from the holistic review of the MRA, for better administration of and to streamline and strengthen the disciplinary process. These changes are in line with the spirit of the Workgroup’s recommendations. <br>&nbsp;<br>9.&nbsp;&nbsp;&nbsp;&nbsp; The co-chairpersons of the Workgroup welcome the amendments made to the CLA and MRA. Ms Kuah Boon Theng, SC, Managing Director of Legal Clinic LLC, said, “The amendments will guide doctors on how to provide information to their patients, in a way that will better serve patients’ needs. Ultimately, we hope that this will benefit all parties concerned, and strengthen the doctor-patient partnership.” <br>&nbsp;<br>10.&nbsp;&nbsp;&nbsp;&nbsp; Associate Professor Ng Wai Hoe, Chief Executive Officer of Changi General Hospital, said, “We believe that greater clarity to the legal test for medical advice and various improvements to the disciplinary process will serve the interests of patients, doctors and society at large; leading to stronger doctor-patient relationships and trust.” <br>&nbsp;<br>11.&nbsp;&nbsp;&nbsp;&nbsp; While the legislative changes will ensure a disciplinary process that is clearer, fairer, more timely and robust, and bring clarity, certainty and consistency to the taking of informed consent, these outcomes also require a culture shift in the medical fraternity. The self-regulating system requires the continued contribution and involvement of all healthcare professionals, such as by participating as members of the committees or as experts in the disciplinary process. <br>&nbsp;<br>12.&nbsp;&nbsp;&nbsp;&nbsp; MOH will continue to work with SMC, the medical community and other relevant stakeholders on the implementation of the changes based on the Workgroup recommendations, and the legislative amendments to the CLA and MRA.", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "amendments-to-medical-registration-act-and-civil-law-act", "CurrentPageUrl": null}, {"Title": "7 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1601972100000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "06 Oct 2020", "Summary": "", "MainContent": "&nbsp; &nbsp; &nbsp; &nbsp;As of 6 October 2020, 12 pm, the Ministry of Health (MOH) has preliminarily confirmed 7 new cases of locally transmitted COVID-19 infection. Based on our investigations so far, 2 are in the community, and 5 reside in dormitories.&nbsp;<br><br>2.&nbsp; &nbsp;In addition, there are 4 imported cases, who had all been placed on Stay-Home Notice upon arrival in Singapore. In total, there are 11 new cases of COVID-19 infection in Singapore today.<br><br>3.&nbsp; &nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.<br><br><br><br><strong>MINISTRY OF HEALTH<br>6 OCTOBER 2020</strong>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "7-new-cases-of-locally-transmitted-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}