{"pressItemDictionary": {"Press Releases": [{"Title": "25 More Cases  Discharged, 623 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1587138600000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "17 Apr 2020", "Summary": "", "MainContent": "<div id=\"ftn2\"><p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;As of 17 April 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 623 cases of COVID-19 infection in Singapore. The breakdown is as follows:</p><p><strong>a) Imported cases: 1</strong><br><br>We have one new imported case today who is serving Stay-Home Notice.&nbsp; &nbsp;<br><br><strong>b)</strong>&nbsp;<strong>Cases in the community: 27 </strong>(22 Singaporeans/Permanent Residents, 4 work passes, 1 visitor)<br><br>It has been 11 days since the circuit breaker was implemented. The number of new cases in the community has decreased, from an average of 40 cases per day in the week before, to an average of 32 per day in the past week [1].<br><br>The circuit breaker measures appear to have helped, but we still have to monitor carefully the numbers over the next few days. We are particularly concerned that it is increasingly difficult to link the new cases and identify the source of infection. In fact, the number of unlinked cases in the community has increased slightly, from an average of 19 cases per day in the week before, to an average of 22 per day in the past week.&nbsp;We have an ongoing surveillance programme, where a small sample of patients at our primary care facilities are tested for COVID-19 infections. We have picked up some cases through these tests, which is an indication of undetected cases in the community.<br><br><strong>c)</strong>&nbsp;&nbsp;<strong>Work Permit holders (residing outside dormitories): 37<br><br></strong>The number of new cases amongst Work Permit holders residing outside dormitories has increased, from an average of 11 cases per day in the week before, to an average of 19 per day in the past week.&nbsp;<br><br><strong>d)&nbsp;Work Permit holders (residing in dormitories): 558</strong></p><p>The main increase today continues to be for Work Permit holders residing in dormitories, in line with our continued efforts to actively test and isolate the infected workers. Most of these cases have a mild illness and are being monitored in the community isolation facilities or general ward of our hospitals. The cases are generally mild, and none of them is in the intensive care unit.</p><h3> </h3><p>2.&nbsp; &nbsp;Details of these trends can be found in MOH’s daily situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\">www.moh.gov.sg/covid-19/situation-report</a>).</p><p><p>3.&nbsp; Of the new cases, 69% are linked to known clusters, while the rest are pending contact tracing.</p></p><p><p><strong>Links between previous cases found</strong></p><p>4.&nbsp; &nbsp;In the past week (10 April to 16 April), MOH has uncovered links for 483 previously unlinked cases (see <u><a href=\"/docs/librariesprovider5/2019-ncov/annex-a0b923cbd4d30406abaec93b530525cd8.pdf?sfvrsn=e2b0106c_0\" title=\"Annex A\">Annex A</a></u>).</p></p><p><p>5.&nbsp; &nbsp;Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. A summary of the confirmed cases are in <u><a href=\"/docs/librariesprovider5/default-document-library/annex-bef136b88e3d2415ebea50f0f9fd59375.pdf?sfvrsn=a6a28646_0\" title=\"Annex B\">Annex B</a></u>.</p></p><p><p>6.&nbsp; Please refer to the MOH website for the situation report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\">www.moh.gov.sg/covid-19/situation-report</a>).</p></p><p><p><strong></strong><strong>Cases from public healthcare sector</strong></p><p><u>Case 5018</u></p><p>7.&nbsp; Case 5018 is a 34 year-old female Malaysian national who had been in Malaysia from 29 January to 8 April. She reported onset of symptoms on 16 April, and subsequent test results confirmed COVID-19 infection on 17 April. She is currently warded at the National Centre for Infectious Diseases.</p></p><p><p>8.&nbsp; She is employed as a nurse at Bright Vision Hospital but had not gone to work since onset of symptoms as she had been on Stay-Home Notice.</p></p><p><p><strong>Update on condition of confirmed cases</strong></p><p>9.&nbsp; &nbsp;25 more cases<font size=\"1\">&nbsp;[2]</font>&nbsp;of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 708 have fully recovered from the infection and have been discharged from hospitals or community isolation facilities.</p></p><p><p>10.&nbsp; Of the 2,113 confirmed cases who are still in hospital, most are stable or improving. 22 are in critical condition in the intensive care unit. 2,218 cases who are clinically well but still test positive for COVID-19 are isolated and cared for at community facilities. 11 have passed away from complications due to COVID-19 infection.</p></p><p><p>11.&nbsp; &nbsp;Case 3145, a 95 year-old male Singapore Citizen, has passed away from complications due to COVID-19 infection on 17 April 2020. He was confirmed to have COVID-19 infection on 13 April. Raffles Hospital has reached out to his family and is extending assistance to them.</p></p><p><strong>MINISTRY OF HEALTH</strong><br></p><p><strong>17 APRIL 2020</strong></p><div> <hr align=\"left\" size=\"1\" width=\"33%\"> <div id=\"ftn1\"> </div></div><p>[1] Yesterday’s report highlighted 48 community cases, including 22 with pending details on the pass type.&nbsp;&nbsp;But subsequent contact tracing found that these 22 cases were in fact residing in the dormitories.&nbsp;&nbsp;This means that there were only 26 cases in the community yesterday.</p><p>[2]&nbsp;Cases 388, 511, 533, 632, 638, 898, 911, 1046, 1060, 1115, 1266, 1352, 1435, 1575, 1620, 1712, 1915, 1936, 1990, 2421, 2556, 2558, 2641, 2727 and 3193,.</p><p>.</p><p><div><div id=\"ftn2\"> </div> </div><br></p></div>", "PressCategory": ["Press Releases"], "CustomDetailUrl": "", "UrlName": "25-more-cases-discharged-623-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "623 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1587118320000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "17 Apr 2020", "Summary": "&nbsp;", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;As of 17 April 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 623 cases of COVID-19 infection in Singapore, the majority of whom are foreign workers in the dormitories.</p><p>2.&nbsp; &nbsp; &nbsp;We are still working through the details of these cases, and further updates will be shared via the MOH press release that will be issued later tonight.</p><p>&nbsp;</p> <p>&nbsp;</p> <p><div id=\"ftn2\"> <p>&nbsp;</p> </div> </p>", "PressCategory": ["Press Releases"], "CustomDetailUrl": "", "UrlName": "623-new-cases-of-covid-19-infection", "CurrentPageUrl": null}, {"Title": "Two Work Permit Holders Charged for Breaching Quarantine Order", "PublishedDate": "/Date(1587052800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "17 Apr 2020", "Summary": "", "MainContent": "<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Two individuals were charged in court on 17 April 2020 after breaching their Quarantine Order (QO). 35-year-old male Indian national, Vardireddy Nageswara Reddy was charged for an offence under Section 15(4)(b) of the Infectious Diseases Act, and 49-year-old male Chinese national, Liu Dufeng was charged for two offences under Section 15(4)(b) of the Infectious Diseases Act.</p><p>&nbsp;</p><p><strong>Wilful Breach of the QO by Vardireddy Nageswara Reddy</strong></p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; On 17 February 2020, Vardireddy, a Work Permit holder, was issued a QO which required him to be isolated at home from 16 to 20 February. Vardireddy’s quarantine period was subsequently extended to 25 February, 12.00 pm. When the QO was served to Vardireddy, he had acknowledged that he understood the contents of the QO, in particular that he could not leave his place of residence for the entire duration of the quarantine period.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; On 24 February, Vardireddy had left his home to go to the neighbourhood shopping mall to purchase some items without the permission of Director of Medical Services and thereby, breached his QO. </p><p>&nbsp;</p><p><strong>Wilful Breach of the QO by Liu Dufeng</strong></p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; On 15 February 2020, Liu, a Work Permit holder, was issued a QO for him to be isolated at his place of residence at 45 Genting Road from 12 to 24 February. When the QO was served to Liu, he acknowledged that he understood the contents of the QO, in particular that he could not leave his place of residence for the quarantine period.</p><p>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; On 19 February, Liu relocated to 14 Genting Road to continue his quarantine under the instructions of his employer. Liu had failed to inform his employer that he was not supposed to be relocated during the quarantine period and also failed to seek permission from Director of Medical Services prior to the relocation. </p><p>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Investigations also revealed that Liu had left his residence on 21 February in search of a bank at MacPherson Road. <br><br>7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Any person convicted of an offence under Section 15(4)(b) of the Infectious Diseases Act is liable to a fine of up to $10,000, or up to six months’ imprisonment, or both. </p><p>8.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; A QO is a legal order issued to individuals under the Infectious Diseases Act and issued to quarantine or isolate an individual who is, or suspected to be, a carrier of an infectious disease or a contact of a person confirmed to have an infectious disease. MOH will not hesitate to take enforcement action against those who fail to comply with the QO requirements. </p><p>&nbsp;</p><p><strong>MINISTRY OF HEALTH<br>17 APRIL 2020</strong></p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "two-work-permit-holders-charged-for-breaching-quarantine-order", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}