{"pressItemDictionary": {"Press Releases": [{"Title": "838 More Cases Discharged, 614 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1590158880000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "22 May 2020", "Summary": "", "MainContent": "<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; As of 22 May 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 614 cases of COVID-19 infection in Singapore. The breakdown is as follows: </p><p><strong>a)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Imported cases: 0</strong></p><p>There are no imported cases today. </p><p><strong>b)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Cases in the community</strong><sup>1</sup><strong> </strong>: 4 (4 Singaporeans/Permanent Residents)</p><p>The number of new cases in the community has increased, from an average of 5 cases per day in the week before, to an average of 7 per day in the past week. This is partly due to our active surveillance and screening of nursing home residents and pre-school staff, which have picked up more cases in the past week. The number of unlinked cases in the community has remained stable at an average of 2 per day in the past two weeks. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.</p><p><strong>c)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Cases residing in dormitories: 610</strong></p><p>We continue to pick up many cases amongst Work Permit holders residing in dormitories, including in factory-converted dormitories, because of extensive testing in these premises, as part of our process to verify and test the status of all workers. </p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Details of these trends can be found in MOH’s daily situation Report (<a title=\"\" href=\"http://www.moh.gov.sg/covid-19/situation-report\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?q=http://www.moh.gov.sg/covid-19/situation-report&amp;source=gmail&amp;ust=1590244916505000&amp;usg=AFQjCNHlXvgpzM11QTkxuIWlhLTKU8iReA\">www.moh.gov.sg/covid-19/<wbr>situation-report</a>). Please refer to <a title=\"Annex A\" href=\"/docs/librariesprovider5/pressroom/annex-a-22-may.pdf?sfvrsn=b062b630_2\">Annex A</a>&nbsp;for the summary of the confirmed cases. </p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Of the new cases, 99% are linked to known clusters, while the rest are pending contact tracing. </p><p>&nbsp;</p><p><strong>Links between previous cases found</strong></p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In the past week (15 May to 21 May), MOH has uncovered links for 2 previously unlinked cases. </p><p>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <a title=\"Annex B\" href=\"/docs/librariesprovider5/pressroom/annex-b-22-may.pdf?sfvrsn=3fd92529_2\">Annex B</a>&nbsp;and <a title=\"Annex C\" href=\"/docs/librariesprovider5/pressroom/annex-c-22-may.pdf?sfvrsn=6db1cc52_2\">Annex C</a>&nbsp;for details.</p><p>&nbsp;</p><p><strong>Update on condition of confirmed cases</strong></p><p>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 838 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 12,955 have fully recovered from the infection and have been discharged from hospitals or community care facilities. </p><p>7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; There are currently 798 confirmed cases who are still in hospital. Of these, most are stable or improving, and eight are in critical condition in the intensive care unit. 16,650 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 23 have passed away from complications due to COVID-19 infection. </p><p>&nbsp;&nbsp;</p><p><strong>MINISTRY OF HEALTH<br>22 MAY 2020</strong></p><p><sup>1</sup>&nbsp;Previously we had tracked the work permit holders living outside dormitories as a separate category, and put a large number of these workers on Stay Home Notices (SHN). The SHN for these workers has since expired. Hence we have now updated the definition of “Cases in the Community” to include all cases (including amongst Work Permit holders) who are detected outside of the dormitories.&nbsp;</p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "838-more-cases-discharged-614-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "End of Circuit Breaker Phased Approach to Resuming Healthcare Services", "PublishedDate": "/Date(1590153480000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "22 May 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;The Multi-Ministry Taskforce has assessed the situation and decided to exit the Circuit Breaker when it ends on 1 June 2020. In tandem with the gradual opening of the economy, healthcare services which were deferred will also resume in a controlled and gradual manner.<br><br>2.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Even as we resume more healthcare services, managing the current outbreak situation and preventing new large clusters from forming remain our priority.<br><br><strong>Phase One (“Safe Re-opening”)<br><br></strong>3.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Over the next few weeks, more healthcare services will resume in a gradual and controlled manner to minimise crowding. This carefully considers the need to set aside sufficient capacity, critical resources and manpower in our healthcare institutions to cover ongoing COVID-19 operations. Appropriate safe distancing and precautionary measures remain necessary.<br><br>4.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Healthcare providers will triage and prioritise the resumption of healthcare services based on medical necessity, where patients with more urgent medical needs will be attended to first. Services for patients who are well, or whose conditions are stable and whose treatment can continue to be safely deferred will resume in a later phase. Similarly, services which alter the appearance but do not cure or ameliorate disease or illness (e.g. Botox, fillers, threadlifts) will continue to be deferred.<br><br>5.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;In Phase One, i.e. from 2 June 2020, patients may expect the following services to resume:<br><br>&nbsp; &nbsp;a.&nbsp; &nbsp;<strong><span style=\"text-decoration: underline;\">Hospital-based</span></strong><u><strong><span style=\"text-decoration: underline;\"> </span>Care</strong></u><strong>.</strong>Only specialist outpatient services, medical procedures and allied health services for patients with higher needs will resume. These include care that has been deferred for some months and cannot be deferred further without affecting clinical outcome. Some examples include surgeries for visually significant or advanced cataracts, hearing implants in children, joint surgeries for patients with severe impairment, all in-vitro fertilisation services, surveillance services including scopes for high-risk groups, and diabetic foot screening. Each patient will be assessed based on his individual circumstance.</p><p><p><br>&nbsp; &nbsp;b.&nbsp; &nbsp;<strong><u>Primary, Preventive and Dental Care</u></strong><strong>.</strong> Chronic disease management, including the provision of ancillary services, will resume for patients, prioritised by healthcare providers based on medical necessity and available capacity. Preventive health services, such as vaccinations for flu, pneumococcal and other recommended adult vaccinations, and pre-enlistment screening will recommence. Ongoing dental procedures including scaling and polishing, fillings, crowns, dentures and orthodontic treatment can resume, with appropriate precautions.<br><br>&nbsp; &nbsp;c.&nbsp; &nbsp;<strong><u>Community-based services</u></strong><strong>.</strong> Home-based visits will resume for existing clients to serve those who need the services, with safe distancing measures in place. These include clients whose services have been deferred during the circuit breaker period. Services for new clients will be prioritised to those with urgent needs.<br><br>&nbsp; &nbsp;d.&nbsp; &nbsp;<strong><u>Traditional Chinese Medicine</u></strong><u> <strong>and other Traditional and Complementary Services</strong></u><strong>.</strong> TCM needle acupuncture for all conditions will resume. Other Traditional and Complementary Services such as Ayurvedic, chiropractic and osteopathic treatments for the management of medical conditions and relief of symptoms may resume with appropriate precautions.<br><br>6.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Please see <u><a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-a---examples-of-essential-services-that-have-not-been-deferred-during-circuit-breaker-period.pdf?sfvrsn=e12561ff_0\" title=\"Annex A\">Annex A</a></u> for examples of essential services that continue to be provided even during the circuit breaker period, and <u><a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-b---examples-of-services-for-resumption.pdf?sfvrsn=d99d638d_0\" title=\"Annex B\">Annex B</a></u> for examples of services that have gradually resumed since 19 May 2020, with further services to be resumed from Phase One (i.e. 2 Jun 2020).<br><br>7.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;In addition, as there is still a need to reduce the risk of community transmissions, physical visits should be minimised whenever possible, with teleconsultation and medication delivery being the preferred mode of review. These consultations, including collection of medications for continual management of existing medical conditions, should be done on an appointment basis as far as possible, and subject to the ability to maintain safe care and safe distancing on the premises.<br><br>8.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;To ensure the safety of staff and patients in our healthcare establishments, all staff will continue to adhere to necessary precautions including the wearing of masks, maintaining good personal hygiene and ensuring regular cleaning of activity equipment and shared spaces. Patients and caregivers must also do their part by wearing a mask at all times and maintaining good personal hygiene when seeking treatment.<br><br>9.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;In Phase One, we will also allow visitors from the same or one other household to visit loved ones who have been hospitalised. However, to protect our patients who are still vulnerable, we will allow a maximum of five such visitors to pre-register with the hospital, and only one person will be allowed to visit at a time. Hospitals may also introduce further measures to space out visitations and avoid crowding.<br><br>10.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Some of these measures may be adjusted further to reduce risk of infection if necessary. The Ministry of Health (MOH) will continue to reach out to healthcare professionals to share our plans.<br><br><strong>Phases Two and Three<br></strong><br>11.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;The Multi-Ministry Taskforce will monitor the daily infection rates. If the community transmission rates remain low and stable over the subsequent few weeks, and the dormitory situation remains under control, we may then progress to Phase Two (“Safe Transition”), with the gradual resumption of more activities.<br><br>12.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;In the early part of Phase Two, we expect most healthcare services to resume, with services for medically necessary treatments prioritised. This would still be subject to the need to minimise appointments for physical consultations unless clinically needed, based on the ability to maintain safe distancing. These include recommended chronic disease and cancer screening under the Screen For Life programme, statutory medical examinations, pre-employment medical screening, and selected community based services delivered on a one-to-one basis. Group activities such as senior activities, community health screening and other forms of congregation will resume in later phases.<br><br>13.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;We will also consider further easing the visitor restrictions, to allow more family members and friends to visit loved ones admitted to hospitals. This will still be subject to overall visitor caps.</p></p> <p>&nbsp;</p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "end-of-circuit-breaker-phased-approach-to-resuming-healthcare-services", "CurrentPageUrl": null}, {"Title": "Post-circuit Breaker Measures for Seniors ", "PublishedDate": "/Date(1590136560000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "22 May 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; The Multi-Ministry Taskforce announced on 19 May 2020 that we will exit the Circuit Breaker when it ends on 1 June, with a controlled approach to resume activities safely over three phases. Seniors are especially vulnerable and should continue to take extra precautions after the Circuit Breaker.&nbsp;<br><br><strong>Phase 1 (“Safe Opening”)&nbsp;<br><br></strong>2<b>. &nbsp;&nbsp;&nbsp;&nbsp;</b>In Phase 1, with more activities and interactions, there will likely be a higher risk of community transmission.&nbsp; Therefore seniors should continue to stay at home as much as possible. We will continue with most Circuit Breaker measures for seniors in Phase 1, to ensure that they stay safe. <br><br><em>Families as first line of support </em><br><br>3.&nbsp; &nbsp; &nbsp;Family support for seniors remains important. Therefore we will allow family members to visit their parents or grandparents staying elsewhere in Phase 1. However, this is capped at two visitors from the same visiting household per day to minimise risk of exposure. Dropping off children at parents’ and grandparents’ homes for childcare will also be allowed, subject to the same limit. This is on top of the existing provisions for informal childcare arrangements for essential workers. Seniors should not leave their houses to visit family members, as this will increase their risk of infection e.g. while commuting. The restrictions are necessary to keep our elderly parents and grandparents safe.&nbsp;&nbsp;<br><br><em>Essential services will continue&nbsp;&nbsp;<br><br></em>4.&nbsp; &nbsp; &nbsp; Essential services such as residential care services, home care, and meals support will continue operations. All centre-based care services will remain suspended, except for designated centres which will serve seniors without alternative caregiving arrangements. We will increase the number of designated centres if there are more such seniors requiring these services as caregivers return to work. We recognise the challenges of balancing caregiving and work responsibilities, especially for caregivers of persons with dementia. Caregivers who require support may reach out to the Agency for Integrated Care (AIC) at 1800-650-6060 or their enrolled centres for assistance.&nbsp;&nbsp;<br><br><em>Senior-centric activities continue to be suspended&nbsp; <br><br>5.&nbsp; &nbsp; &nbsp;</em>All senior-centric activities organised by the People’s Association, Health Promotion Board, SportSG and the Council for Third Age will remain suspended. All&nbsp;other activities that involve physical interactions amongst seniors, such as interest groups, events, and other gatherings targeted at seniors should also continue to be suspended. We do recognise that this prolonged suspension may cause seniors with little or no social support to feel isolated, even as the suspensions help keep all seniors safe. Hence we will gradually resume some activities for clients of Senior Activity Centres (SACs) and Community Resource, Engagement and Support Team (CREST) providers to address their psychosocial wellbeing. In order to keep interactions low, these will be limited to activities that can be done individually (e.g. craftwork, reading, gardening), and with restrictions on the activity duration and total number of persons per session. SACs, CREST, befriending and counselling services will continue phone check-ins on their clients, and home visits will resume. Together, these services and activities will enable us to support vulnerable seniors. See <span style=\"text-decoration: underline;\"><a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-a---service-in-operation-in-phase-1.pdf?sfvrsn=bcf0043d_0\" title=\"Annex A\">Annex A</a></span> for list of services in operation in Phase 1.&nbsp;&nbsp;<br><br><em>Protection for eldercare sector&nbsp;<br><br>6.&nbsp; &nbsp; &nbsp;</em>We have progressively tightened precautionary measures in eldercare services and senior-centric programmes since January. These include strict infection prevention and control, safe distancing, split zones, contact tracing, and active testing. In particular, frail seniors living in residential care homes are most vulnerable, and we want to keep the risk of bringing infection into the homes low. Hence face-to-face visits in residential homes will continue to be suspended. We recognise that this is difficult for seniors and their loved ones, and AIC will continue supporting homes to use phone or video calls for them to keep in touch. This has been a challenging period for seniors, families, and service providers, and the collective vigilance has helped to keep numbers low. These measures are necessary to ensure that seniors may tide through COVID-19 safely, and we will continue to make adjustments as needed.&nbsp;<br><br><em>Surveillance testing to detect cases in eldercare sector early&nbsp;<br><br>7.&nbsp; &nbsp; &nbsp;&nbsp;</em>We will continue to complement our precautionary measures with surveillance testing. This allows us to pick up cases early and to limit further transmission. We conducted tests for all staff of residential care homes earlier and testing of all residents is underway. These initial sweeps will guide the approach for future surveillance in residential care homes. We will also conduct tests for staff of non-residential care services, namely designated eldercare centres and day hospices, kidney dialysis centres, and home care providers. <br><br>8.&nbsp; &nbsp; &nbsp; Together with the Ministry of Social and Family Development and National Council of Social Service, we will continue to ensure tight coordination among community partners such as charities, social service agencies and ground-up groups, so that help continues to reach those in need, while keeping everyone safe. AIC will also continue to check in on seniors via phone to refer them to assistance as needed.&nbsp;<br><br><strong>Phases 2 (“Safe Transition”) and 3 (“Safe Nation”)&nbsp;<br><br></strong>9.<strong>&nbsp; &nbsp; &nbsp;</strong>Adopting a more conservative approach in Phase 1 will allow us to better manage the risks to seniors. If the community transmission rate remains low and stable in the subsequent few weeks, we expect to be able to resume more activities in Phase 2. This includes reviewing the restrictions on visits at residential care homes as well as among different households, and increasing the activities of centre-based care services.</p><p><p>10.&nbsp; &nbsp;Depending on the COVID-19 situation and our risk assessment, we will continue to ease measures gradually and eventually reach a new normal in Phase 3. Seniors can resume day-to-day activities and we can allow social activities in small groups, with safe distancing measures and other precautions remaining in place. Seniors can then look forward to activities like cooking classes and fitness programmes again. More details on the range of activities and services to be resumed in Phases 2 and 3 will be announced later.&nbsp;<br><br><strong>Working Together to be COVID-safe&nbsp;<br><br></strong><em>Seniors and caregivers must stay vigilant<br><br>11.&nbsp; &nbsp;&nbsp;</em>Everyone has a part to play in keeping Singapore COVID-safe. We urge families and neighbours to continue assisting seniors with essential activities, so they may avoid going out. If seniors must go out, they should avoid crowded places (e.g. wet markets) and peak hour travel. Family members visiting should maintain good personal hygiene including washing hands frequently with soap, and safe distancing where possible. It is very important to minimise physically interact with seniors at all if unwell. See <span style=\"text-decoration: underline;\"><a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-b---summary-of-precautionary-measures-for-seniors.pdf?sfvrsn=572be1a8_0\" title=\"Annex B\">Annex B</a></span> for a summary of precautionary measures for seniors and families.&nbsp;<br><br><em>Support seniors at work&nbsp;<br><br>12.&nbsp; &nbsp; &nbsp;&nbsp;</em>Employers should enable seniors to work from home as far as possible. For senior workers who cannot work from home, companies should ensure that safe distancing measures such as spacing out workstations, staggering work timing, and temperature screening, are implemented. All workers must be vigilant in adhering to safe distancing measures, such as washing hands frequently, dining alone, and minimising interactions with co-workers.&nbsp;<br><br><strong>Preparing for better times<br><br></strong>13<strong>.&nbsp; &nbsp; &nbsp;</strong>In order to resume these activities that we enjoy, we must continue to be vigilant. Stay home, avoid crowds, and stay in contact with your friends and family remotely as far as possible.<br></p></p><p><strong></strong><strong>MINISTRY OF HEALTH<br></strong><strong>22 </strong><strong>MAY 2020</strong></p><p>&nbsp;</p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "post-circuit-breaker-measures-for-seniors", "CurrentPageUrl": null}, {"Title": "614 New Cases of Covid-19 Infection ", "PublishedDate": "/Date(1590132900000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "22 May 2020", "Summary": "", "MainContent": "<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; As of 22 May 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 614 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders residing in foreign worker dormitories. Four cases are Singaporeans/ Permanent Residents. </p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight. </p><p><strong>MINISTRY OF HEALTH<br>22 MAY 2020</strong><br></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "614-new-cases-of-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}