{"pressItemDictionary": {"Press Releases": [{"Title": "Seoul Garden Restaurant In Tampines Mall to Suspend Operations for Breaching Safe Management Measures", "PublishedDate": "/Date(1607162400000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "05 Dec 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\"><span style=\"font-family: Arial;\"><span style=\"font-size: 14px;\">&nbsp; &nbsp; &nbsp; The Ministry of Health (MOH) has ordered the Seoul Garden restaurant located in Tampines Mall (4 Tampines Central 5 #04-01 Tampines Mall) to suspend its full operations (inclusive of both dining in and take-away) for 10 days between 5 December and 14 December 2020, with both dates inclusive, after investigations revealed that the restaurant had failed to ensure safe management measures (SMMs) on its premises.&nbsp;<br><br>2.&nbsp; &nbsp; &nbsp;MOH commenced investigations in respect of potential breaches of SMMs upon receiving information that an individual (Case 58401 <sup><span style=\"font-size: 11px;\">[1]</span></sup>) had tested positive for COVID-19 infection after having dinner with 12 other family members at the restaurant on 21 November 2020. Although the family members were seated at separate tables of up to five persons per table, investigations revealed that there had been mingling among them. The restaurant did not take reasonable steps to prevent the intermingling between tables on its premises.&nbsp;&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp;Investigations against the restaurant, as well as Case 58401 and his family members are ongoing, and further enforcement action may be taken pending the outcome of investigations.&nbsp; &nbsp;<br><br>4.&nbsp; &nbsp; MOH will not hesitate to take enforcement action against operators and individuals who fail to comply with the safe distancing and safe management measures. Any person convicted of an offence under the COVID-19 (Temporary Measures) Act 2020 is liable to a fine of up to $10,000, or up to six months’ imprisonment, or to both. In the case of second or subsequent offence, to a fine not exceeding $20,000 or to imprisonment for a term not exceeding 12 months or to both.&nbsp;<br><br>5.&nbsp; &nbsp; &nbsp;We urge everyone to continue to exercise social responsibility, and to comply with the prevailing measures. A resurgence of COVID-19 cases and clusters can easily emerge in our community if we let our guard down and become lax in adherence to SMMs.<br><br><br><strong>MINISTRY OF HEALTH<br>5 DECEMBER 2020</strong><br><br>==<br><span style=\"font-size: 12px;\">[1]&nbsp;Case 58401 is a 32 year-old male Singaporean who was confirmed to have COVID-19 infection on 25 November. MOH had earlier announced this on 26 November.</span></span></span></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "seoul-garden-restaurant-in-tampines-mall-to-suspend-operations-for-breaching-safe-management-measures", "CurrentPageUrl": null}, {"Title": "1 New Case of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1607154360000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "05 Dec 2020", "Summary": "", "MainContent": "&nbsp; &nbsp; &nbsp; As of 5 December 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 1 new case of locally transmitted COVID-19 infection. Based on our investigations so far, the case is in the community and had already been placed on quarantine earlier. There are no new cases in the dormitories.&nbsp;<br><br>2.&nbsp; &nbsp;In addition, there are 12 imported cases. Of these, 11 had already been placed on Stay-Home Notice or isolated upon arrival in Singapore. The remaining case is a Singaporean who had travelled to Indonesia under the Business Travel Pass. He had undergone a COVID-19 Polymerase Chain Reaction (PCR) test upon return to Singapore on 28 November, and self-isolated while waiting for his test result. His test came back negative on 29 November but he developed symptoms on 2 December, and was confirmed to have COVID-19 infection on 4 December.&nbsp;<br><br>3.&nbsp; &nbsp;In total, there are 13 new cases of COVID-19 infection in Singapore today.&nbsp;<br><br>4.&nbsp; &nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;<br><br><strong><br>MINISTRY OF HEALTH<br>5 DECEMBER 2020</strong><br><div><br></div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "1-new-case-of-locally-transmitted-covid-19-infection-5Dec", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}