{"pressItemDictionary": {"Press Releases": [{"Title": "One more case discharged; Thirteen new cases of COVID-19 infection confirmed", "PublishedDate": "/Date(1583496900000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "06 Mar 2020", "Summary": "", "MainContent": "<p>One more case of COVID-19 infection has been discharged from hospital today (Case 107). In all, 82 have fully recovered from the infection and have been discharged from hospital.<br></p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;As of 6 March 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified 13 more cases of COVID-19 infection in Singapore. Of these:<br></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Nine are part of the cluster involving a private dinner function at SAFRA Jurong (333 Boon Lay Way) on 15 February;<br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;One is linked to a previous case;<br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Two are likely to be imported cases; and<br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;One is unlinked.</p><p>&nbsp;</p><p><strong>Links between previous cases found</strong></p><p><a name=\"m_-5947965576977771178_OLE_LINK8\">3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Further&nbsp;</a>epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. This was made possible with the assistance of the Singapore Police Force.<br></p><p>a)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Six of the locally transmitted confirmed cases (Cases 31, 33, 38, 83, 90 and 91), as well as Cases 8 and 9, are linked to The Life Church and Missions Singapore. These six cases are linked to another 23 confirmed cases (Cases 48, 49, 51, 53, 54, 57, 58, 60, 61, 62, 63, 66, 67, 68, 70, 71, 73, 74, 78, 80, 81, 84, 88) who are linked to the Grace Assembly of God.<br>b)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Nine of the confirmed cases (Cases 19, 20, 21, 24, 25, 27, 28, 34 and 40) are linked to Yong Thai Hang.<br>c)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Three of the confirmed cases (Cases 30, 36 and 39) are linked to the business meeting held at Grand Hyatt Singapore from 20 to 22 January.<br>d)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Five of the confirmed cases (Cases 42, 47, 52, 56 and 69) are linked to the Seletar Aerospace Heights construction site.<br>e)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;14 of the confirmed cases (Cases 93, 95, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 108 and 110) are linked to&nbsp;Wizlearn Technologies Pte Ltd.<br>f)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;17 of the confirmed cases (Cases 94, 96, 107, 112, 114, 115, 116, 117, 118, 120, 121, 122, 125, 127, 128, 129 and 130) are linked to a private dinner function at SAFRA Jurong on 15 February.</p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Investigations on these clusters are ongoing. In addition to the clusters, our investigations have identified the following links between cases:<br></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Case 44 is linked to Cases 13 and 26;<br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Case 72 is linked to Cases 59 and 79;<br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Case 50 is linked to Cases 55, 65 and 77;<br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Case 75 is linked to Case 41;<br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Case 86 is linked to Case 82; and<br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Case 126 is linked to Case 109.</p><p><a name=\"m_-5947965576977771178_OLE_LINK3\">5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Contact tracing is underway for the other 12 locally transmitted cases to establish any links to previous cases or travel history to affected countries or regions.</a><br></p><p><strong>&nbsp;</strong></p><p><strong>About the confirmed cases</strong></p><p><u>Case 118</u><br></p><p>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Case 118 is a 33 year-old female Singapore Citizen who has no recent travel history to affected countries and regions. She is currently warded in an isolation room at the National University Hospital (NUH). She is a family member of Cases 114 and 115, and is linked to the cluster involving the private dinner function at SAFRA Jurong.<br></p><p>7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;She reported onset of symptoms on 29 February and had sought treatment at Pioneer Polyclinic on 2 March. She presented at the emergency department at NUH on 4 March. Subsequent test results confirmed COVID-19 infection on 5 March afternoon.<br></p><p>8.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Prior to hospital admission, she had mostly stayed at home in the Westwood Avenue area.<br></p><p><u>Case 119</u><br></p><p>9.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Case 119 is a 55 year-old male Singapore Citizen who has no recent travel history to affected countries and regions. He is warded in an isolation room at Alexandra Hospital (AH).<br></p><p>10.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;He reported onset of symptoms on 27 February and had sought treatment at a general practitioner (GP) clinic on the same day, and on 29 February. He presented at the Urgent Care Centre at AH on 1 March and 5 March. Subsequent test results confirmed COVID-19 infection on 5 March afternoon.<br></p><p>11.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Prior to hospital admission, he had mostly stayed at his home at Stirling Road. He is employed by SingTel but had not gone to work since onset of symptoms.<br></p><p><u>Case 120</u><br></p><p>12.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Case 120 is a 62 year-old female Singapore Citizen who has no recent travel history to affected countries and regions. She is currently warded in an isolation room at the National Centre for Infectious Diseases (NCID). She is linked to the cluster involving the private dinner function at SAFRA Jurong.<br></p><p>13.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;She reported onset of symptoms on 2 March and had sought treatment at a GP clinic on 3 March. As she had attended the private dinner function at SAFRA Jurong on 15 February, she was referred by MOH to NCID on 5 March, and was immediately isolated. Subsequent test results confirmed COVID-19 infection on 5 March afternoon.<br></p><p><a name=\"m_-5947965576977771178_OLE_LINK9\">14.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Prior to hospital admission, she had&nbsp;</a>visited Boon Lay Shopping Centre (221 Boon Lay Place). She stays at Jurong West Street 65.<br></p><p><u>Case 121</u><br></p><p>15.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Case 121 is a 54 year-old female Singapore Citizen who has no recent travel history to affected countries and regions. She is currently warded in an isolation room at NCID. She is linked to the cluster involving the private dinner function at SAFRA Jurong.<br></p><p>16.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;She reported onset of symptoms on 26 February and had sought treatment at a GP clinic on 1 March. As she had attended the private dinner function at SAFRA Jurong on 15 February, she was referred by MOH to NCID on 5 March, and was immediately isolated. Subsequent test results confirmed COVID-19 infection on 5 March afternoon.<br></p><p>17.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Prior to hospital admission, she had mostly stayed at her home at&nbsp;Corporation Drive.<br></p><p><u>Case 122</u><br></p><p>18.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Case 122 is a 64 year-old female Singapore Citizen who has no recent travel history to affected countries and regions. She is currently warded in an isolation room at NCID. She is a close contact of Case 117, and is linked to the cluster involving the private dinner function at SAFRA Jurong.<br></p><p>19.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;She reported onset of symptoms on 3 March and had sought treatment at a GP clinic on 5 March. She was referred to NCID on the same day, and was immediately isolated. Subsequent test results confirmed COVID-19 infection on 5 March afternoon.<br></p><p>20.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Prior to hospital admission, she had visited Westgate (3 Gateway Drive) and Keat Hong Community Club (2 Choa Chu Kang Loop). She stays at Petir Road.<br></p><p><u>Case 123</u><br></p><p>21.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Case 123 is likely to be an imported case involving a 47 year-old male Singapore Citizen who had been in South Africa from 14 February to 17 February and France from 22 February to 24 February.<br></p><p>22.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;He reported onset of symptoms on 27 February and had sought treatment at a GP clinic on the same day, and on 2 March and 4 March. He presented at Sengkang General Hospital on 4 March. Subsequent test results confirmed COVID-19 infection on 5 March afternoon.<br></p><p>23.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Prior to hospital admission, he had mostly stayed at his home at Fernvale Close. He&nbsp;<a name=\"m_-5947965576977771178_OLE_LINK7\">is employed by Singapore Airlines as a cabin crew but had not gone to work since onset of symptoms</a>.<br></p><p><u>Case 124</u><br></p><p>24.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Case 124 is likely to be an imported case involving a 37 year-old female Singapore Permanent Resident who had been in Germany from 27 February to 5 March. She was confirmed to have COVID-19 infection on 6 March morning and is currently warded in an isolation room at NCID.<br></p><p><u>Case 125</u><br></p><p>25.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Case 125 is a 65 year-old female Singapore Citizen who has no recent travel history to affected countries and regions. She was confirmed to have COVID-19 infection on 6 March morning and is currently warded in an isolation room at NCID. She is a family member of Case 128, and is linked to the cluster involving a private dinner function at SAFRA Jurong.<br></p><p><u>Case 126</u><br></p><p>26.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Case 126 is a 77 year-old male Singapore Citizen who has no recent travel history to affected countries and regions. He was confirmed to have COVID-19 infection on 5 March afternoon and is currently warded in an isolation room at NCID.&nbsp;<a name=\"m_-5947965576977771178_OLE_LINK6\">As part of enhanced precautions, patients who have acute respiratory infection will be placed in wards with greater separation between patients to minimise the risk of infection. Case 126 had been in the same ward as Case 109 at Singapore General Hospital from 29 February to 1 March, before Case 109 had been confirmed to have COVID-19 infection. Case 126 had been quarantined since 4 March.</a><br></p><p><u>Case 127</u><br></p><p>27.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Case 127 is a 64 year-old female Singapore Citizen who has no recent travel history to affected countries and regions. She was confirmed to have COVID-19 infection on 5 March afternoon and is currently warded in an isolation room at NCID. She is a close contact of Case 117, and is linked to the cluster involving a private dinner function at SAFRA Jurong.<br></p><p><u>Case 128</u><br></p><p>28.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Case 128 is a 70 year-old male Singapore Citizen who has no recent travel history to affected countries and regions. He was confirmed to have COVID-19 infection on 6 March morning and is currently warded in an isolation room at NCID. He is a family member of Case 125, and is linked to the cluster involving a private dinner function at SAFRA Jurong.<br></p><p><u>Case 129</u><br></p><p>29.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Case 129 is a 68 year-old female Singapore Citizen who has no recent travel history to affected countries and regions. She was confirmed to have COVID-19 infection on 6 March morning and is currently warded in an isolation room at Ng Teng Fong General Hospital (NTFGH). She is a family member of case 130, and is linked to the cluster involving a private dinner function at SAFRA Jurong.<br></p><p><u>Case 130</u><br></p><p>30.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Case 130 is a 66 year-old male Singapore Citizen who has no recent travel history to affected countries and regions. He was confirmed to have COVID-19 infection on 6 March morning and is currently warded in an isolation room at NTFGH. He is linked to the cluster involving the private dinner function at SAFRA Jurong.<br></p><p><u>Case 116 (Announced on 5 March)</u><br></p><p><a name=\"m_-5947965576977771178_OLE_LINK2\">31.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Case 116 is a 50 year-old female Singapore Citizen who has no recent travel history to affected countries and regions. She is currently warded in an isolation room at NCID. She is linked to the cluster involving a private dinner function at SAFRA Jurong.</a><br></p><p>32.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;She reported onset of symptoms on 29 February and had sought treatment at a GP clinic on 1 March and 3 March. As she had attended the private dinner function at SAFRA Jurong on 15 February, she was referred by MOH to NCID, and was immediately isolated.&nbsp;<a name=\"m_-5947965576977771178_OLE_LINK4\">Subsequent test results confirmed COVID-19 infection on 5 March morning</a>.<br></p><p>33.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Prior to hospital admission, she had mostly stayed at her home at&nbsp;Jurong West Street 81.<br></p><p><u>Case 117 (Announced on 5 March)</u><br></p><p>34.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Case 117 is a 52 year-old female Singapore Citizen who has no recent travel history to affected countries and regions but had been in Malaysia on 1 March. She is currently warded in an isolation room at NCID. She is linked to the cluster involving the private dinner function at SAFRA Jurong.<br></p><p>35.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;She reported onset of symptoms on 2 March. As she had attended the private dinner function at SAFRA Jurong on 15 February, she was referred by MOH to NCID, and immediately isolated. Subsequent test results confirmed COVID-19 infection on 5 March morning.<br></p><p>36.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Prior to hospitalisation, she had visited shops located at 131 Marsiling Rise and 731 Yishun Street 72, and attended exercise classes at Petir Park (141 Petir Road) and Zhenghua Nature Park (466 Segar Road). She stays at Senja Road.<br></p><p><strong></strong><br></p><p><strong>Update on condition of confirmed cases</strong></p><p>37.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;To date, a total of 82 cases have fully recovered from the infection and have been discharged from hospital. Of the 48 confirmed cases who are still in hospital, most are stable or improving. Nine are in critical condition in the intensive care unit.<br></p><p><strong>&nbsp;</strong></p><p><strong>Update on contact tracing for confirmed cases</strong></p><p>38.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Contact tracing for the confirmed cases is ongoing. Once identified, MOH will closely monitor all close contacts. As a precautionary measure, they will be quarantined for 14 days from their last exposure to the patient. In addition, all other identified contacts who have a low risk of being infected will be under active surveillance, and will be contacted daily to monitor their health status.<br></p><p><a name=\"m_-5947965576977771178_OLE_LINK1\">39.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;As of 6 March 2020, 12pm, MOH has identified 3,366 close contacts who have been quarantined. Of these, 389 are currently quarantined, and 2,977 have completed their quarantine.</a><br></p><p>&nbsp;</p><p><strong>Health advisory<br><br></strong>40.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Singaporeans are advised to defer all travel to Hubei Province and all non-essential travel to mainland China,&nbsp;Iran, northern Italy, Japan and the Republic of Korea.<strong><br></strong></p><p>41.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;All travellers should monitor their health closely for two weeks upon return to Singapore and seek medical attention promptly if they feel unwell. Travellers should inform their doctor of their travel history. If they have a fever or respiratory symptoms (e.g. cough, shortness of breath), they should wear a mask and call the clinic ahead of the visit.<br></p><p>42.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Travellers and members of the public should adopt the following precautions at all times:<br></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Avoid close contact with people who are unwell or showing symptoms of illness;<br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Observe good personal hygiene;<br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Practise frequent hand washing with soap (e.g. before handling food or eating, after going to toilet, or when hands are dirtied by respiratory secretions after coughing or sneezing);<br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Wear a mask if you have respiratory symptoms such as a cough or shortness of breath;<br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Cover your mouth with a tissue paper when coughing or sneezing, and dispose the soiled tissue paper in the rubbish bin immediately; and<br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Seek medical attention promptly if you are feeling unwell.</p><p>43.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;MOH will continue to monitor the situation closely. As medical practitioners are on the lookout for suspect cases, Singapore is likely to see more cases that will need to be investigated.</p><p><strong>MINISTRY OF HEALTH<br></strong><strong>6 MARCH 2020</strong></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "one-more-case-discharged-thirteen-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}