{"pressItemDictionary": {"Press Releases": [{"Title": "910 More Cases Discharged, 448 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1590070500000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "21 May 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;As of 21 May 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 448 cases of COVID-19 infection in Singapore. The breakdown is as follows:&nbsp;<br><br><strong>a) Imported cases: 0</strong><br><br>There are no imported cases today.&nbsp;<br><br><strong>b) Cases in the community</strong>[1]:<strong><em></em> 14</strong> (13 Singaporeans/Permanent Residents, 1 Work Permit holder)<br><br>The number of new cases in the community has decreased, from an average of 7 cases per day in the week before, to an average of 6 per day in the past week. The number of unlinked cases in the community has remained stable at an average of 2 per day in the past two weeks. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br><br>Of the 13 Singaporeans/ Permanent Residents cases, 7 cases were picked up as a result of our active surveillance and screening of nursing home residents and pre-school staff, and four are part of a family cluster linked to a dormitory. Epidemiological investigations are ongoing for the remaining two cases.<br><br><strong>c) Cases residing in dormitories: 434</strong><br><br>We continue to pick up many cases amongst Work Permit holders residing in dormitories, including in factory-converted dormitories, because of extensive testing in these premises, as part of our process to verify and test the status of all workers.&nbsp;<br><br>2.&nbsp; &nbsp;Details of these trends can be found in MOH’s daily situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\" title=\"\" class=\"\" target=\"\">www.moh.gov.sg/covid-19/situation-report</a>). Please refer to <a href=\"/docs/librariesprovider5/default-document-library/annex-a62c57f48ffc34bdfb1b6f596ac73b420.pdf?sfvrsn=6105c914_0\" title=\"Annex A\">Annex A</a>&nbsp;for the summary of the confirmed cases.&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp;Of the new cases, 99% are linked to known clusters, while the rest are pending contact tracing.&nbsp;<br><br>4.&nbsp; &nbsp; &nbsp; &nbsp; MOH has been monitoring existing clusters for any further transmission. As there have been no more cases linked to Natureland East Coast (907 East Coast Road), Wing Fong Court (10 Lorong 14 Geylang) and 112 Neythal Road&nbsp; for the past two incubation periods (i.e. 28 days), the clusters have now been closed.<br><br><strong>Links between previous cases found<br></strong><br>5.&nbsp; &nbsp; &nbsp; &nbsp; In the past week (14 May to 20 May), MOH has uncovered links for 6 previously unlinked cases.&nbsp;<br><br>6.&nbsp; &nbsp; &nbsp; Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <a href=\"/docs/librariesprovider5/default-document-library/annex-b8be8e4e88e2b4e04bffb7c5723e4d0c5.pdf?sfvrsn=1e3b4675_0\" title=\"Annex B\">Annex B</a>&nbsp;and <a href=\"/docs/librariesprovider5/default-document-library/annex-c7dd237e78cdb4bffa84e53f90fd20fb4.pdf?sfvrsn=11692bfe_0\" title=\"Annex C\">Annex C</a>&nbsp;for details.<br><br><strong>Update on condition of confirmed cases<br></strong><br>7.&nbsp; &nbsp; &nbsp; 910 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 12,117 have fully recovered from the infection and have been discharged from hospitals or community care facilities.&nbsp;<br><br>8.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;There are currently 901 confirmed cases who are still in hospital. Of these, most are stable or improving, and 10 are in critical condition in the intensive care unit. 16,771 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 23 have passed away from complications due to COVID-19 infection.&nbsp;<br><br>9.&nbsp; &nbsp; Case 4689, a 73 year-old male Singapore Citizen, has passed away from complications due to COVID-19 infection on 21 May 2020. He was confirmed to have COVID-19 infection on 17 April, and had a history of hypertension, hyperlipidaemia and hypothyroidism. The National Centre for Infectious Diseases has reached out to his family and is extending assistance to them.<br><br><strong>MINISTRY OF HEALTH<br>21 MAY 2020<br><br></strong>[1] Previously we had tracked the work permit holders living outside dormitories as a separate category, and put a large number of these workers on Stay Home Notices (SHN). The SHN for these workers has since expired. Hence we have now updated the definition of “Cases in the Community” to include all cases (including amongst Work Permit holders) who are detected outside of the dormitories.&nbsp;&nbsp;<br></p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "910-more-cases-discharged-448-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "448 New Cases of Covid-19 Infection ", "PublishedDate": "/Date(1590045000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "21 May 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;As of 21 May 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 448 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders residing in foreign worker dormitories. 13 cases are Singaporeans/ Permanent Residents. Of these, seven cases were picked up from our active surveillance and screening of nursing home residents and pre-school staff, and four are part of a family cluster linked to a dormitory. Epidemiological investigations are ongoing for the other two cases.<br><br>2.&nbsp; &nbsp; &nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;<br><br><strong>MINISTRY OF HEALTH<br>21 MAY 2020</strong><br></p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "448-new-cases-of-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}