{"pressItemDictionary": {"Press Releases": [{"Title": "504 More Cases Discharged; 486 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1589209680000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "11 May 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;As of 11 May 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 486 cases of COVID-19 infection in Singapore. The lower number of cases today is partly due to fewer tests being processed at a testing laboratory as it is recalibrating its apparatus for one of the test kits. The breakdown is as follows:<br><strong><br>&nbsp; a)&nbsp;&nbsp;Imported cases: 0<br><br></strong>There are no imported cases today.<br><strong><br>&nbsp; b)&nbsp; Cases in the community: 3 </strong>(2 Singaporeans/Permanent Residents, 1 Work Pass)<br><br>The number of new cases in the community has decreased, from an average of 9 cases per day in the week before, to an average of 8 per day in the past week. The number of unlinked cases in the community has also decreased, from an average of 5 cases per day in the week before, to an average of 3 per day in the past week.&nbsp;We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br><strong><br>&nbsp; c)&nbsp;&nbsp;Work Permit holders (residing outside dormitories): 2<br><br></strong>The number of new cases amongst Work Permit holders residing outside dormitories has decreased, from an average of 9 cases per day in the week before, to an average of 8 per day in the past week.&nbsp;<br><strong><br>&nbsp; d)&nbsp;&nbsp;Work Permit holders (residing in dormitories): 481</strong></p>We continue to pick up many more cases amongst Work Permit holders residing in dormitories, including in factory-converted dormitories, because of extensive testing in these premises.<br><br>2.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Details of these trends can be found in MOH’s daily situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\">www.moh.gov.sg/covid-19/situation-report</a>). Please refer to <u><a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-a---summary-of-confirmed-cases-11-may-2020.pdf?sfvrsn=54114926_0\" title=\"Annex A\">Annex A</a></u> for the summary of the confirmed cases.<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Of the new cases, 97% are linked to known clusters, while the rest are pending contact tracing.<br><br><strong>Links between previous cases found<br></strong><br>4.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;In the past week (4 May to 10 May), MOH has uncovered links for 223 previously unlinked cases.<br><br>5.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <u><a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-b---links-between-previously-announced-and-new-cases-11-may-2020.pdf?sfvrsn=3ee79914_0\" title=\"Annex B\">Annex B</a></u> and <u><a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-c---summary-of-singaporeans-or-singapore-permanent-residents-cases-11-may-2020.pdf?sfvrsn=367df22f_0\" title=\"Annex C\">Annex C</a></u> for details.<br><br><strong>Update on condition of confirmed cases<br></strong><br>6.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;504 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 3,225 have fully recovered from the infection and have been discharged from hospitals or community care facilities.<br><br>7.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;There are currently 1,093 confirmed cases who are still in hospital. Of these, most are stable or improving, and 24 are in critical condition in the intensive care unit. 19,448 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 21 have passed away from complications due to COVID-19 infection.<br><br>8.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Case 1305, a 68 year-old male Singapore Citizen, has passed away from complications due to COVID-19 infection on 11 May 2020. He was confirmed to have COVID-19 infection on 5 April, and had a history of hypertension and hyperlipidaemia. The National University Hospital has reached out to his family and is extending assistance to them.<br><br>9.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Case 23550, a 53 year-old Indian national, has passed away on 9 May 2020. He had been sent to the emergency department at Sengkang General Hospital after suffering a cardiac arrest on 9 May. He was confirmed to have COVID-19 infection on 10 May after his demise. The cause of death is ruptured myocardial infarction due to coronary thrombosis.<sup>[1]</sup><div><br clear=\"all\"> <hr align=\"left\" size=\"1\" width=\"33%\"> <div id=\"ftn1\"> <p><sup>[1]</sup>&nbsp;Only cases where the attending doctor or pathologist attributes the primary or underlying cause of death as due to COVID-19 infection will be added to the COVID-19 death count. This is consistent with international practice for classifying deaths. In 2018, 86 male foreign workers aged 25 to 59 passed away due to heart disease in Singapore.</p> </div> </div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "504-more-cases-discharged-486-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "486 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1589182800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "11 May 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As of 11 May 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 486 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders residing in foreign worker dormitories. Two cases are Singaporeans/ Permanent Residents.<br><br>2.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;The lower number of cases today is partly due to fewer tests being processed at a testing laboratory as it is recalibrating its apparatus for one of the test kits.<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.</p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "486-new-cases-of-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}