{"pressItemDictionary": {"Press Releases": [{"Title": "Government Accepts Recommendations of Expert Committee On Covid-19 Vaccination", "PublishedDate": "/Date(1609063200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "27 Dec 2020", "Summary": "", "MainContent": "1.The government has accepted in full the recommendations of the Expert Committee on COVID-19 Vaccination on the overall COVID-19 vaccination strategy for Singapore, and will begin vaccinating healthcare workers progressively from 30 December 2020. \n<br>\n<br>2. The Expert Committee was convened by the Ministry of Health (MOH) in October 2020 to make recommendations to the government on Singapore’s COVID-19 vaccination strategy, including ensuring the safe and effective use of COVID-19 vaccines in Singapore’s population groups. It submitted its full set of overall framework recommendations and its detailed recommendations specific to the use of the Pfizer-BioNTech COVID-19 Vaccines to the government on 24 December 2020. \n<br>\n<br>3. As announced by the Multi-Ministry Taskforce on 14 December 2020, the government has made provision for all Singaporeans and long-term residents in Singapore to be able to get vaccinated by end-2021, if there are no unforeseen disruptions to vaccine shipments. To ensure the accessibility of the vaccine and enable us to achieve a higher rate of vaccination for the population, this vaccination will be free.<sup>1</sup>  \n<br>\n<br>4. Only vaccines that meet strict standards of safety, quality and effectiveness will be used for our population. The Pfizer-BioNTech COVID-19 vaccine had earlier received authorisation by the Health Sciences Authority under the Pandemic Special Access Route, and the Expert Committee had also reviewed and endorsed its use in Singapore in individuals aged 16 years and above. \n<br>\t\n<br>5. Singapore received the first shipment of vaccines from Pfizer-BioNTech on 21 December 2020, and subsequent COVID-19 vaccine stocks are expected to arrive in Singapore in batches over several months. Vaccination will therefore take place in a progressive manner, with priority given to the following groups, as recommended by the Expert Committee: \n<br>\n<br><strong>a. Persons at high risk of being infected by COVID-19, including healthcare workers and workers at the frontline of our national COVID-19 response. </strong>We agree with the Expert Committee that there is a duty to protect these workers who place themselves at higher risk of infection in the course of serving our population, so as to ensure the continued effective functioning of our healthcare system, and our national systems for preventing and containing disease spread.  \n<br>\n<br><strong>b. Persons who are most vulnerable to severe disease and complications if they fall ill with COVID-19, including the elderly and persons with medical comorbidities. </strong>We will start with vaccinating those 70 years old and above as they have more medical co-morbidities, and tend to have worse health outcomes than those aged 60 to 69 years old if infected with COVID-19. Protecting such persons minimises COVID-19 related mortality and morbidity, and ensures that our healthcare system will continue to have the capacity to care for the overall health of all Singaporeans. \n<br>\n<br>6. We will begin the vaccination exercise with healthcare workers at the National Centre for Infectious Diseases (NCID) on 30 December 2020, and subsequently roll out to more healthcare institutions in the subsequent weeks. Public healthcare institutions – including acute hospitals, community hospitals and polyclinics – as well as private hospitals, will progressively arrange for their staff to be vaccinated within their respective premises. \n<br>\n<br>7. We aim to begin vaccinating the elderly, starting with those aged 70 years and above, from February 2021. Thereafter we will vaccinate other Singaporeans and long-term residents who are medically eligible for vaccination. More details will be shared in due course. \n<br>\n<br>8. Comprehensive vaccination coverage in the population will ensure that our population is protected from COVID-19. This will also indirectly protect those who cannot be vaccinated due to medical reasons. In the longer term, this will enable us to re-open further both as a society and economy, and expedite our recovery from the pandemic. While COVID-19 vaccination will be voluntary, we strongly encourage everyone who is medically eligible for vaccination to get vaccinated when the vaccine is offered. While the current number of cases in the community remains low, the risk for further importation of COVID-19 and community spread will increase as we move into Phase Three and given the global COVID-19 situation. This is especially important in the face of reports surfacing globally about more transmissible strains.\n<br>\n<br>9. Vaccination is not a silver bullet that can end the pandemic immediately, but it is a key enabler to getting us back to a safer state of affairs. It will complement other existing key enablers – safe management measures, testing and contact tracing – which will continue to be necessary in helping us to mitigate any spread and keep community transmission low. We seek the cooperation of all Singaporeans to continue to remain vigilant and disciplined in our fight against COVID-19, by observing safe distancing and safe management measures, and wearing a mask when out of the home. If we all work together, we can look forward to a safer and healthier 2021.\n<br>\n<br>10. The Multi-Ministry Taskforce would like to put on record our thanks to the Chairman, Associate Professor Benjamin Ong, and members of the Expert Committee on COVID-19 Vaccination, who have submitted a comprehensive set of recommendations. As information on more vaccines becomes available, we look forward to further recommendations by the Expert Committee on subsequent population groups to be vaccinated.  \n<br>\n<br>[1] For Singaporeans and long-term residents in Singapore, which includes long-term work-permit holders.<br>\n<br><strong>MINISTRY OF HEALTH\n<br>27 DECEMBER 2020</strong>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "government-accepts-recommendations-of-expert-committee-on-covid-19-vaccination", "CurrentPageUrl": null}, {"Title": "Expert Committee Submits Recommendations On Singapore’s Covid-19 Vaccination Strategy", "PublishedDate": "/Date(1609055100000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "27 Dec 2020", "Summary": "", "MainContent": "<p><strong>Press&nbsp;release by the Expert&nbsp;Committee on COVID-19 Vaccination</strong><br><br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The Expert Committee on COVID-19 Vaccination has submitted its recommendations to the government on the overall COVID-19 vaccination strategy for Singapore on 24 December 2020. </p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The Expert Committee on COVID-19 Vaccination was convened by the Ministry of Health in October 2020 to make recommendations to the government on Singapore’s COVID-19 vaccination strategy, including ensuring the safe and effective use of COVID-19 vaccines in Singapore’s population groups. It closely monitors the global vaccine landscape and recommendations by global authorities, makes detailed assessments of vaccine candidates for their safety, efficacy and suitability for the different segments of Singapore’s population based on the latest clinical data, and makes recommendations on the population groups which should be prioritised for vaccination. Please refer to <a href=\"/docs/librariesprovider5/pressroom/annex-a-ec19v-27-dec.pdf?sfvrsn=8ebac37d_2\">Annex A</a><strong> </strong>for the composition of the Expert Committee.</p><p>&nbsp;</p><p><u>Pfizer-BioNTech COVID-19 vaccine suitable for use in Singapore</u></p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The Expert Committee has independently reviewed the clinical data on the safety and efficacy of the Pfizer-BioNTech COVID-19 vaccine, and concurs with the indications for the interim authorisation granted by the Health Sciences Authority for use of the vaccine in Singapore under the Pandemic Special Access Route. The Committee has assessed that the<strong> Pfizer-BioNTech COVID-19 vaccine is suitable for use in persons aged 16 years old and older in Singapore for the prevention of COVID-19</strong>. </p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In assessing the suitability of vaccine candidates for specific population groups, the Expert Committee took into consideration four key criteria – vaccine safety, vaccine efficacy, vaccine tolerability, and data adequacy of clinical trials. The Pfizer-BioNTech COVID-19 vaccine has demonstrated a high vaccine efficacy of 95%, and its safety profile is consistent with the high standards set for other registered vaccines used in immunisation against other diseases. </p><p>&nbsp;</p><p><u>Vaccinate all persons residing in Singapore who are medically eligible for vaccination</u></p><p>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The Expert Committee recommends to achieve as high a level of population coverage for COVID-19 vaccination as possible, so as to markedly reduce the overall proportion of the population that is susceptible to the disease and likelihood of uncontrolled chains of transmission. A high vaccination coverage in the population also indirectly protects others who may not be suitable for vaccination yet. When vaccines become more widely available, <strong>everyone residing in Singapore who is medically eligible for vaccination should be vaccinated</strong>, although vaccination should remain voluntary. </p><p>&nbsp;</p><p><u>Prioritise population subgroups to maximise the beneficial impact of vaccination </u></p><p>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In view of the limited supply of vaccines, the current disease epidemiology and the public health considerations, the Expert Committee recommends the following groups to be prioritised for vaccination using the Pfizer-BioNTech COVID-19 vaccine:</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; a.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <strong>Persons at high risk of being infected by COVID-19, including healthcare workers and workers at the frontline of our national COVID-19 response.</strong> There is a duty to protect these workers who place themselves at higher risk of infection in the course of caring for our population, and to ensure the continued effective functioning of our healthcare system, and our national systems for preventing and containing epidemic spread.</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; b.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <strong>Persons who are most vulnerable to severe disease and complications if they fall ill with COVID-19, including the elderly and persons with vascular medical comorbidities.</strong> Even in the older age groups, COVID-19 patients 70 years old and above have worse health outcomes than those aged 60 to 69 years old. Where vaccine supply is limited, the Expert Committee recommends starting vaccinations of persons aged 70 years and above, followed by persons aged 60 to 69 years.</p><p>7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The Expert Committee also recommends that around 5% of available vaccine stocks at any given point in time be set aside for specific groups of persons who are of critical importance to the functioning of Singapore (examples could include personnel involved in ensuring that Singapore’s water and utilities, and other nationally essential services are not disrupted), separate from the prioritisation of population subgroups by public health considerations, to ensure that Singapore would be able to continue to function effectively amidst a local outbreak situation. The detailed identification of these groups will be decided by the government as this is beyond the remit of the Expert Committee. </p><p>8.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Until a significant proportion of the population is vaccinated and more data is available on the vaccine’s duration of protection and its ability to generate a response in the body to prevent infection from the outset, the Expert Committee recommends that ongoing public health measures such as safe distancing, mask wearing and good hand hygiene should continue to be practised. Please refer to <a title=\"Annex B\" href=\"/docs/librariesprovider5/pressroom/annex-b-ec19v-27-dec.pdf?sfvrsn=5fb1ef20_2\">Annex B</a>&nbsp;for the full recommendations on Singapore’s COVID-19 Vaccination Strategy by the Expert Committee. </p><p>9.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Expert Committee chairperson A/Prof Benjamin Ong said, “The Committee has made our recommendations after careful assessment and deliberation of the available clinical data. While Singapore currently has a low rate of local transmission of COVID-19, we remain vulnerable to the threat of a surge in cases. As such, it is important that we achieve as comprehensive a coverage of COVID-19 vaccination as possible across the entire population. We strongly encourage all persons who are medically eligible to be vaccinated when the vaccine is made available to them. In the meantime, we recommend to first vaccinate groups who are at greater risk of exposure, such as healthcare workers and COVID-19 frontline workers, and vulnerable groups at greater risk of severe disease from COVID-19 infection, such as the elderly and those with co-morbidities.” </p><p>10.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; As information on more vaccines becomes available, the Expert Committee will assess and make further recommendations on the subsequent population groups to be vaccinated. It will also continue to monitor and review the use of COVID-19 vaccines in Singapore as more data become available over time. </p><p><br><strong>EXPERT COMMITTEE ON COVID-19 VACCINATION<br>27 DECEMBER 2020</strong></p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "expert-committee-submits-recommendations-on-singapore-s-covid-19-vaccination-strategy", "CurrentPageUrl": null}, {"Title": "No New Cases of Locally Transmitted Covid-19 Infection ", "PublishedDate": "/Date(1609054860000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "27 Dec 2020", "Summary": "<div><br><div><br></div></div>", "MainContent": "&nbsp; &nbsp; &nbsp; &nbsp;As of 27 December 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed that there are no new cases of locally transmitted COVID-19 infection.&nbsp;<br><br>2.&nbsp; &nbsp; There are 5 imported cases, who had already been placed on Stay-Home Notice upon arrival in Singapore.<br><br>3.&nbsp; &nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>27 DECEMBER 2020</strong>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "no-new-cases-of-locally-transmitted-covid-19-infection-27dec", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}