{"pressItemDictionary": {"Press Releases": [{"Title": "No New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1607504400000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "09 Dec 2020", "Summary": "", "MainContent": "<p>As of 9 December 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed that there are no new cases of locally transmitted COVID-19 infection. <br><br>There are 6 imported cases, who had already been placed on Stay-Home Notice upon arrival in Singapore. <br><br>We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight. <br><br>An 83 year-old male Singaporean on board Royal Caribbean International’s <em>Quantum of the Seas</em> tested positive for COVID-19 infection this morning, and was immediately isolated. He had reported to the medical centre with diarrhoea, and as part of the protocols was tested for COVID-19 using the Polymerase Chain Reaction (PCR) test equipment on board the ship. His sample will be re-tested at the National Public Health Laboratory, and a second sample will be taken for confirmatory tests. If further tests also come back positive for COVID-19 infection, he will be included as a case in our daily case count. <br><br>Epidemiological investigations and contact tracing are in progress. In the meantime, all the identified close contacts of the case have been isolated, and the results that have come back so far are negative for COVID-19 infection. The remaining passengers and crew will remain on board the ship until contact tracing is completed. All passengers will undergo mandatory COVID-19 testing before they are allowed to leave the terminal at Marina Bay Cruise Centre.</p> <p>&nbsp;</p> <div> <p><strong>MINISTRY OF HEALTH<br></strong><strong>9 DECEMBER 2020</strong></p> </div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "no-new-cases-of-locally-transmitted-covid-19-infection-9dec", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}