{"pressItemDictionary": {"Press Releases": [{"Title": "Gradual Re-opening of Travel and Changes to Border Measures  ", "PublishedDate": "/Date(1592220000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "15 Jun 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The Multi-Ministry Taskforce has announced the plans for a progressive re-opening of our economy and society. The Taskforce has also been reviewing the border measures that we had put in place to manage the risks of importation, and will likewise be implementing progressive changes as we re-open to international travel. These include ongoing discussions with various countries/regions on developing bilateral arrangements for safe travel, and allowing more Long Term Pass holders still outside Singapore to return.&nbsp; &nbsp;<br><br>2.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; We have been monitoring the global situation closely to determine the risk of importation from abroad. Countries/regions are at various stages of putting in place effective systems to control the infection. We will therefore update our border measures, taking into account our understanding of the virus, as well as the developments in these countries/regions.<br><br><strong>Testing of All Incoming Travellers&nbsp;<br></strong><br>3.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Since 21 March 2020, all incoming travellers, including Singapore Citizens, Permanent Residents and Long Term Pass holders<sup>[1]</sup>, have been required to serve a 14-day Stay-Home Notice (SHN).Besides the SHN, we will now put in place a testing regime for all incoming travellers before the end of their SHN.The testing regime will apply to all travellers entering Singapore from 17 June 2020, 2359 hours. It is an additional precautionary measure to detect the virus, especially given the risks of asymptomatic cases. We will monitor the results of these tests and may make adjustments to the testing requirements over time.<br><br>4.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;The test will be scheduled a few days before the end of the SHN period, at a designated community testing facility. Each person under SHN will receive information on the scheduled appointment slot and venue via an SMS notification. They will have to travel from their place of residence to the designated testing facility, and return immediately after the test, using their own private vehicle or designated transport. Public transport should be avoided.<br><br><strong>Travellers from Some Countries/Regions to Serve Stay-Home Notice at Suitable Place of Residence&nbsp;&nbsp;<br></strong><br>5.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;With the testing regime in place, we will also update the existing requirement for all incoming travellers to stay at dedicated SHN facilities. For a start, all travellers entering Singapore from 17 June 2020, 2359 hours, and who had remained in Australia, Brunei Darussalam, Hong Kong, Japan, Macao, Mainland China, New Zealand, Republic of Korea, Taiwan and Vietnam in the last consecutive 14 days prior to their entry, will no longer have to serve their SHN at dedicated SHN facilities:<br><br>&nbsp; a.&nbsp; Singapore Citizens and Permanent Residents may serve their 14-day SHN at their place of residence.</p><p>&nbsp; b.&nbsp; Long Term Pass holders may serve their 14-day SHN at a place of residence that they or their family members own or are sole tenants of; or in suitable accommodation such as a hotel, at their own cost.<br><br>6.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;All persons under SHN must remain in their place of residence at all times. They will be subject to close monitoring of their whereabouts, through electronic monitoring as well as physical spot-checks. Strict enforcement action will be taken against those who breach the requirements of the SHN.<br><br>7.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;All other travellers entering Singapore will continue to serve their 14-day SHN at dedicated SHN facilities, for now.<br><br>8.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Notwithstanding the above changes, all Long Term Pass holders will continue to require prior approval before entering Singapore<sup>[2]</sup>. As the global and local health situations improve, we have gradually increased the number of entry approvals given to Long Term Pass holders, especially those with deep roots to Singapore or have exigent circumstances. We expect to be able to facilitate the re-entry of more Long Term Pass holders in the coming weeks. We will also study how to facilitate business travels, in particular for professionals based in Singapore who need to travel frequently as part of their work, with the necessary safeguards.<br><br>9.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;For now, we are not yet allowing short-term visitors, except those coming in under the Green / Fast Lane arrangements (starting with China, and eventually covering more countries/regions), or with special prior approval.<br><br><strong>Travellers to Bear Costs of COVID-19 Tests and Stay at Dedicated SHN Facilities<br></strong><br>10.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;The Government has thus far borne the costs of stay at dedicated SHN facilities for travellers entering Singapore, except for those who left Singapore from 27 March 2020 despite the prevailing travel advisory. The Government has also borne the costs of the large majority of COVID-19 tests.<br><br>11.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Going forward, as we re-open our borders to more international travel, those who enter Singapore would have to bear the costs of fulfilling these requirements, as part of the cost of travel in a COVID-19 world.<br><br>12.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;In this regard, all inbound and outbound travellers who enter Singapore from 17 June 2020, 2359 hours, and leave Singapore from 17 June 2020, 2359 hours, respectively, will be required to pay for their COVID-19 tests, where applicable. In addition, incoming travellers who are not Singapore Citizens or Permanent Residents, who enter Singapore from 17 June 2020, 2359 hours, will be required to pay for their stay at dedicated SHN facilities, where applicable.<br><br>13.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Singapore’s measures for inbound travellers in relation to COVID-19, including the new ones announced in this press statement, are summarised in <u><a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-a---measures-for-inbound-travellers-(15-june-2020).pdf?sfvrsn=612afe28_0\" title=\"Annex A\">Annex A</a></u>.<br><br>14.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;The prevailing charges for the COVID-19 test and stay at the dedicated SHN facilities are set out in <u><a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-b---charges-for-covid-19-test-and-stay-at-dedicated-shn-facility-(15-june-2020).pdf?sfvrsn=f85a78f1_0\" title=\"Annex B\">Annex B</a></u>.<br><br>15.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;As Singapore’s border measures will evolve as the global situation changes, we encourage everyone to check the MOH website (<a href=\"https://www.moh.gov.sg/covid-19\">https://www.moh.gov.sg/covid-19</a>) for the latest updates.<br><br><strong>Updated Travel Advisory<br></strong><br>16.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;All Singaporeans and residents of Singapore are still advised to defer all travel abroad. However, essential business and official travel will be permitted under Green/ Fast Lane arrangements<sup>[3]</sup>.</p> <p>&nbsp;</p> <p>&nbsp;</p> <p><strong>MINISTRY OF HEALTH<br></strong><strong>15 JUNE</strong><strong> 2020</strong></p> <div><br clear=\"all\"> <hr align=\"left\" size=\"1\" width=\"33%\"> <div id=\"ftn1\"> <p><sup>[1]</sup>&nbsp;Long Term Pass (LTP) holders refer to Work Pass holders, Student’s Pass holders, Long-Term Visit Pass (LTVP) holders and Dependant’s Pass holders, as well as those who have been granted In-Principle Approval (IPA) for a LTP. </p> </div> <div id=\"ftn2\"> <p><sup>[2]</sup>&nbsp;Except for those returning under the Singapore-China Fast Lane arrangements, as separate arrangements would have been put in place for this group.&nbsp; </p> </div> <div id=\"ftn3\"> <p><sup>[3]</sup>&nbsp;As of 15 June 2020, this comprises the Singapore-China Fast Lane.</p> </div> </div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "gradual-re-opening-of-travel-and-changes-to-border-measures", "CurrentPageUrl": null}, {"Title": "Moving Into Phase Two of Re-opening", "PublishedDate": "/Date(1592220000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "15 Jun 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The Multi-Ministry Taskforce has assessed the situation and decided to start Phase Two after 18 June 2020, 2359 hours. Community infection rates have remained generally stable despite the increase in workplace activity in Phase One of re-opening. The incidence of cases in migrant worker dormitories has also declined, and there are no new large clusters emerging.<br><br>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In this next phase, our goal is to ensure that efforts taken during the circuit breaker period and Phase One of reopening are sustained. By limiting close contact among individuals, while maintaining hygiene and safe management principles, we will be able to resume more activities without substantially raising the risk of new clusters of infections.<br><br><strong>Approach for Phase Two<br><br></strong>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Apart from a small list of exceptions, Phase Two will see the resumption of most activities, subject to the following safe distancing principles:</p> <p>&nbsp; a.&nbsp; As a default, measures should be put in place to ensure that individuals maintain <u>safe distancing of at least <strong>one metre</strong></u> at all times.<br><br>&nbsp; b.&nbsp; Where not feasible or practical to apply one metre safe distancing between individuals, this one metre requirement can instead be enforced between groups, with <u>each group made up of not more than <strong>five persons</strong></u>, and with no mixing between groups. Other safe management measures should also be in place.<br><br>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Similarly, <u>small-group social gatherings of up to any five persons</u> can also resume. Within the home, <u>households may receive up to five visitors</u> at any one time.<br><br><strong>Activities to be Resumed<br><br></strong>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; After 18 June, 2359 hours, retail businesses may re-open their physical outlets. Food and beverage dine-in will also be allowed to resume, subject to liquor sales and consumption ceasing at 2230 hours. However, live music and television and video screenings will not be allowed in all F&amp;B outlets at this stage. Larger public venues with high human traffic such as malls and large standalone retail outlets will be subject to capacity limits, and operators will be required to prevent crowds or long queues from building up within and in the immediate vicinity of their premises.<br><br>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Personal health and wellness, and home-based services will also be allowed to resume. Registered clubs and societies will be allowed to operate at their registered premises. Tuition and other private enrichment classes can resume, with the exception of singing or voice training classes. All other healthcare services, including eldercare services in the community, individual health screening and aesthetic services, will resume with safe distancing measures in place. Face-to-face visitations at residential facilities for the elderly (including nursing homes, welfare homes, sheltered homes and adult disability homes) will also resume with precautionary measures in place.<br><br>7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Sports, parks and other public facilities will also open. These include playgrounds, beaches, lawns and fields, stadia, swimming complexes, sports halls, hardcourts, gyms, fitness studios, bowling centres and function rooms. This applies also to similar facilities in private settings such as condominiums and clubs.<br><br>8.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The complete list of businesses that are allowed to operate can be found on MTI’s website (<a href=\"https://covid.gobusiness.gov.sg/permittedlist/\">https://covid.gobusiness.gov.sg/permittedlist/</a>). Businesses in this list do not need to apply for an exemption before resuming operations.<br><br>9.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; However, they are required to submit the number of workers who are working on-site via the GoBusiness portal (<a href=\"https://covid.gobusiness.gov.sg/\">https://covid.gobusiness.gov.sg</a>) within two weeks of the date of resumption of on-site operations. In the interest of reducing physical contact between individuals, <u>telecommuting must remain the default for all businesses</u> where feasible.<br><br>10.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In settings run by permitted businesses, such as for F&amp;B dining-in or classes where individuals come together for activities, the one metre safe distancing requirement may be waived only if each group is made up of not more than five persons, and subject to overall safe management measures as indicated earlier.<br><br>11.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Further guidance for various sectors will be provided by the relevant agencies in the coming days, leading up to the start of Phase Two. Businesses and organisations are reminded to play their part to keep Singapore safe. Should they be unable to meet safe management principles, businesses and organisations can engage relevant agencies to seek approval for alternative safe distancing measures. Such businesses and activities should only open when they are ready. <u>Businesses and organisations found to be flouting safe management principles may be required to close.<br><br></u><strong>Exceptions<br><br></strong>12.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; While the vast majority of activities will be allowed to resume at the start of Phase Two, the resumption of a small number of activities will take more time. These are activities or settings where large numbers of people are likely to come into close contact, often in enclosed spaces, and for prolonged periods of time. Overseas and local experience has shown that these settings can spawn large clusters of infections, given the number of close contacts between individuals in the course of such activities.<br><br>13.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Such activities and settings include:&nbsp; <br><br>&nbsp; a.&nbsp; Religious services and congregations;<br>&nbsp; b.&nbsp; Large cultural venues such as libraries and museums;<br>&nbsp; c.&nbsp; Large-scale events and venues, such as conferences, exhibitions, concerts and trade fairs; and<br>&nbsp; d.&nbsp; Entertainment venues such as bars, nightclubs, karaoke outlets, cinemas, theatres, as well as indoor and outdoor attractions.<br><br>14. &nbsp;&nbsp;&nbsp;&nbsp; Government agencies have begun to engage relevant businesses and organisations on possible safe management measures to be taken for these activities or settings.&nbsp; Agencies will advise these organisations on the approval processes and timelines for their resumption at a later date, depending on the ability and readiness of the organisation to implement these measures.<br><br><strong>Guidelines of Specific Activities and Settings<br><br></strong>15.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Apart from the safe management principles, specific rules will apply to the following events and settings:<br><br>&nbsp; a.&nbsp;&nbsp;<strong>Weddings</strong>. Added flexibility will be given for weddings. Wedding solemnizations at home and at ROM or ROMM may take place with up to ten persons (excluding the Solemnizer). At other venues, they may take place with up to twenty persons (excluding the Solemnizer), subject to the venue’s capacity limit based on safe management principles.<br><br>&nbsp; b.&nbsp;&nbsp;<strong>Wakes and Funerals.</strong> For wakes and funerals, up to twenty persons may be present at any one time.<br><br>&nbsp; c.&nbsp;&nbsp;<strong>Workplaces</strong>. The current safe management measures for workplaces will continue to apply. Employers must continue to ensure that there are no social gatherings between employees, and safe distancing of at least one metre is maintained at all times.<br><br>&nbsp; d.&nbsp;&nbsp;<strong>Schools and Institutes of Higher Learning (IHLs).</strong> Students from all levels will return to school daily from 29 June 2020. IHLs have been conducting most lessons online, except for practical and laboratory-based lessons, and will gradually increase the number of students back on campus for face-to-face learning. The Ministry of Education will share more details later this week.<br><br><strong>Role of the Public<br><br></strong>16.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; With the range of activities resuming in Phase Two, the number of close contacts between individuals will increase. More new community cases should be expected. To keep the number of new cases under control, it is critical that we continue to exercise caution. All of us must adhere to safe management principles, and we should avoid businesses or activities that fail to comply.<br><br>17.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; At the same time, we must practise social responsibility in upholding good personal hygiene and safe distancing measures - wash our hands regularly, wear a mask wherever we go, and see a doctor immediately when we are sick. We should also check-in and check-out on SafeEntry when required, and download and install the TraceTogether app on our phones.<br><br>18.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; While the scope for meeting friends and family members has been increased, we urge everyone to continue exercising personal responsibility. They should protect themselves and their families by keeping their daily number of contacts small and preferably limited to a regular circle of close contacts.&nbsp; As seniors are especially vulnerable, they should continue to exercise extra caution and stay at home as much as possible.<br><br>19.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Individually, these are steps that everyone can take to protect ourselves and our loved ones. Collectively, these actions will make all the difference in keeping COVID-19 at bay.<br><br><strong>Toward a Safe and Sustainable Re-opening – Everyone Plays a Part<br><br></strong>20.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Phase Two is a significant step in moving towards a new COVID-safe normal. The Multi-Ministry Taskforce will continue to monitor the situation closely, with the aim of continuing to ease measures, until we reach a new normal in <strong>Phase Three</strong>. Our goal is to re-open our economy and society progressively, while controlling the infection and providing maximum protection for vulnerable groups, such as our seniors and those with medical conditions.&nbsp; &nbsp;<br><br>21.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Meanwhile, we must all adjust our expectations, lifestyles and norms, as we are not going back to the way things were before COVID-19. Let us continue to stay disciplined and vigilant, and not let all our previous efforts go to waste. Together, let us find the resilience within ourselves, the solidarity with each other, and the fortitude as a society to embark on this collective journey to achieve a COVID-safe Singapore.<br><br></p><div> </div><p><strong>MINISTRY OF HEALTH<br></strong><strong>15 JUNE 2020</strong></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "moving-into-phase-two-of-re-opening", "CurrentPageUrl": null}, {"Title": "214 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1592204700000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "15 Jun 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\"><span style=\"font-family: Arial;\"><span style=\"font-size: 14px;\">&nbsp; &nbsp; &nbsp;As of 15 June 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 214 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders residing in foreign worker dormitories. Based on our investigations so far, there are 3 cases in the community, all of whom are Work Pass holders. There are no Singaporean/ Permanent Resident cases.&nbsp;<br><br>2.&nbsp; &nbsp; &nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>15 JUNE 2020</strong></span></span><br></p><div><br></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "214-new-cases-of-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}