{"pressItemDictionary": {"Press Releases": [{"Title": "Updated Border Measures for Travellers From Estonia and Norway", "PublishedDate": "/Date(1604653200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "06 Nov 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The Multi-Ministry Taskforce has been closely monitoring the global COVID-19 situation. As there has been a sharp increase in cases in Estonia and Norway in the past week, all travellers entering Singapore from <strong>8 November 2020, 2359 hours</strong> who have a travel history in the past 14 days to <strong>Estonia and Norway</strong> will be required to serve a 14-day Stay-Home Notice (SHN) at dedicated SHN facilities, even if they have obtained approval to opt out earlier.</p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; This is revised from our announcement on 27 October 2020 that travellers from Estonia and Norway were allowed to serve their 14-day SHN at a suitable place of residence.</p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Travellers from Fiji, Finland, Japan, Republic of Korea, Sri Lanka, Thailand and Turkey are still allowed to apply to opt out of dedicated SHN facilities and serve their 14-day SHN at their place of residence, if they fulfil the following criteria:</p><p>a.&nbsp;&nbsp;&nbsp; Travelled to no other country/region than above-mentioned countries[1], in the last consecutive 14 days prior to entry; and</p><p>b.&nbsp;&nbsp;&nbsp; Are occupying their place of residence (i.e. residential address) alone, or only with household members who are also persons serving SHN with the same travel history and duration of SHN.</p><p>The COVID-19 tests will continue to be administered before the end of the SHN.</p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; As the global situation evolves, we will continue to adjust our border measures to manage the risk of importation and transmission to the community. Any changes to border measures will be updated on the <a href=\"https://www.safetravel.ica.gov.sg/health\" title=\"\" class=\"\" target=\"\">Safe Travel Office website</a>[2]. Travellers are advised to visit the <a href=\"https://www.safetravel.ica.gov.sg/health\" title=\"\" class=\"\" target=\"\">website</a>&nbsp;to check for the most updated border measures before entering Singapore and be prepared to be subjected to the prevailing border measures upon entry, including payment for their stay at dedicated SHN facilities, tests and treatment.</p><p>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; All travellers are reminded to accurately declare their travel history. Strict enforcement actions will be taken against false declarations.</p><div><br clear=\"all\"><hr align=\"left\" size=\"1\" width=\"33%\"><div id=\"ftn1\"><p>[1] Including the following countries/regions: Australia, Brunei Darussalam, Hong Kong, Macao, Mainland China, Malaysia (excluding Sabah), New Zealand, Taiwan and Vietnam (correct as of 5 November 2020).</p></div><div id=\"ftn2\"><p>[2]&nbsp;<a href=\"http://www.safetravel.ica.gov.sg/health\">www.safetravel.ica.gov.sg/health</a></p></div></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "updated-border-measures-for-travellers-from-estonia-and-norway", "CurrentPageUrl": null}, {"Title": " No New Cases of Locally Transmitted  Covid-19 Infection (6 Nov)", "PublishedDate": "/Date(1604647800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "06 Nov 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; As of 6 November 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed that there are no new cases of locally transmitted COVID-19 infection. <br><br>2. There are 4 imported cases, who had already been placed on Stay-Home Notice upon arrival in Singapore. <br><br>3. We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.<br><br></p><p>&nbsp;</p><p><strong>MINISTRY OF HEALTH<br></strong><strong>6 NOVEMBER 2020</strong></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "no-new-cases-of-locally-transmitted-covid-19-infection-(6-nov)", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}