{"pressItemDictionary": {"Press Releases": [{"Title": "24 More Cases Discharged, 19 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1601562000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "01 Oct 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;As of 1 October 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 19 [1] cases of COVID-19 infection in Singapore. The breakdown of the cases is as follows:<br><br><strong>Summary of new cases<br></strong><br>Amongst the new cases today, 14 are asymptomatic, and were detected from our proactive screening and surveillance, while 5 were symptomatic.&nbsp;<br></p><table border=\"1\" cellspacing=\"0\" cellpadding=\"0\"><tbody><tr><td width=\"241\" valign=\"top\"><p>&nbsp;</p></td><td width=\"120\"><p align=\"center\"><strong>Already in quarantine/ isolation before detection</strong></p></td><td width=\"120\"><p align=\"center\"><strong>Detected from surveillance</strong></p></td><td width=\"120\"><p align=\"center\"><strong>Total</strong></p></td></tr><tr><td width=\"241\" valign=\"top\"><p><strong>Imported cases</strong></p></td><td width=\"120\"><p align=\"center\">15</p></td><td width=\"120\"><p align=\"center\">0</p></td><td width=\"120\"><p align=\"center\">15</p></td></tr><tr><td width=\"241\" valign=\"top\"><p><strong>Cases in the community</strong></p></td><td width=\"120\"><p align=\"center\">1</p></td><td width=\"120\"><p align=\"center\">0</p></td><td width=\"120\"><p align=\"center\">1</p></td></tr><tr><td width=\"241\" valign=\"top\"><p><strong>Cases residing in dormitories</strong></p></td><td width=\"120\"><p align=\"center\">1</p></td><td width=\"120\"><p align=\"center\">2</p></td><td width=\"120\"><p align=\"center\">3</p></td></tr></tbody></table><p style=\"text-align: justify;\"><br><strong>a) Imported cases: 15</strong> (3 Singaporeans, 2 Permanent Residents, 2 Work Pass holders, 1 Work Permit holder, 2 Student’s Pass holders, 1 Short-Term Visit Pass holder, 4 Special Pass holders)<br><br>Amongst the 15 imported cases, 3 (Cases 57914, 57926 and 57927) are Singaporeans and 2 (Cases 57920 and 57928) are Singapore Permanent Residents who returned to Singapore from Indonesia on 19 September and India on 17 September and 19 September. 3 (Cases 57929, 57930 and 57931) are Work Pass/ Work Permit holders currently employed in Singapore who arrived from France on 20 September, the Philippines on 18 September and India on 19 September. 2 (Cases 57912 and 57913) are Student’s Pass holders who arrived from India on 19 September. Another case (Case 57921) is a Short-Term Visit Pass holder who arrived from India on 28 September. He was allowed entry into Singapore as he was already receiving medical care in Singapore and had returned for further treatment.<br><br>All of them had been placed on 14-day Stay-Home Notice (SHN) upon arrival in Singapore, and were tested while serving their SHN at dedicated facilities.&nbsp;<br><br>The remaining 4 (Cases 57922, 57923, 57924 and 57925) are Special Pass holders who are crew members of a ship. They arrived in Singapore from Malaysia on 23 September and had not disembarked from the ship. They subsequently reported symptoms and were swabbed while on the ship, where they had remained until their test results came back positive for COVID-19. They were then conveyed in ambulances to a hospital.&nbsp;<br><br><strong>b) Cases in the community: 1 </strong>[1] (1 Permanent Resident)<br><br>There is 1 case in the community today who is linked to previous cases. Case 57915 had been identified as a contact of previously confirmed cases, and had been placed on quarantine earlier. He was tested during quarantine to determine his status, even though he is asymptomatic.<br><br>Overall, the number of new cases in the community has remained stable at an average of fewer than 1 case per day in the past 2 weeks. The number of unlinked cases in the community has also remained stable at an average of fewer than 1 case per day in the past 2 weeks. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br><br><strong>c) Cases residing in dormitories: 3<br></strong><br>Amongst the 3 cases residing in dormitories, 1 had been identified earlier as a contact of previous cases, and had already been quarantined to prevent further transmission. He was tested during quarantine to determine his status.&nbsp;&nbsp;<br><br>The remaining 2 cases were detected through surveillance testing, such as our bi-weekly Rostered Routine Testing of workers living in dormitories. This allows us to pick up cases early, including asymptomatic ones, so that we are able to ring-fence them quickly to prevent further transmission, by aggressively containing, tracing and isolating the close contacts.&nbsp;<br><br>2.&nbsp; &nbsp; Details of these trends can be found in MOH’s daily situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\" title=\"\" class=\"\" target=\"\">www.moh.gov.sg/covid-19/situation-report</a>). Please refer to <a href=\"/docs/librariesprovider5/default-document-library/annex-a554de28ece864e388259711478d289de.pdf?sfvrsn=dfc5d6fc_0\" title=\"Annex A\">Annex A</a>&nbsp;for the summary of the confirmed cases.&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Of the new cases, 95% are imported or linked to known cases/ clusters, while the rest are pending contact tracing.&nbsp;<br><br>4.&nbsp; &nbsp; &nbsp; &nbsp; MOH has been monitoring existing clusters for any further transmission. As there have been no more cases linked to 8 Sungei Kadut Loop for the past two incubation periods (i.e. 28 days), the cluster has now been closed.<br><br><strong>Links between previous cases found<br></strong><br>5.&nbsp; &nbsp; &nbsp; &nbsp;Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <a href=\"/docs/librariesprovider5/default-document-library/annex-bf9b6b4fbeb234a919df1f7f4cc77ce2e.pdf?sfvrsn=f56ec7a2_0\" title=\"Annex B\">Annex B</a>&nbsp;and <a href=\"/docs/librariesprovider5/default-document-library/annex-c1d301498957a4823b42427d937f5700a.pdf?sfvrsn=810253c0_0\" title=\"Annex C\">Annex C</a>&nbsp;for details.&nbsp;<br><br><strong>Update on condition of confirmed cases<br></strong><br>6.&nbsp; &nbsp; &nbsp; 24 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 57,512 have fully recovered from the infection and have been discharged from hospitals or community care facilities.&nbsp;<br><br>7.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;There are currently 44 confirmed cases who are still in hospital. Of these, most are stable or improving, and none is in the intensive care unit. 201 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 27 have passed away from complications due to COVID-19 infection.&nbsp;<br><br><strong>MINISTRY OF HEALTH<br>1 OCTOBER 2020<br><br></strong>[1] Updated from the afternoon press release as 2 community cases have been removed following investigation. The initial test results for Cases 57918 and 57919 had been borderline-positive and further tests have confirmed that they do not have COVID-19 infection. All necessary public health actions had been taken earlier and neither the cases nor their contacts had been exposed to risk of infection due to the initial classification.&nbsp;&nbsp;</p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "24-more-cases-discharged-19-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "21 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1601537400000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "01 Oct 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;As of 1 October 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 21 cases of COVID-19 infection in Singapore. Based on our investigations so far, there are 3 cases in the community, all of whom are Singaporeans/ Permanent Residents.&nbsp;<br>&nbsp;<br>2.&nbsp; &nbsp; There are 15 imported cases, who had all been placed on Stay-Home Notice or isolated upon arrival in Singapore.&nbsp;<br>&nbsp;<br>3.&nbsp; &nbsp; &nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.<br><br><strong>MINISTRY OF HEALTH<br>1 OCTOBER 2020</strong></p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "21-new-cases-of-covid-19-infection-1Oct", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}