{"pressItemDictionary": {"Press Releases": [{"Title": "Additional measures for travellers to reduce further importation of COVID-19 cases", "PublishedDate": "/Date(1584535500000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "18 Mar 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; In view of the heightened risk of importation of COVID-19 cases into Singapore, the Multi-Ministry Taskforce will implement additional measures for all travellers entering Singapore.<br><br>2.&nbsp; &nbsp; &nbsp; &nbsp; Globally, there has been a sharp increase in cases and widening spread across the world. To date, there are close to 200,000 COVID-19 cases across 159 countries, and more than 7,900 deaths. Many countries have seen an exponential rise in cases recently, and more than 40,000 new cases have been reported in the past three days. Globally the number of cases and deaths has surpassed those in China since the beginning of the outbreak. The World Health Organization has urged its member states to take urgent and aggressive measures to stop the transmission of COVID-19.<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;In Singapore, over the past three days<sup>[1]</sup>, about 70 percent of our new COVID-19 cases were imported, most of whom were Singapore residents and long-term pass holders returning to Singapore after travel abroad.<br><br><strong>Singaporeans advised to defer all travel abroad<br></strong><br>4.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;In view of the heightened risk of further importation of COVID-19 to Singapore, Singaporeans are advised to defer all travel abroad with immediate effect. This supercedes our earlier advisory announced on 15 March to defer all non-essential travel abroad.<sup>[2]</sup>&nbsp;The expansion of the travel advisory is to reduce the risk of Singaporeans being infected with the virus when abroad, and spreading it to other Singaporeans when they return.<br><br><strong>14-Day Stay-Home Notice for all travellers<br></strong><br>5.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;To further reduce the risk of further importation leading to community spread in Singapore, the Multi-Ministry Taskforce will put in place additional measures for all travellers entering Singapore. From 20 March 2020, 2359 hours, all Singaporeans, Permanent Residents, Long Term Pass holders and short term visitors entering Singapore will be issued a 14-day Stay-Home Notice (SHN).<sup>[3]</sup>&nbsp;They will have to provide proof of the place where they will serve the 14-day SHN, for example a hotel booking covering the entire period, or a place of residence they or their family members own.<br><br>6.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;As announced previously, short-term visitors with recent travel history to mainland China, France, Germany, Iran, Italy, Republic of Korea and Spain, are not allowed to enter or transit in Singapore.<br><br>7.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;For the land crossings with Malaysia, there are already restrictions imposed by Malaysia under their Movement Control Order. The Singapore-Malaysia Special Working Committee (co-chaired by Senior Minister and Coordinating Minister for National Security Teo Chee Hean, and Malaysian Senior Minister and Minister of Defence Dato' Sri Ismail Sabri Yaakob and Johor Menteri Besar Datuk Ir. Hasni Mohammad) are discussing a joint mitigation plan to ensure the safe and sustainable movement of people, goods and services between the two countries. More details will be announced when ready.<br><br>8.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Persons under SHN will have to remain in their place of residence at all times for 14 days after entering Singapore.<br><br>9.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;The existing measures which apply to all inbound travellers, such as requiring those who exhibit fever and/or other symptoms of respiratory illness to undergo a COVID-19 swab test at the checkpoints, will continue to apply.<br><br>10.&nbsp; &nbsp; &nbsp; &nbsp;Singapore’s measures for inbound travellers in relation to COVID-19, including the new ones announced in this press statement, are summarised in the <u><a href=\"/docs/librariesprovider5/pressroom/press-releases/annex---list-of-countries-regions-and-measures-for-inbound-travellers.pdf?sfvrsn=322144f0_0\" title=\"Annex - List of Countries, Regions and Measures for Inbound Travellers\">Annex</a></u>.<br><br>11.&nbsp; &nbsp; &nbsp; &nbsp;As Singapore’s measures will evolve according to the global situation, Singaporeans should check the MOH website (<a href=\"https://www.moh.gov.sg/covid-19\">https://www.moh.gov.sg/covid-19</a>) for the latest measures.</p> <p>&nbsp;</p> <div><br clear=\"all\"> <hr align=\"left\" size=\"1\" width=\"33%\"> <div id=\"ftn1\"> <p><sup>[1]</sup>&nbsp;As of 18 March, 12pm.</p> </div> <div id=\"ftn2\"> <p><sup>[2]</sup>&nbsp;Singaporeans are also advised to defer all travel to Hubei province (mainland China). </p> </div> <div id=\"ftn3\"> <p><sup>[3]&nbsp;</sup>The SHN will not apply to travellers transiting in Singapore without leaving the transit area. </p> </div> </div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "additional-measures-for-travellers-to-reduce-further-importation-of-covid-19-cases", "CurrentPageUrl": null}, {"Title": " Three More Cases Discharged, 47 New Cases of COVID-19 Infection Confirmed", "PublishedDate": "/Date(1584460800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "18 Mar 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Three more cases of COVID-19 infection have been discharged from hospital (Cases 101, 118 and 201). In all, 117 have fully recovered from the infection and have been discharged from hospital.</p> <p>2.&nbsp; &nbsp; &nbsp; &nbsp; As of 18 March 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified 47 more cases of COVID-19 infection in Singapore. Of these:</p> <ul><li>33 are imported cases (Cases 267, 268, 269, 270, 271, 272, 274, 276, 277, 278, 279, 280, 281, 282, 284, 285, 286, 292, 293, 295, 296, 297, 298, 299, 300, 301, 304, 306, 307, 308, 309, 312, 313) with travel history to Europe, North America, ASEAN and parts of Asia; <ul><li>30 were returning residents and long-term pass holders </li><li>Three were short term visitors</li></ul></li><li>Two (Cases 283 and 305) are linked to the clusters at Church of Singapore (Bukit Timah) and boulder+ Gym;</li><li>One (Case 310) is linked to Cases 183 and 252 at the cluster at Masjid Al Muttaqin;</li><li>Six are linked to previous cases (Case 294 is linked to Cases 225 and 237; Case 287 is linked to Case 266; Case 289 is linked to Case 212, Case 291 is linked to Case 260; Case 303 is linked to Case 248; and Case 311 is linked to Case 234); and</li><li>Five are currently unlinked (Cases 273, 275, 288, 290, 302).<p _rdeditor_exists=\"1\">&nbsp;</p></li></ul><p><p><strong>Links between previous cases found</strong></p><p>3.&nbsp; &nbsp; &nbsp; &nbsp;Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. This was made possible with the assistance of the Singapore Police Force.<br></p></p><p><p>a) Eight of the locally transmitted confirmed cases (Cases 31, 33, 38, 83, 90, 91, 138 and 151), as well as Cases 8 and 9, are linked to The Life Church and Missions Singapore. These cases are linked to another 23 confirmed cases (Cases 48, 49, 51, 53, 54, 57, 58, 60, 61, 62, 63, 66, 67, 68, 70, 71, 73, 74, 78, 80, 81, 84, 88) who are linked to the Grace Assembly of God.</p></p><p><p>b) 14 of the confirmed cases (Cases 93, 95, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 108 and 110) are linked to Wizlearn Technologies Pte Ltd.</p></p><p><p>c) 47 of the confirmed cases (Cases 94, 96, 107, 112, 114, 115, 116, 117, 118, 120, 121, 122, 125, 127, 128, 129, 130, 131, 133, 134, 137, 139, 140, 142, 144, 145, 146, 148, 149, 150, 155, 156, 157, 158, 159, 160, 161, 164, 166, 174, 179, 185, 186, 196, 201, 218 and 224) are linked to a private dinner function at SAFRA Jurong on 15 February. Two (Cases 142 and 144) are linked to boulder+ Gym and Church of Singapore (Bukit Timah).</p></p><p><ul><li>&nbsp;Four of the confirmed cases (Cases 142, 162, 163 and 305) are linked to boulder+ Gym (12 Kallang Avenue).</li></ul></p><p><ul><li>&nbsp;Five of the confirmed cases (Cases 144, 208, 214, 235 and 283) are linked to the Church of Singapore (Bukit Timah) (2B Hindhede Road).</li></ul></p><p>d)&nbsp; Three of the confirmed cases (Cases 183, 252 and 310) are linked to Masjid Al-Muttaqin (5140 Ang Mo Kio Avenue 6).<p><br>4.&nbsp; &nbsp; &nbsp; &nbsp;Investigations on these clusters are ongoing. In addition to the clusters, our investigations have identified the following links between cases:</p></p> <ul><li>Case 72 is linked to Cases 59 and 79; </li><li>Case 86 is linked to Case 82;</li><li>Case 126 is linked to Case 109; </li><li>Case 143 is linked to Case 132; </li><li>Case 167 is linked to Case 178; </li><li>Case 190 is linked to Cases 172 and 184; </li><li>Case 200 is linked to Case 165; </li><li>Case 219 is linked to Cases 142, 211 and 236; </li><li>Case 221 is linked to Case 204; </li><li>Case 237 is linked to Case 225</li><li>Case 242 is linked to Case 166</li><li>Case 251 is linked to Case 186;</li><li>Case 256 is linked to Case 205;</li><li>Case 294 is linked to Cases 225 and 237;</li><li>Case 287 is linked to Case 266; </li><li>Case 289 is linked to Case 212; </li><li>Case 291 is linked to Case 260; </li><li>Case 303 is linked to Case 248; and</li><li>Case 311 is linked to Case 234.</li></ul> <p>5.&nbsp; &nbsp; &nbsp; &nbsp;Contact tracing is underway for the other 17 locally transmitted cases to establish any links to previous cases or travel history to affected countries or regions.<p><strong>&nbsp;<br></strong>6<strong>.&nbsp; &nbsp; &nbsp; &nbsp;</strong>Please refer to the <a href=\"/docs/librariesprovider5/pressroom/press-releases/annexc5e2f5be52c84ba1ba438e95077cf400.pdf?sfvrsn=38d6b52c_0\" title=\"Annex\">Annex</a>&nbsp;for a summary of the confirmed cases.</p></p><p><p><strong>Update on condition of confirmed cases</strong></p></p><p>7.&nbsp; &nbsp; &nbsp; To date, a total of 117 cases have fully recovered from the infection and have been discharged from hospital. Of the 196 confirmed cases who are still in hospital, most are stable or improving. 15 are in critical condition in the intensive care unit.<br><p><strong><br>Update on contact tracing for confirmed cases </strong></p><p>8.&nbsp; &nbsp; &nbsp; &nbsp;Contact tracing for the confirmed cases is ongoing. Once identified, MOH will closely monitor all close contacts. As a precautionary measure, they will be quarantined for 14 days from their last exposure to the patient. In addition, all other identified contacts who have a low risk of being infected will be under active surveillance, and will be contacted daily to monitor their health status.</p></p><p><p>9.&nbsp; &nbsp; &nbsp;As of 18 March 2020, 12pm, MOH has identified 6,250 close contacts who have been quarantined. Of these, 2,221 are currently quarantined, and 4,029 have completed their quarantine.</p></p><p><p><strong>Health advisory<br><br></strong>10.&nbsp; <strong>&nbsp; &nbsp;&nbsp;</strong>Singaporeans are advised to defer all travel abroad.<strong><br></strong></p></p><p><p>11.&nbsp; &nbsp; &nbsp; All travellers should monitor their health closely for two weeks upon return to Singapore and seek medical attention promptly if they feel unwell. Travellers should inform their doctor of their travel history. If they have a fever or respiratory symptoms (e.g. cough, shortness of breath), they should wear a mask and call the clinic ahead of the visit.</p></p><p><p>12.&nbsp; &nbsp; &nbsp; Travellers and members of the public should adopt the following precautions at all times:</p></p> <ul><li>Avoid close contact with people who are unwell or showing symptoms of illness; </li><li>Observe good personal hygiene; </li><li>Practise frequent hand washing with soap (e.g. before handling food or eating, after going to toilet, or when hands are dirtied by respiratory secretions after coughing or sneezing); </li><li>Wear a mask if you have respiratory symptoms such as a cough or shortness of breath; </li><li>Cover your mouth with a tissue paper when coughing or sneezing, and dispose the soiled tissue paper in the rubbish bin immediately; and </li><li>Seek medical attention promptly if you are feeling unwell.<p>&nbsp;</p></li></ul> <p>13.&nbsp; &nbsp; &nbsp; MOH will continue to monitor the situation closely. As medical practitioners are on the lookout for suspect cases, Singapore is likely to see more cases that will need to be investigated. </p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "three-more-cases-discharged-47-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}