{"pressItemDictionary": {"Press Releases": [{"Title": "198 More Cases Discharged, 94 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1598626500000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "28 Aug 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As of 28 August 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 94 cases of COVID-19 infection in Singapore. The breakdown of the cases is as follows:<br><br><strong>Summary of new cases</strong><br></p><table border=\"1\" cellspacing=\"0\" cellpadding=\"0\"><tbody><tr><td width=\"241\" valign=\"top\"><p>&nbsp;</p></td><td width=\"120\"><p align=\"center\"><strong>Already in quarantine/ isolation before detection</strong></p></td><td width=\"120\"><p align=\"center\"><strong>Detected from surveillance</strong></p></td><td width=\"120\"><p align=\"center\"><strong>Total</strong></p></td></tr><tr><td width=\"241\" valign=\"top\"><p><strong>Imported cases</strong></p></td><td width=\"120\"><p align=\"center\">10</p></td><td width=\"120\"><p align=\"center\">0</p></td><td width=\"120\"><p align=\"center\">10</p></td></tr><tr><td width=\"241\" valign=\"top\"><p><strong>Cases in the community</strong></p></td><td width=\"120\"><p align=\"center\">3</p></td><td width=\"120\"><p align=\"center\">1</p></td><td width=\"120\"><p align=\"center\">4</p></td></tr><tr><td width=\"241\" valign=\"top\"><p><strong>Cases residing in dormitories</strong></p></td><td width=\"120\"><p align=\"center\">70</p></td><td width=\"120\"><p align=\"center\">10</p></td><td width=\"120\"><p align=\"center\">80</p></td></tr></tbody></table><p style=\"text-align: justify;\">&nbsp;</p><p><strong>a)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Imported cases: 10 </strong>(7 Singaporeans/Permanent Residents, 1 Dependant’s Pass holder, 1 Long-Term Visit Pass holder, 1 Short-Term Visit Pass holder)</p><p>Amongst the 10 imported cases, 7 (Cases 56694, 56695, 56696, 56697, 56704, 56745 and 56750) are Singaporeans/ Permanent Residents who returned to Singapore from India between 16 August and 18 August. Another 2 (Cases 56685 and 56690) are Dependant’s Pass and Long-Term Pass holders who arrived from India on 12 August and 16 August. All of them had been placed on 14-day Stay-Home Notice (SHN) upon arrival in Singapore, and had been tested while serving their SHN at dedicated facilities.<br></p><p>The remaining case (Case 56726) is a Short-Term Visit Pass holder who was allowed entry into Singapore as she has been seeking medical treatment here. She was conveyed directly to the hospital upon arrival in Singapore.<br></p><p>&nbsp;</p><p><strong>b)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Cases in the community: 4</strong> (4 Singaporeans)</p><p>Of the 4 cases in the community, 3 had already been placed on quarantine earlier. 1 of the cases is asymptomatic, and was detected through our proactive testing.<br></p><p>3 of the community cases today are linked to previous cases. Cases 56743, 56744 and 56746 had been identified as contacts of previously confirmed cases, and had been placed on quarantine earlier. They were tested during quarantine to determine their status.<br></p><p>There is 1 case in the community who is currently unlinked. Case 56740 was detected under our enhanced community testing to test all individuals aged 13 and above who are diagnosed with acute respiratory infection (ARI) at first presentation to a doctor. This allows us to identify infected individuals early and to quickly contain further spread.<br></p><p>Epidemiological investigations of the case are in progress. In the meantime, all the identified close contacts of the case have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for her household contacts to determine if she could have been infected by them.<br></p><p>Overall, the number of new cases in the community has remained stable at an average of 2 cases per day in the past 2 weeks. The number of unlinked cases in the community has also remained stable at an average of 1 case per day in the past 2 weeks. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br></p><p>&nbsp;</p><p><strong>c)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Cases residing in dormitories: 80</strong></p><p>Amongst the 80 cases residing in dormitories, 70 had been identified earlier as contacts of previous cases, and had already been quarantined to prevent further transmission. They were tested during quarantine to determine their status.&nbsp;<br></p><p>The remaining 10 cases were detected through surveillance testing, such as our bi-weekly Rostered Routine Testing of workers living in dormitories and testing of those with ARI symptoms. This allows us to pick up cases early, including asymptomatic ones, so that we are able to ring-fence them quickly to prevent further transmission, by aggressively containing, tracing and isolating the close contacts.<br></p><p>58 of the cases residing in dormitories today are from Sungei Tengah Lodge, who had all been placed on quarantine earlier. The vast majority of them were tested during quarantine to determine their status, or picked up through Rostered Routine Testing. Following the detection of cases at Sungei Tengah Lodge<sup>1</sup>, we had placed about 4,500 workers on quarantine, and tested about 3,000 of them so far. We expect the number of cases from the dormitory to continue to be high in the coming days as we complete testing of the remaining quarantined workers.<br></p><p>Besides the polymerase chain reaction (PCR) test, we have also conducted serological tests to determine if some of the cases residing in dormitories are current or past infections.<sup>2</sup> The serological test results for 8 cases have come back positive so far, which indicate likely past infections.<br></p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Details of these trends can be found in MOH’s daily situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?q=http://www.moh.gov.sg/covid-19/situation-report&amp;source=gmail&amp;ust=1598712931381000&amp;usg=AFQjCNGqFx4BYCqnhvl450csdzM_7uAEjA\" title=\"\" class=\"\">www.moh.gov.sg/covid-19/<wbr>situation-report</a>). Please refer to <a href=\"/docs/librariesprovider5/pressroom/annex-a-28-aug.pdf?sfvrsn=15b8a5f7_2\" title=\"Annex A\">Annex A</a>&nbsp;for the summary of the confirmed cases.<br></p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Of the new cases, 97% are imported or linked to known cases/ clusters, while the rest are pending contact tracing.<br></p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; MOH has been monitoring existing clusters for any further transmission. As there have been no more cases linked to Bukit Panjang Integrated Transport Hub (15 Petir Road) for the past two incubation periods (i.e. 28 days), the cluster has now been closed.<br></p><p>&nbsp;</p><p><strong>Links between previous cases found</strong></p><p>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <a href=\"/docs/librariesprovider5/pressroom/annex-b-28-aug.pdf?sfvrsn=fcea1f97_2\" title=\"Annex B\">Annex B</a>&nbsp;and <a href=\"/docs/librariesprovider5/pressroom/annex-c-28-aug.pdf?sfvrsn=bde4dfa_2\" title=\"Annex C\">Annex C</a>&nbsp;for details.<br></p><p>&nbsp;</p><p><strong>Update on condition of confirmed cases</strong></p><p>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 198 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 55,337 have fully recovered from the infection and have been discharged from hospitals or community care facilities.<br></p><p>7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; There are currently 71 confirmed cases who are still in hospital. Of these, most are stable or improving, and none is in the intensive care unit. 1,231 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 27 have passed away from complications due to COVID-19 infection.<br></p><p>&nbsp;</p><p><strong>MINISTRY OF HEALTH<br>28 AUGUST 2020</strong></p><p><sup>[1]</sup> Sungei Tengah Lodge was reported as a new cluster by MOH on 22 August 2020.<br><sup>[2] </sup>Cases whose serological tests are positive are likely to have a past infection, and could be shedding minute fragments of the virus RNA picked by the PCR test, which were no longer transmissible and infective to others.</p><br>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "198-more-cases-discharged-94-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "94 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1598601300000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "28 Aug 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As of 28 August 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 94 cases of COVID-19 infection in Singapore. Based on our investigations so far, there are 4 cases in the community, all of whom are Singaporeans/ Permanent Residents.</p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; There are 10 imported cases, who had all been placed on Stay-Home Notice or isolated upon arrival in Singapore.&nbsp;<br></p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Amongst the 80 cases residing in dormitories today, 58 are from Sungei Tengah Lodge, who had all been placed on quarantine earlier. The vast majority of them were tested during quarantine to determine their status, or picked up through Rostered Routine Testing. Following the detection of cases at Sungei Tengah Lodge, we had placed about 4,500 workers on quarantine, and tested about 3,000 of them so far. We expect the number of cases from the dormitory to continue to be high in the coming days as we complete testing of the remaining quarantined workers.<br></p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.<br></p><p><br><strong>MINISTRY OF HEALTH<br>28 AUGUST 2020</strong></p><div><br></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "94-new-cases-of-covid-19-infection", "CurrentPageUrl": null}, {"Title": "Launch of Careshield Life and Medisave Care On 1 October 2020", "PublishedDate": "/Date(1598594400000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "28 Aug 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp;CareShield Life, the new national long-term care insurance scheme, and MediSave Care, which allows cash withdrawals from MediSave accounts for long-term care needs, will be launched on 1 October 2020. These schemes, as well as ElderFund (launched in January 2020), are part of the package of long-term care financing measures which were announced in 2019 to provide greater protection and assurance for Singaporeans’ long-term care needs.<br><br>2.&nbsp; &nbsp; CareShield Life provides universal long-term care coverage for all Singapore Residents born in 1980 or later, including those with pre-existing disabilities. Under CareShield Life, policy holders will receive monthly cash payouts to support their care needs should they become severely disabled. These payouts will increase annually until age 67 or when a successful claim is made, whichever is earlier. Singapore Residents aged 30 to 40 in 2020 will be the first cohorts to join the scheme, on 1 October 2020 or their 30th birthday, whichever is later.&nbsp; Subsequent cohorts will join the scheme when they reach the age of 30.&nbsp; For Singapore Residents born in 1979 or earlier, the scheme is optional and details on when these cohorts can join CareShield Life will be released in 2021.&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp;Under MediSave Care, Singapore Residents aged 30 and above will be able to tap on their own and/or their spouse’s MediSave accounts to withdraw cash of up to $200 per month for their long-term care needs.<br><br>4.&nbsp; &nbsp; &nbsp;Commenting on the launch of both schemes, Minister for Health Mr Gan Kim Yong said, “As our population ages, we want to ensure that Singaporeans continue to have accessible and affordable long-term care. With CareShield Life, severely disabled Singaporeans can be assured that they will receive financial support for life. They will also have another avenue to fund their long-term care needs, by tapping on their MediSave savings under MediSave Care. Together with ElderFund, which provides discretionary government assistance to lower-income, severely disabled Singapore Citizens, these schemes will collectively enhance support for long-term care costs.”<br><br><strong>Appointment of CareShield Life Council</strong><br><br>5.&nbsp; &nbsp; &nbsp;The CareShield Life Council has been appointed from 1 April 2020 to oversee and advise on the administration and sustainability of CareShield Life and ElderShield schemes. The Council’s Terms of Reference are:<br><br>&nbsp; &nbsp;• Make recommendations on policy and scheme parameters, including premium and benefit adjustments, to ensure that CareShield Life and ElderShield provide effective protection in an affordable and sustainable manner.<br><br>&nbsp; &nbsp; &nbsp; • Review the administration of the CareShield Life and ElderShield schemes.<br><br>&nbsp; &nbsp; &nbsp; • Advise on matters related to the investment of the CareShield Life and ElderShield Insurance Fund (CEIF), and other matters as the Minister for Health may direct.<br><br>6.&nbsp; &nbsp; &nbsp;Ms Jeanette Wong, the previous Group Executive, Institutional Banking Group, DBS, and Board Member of UBS Group AG, was appointed Chairperson of the Council. The rest of the CareShield Life Council comprises 13 members from a variety of fields, such as accountancy, actuarial science, investment, medicine, law, union, and government. This ensures that the Council can benefit from the diverse range of expertise and experiences of the members. The full list of the CareShield Life Council members is at <a href=\"/docs/librariesprovider5/default-document-library/annex-ba3a2b86dfc204443b10c004fd4212526.pdf?sfvrsn=7f9a1ef8_0\" title=\"Annex B\">Annex B</a>.<br><br>7.&nbsp; &nbsp; &nbsp;On behalf of the Council, Ms Wong said, “CareShield Life and ElderShield are key pillars of Singapore’s social safety net for our long-term care needs should any of us become severely disabled, including in our old age. My Council members and I look forward to working together with the Ministry of Health and various stakeholders to help ensure the schemes’ relevance and sustainability.”<br><br>8.&nbsp; &nbsp; &nbsp;The Council has been appointed for a term of three years, from 1 April 2020 to 31 March 2023.<br><br><strong>CareShield Life to provide better protection for long-term care needs</strong><br><br>9.&nbsp; &nbsp; &nbsp;Under CareShield Life, Singaporeans will enjoy longer and greater coverage than the current ElderShield scheme. They will be able to benefit from these features:<br><br>&nbsp; &nbsp; &nbsp; • Lifetime cash payouts. CareShield Life policyholders can receive cash payouts for as long as they remain severely disabled.&nbsp;&nbsp;<br><br>&nbsp; &nbsp; &nbsp; • Payouts increase over time. Payouts start at $600 per month in 2020 and increase annually until age 67 or when a successful claim is made, whichever is earlier.<br><br>&nbsp; &nbsp; &nbsp; • Use of MediSave for Premiums. Singapore Residents can use their MediSave to pay for their CareShield Life premiums and that of their approved dependents.&nbsp;<br><br>&nbsp; &nbsp; &nbsp; • Premium Support Measures. No one will lose coverage because of an inability to pay their premiums. The government will provide the following premium support measures to ensure that premiums remain affordable.&nbsp;<br><br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;i. Permanent Means-Tested Subsidies for lower- to middle-income Singapore Residents. Up to two-thirds of households will be eligible for CareShield Life premium subsidies of up to 30%. More details are at <a href=\"/docs/librariesprovider5/default-document-library/annex-aa92c2d11278947e1845bd95cdc3e1493.pdf?sfvrsn=da4b5b9d_0\" title=\"Annex A\">Annex A</a>.<br><br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;ii. Additional Premium Support. Singapore Citizens in financial need who are unable to pay for their premiums even after the premium subsidies can apply for Additional Premium Support from the government.<br><br>10.&nbsp; &nbsp; &nbsp;Singapore Residents born in 1980 or later will be automatically covered under CareShield Life. Of this group, those who are enrolled within the first five years of scheme launch (i.e. 2020 to 2024) will also receive up to $250 in transitional subsidies. More details are at Annex A. The first cohorts to join the scheme (i.e. those aged 30 to 40 in 2020) will receive a CareShield Life welcome package by 2 September 2020 or up to two months before their 30th birthday, whichever is later. Subsequent cohorts will also receive a CareShield Life welcome package before they reach age 30. More information on one’s CareShield Life coverage and&nbsp; personalised premiums can found in the welcome package, or at <a href=\"http://www.careshieldlife.gov.sg\" title=\"\" class=\"\" target=\"\">www.careshieldlife.gov.sg</a>.<br><br>11.&nbsp; &nbsp; &nbsp;Singapore Residents born in 1979 or earlier do not need to take any action now. They will have the opportunity to join CareShield Life, including switching from ElderShield, closer to end-2021. More details will be released in 2021.<br><br>12.&nbsp; &nbsp; &nbsp;CareShield Life will be administered by the Central Provident Fund (CPF) Board and Agency for Integrated Care (AIC). The two agencies will also administer ElderShield when it is transferred to the government in 2021. This will facilitate a smoother upgrading from ElderShield to CareShield Life, for those who choose to do so.<br><br><strong>MediSave Care</strong><br><br>13.&nbsp; &nbsp; &nbsp;In addition to insurance and government assistance, Singaporeans will also be able to draw on their personal savings for long-term care needs. From 1 October 2020, severely disabled Singapore Residents aged 30 and above will be able to tap on their own and/or their spouse’s MediSave accounts for their long-term care needs, under MediSave Care.&nbsp;<br><br>14.&nbsp; &nbsp; &nbsp;Eligible Singapore Residents can withdraw up to a total of $2,400 per year in cash (i.e. $200 per month) from their own and/or their spouse’s MediSave accounts to supplement their long-term care needs, depending on their MediSave balances. More details are at <a href=\"/docs/librariesprovider5/default-document-library/annex-c15179c004c574d36b1f8634d6ac86b8c.pdf?sfvrsn=70e5a4ea_0\" title=\"Annex C\">Annex C</a>. A minimum of $5,000 has to be set aside in the MediSave account, to ensure sufficient savings for other medical expenses such as hospitalisation and selected costly outpatient treatments. Individuals who have insufficient MediSave balances can tap on their spouse’s MediSave account to supplement the withdrawal, up to a combined total of $200 per month. MediSave Care will also be jointly administered by AIC and CPFB.<br><br><strong>How to apply for CareShield Life claims and MediSave Care</strong><br><br>15.&nbsp; &nbsp; &nbsp;Claim applications for both schemes will open from 1 October 2020 onwards. Interested applicants should arrange for a disability assessment by a MOH-accredited severe disability assessor and submit the scheme(s) application to AIC. For more details on the claims application process for CareShield Life and MediSave Care, please refer to <a href=\"https://www.aic.sg/CareShieldLife\" title=\"\" class=\"\" target=\"\">https://www.aic.sg/CareShieldLife</a>&nbsp;and <a href=\"https://www.aic.sg/MediSaveCare\" title=\"\" class=\"\" target=\"\">https://www.aic.sg/MediSaveCare</a>, respectively.<br><br><strong>MINISTRY OF HEALTH&nbsp;<br>28 AUGUST 2020</strong><br></span></p><div style=\"text-align: justify;\"><span style=\"font-size: 16px;\"><br></span></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "launch-of-careshield-life-and-medisave-care-on-1-october-2020", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}