{"pressItemDictionary": {"Press Releases": [{"Title": " 180 More Cases Discharged, 513 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1595687040000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "25 Jul 2020", "Summary": "", "MainContent": "<div><p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;As of 25 July 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 513 cases of COVID-19 infection in Singapore. The breakdown of the cases is as follows:</p><p><strong>a) Imported cases: 6&nbsp;</strong>(2 Permanent Residents, 4 Dependant’s Pass holders)</p><p>Amongst the 6 imported cases, 2 (Cases 49477 and 49479) are Permanent Residents who returned to Singapore from India on 12 July, and from the UK on 10 July. The remaining cases are Dependant’s Pass holders who arrived from India between 11 July and 13 July. All of them had been placed on 14-day Stay-Home Notice (SHN) upon arrival in Singapore, and had been tested while serving their SHN.</p><p><strong>b) Cases in the community: 2&nbsp;</strong>(2 Work Permit holders)<br></p><p>Of the 2 cases in the community, 1 was picked up as a result of our proactive surveillance and screening, and 1 had already been placed on quarantine earlier. Both are asymptomatic, and were detected through our proactive testing.</p><p>1 of the community cases today is linked to a previous case. Case 49715 had been identified as a contact of a previously confirmed case, and had been placed on quarantine earlier. He was tested during quarantine to determine his status.&nbsp;&nbsp;</p><p>The other community case is currently unlinked. Case 49478 was detected from our proactive screening of workers in essential services who are living outside the dormitories, even though he is asymptomatic.</p><p>Epidemiological investigations of the unlinked case are in progress. In the meantime, all the identified close contacts have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for his household contacts to determine if he could have been infected by them.</p><p>Overall, the number of new cases in the community has decreased, from an average of 9 cases per day in the week before, to an average of 7 per day in the past week. The number of unlinked cases in the community has also decreased, from an average of 5 cases per day in the week before, to an average of 4 per day in the past week.&nbsp;We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.</p><p><strong>c) Cases residing in dormitories: 505</strong></p><p>We continue to pick up cases amongst Work Permit holders residing in dormitories, including in factory-converted dormitories, because of extensive testing in these premises, as part of our process to verify and test the status of all workers.</p><p>The Inter-agency Taskforce is on track to clear all the dormitories by the beginning of August 2020, with the exception of 17 standalone blocks in 8 Purpose Built Dormitories, which serve as quarantine facilities for 28,000 workers still serving out their isolation period. This last batch of workers come from dormitories with a relatively high prevalence of COVID-19, and will be subject to a final test before they complete their isolation periods. We therefore expect the daily case counts to be high for the coming two weeks, before tapering down thereafter</p><p>2.&nbsp; &nbsp; &nbsp; &nbsp;Details of these trends can be found in MOH’s daily situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\">www.moh.gov.sg/covid-19/situation-report</a>). Please refer to&nbsp;<u><a href=\"/docs/librariesprovider5/pressroom/annex-a-(25-jul).pdf?sfvrsn=dac55a0e_0\" title=\"Annex A \">Annex A&nbsp;</a>&nbsp;</u>for the summary of the confirmed cases.<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp;Of the new cases, 99% are linked to known clusters, while the rest are pending contact tracing.<br><br>4.&nbsp; &nbsp; &nbsp; The Inter-Agency Task Force has been systematically and progressively clearing dormitories through aggressive testing of migrant workers residing in dormitories. The following dormitories have been cleared, and now house only recovered individuals and those who have recently tested negative for COVID-19 infection. As such, the clusters have now been closed.</p></div><div><ul><li><p>20 Kranji Road;</p></li><li><p>Potong Pasir Avenue 1;</p></li><li><p>63 Senoko Drive;</p></li><li><p>5 Sungei Kadut Avenue;</p></li><li><p>59 Sungei Kadut Loop;</p></li><li><p>10 Tagore Drive;</p></li><li><p>212 Tagore Lane;</p></li><li><p>16 Tech Park Crescent;</p></li><li><p>23 Tech Park Crescent;</p></li><li><p>50 Tech Park Crescent; and</p></li><li><p>29 Tuas View Walk 2.</p></li></ul></div><p><strong>Links between previous cases found</strong></p><p>5.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;In the past week (18 July to 24 July), MOH has uncovered links for 2 previously unlinked cases in the community.<br><br>6.&nbsp; &nbsp; &nbsp; &nbsp; Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to&nbsp;<u><u><a href=\"/docs/librariesprovider5/pressroom/annex-b-(25-jul).pdf?sfvrsn=2dce3ec4_0\">Annex B</a>&nbsp;</u></u>and&nbsp;<u><a href=\"/docs/librariesprovider5/pressroom/annex-c-(25-jul).pdf?sfvrsn=67465ac8_0\" title=\"Annex C\">Annex C</a>&nbsp;</u>for details.<br><br><strong>Update on condition of confirmed cases<br></strong><br>7.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; 180 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 45,352 have fully recovered from the infection and have been discharged from hospitals or community care facilities.<br><br>8.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;There are currently 148 confirmed cases who are still in hospital. Of these, most are stable or improving, and none is in the intensive care unit. 4,361 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 27 have passed away from complications due to COVID-19 infection.</p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "180-more-cases-discharged-513-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "513 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1595663400000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "25 Jul 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As of 25 July 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 513 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders residing in foreign worker dormitories. Based on our investigations so far, there are 2 cases in the community, both of whom are Work Pass holders. In addition, there are 6 imported cases who had been placed on Stay-Home Notice upon arrival in Singapore.</p><p>2.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The Inter-agency Taskforce is on track to clear all the dormitories by the beginning of August 2020, with the exception of 17 standalone blocks in 8 Purpose Built Dormitories, which serve as quarantine facilities for 28,000 workers still serving out their isolation period. This last batch of workers come from dormitories with a relatively high prevalence of COVID-19, and will be subject to a final test before they complete their isolation periods. We therefore expect the daily case counts to be high for the coming two weeks, before tapering down thereafter.</p><p>3.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;We are still working through the details of the cases today, and further updates will be shared via the MOH press release that will be issued tonight.</p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "513-new-cases-of-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}