{"pressItemDictionary": {"Press Releases": [{"Title": "Additional Precautionary Measures to Prevent Further Importation of COVID-19 Cases", "PublishedDate": "/Date(1584266400000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "15 Mar 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\"><span style=\"font-size: 14px;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Singapore will implement additional precautionary measures to further reduce the risk of importation of COVID-19 to Singapore. These include travel advisories against <u>all</u> non-essential travel abroad, and further restrictions on travellers coming into Singapore.<br><br>2.&nbsp; &nbsp; &nbsp; &nbsp; Globally, there are now more than 150,000 COVID-19 cases and more than 5,000 deaths across 135 countries, and the numbers are increasing rapidly. There have been more than 25,000 new cases since as recently as 12 March (when the Multi-Ministry Taskforce last issued precautionary measures) and a majority of these cases were reported outside of China. The World Health Organization (WHO) has indicated that the epicentre of the outbreak has now shifted to Europe, and there are now more cases reported outside of China daily than that reported in China at the height of its epidemic. The number of new cases imported into mainland China from overseas has also surpassed its number of locally transmitted new infections.<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp; In the past three days<a href=\"file:///C:/Users/Truda/Downloads/Press%20Release-Further%20border%20control%20measures-Draft%2015Mar%201615h%20(Final).docx#_ftn1\" name=\"_ftnref1\" title=\"\"><sup><span style=\"font-size: 11px;\">[1]</span></sup></a> alone, Singapore has seen an increase of 25 new cases. Of these, more than three-quarters were imported cases, of which close to 90 percent were Singapore Residents (Singapore Citizens and Permanent Residents) and Singapore Long Term Pass holders who had returned to Singapore from overseas. During the same period, more than one quarter of imported cases were from ASEAN countries. We have seen a number of these cases entering Singapore for the purpose of seeking medical care, which imposes a significant burden on Singapore’s healthcare resources during this critical period when we are focused on containing the situation within Singapore.<br><br><strong>Border restrictions<br><br></strong>4.&nbsp; &nbsp; &nbsp;<strong> &nbsp;&nbsp;</strong>Based on this latest situation, the Multi-Ministry Taskforce will put in place additional border restriction measures. From 16 March 2020, 2359 hours, all travellers (including Singapore Residents, Long Term Pass holders, and short-term visitors) entering Singapore with recent travel history to ASEAN countries<a href=\"file:///C:/Users/Truda/Downloads/Press%20Release-Further%20border%20control%20measures-Draft%2015Mar%201615h%20(Final).docx#_ftn2\" name=\"_ftnref2\" title=\"\"><sup><span style=\"font-size: 11px;\">[2]</span></sup></a>, Japan, Switzerland, or the United Kingdom within the last 14 days will be issued with a 14-day Stay-Home Notice (SHN).<a href=\"file:///C:/Users/Truda/Downloads/Press%20Release-Further%20border%20control%20measures-Draft%2015Mar%201615h%20(Final).docx#_ftn3\" name=\"_ftnref3\" title=\"\"><sup><sup><span style=\"font-size: 11px;\">[3]</span></sup></sup></a> In addition, they will have to provide proof of the place where they will serve the 14-day SHN, for example a hotel booking covering the entire period, or a place of residence they or their family members own. They may also be swabbed for testing for COVID-19, even if asymptomatic. This is because of the risk of community transmission in these countries and evidence of cases that have been imported from these countries into Singapore.<br><br>5.&nbsp; &nbsp; &nbsp; &nbsp; In addition to the SHN requirement, from 16 March 2020, 2359 hours, all short-term visitors who are nationals of any ASEAN country will have to submit requisite information on their health to the Singapore Overseas Mission in the country they are resident before their intended date of travel. The submission will have to be approved by Singapore’s Ministry of Health (MOH) before travel to Singapore, and the approval will be verified by the Immigration and Checkpoints Authority (ICA) officers at the Singapore checkpoints. Short-term visitors who arrive in Singapore without the necessary approval will be denied entry into Singapore.They are therefore advised to secure the approval before making definitive travel bookings.<br><br>6.&nbsp; &nbsp; &nbsp; &nbsp; The Ministry of Manpower (MOM) will also introduce new measures for Foreign Domestic Workers entering Singapore. More details will be announced by MOM.<br><br>7.&nbsp; &nbsp; &nbsp; &nbsp; As previously announced, residents and long-term pass holders returning from mainland China (outside Hubei province<a href=\"file:///C:/Users/Truda/Downloads/Press%20Release-Further%20border%20control%20measures-Draft%2015Mar%201615h%20(Final).docx#_ftn4\" name=\"_ftnref4\" title=\"\"><sup><sup><span style=\"font-size: 11px;\">[4]</span></sup></sup></a>), Iran, Italy, France, Germany, Republic of Korea, and Spain will continue to be issued a 14-day SHN upon return to Singapore, while short-term visitors from these areas will not be allowed to enter or transit through Singapore.<br><br>8.&nbsp; &nbsp; &nbsp; &nbsp; All travellers entering Singapore and exhibiting fever and/or other symptoms of respiratory illness are required to undergo a COVID-19 swab test at the checkpoints, regardless of travel history. Such travellers will also be issued a 14-day SHN, which they will have to serve in full even if the result of the swab test is negative. Those who meet the clinical suspect case definition will be conveyed to the hospital for follow-up.<br><br>9.&nbsp; &nbsp; &nbsp; &nbsp; Persons under SHN will have to remain in their place of residence at all times for 14 days after entering Singapore.<br><br>10.&nbsp; &nbsp; &nbsp; &nbsp;Singapore’s border control measures in relation to COVID-19, including the new ones announced in this press statement, are summarised in the <u>Annex</u>. These border restrictions will be reviewed in 30 days. The Taskforce may extend the border restriction measures to more countries as the global and local situation evolves.<br><br><strong>Travel advisory<br><br></strong>11.&nbsp; <strong>&nbsp; &nbsp; &nbsp;</strong>With immediate effect, Singaporeans are advised to defer <u>all</u> non-essential travel abroad. This advisory will apply for 30 days, and will be reviewed thereafter. This is to reduce the risk of Singaporeans contracting COVID-19 infection while overseas during this global pandemic.<br><br>12.&nbsp; &nbsp; &nbsp; &nbsp;Singaporeans who have made plans to travel abroad during the March school holidays are advised to review their plans<em>.</em> All travellers will be subject to the prevailing travel measures imposed by their destination countries, and those imposed by Singapore upon their return home. As the situation remains uncertain and will continue to evolve, Singaporeans are advised to review their travel plans for the coming months after the March school holidays as well.<br><br>13.&nbsp; &nbsp; &nbsp; &nbsp;As Singapore’s measures will evolve according to the global situation, Singaporeans should check the MOH website (<a href=\"https://www.moh.gov.sg/covid-19\">https://www.moh.gov.sg/covid-19</a>) for the latest measures.</span></p> <p style=\"text-align: justify;\"><span style=\"font-size: 14px;\"><strong>MINISTRY OF HEALTH</strong></span></p> <p style=\"text-align: justify;\"><strong><span style=\"font-size: 14px;\">15 MARCH 2020</span></strong></p> <div><br clear=\"all\"> <hr align=\"left\" size=\"1\" width=\"33%\"> <div id=\"ftn1\"> <p><a href=\"file:///C:/Users/Truda/Downloads/Press%20Release-Further%20border%20control%20measures-Draft%2015Mar%201615h%20(Final).docx#_ftnref1\" name=\"_ftn1\" title=\"\"><span style=\"font-size: 9px;\">[1]</span></a> As of 14 March, 12pm.</p> </div> <div id=\"ftn2\"> <p><a href=\"file:///C:/Users/Truda/Downloads/Press%20Release-Further%20border%20control%20measures-Draft%2015Mar%201615h%20(Final).docx#_ftnref2\" name=\"_ftn2\" title=\"\"><span style=\"font-size: 9px;\">[2]</span></a> ASEAN countries besides Singapore: Brunei Darussalam, Cambodia, Indonesia, Lao PDR, Malaysia, Myanmar, Philippines, Thailand, Vietnam.</p> </div> <div id=\"ftn3\"> <p><a href=\"file:///C:/Users/Truda/Downloads/Press%20Release-Further%20border%20control%20measures-Draft%2015Mar%201615h%20(Final).docx#_ftnref3\" name=\"_ftn3\" title=\"\"><sup><sup>[3]</sup></sup></a> The SHN will not apply to travellers transiting in Singapore without leaving the transit area. </p> </div> <div id=\"ftn4\"> <p><a href=\"file:///C:/Users/Truda/Downloads/Press%20Release-Further%20border%20control%20measures-Draft%2015Mar%201615h%20(Final).docx#_ftnref4\" name=\"_ftn4\" title=\"\"><sup><sup>[4]</sup></sup></a> Persons returning from Hubei province are subject to quarantine.<br><br><br>+++++<br><strong><u>Annex</u><br></strong></p><p align=\"center\" style=\"text-align: left;\"><strong>List of Countries/ Regions and Border Control Measures</strong></p><table border=\"1\" cellspacing=\"0\" cellpadding=\"0\"> <tbody><tr> <td width=\"236\" valign=\"top\"> <p><strong>Travel History in the last 14-days in Countries/Regions </strong></p> </td> <td width=\"182\" valign=\"top\"> <p><strong>For Singapore Residents and Long-Term Pass Holders</strong></p> </td> <td width=\"182\" valign=\"top\"> <p><strong>For Short-Term Visitors</strong></p> </td> </tr> <tr> <td width=\"236\" valign=\"top\"> <p>Hubei province (mainland China)</p> </td> <td width=\"182\" valign=\"top\"> <p>14-day quarantine</p> </td> <td width=\"182\" valign=\"top\"> <p>Not allowed entry or transit</p> </td> </tr> <tr> <td width=\"236\" valign=\"top\"> <p>Mainland China (except Hubei province), France, Germany, Italy, Iran, Republic of Korea, and Spain</p> </td> <td width=\"182\" valign=\"top\"> <p>14-day SHN</p> </td> <td width=\"182\" valign=\"top\"> <p>Not allowed entry or transit</p> </td> </tr> <tr> <td width=\"236\" valign=\"top\"> <p><strong><span style=\"color: rgb(255, 0, 0);\">[New]</span></strong> ASEAN countries </p> <p>&nbsp;</p> </td> <td width=\"182\" valign=\"top\"> <p>14-day SHN</p> </td> <td width=\"182\" valign=\"top\"> <p>14-day SHN </p> <p>Short-term visitors who are ASEAN nationals will also be required to submit requisite health information for approval before travelling </p> </td> </tr> <tr> <td width=\"236\" valign=\"top\"> <p><strong><span style=\"color: rgb(255, 0, 0);\">[New]</span></strong> Japan, Switzerland, and the United Kingdom </p> </td> <td width=\"182\" valign=\"top\"> <p>14-day SHN</p> </td> <td width=\"182\" valign=\"top\"> <p>14-day SHN</p> </td> </tr> </tbody></table><p>&nbsp;</p><p><strong>&nbsp;</strong></p> </div> </div>", "PressCategory": ["Press Releases"], "CustomDetailUrl": "", "UrlName": "additional-precautionary-measures-to-prevent-further-importation-of-covid-19-cases", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}