{"pressItemDictionary": {"Press Releases": [{"Title": "623 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1587118320000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "17 Apr 2020", "Summary": "&nbsp;", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;As of 17 April 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 623 cases of COVID-19 infection in Singapore, the majority of whom are foreign workers in the dormitories.</p><p>2.&nbsp; &nbsp; &nbsp;We are still working through the details of these cases, and further updates will be shared via the MOH press release that will be issued later tonight.</p><p>&nbsp;</p> <p>&nbsp;</p> <p><div id=\"ftn2\"> <p>&nbsp;</p> </div> </p>", "PressCategory": ["Press Releases"], "CustomDetailUrl": "", "UrlName": "623-new-cases-of-covid-19-infection", "CurrentPageUrl": null}, {"Title": "Two Work Permit Holders Charged for Breaching Quarantine Order", "PublishedDate": "/Date(1587052800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "17 Apr 2020", "Summary": "", "MainContent": "<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Two individuals were charged in court on 17 April 2020 after breaching their Quarantine Order (QO). 35-year-old male Indian national, Vardireddy Nageswara Reddy was charged for an offence under Section 15(4)(b) of the Infectious Diseases Act, and 49-year-old male Chinese national, Liu Dufeng was charged for two offences under Section 15(4)(b) of the Infectious Diseases Act.</p><p>&nbsp;</p><p><strong>Wilful Breach of the QO by Vardireddy Nageswara Reddy</strong></p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; On 17 February 2020, Vardireddy, a Work Permit holder, was issued a QO which required him to be isolated at home from 16 to 20 February. Vardireddy’s quarantine period was subsequently extended to 25 February, 12.00 pm. When the QO was served to Vardireddy, he had acknowledged that he understood the contents of the QO, in particular that he could not leave his place of residence for the entire duration of the quarantine period.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; On 24 February, Vardireddy had left his home to go to the neighbourhood shopping mall to purchase some items without the permission of Director of Medical Services and thereby, breached his QO. </p><p>&nbsp;</p><p><strong>Wilful Breach of the QO by Liu Dufeng</strong></p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; On 15 February 2020, Liu, a Work Permit holder, was issued a QO for him to be isolated at his place of residence at 45 Genting Road from 12 to 24 February. When the QO was served to Liu, he acknowledged that he understood the contents of the QO, in particular that he could not leave his place of residence for the quarantine period.</p><p>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; On 19 February, Liu relocated to 14 Genting Road to continue his quarantine under the instructions of his employer. Liu had failed to inform his employer that he was not supposed to be relocated during the quarantine period and also failed to seek permission from Director of Medical Services prior to the relocation. </p><p>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Investigations also revealed that Liu had left his residence on 21 February in search of a bank at MacPherson Road. <br><br>7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Any person convicted of an offence under Section 15(4)(b) of the Infectious Diseases Act is liable to a fine of up to $10,000, or up to six months’ imprisonment, or both. </p><p>8.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; A QO is a legal order issued to individuals under the Infectious Diseases Act and issued to quarantine or isolate an individual who is, or suspected to be, a carrier of an infectious disease or a contact of a person confirmed to have an infectious disease. MOH will not hesitate to take enforcement action against those who fail to comply with the QO requirements. </p><p>&nbsp;</p><p><strong>MINISTRY OF HEALTH<br>17 APRIL 2020</strong></p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "two-work-permit-holders-charged-for-breaching-quarantine-order", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}