{"pressItemDictionary": {"Press Releases": [{"Title": "Additional Covid-19 Support Measures for All Homes Serving the Elderly", "PublishedDate": "/Date(1588418400000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "02 May 2020", "Summary": "", "MainContent": "1. The Ministry of Health (MOH) and Ministry of Social and Family Development (MSF) will implement additional support measures for all homes serving the elderly to further reduce the risk of COVID-19 exposure for staff and residents. These include nursing homes, welfare homes, sheltered homes and adult disability homes (“Homes\"). All Homes will continue to implement safe distancing and infection control measures in full compliance with previous advisories. \n<br>\n<br> <strong>COVID-19 Tests for Staff and Residents\n</strong><br>\n<br>2. Testing is a critical enabler of Singapore’s fight against COVID-19, and allows us to heighten protection for vulnerable settings. The Multi-Ministry Taskforce has been steadily building up our national capacity to conduct tests for COVID-19, in tandem with a comprehensive medical strategy to ensure that individuals infected with COVID-19 receive prompt and quality medical treatment.\n<br>\n<br>3.  Homes serve highly vulnerable and frail seniors, who are at higher risk of developing serious health complications if infected with COVID-19. The Taskforce recognises the need to support these Homes to strengthen the safety of their environment. MOH and MSF will therefore prioritise testing for residents and staff in all homes serving the elderly. This will ensure that any COVID-19 infections in the Homes are detected as early as possible for treatment, as well as to limit transmission. This new support measure complements existing measures on safe distancing and movement restrictions within the Homes, which had been put in place earlier.\n<br>\n<br>4. MOH commenced COVID-19 testing from 29 April 2020 and target to complete the tests by next week, while MSF commenced the tests from 30 April 2020 and will complete them by 2 May. Prior to this, we had been actively testing symptomatic residents and staff who developed Acute Respiratory Infection or fever for COVID-19.\n<br>\n<br>5. The Ministries are providing full funding support for the costs of all tests, and all follow-up treatment that is required.\n<br>\n<br><strong>Accommodation Support for All Resident-Facing Staff\n</strong><br>\n<br>6. To ensure a safe environment in the Homes, broad-based testing will be complemented by further measures to reduce the exposure of staff and residents to COVID-19 infection risks in the community. This includes ensuring resident-facing staff who enter and leave the Homes daily have a protected living environment to minimise the chances of them contracting the virus and bringing it into the Homes.\n<br> \n<br>7. We are working with the Homes to facilitate lodging for staff who interact with residents of Homes at designated accommodation facilities on-site or at hotels, to reduce their exposure to the community during the circuit breaker period<sup>1</sup>. We will arrange for staff of the Homes to stay at hotels if the Home they work at is unable to house them on-site.\n<br>\n<br>8. For staff who have to move into hotels, we will provide funding for the accommodation and for the Homes to provide meals, dedicated transport and daily necessities for the staff. MOH will also provide support for nursing homes to enhance onsite accommodation spaces to improve safe distancing, where necessary.\n<br>\n<br>9. A $500 allowance will be provided to affected staff to assist them with the transition for the current measures. We understand that the move could cause inconvenience to the affected staff and appreciate their sacrifices and efforts in keeping our elderly safe. \n<br>\n<br>10. We acknowledge and appreciate the dedication of all staff and the management of the Homes, who have stepped up amidst the challenges and are working hard to care for their residents. The Government remains committed to support and work closely with the Homes to strengthen safety and protection for everyone. Through our collective efforts, we will be better able to protect those who are more vulnerable in our community.\n<br>\n<br>\t\n[1]&nbsp; As of 29 April 2020, the Circuit Breaker ends on 1 June 2020.&nbsp;&nbsp;<br><br><strong>MINISTRY OF HEALTH\n<br>MINISTRY OF SOCIAL AND FAMILY DEVELOPMENT\n<br>2 MAY 2020\n</strong><br>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "additional-covid-19-support-measures-for-all-homes-serving-the-elderly", "CurrentPageUrl": null}, {"Title": "447 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1588403160000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "02 May 2020", "Summary": "", "MainContent": "1. As of 2 May 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 447 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders residing in foreign worker dormitories. Four cases are Singaporeans/ Permanent Residents.\n<br>\n<br>2. We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight. \n<br>\n<br>\n<br><strong>MINISTRY OF HEALTH\n<br>2 MAY 2020</strong>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "447-new-cases-of-covid-19-infection", "CurrentPageUrl": null}, {"Title": "Easing the Tighter Circuit Breaker Measures, Preparing for Gradual Resumption of Activity After 1 June", "PublishedDate": "/Date(1588392600000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "02 May 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;The Multi-Ministry Taskforce will ease some of the tighter circuit breaker measures, which were announced on 21 April 2020, progressively over the coming weeks. At the same time, we are preparing for the safe and gradual resumption of economic and community activities after the end of the circuit breaker period on 1 June 2020. We will be tapping on digital solutions, such as the SafeEntry check-in system, and deploying them more pervasively when we resume these activities.<br><br>2.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;With everyone playing their part and observing safe distancing measures, we have seen a significant decrease in community transmission over the past month. The average daily number of new cases in the community has dropped by more than half, from 25 in the week before, to 12 in the past week.<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;That said, we are not out of the woods. There are still unlinked cases in the community and new clusters may form if we let our guard down. We must be cautious in how we lift the restrictions, and put in place further safeguards even as we do so.<br><br><strong>Gradual Reopening of Work Premises and Economy<br><br></strong>4.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;We plan to phase in the reopening of work premises, taking into account their importance to the economy and supply chains, their contribution to local employment,&nbsp;and their ability to minimise risks of transmission at their workplaces. To do so safely, we will impose more stringent requirements on all employers and firms.<br><br>5.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;In particular, all companies must put in place safe management practices as an integral part of their operations. This means proactively identifying situations and practices which have higher infection risks, and implementing appropriate precautions and safeguards.<br><br>6.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;For example, companies must continue to allow staff to work from home wherever possible; enforce safe distancing amongst their employees at the workplace; stagger working hours and break times; and ensure no cross-deployment of staff across teams or worksites. They should also require every employee to wear a mask at work, and ensure that there are no gatherings amongst their staff (i.e. they should not be interacting at staff canteens, or going out in groups during lunch breaks). Further details on the specific workplace measures will be announced by the Ministry of Manpower, Ministry of Trade and Industry and relevant agencies in due course.<br><br>7.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Over the coming weeks, we will work closely with the Trade Associations and Business Chambers to engage businesses and help them prepare to meet the more stringent safe management requirements when they reopen.<br><br><strong>Gradual Resumption of Selected Activities and Services<br><br></strong>8.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;The Multi-Ministry Taskforce will allow the gradual resumption of selected activities and services in the coming weeks, subject to the necessary safe management measures being in place.<br><br>9.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;From 5 May 2020, Traditional Chinese Medicine (TCM) needle acupuncture will be allowed, for pain management only (excluding cupping, moxibustion, <em>guasha</em> and <em>tuina</em> manipulative therapies), if assessed by the TCM practitioner to be essential. TCM halls with registered TCM practitioners will also be allowed to sell retail products. This is on top of the consultation and herbal dispensary services which they are already allowed to provide.<br><br>10.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; From 5 May 2020, residents living in strata-titled residential buildings may exercise within the common areas of these private residential developments such as footpaths, but must continue to practise safe distancing measures. In other words, the same rules that apply in public areas will also apply within the common areas of these developments. Enforcement officers will conduct periodic checks and inspections, and the Management Corporations (MCST) and Managing Agents should also do their part to ensure compliance with these measures. All sports and recreational facilities within these private residential developments such as playgrounds, pools, gyms, barbecue pits and club houses are to remain closed.<br><br>11.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;From 12 May 2020, the following will be allowed to resume operations:<br><br>a.&nbsp; &nbsp; Manufacturing and onsite preparation of all food, including cakes and confectionery, ice cream, cocoa, chocolate and chocolate products, and other snacks;<br><br>b.&nbsp; &nbsp; Retail outlets of food, including cakes and confectionery, packaged snacks and desserts, may be open for takeaway and delivery only;<br><br>c.&nbsp; &nbsp; Home-based food businesses may operate, but only for delivery or collection. Home-based private dining will not be allowed. Delivery and collection of food orders should be done in a safe and contactless manner, by appointment so that it can be spaced out, and there is no bunching of people. Details will be provided separately;<br><br>d.&nbsp; &nbsp; Retail laundry services;<br><br>e.&nbsp; &nbsp; Barbers and hairdressers, for basic haircut services; and<br><br>f.&nbsp; &nbsp; &nbsp;Retail of pet supplies.<br><br>12.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;The list of activities that will be allowed to operate, and relevant further information, will be updated at <a href=\"https://covid.gobusiness.gov.sg/essentialservices\">https://covid.gobusiness.gov.sg/essentialservices</a>.<br><br>13.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Learning has continued during the circuit breaker period through Home-Based Learning. But we recognise the anxiety amongst students and parents of graduating cohorts, who have to take the national examinations this year. From 19 May 2020, schools will bring back students from graduating cohorts in small groups for face-to-face consultations and lessons. Priority will be given to students requiring school facilities for coursework and practical sessions, and those who need additional support and remediation during the school vacation period. Institutes of Higher Learning (IHLs), especially the Institute of Technical Education, will also bring back small groups of students on campus for critical consultations, projects or practicums. We will stagger the students’ return to schools and IHLs throughout the day. They will practise safe distancing and safe management measures, such as keeping to separate groups within their cohort.<br><br>14.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;In the migrant worker dormitories, the number of cases is still high. The restriction on daily movement of workers in and out of all dormitories (i.e. Purpose Built Dormitories, Factory Converted Dormitories, Construction Temporary Quarters and Temporary Occupation Licence quarters) will therefore be extended to the end of the circuit breaker period, i.e. until 1 June 2020 (inclusive). This will minimise the risk of further community transmission of COVID-19.<br><br>15.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;The Multi-Ministry Taskforce will closely observe the trends over the coming weeks, and adjust further as necessary.<br><br><strong>Leveraging Technology to Enable Safe Resumption of Activities<br><br></strong>16.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;There will likely still be some cases in our community even after the circuit breaker period. We must be able to quickly contact trace and isolate close contacts of these infected individuals. We will leverage technology to speed up contact tracing, so that we can more effectively prevent the formation of new infection clusters, and enable the safe resumption of activities.<br><br>17.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;<a href=\"http://www.safeentry.gov.sg\" title=\"\" class=\"\" target=\"\">SafeEntry</a>&nbsp;was deployed by the Government on 23 April 2020 to log the names, NRIC/FINs and mobile numbers of individuals visiting hotspots, workplaces of essential services, as well as selected public venues. Such details are necessary for the Government to carry out contact tracing quickly and effectively, should the need arise. Users check-in by scanning a QR code displayed at the venue with their phone, or by having any identification card with a barcode scanned e.g. NRIC, driver’s licence, student pass and work permit.<br><br>18.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;To further support our contact tracing efforts, SafeEntry must be deployed extensively across Singapore, especially at places with a higher risk of non-transient contact. This would include workplaces, malls and supermarkets. From 12 May 2020, all businesses and services that are in operation must come on board the SafeEntry system to log the check-in and check-out of employees and visitors.<br><br>19.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;At places with transient populations on-the-move such as MRT stations and parks, there will not be mandatory SafeEntry checkpoints. But QR codes will be put up, and we encourage the public to scan in so that they may be reached should the need for contact tracing arise. Contact data collected by SafeEntry is only used by authorised personnel for contact tracing purposes, and stringent measures are in place to safeguard the data in accordance with the Government’s data security standards. We will announce details of the list of venues for deployment in the next few days.<br><br>20.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;We are also working to improve our digital tools to enable speedier contact tracing. In the meantime, we encourage more Singaporeans to download and actively use the TraceTogether app. The app uses Bluetooth proximity data to establish close contact between two users. We are working with Apple/Google to make the app more effective on iOS phones. We are also looking into solutions for groups like the elderly and the young who do not have smartphones. We will announce more details in the coming weeks.<br><br><strong>Social Responsibility is Key<br><br></strong>21.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Social responsibility is critical in slowing the spread of COVID-19. Even as the circuit breaker measures are gradually eased, all of us should continue to stay at home as much as possible, and minimise movement outside the home. In the community and at workplaces, we must keep up good habits such as safe distancing, personal hygiene and wearing of masks. This must be our new normal in a COVID-19 world.</p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "easing-the-tighter-circuit-breaker-measures-preparing-for-gradual-resumption-of-activity-after-1-june", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}