{"pressItemDictionary": {"Press Releases": [{"Title": "7,500 Job Vacancies and 1,600 Traineeship, Attachment and Skills Training Opportunities Available In the Healthcare Sector", "PublishedDate": "/Date(1598347800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "25 Aug 2020", "Summary": "", "MainContent": "<div>1.&nbsp; &nbsp; &nbsp;The healthcare sector continues to offer meaningful employment opportunities for Singaporeans. From now until end 2021, the healthcare sector will be offering up to a total of about 7,500 jobs, and about 1,600 traineeships, attachments and skills training opportunities. The majority of these positions are suitable for fresh graduates entering the workforce and mid-career jobseekers with or without prior healthcare background. These vacancies and opportunities will help to fulfil current and future expanding needs for healthcare services, given Singapore’s ageing population.<br><br></div><div><strong>Job Opportunities in the Healthcare Sector</strong></div><div><br>2.&nbsp; &nbsp; &nbsp;Of the 7,500 job opportunities, about one-third are for healthcare professionals including nurses and allied health professionals. These vacancies will be mainly met by fresh graduates from healthcare training programmes, as well as graduates from our Professional Conversion Programmes (PCP) targetted at mid-career entrants into the healthcare sector. Currently, we have about 200 nursing and allied health PCP training places available each year, and we will be adding at least another 100 new training places in 2021.<br><br></div><div>3.&nbsp; &nbsp; &nbsp;The remaining vacancies are for various roles including support care, and administrative and ancillary roles, which will be suitable for fresh graduates and mid-career job seekers from non-healthcare backgrounds. These vacancies are available across both the public healthcare and community care sector, ranging from service management positions, such as patient service associates, to blended job roles which involve providing support in non-clinical care or administrative operations. There are also managerial and executive roles available for those who may have relevant administrative experience or training outside the healthcare sector, for example in financial management, accounting, human resources, or digitalisation of business processes. Training, on-boarding and orientation will be provided.<br><br></div><div><strong>Traineeships, Attachments and Skills Training Opportunities under SGUnited Jobs and Skills Package<br></strong><br></div><div>4.&nbsp; &nbsp; &nbsp;Workforce Singapore (WSG) and SkillsFuture Singapore are working with healthcare and community care providers in the public and private sectors, as well as training institutions and the healthcare union, to offer about 1,600 traineeship, attachments and skills training opportunities, for individuals to acquire relevant working experience and work-ready skills needed in the sector. Employers and trainees will receive funding support during the traineeship, attachment or skills training period.</div><br>•<strong> Traineeships and Attachments</strong><div>Fresh or recent graduates can tap on the SGUnited Traineeships Programme, while mid-career individuals can apply for attachments available under the SGUnited Mid-Career Pathways Programme, to join the healthcare sector. The traineeships and attachments last between four to nine months in duration, and are available for various roles, including patient service associates, dental surgery assistants and other admin and ancillary roles. Employers can consider hiring well-performing trainees and mid-career individuals at any time during or after the completion of the traineeship or attachment.<br><br></div><div><strong>• Skills Training</strong></div><div>Mid-career job seekers can tap on the SGUnited Skills programme to apply for skills training in healthcare roles, such as support staff and executives in clinical and non-clinical roles. Skills training lasts between six to 12 months for various job roles that include healthcare assistants, therapy assistants, community care coordinators, pharmacy technicians and health managers and administrators. Over 1,300 training opportunities will be offered by seven training partners, with classes starting progressively from August 2020.<br><br></div><div>The training providers are:</div><div>o HMI Institute of Health Sciences</div><div>o Institute of Technical Education</div><div>o NTUC Learning Hub</div><div>o Republic Polytechnic</div><div>o Singapore Management University</div><div>o Singapore University of Social Sciences</div><div>o Temasek Polytechnic<br><br></div><div>5.&nbsp; &nbsp; &nbsp;In all, these opportunities will allow more Singaporeans to join the healthcare workforce. The job vacancies and opportunities will be made available progressively over 2020 and 2021. Job seekers will be able to access these opportunities through WSG’s MyCareersFuture job portal, and various job fairs and recruitment platforms.</div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "7-500-job-vacancies-and-1-600-traineeship-attachment-and-skills-training-opportunities-available-in-the-healthcare-sector", "CurrentPageUrl": null}, {"Title": "31 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1598284800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "25 Aug 2020", "Summary": "", "MainContent": "1.&nbsp; &nbsp; &nbsp; As of 25 August 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 31 cases of COVID-19 infection in Singapore. Based on our investigations so far, there are no cases in the community.<br><br>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; There is 1 imported case, who had been placed on Stay-Home Notice upon arrival in Singapore.&nbsp;<br><br>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "31-new-cases-of-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}