{"pressItemDictionary": {"Press Releases": [{"Title": "348 More Cases Discharged, 185 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1593877200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "04 Jul 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\">&nbsp; &nbsp; As of 4 July 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 185 cases of COVID-19 infection in Singapore. The breakdown is as follows:&nbsp;<br><br><strong>a) Imported cases: 1</strong> (1 Permanent Resident)<br><br>There is an imported case today involving a Singapore Permanent Resident who had returned to Singapore from India on 21 June 2020, and is a family member of Case 44351. He was placed on Stay-Home Notice (SHN) upon arrival in Singapore, and had been conveyed in a dedicated transport to an SHN facility to commence his 14-day isolation. He is asymptomatic, and had been tested while serving SHN.<br><br><strong>b) Cases in the community: 9</strong> (4 Singaporeans, 3 Work Pass holders, 2 Work Permit holders)<br><br>Of the 9 cases in the community, 4 had been picked up as a result of our proactive surveillance and screening, and 1 had already been placed on quarantine earlier.&nbsp;<br><br>1 of the community cases today is linked to a previous case. Case 44700 had been identified as a contact of a previously confirmed case, and had already been quarantined earlier. He is asymptomatic and was tested during quarantine to verify his status.&nbsp;<br><br>8 of the community cases are currently unlinked. Of these, 3 cases (Cases 44630, 44631 and 44633) were proactively swabbed as they work in essential services, even though 2 are asymptomatic. Another case (Case 44596) was detected as part of our proactive screening of individuals deployed to frontline COVID-19 operations. Epidemiological investigations are ongoing for the remaining 4 cases (Cases 44518, 44562, 44591 and 44680), 3 of whom had been tested under our enhanced community testing after being diagnosed with acute respiratory infection.<br><br>Overall, the number of new cases in the community has increased, from an average of 6 cases per day in the week before, to an average of 9 per day in the past week. The number of unlinked cases in the community has also increased, from an average of 3 cases per day in the week before, to an average of 5 per day in the past week. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br><br><strong>c) Cases residing in dormitories: 175</strong><br><br>We continue to pick up cases amongst Work Permit holders residing in dormitories, including in factory-converted dormitories, because of extensive testing in these premises, as part of our process to verify and test the status of all workers.&nbsp;<br><br>2.&nbsp; &nbsp; &nbsp;Details of these trends can be found in MOH’s daily situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report/\" title=\"\" class=\"\" target=\"\">www.moh.gov.sg/covid-19/situation-report</a>). Please refer to <a href=\"/docs/librariesprovider5/default-document-library/annex-a9a15855fb48749fbb9998405825b65c1.pdf?sfvrsn=dc6d7ec_0\" title=\"Annex A\">Annex A</a>&nbsp;for the summary of the confirmed cases.&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp;Of the new cases, 95% are linked to known clusters, while the rest are pending contact tracing.&nbsp;<br><br>4.&nbsp; &nbsp; &nbsp;We announced on 2 July that MOH has placed 58 households residing at Block 111 Tampines Street 11 under active phone surveillance and would be facilitating COVID-19 testing for them and their visitors. This is a precautionary measure after MOH had detected 9 confirmed cases from 2 households residing at the block. In total, 116 residents and visitors have been tested, and all the results have come back negative for COVID-19. MOH will continue to closely monitor the situation.&nbsp;<br><br><strong>Links between previous cases found</strong><br><br>5.&nbsp; &nbsp; &nbsp;In the past week (27 June to 3 July), MOH has uncovered links for 11 previously unlinked cases.&nbsp;<br><br>6.&nbsp; &nbsp; &nbsp;Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <a href=\"/docs/librariesprovider5/default-document-library/annex-b1e122037f3574ffdb5b50f7884e00957.pdf?sfvrsn=700ca8e9_0\" title=\"Annex B\">Annex B</a>&nbsp;and <a href=\"/docs/librariesprovider5/default-document-library/annex-cd480cd480f4243b5a7fe57b95f867445.pdf?sfvrsn=bac9c1a5_0\" title=\"Annex C\">Annex C</a>&nbsp;for details.&nbsp;<br><br><strong>Update on condition of confirmed cases</strong><br><br>7.&nbsp; &nbsp; &nbsp;348 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 40,117 have fully recovered from the infection and have been discharged from hospitals or community care facilities.&nbsp;<br><br>8.&nbsp; &nbsp; &nbsp;There are currently 204 confirmed cases who are still in hospital. Of these, most are stable or improving, and 2 are in critical condition in the intensive care unit. 4,317 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 26 have passed away from complications due to COVID-19 infection.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>4 JULY 2020</strong></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "348-more-cases-discharged-185-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "185 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1593849000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "04 Jul 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\">&nbsp; &nbsp; &nbsp; &nbsp; As of 4 July 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 185 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders residing in foreign worker dormitories. Based on our investigations so far, there are 9 cases in the community, of whom 4 are Singaporeans/ Permanent Residents and 5 are Work Pass holders. In addition, there is an imported case involving a Singapore Permanent Resident who had been placed on Stay-Home Notice upon arrival in Singapore.&nbsp;<br><br>2. &nbsp;&nbsp;&nbsp;&nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp;We announced on 2 July that MOH has placed 58 households residing at Block 111 Tampines Street 11 under active phone surveillance and would be facilitating COVID-19 testing for them and their visitors. This is a precautionary measure after MOH had detected 9 confirmed cases from 2 households residing at the block. In total, 116 residents and visitors have been tested, and all the results have come back negative for COVID-19. MOH will continue to closely monitor the situation.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>4 JULY 2020</strong></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "185-new-cases-of-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}