{"pressItemDictionary": {"Press Releases": [{"Title": "39 More Cases Discharged, 1,111 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1587480900000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "21 Apr 2020", "Summary": "", "MainContent": "<div style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 14px;\">&nbsp; &nbsp;&nbsp; As of 21 April 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 1,111 cases of COVID-19 infection in Singapore. The breakdown is as follows:<br><br><strong></strong></span><span style=\"font-family: Arial; font-size: 14px;\"><strong>a)&nbsp;Imported cases: 0 </strong></span></div><div style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 14px;\"><br>There are no imported cases today.&nbsp;&nbsp; </span></div><div style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 14px;\"><br><strong>b)&nbsp;Cases in the community: 28</strong> (20 Singaporeans/Permanent Residents, 8 Work/ Long Term Passes)</span></div><div style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 14px;\"><br>The number of new cases in the community has decreased, from an average of 39 cases per day in the week before, to an average of 28 per day in the past week. The number of unlinked cases in the community has decreased slightly, from an average of 21 cases per day in the week before, to an average of 20 per day in the past week. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.</span></div><div style=\"text-align: justify;\"><br><span style=\"font-family: Arial; font-size: 14px;\"><strong>c)&nbsp;Work Permit holders (residing outside dormitories): 33</strong></span></div><div style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 14px;\"><br>The number of new cases amongst Work Permit holders residing outside dormitories has continued to increase, from an average of 14 cases per day in the week before, to an average of 26 per day in the past week.&nbsp; </span></div><div style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 14px;\"><br><strong>d)&nbsp;Work Permit holders (residing in dormitories): 1,050</strong></span></div><div style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 14px;\"><br>The main increase today continues to be for Work Permit holders residing in dormitories, where we are picking up many more cases because of extensive testing. Most of these cases have a mild illness and are being monitored in the community isolation facilities or general ward of our hospitals. None of them is in the intensive care unit. </span></div><div style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 14px;\"><br>2. &nbsp; Details of these trends can be found in MOH’s daily situation Report (www.moh.gov.sg/covid-19/situation-report). Please refer to <a title=\"200421 MOH Press Release Annex A\" href=\"/docs/librariesprovider5/pressroom/press-releases/200421-moh-press-release-annex-a.pdf?sfvrsn=bb713493_0\">Annex A</a>&nbsp;for the summary of the confirmed cases.<br><br></span><span style=\"font-family: Arial; font-size: 14px;\">3. &nbsp; Of the new cases, 66% are linked to known clusters, while the rest are pending contact tracing. </span></div><div style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 14px;\"><br><strong>Links between previous cases found<br></strong><br></span><span style=\"font-family: Arial; font-size: 14px;\">4. &nbsp;&nbsp; In the past week (14 April to 20 April), MOH has uncovered links for 672 previously unlinked cases. </span></div><div style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 14px;\"><br>5. &nbsp;&nbsp; Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <a title=\"200421 MOH Press Release Annex B\" href=\"/docs/librariesprovider5/pressroom/press-releases/200421-moh-press-release-annex-b.pdf?sfvrsn=5acad8bc_0\">Annex B</a>&nbsp;for details.<br><br></span></div><div style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 14px;\"><strong>Update on condition of confirmed cases</strong></span></div><div style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 14px;\"><br>6. &nbsp; &nbsp; 39 more cases <sup><span style=\"font-size: 11px;\">[1]</span></sup> of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 839 have fully recovered from the infection and have been discharged from hospitals or community isolation facilities. </span></div><div style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 14px;\"><br>7. &nbsp;&nbsp; Of the 3,593 confirmed cases who are still in hospital, most are stable or improving. 27 are in critical condition in the intensive care unit. 4,682 cases who are clinically well but still test positive for COVID-19 are isolated and cared for at community facilities. 11 have passed away from complications due to COVID-19 infection.</span></div><div style=\"text-align: justify;\"><span style=\"font-family: Arial;\"><span style=\"font-size: 14px;\"><br><strong>MINISTRY OF HEALTH<br>21 APRIL 2020<br><br></strong><span style=\"font-size: 11px;\">[1]&nbsp;Cases 147, 300, 360, 610, 613, 620, 655, 743, 849, 896, 938, 988, 999, 1082, 1103, 1123, 1170, 1383, 1446, 1530, 1544, 1599, 1643, 1733, 1758, 1841, 1937, 1949, 1994, 2182, 2208, 2485, 2539, 2736, 3014, 3448, 4162, 4779 and 5472.</span></span></span></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "39-more-cases-discharged-1-111-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "Strong National Push to Stem Spread of Covid-19", "PublishedDate": "/Date(1587465000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "21 Apr 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The Multi-Ministry Taskforce has directed more steps to be taken to further reduce transmission of COVID-19. We will close more work premises to minimise workplace transmissions and to contain the infection amongst migrant worker clusters. We will also take targeted action at popular areas in the community, and encourage more to stay home, to further reduce the risk of community transmission.&nbsp;&nbsp;<br><br><strong>Update on Current Trends of Transmission<br><br></strong>2&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We have seen a significant increase in cases relating to migrant workers, in the past two weeks, driven predominantly by aggressive testing in migrant worker dormitories. We have deployed medical and support teams to various dormitories to tend to the healthcare and daily needs of the migrant workers residing there. Those who are sick and contracted COVID-19 have been placed under the care of our healthcare teams. Most are young and many have either no symptoms or relatively mild symptoms. None need oxygen support or are in the intensive care unit. Many recover without having to be hospitalised.<br><br>3&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Since the introduction of the circuit breaker measures, we are starting to see a moderation in the number of cases in the community. This has come down from an average of around 40 cases per day in the first week of the circuit breaker period (i.e. from 7 April to 13 April 2020) to an average of around 30 cases per day in the second week of the circuit breaker period (i.e. from 14 April to 20 April 2020).<sup>[1]</sup>&nbsp;The number of cases amongst Singaporeans and Permanent Residents have also decreased in the same period, to an average of 24 cases per day. Overall COVID-19 related deaths remain low, with 11 deaths to date.<br><br>4&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; However we want to bring the number of cases in the community down further. There continues to be transmission at workplaces. There is also an increasing number of unlinked cases in the community. This is indicative of continued community spread and cases in the community that have not been detected.<br><br>5&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We must therefore make a stronger national push to decisively break the transmissions and further reduce the number of community cases. We must also be able to detect and contain cases that break out in the community, to prevent new clusters from forming. Together, we must make the most out of our circuit breaker period.<br><br><strong>Closure of More Work Premises and Measures for Workplaces&nbsp;&nbsp;<br><br></strong>6&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; On 14 April 2020, the Multi-Ministry Taskforce announced that fewer businesses will be permitted to operate during the circuit breaker period. We aim to reduce the proportion of workers still commuting daily to work from about 20% today, to around 15%, so as to minimise the workers’ movements and interactions.<br><br>7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The list of activities that will be allowed to continue to operate will be updated at <a href=\"https://covid.gobusiness.gov.sg/essentialservices\">https://covid.gobusiness.gov.sg/essentialservices</a>. For businesses that are customer facing, we will have a tighter definition of what is allowed under F&amp;B, and either suspend or place restrictions on selected businesses to further reduce interactions. The affected businesses will be notified by the Ministry of Trade and Industry. Businesses which can continue operating at their work premises must register their workers who are required to work on-site. The number of workers permitted to work on-site will be reduced to the minimum needed.&nbsp; &nbsp;<br><br>8&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; For workplace premises which remain open, employers must put in place effective measures to avoid transmission of COVID-19 at and across workplace premises. These include not allowing teams working in different locations to interact physically with one another, implementing safe distancing measures at every workplace premise, and ensuring workers wear masks at the workplaces. All workplaces will also be required to have a system that logs their workers’ entry into, and exit from, their workplaces. &nbsp;Employers can consider using a digital check-in application called SafeEntry for this purpose. More information on SafeEntry’s deployment at work premises can be found at <a href=\"http://go.gov.sg/safeentry\" title=\"\" class=\"\" target=\"\">go.gov.sg/safeentry</a>.&nbsp; &nbsp; <br><br>9&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Enforcement agencies will increase the number of inspections of workplace premises which remain open, and will take firm action against non-compliant workplaces. First-time offenders will be issued composition offers of $1,000, and repeat offenders will face higher fines or prosecution in court. Businesses will be required to suspend their operations should a cluster of infection arise among their staff working on the premises.<br><br><strong>Tackling Transmissions in Migrant Worker Clusters<br><br></strong>10&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The Taskforce has adopted a three-pronged strategy to contain and manage the transmissions at dormitories. First, we are actively containing the spread of the virus in the dormitories. Second, we are enforcing safe distancing measures in the dormitories to prevent the intermingling of workers.&nbsp; Third, we have moved healthy workers in essential services to other facilities so as to reduce movement in and out of the dormitories and minimise further cross-infection.&nbsp; <br><br>11&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; To implement this strategy, the Taskforce has deployed Forward Assurance and Support Teams (FAST teams) to support the dormitories. The FAST teams assist in setting up medical facilities and triage clinics to make sure workers get adequate medical attention and care. Workers who are unwell are encouraged to see the doctor, so that they can be diagnosed and given appropriate treatment. Those who show signs of being unwell with respiratory symptoms will be separated as early as possible from the other dormitory residents. The enhanced medical coverage across the dormitories will facilitate early identification, prompt contact tracing, and effective isolation of COVID-19 cases. The FAST teams also help to ensure that the needs of the migrant workers are met, such as food, water, and masks, and that their living conditions are satisfactory and clean. <br><br>12&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; From 2359 hours, 21 April 2020, we will no longer allow daily movement of workers in and out of all dormitories (i.e. Purpose Built Dormitories, Factory Converted Dormitories, Construction Temporary Quarters and Temporary Occupation Licence quarters. Employers must continue to work with the dormitory operators to ensure the wellbeing of the workers in the dormitories, including taking care of their food and other daily needs. <br><br>13&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Besides the dormitories, we are also dealing with the situation of migrant workers living in shophouses, private housing and HDB flats. In light of the increasing number of COVID-19 cases involving migrant workers in the construction sector, about 180,000 construction Work Permit and S Pass holders (and their dependents) have been placed on mandatory SHN from 20 April to 4 May 2020. This is a precautionary measure to minimise the risk of further community transmission of COVID-19.&nbsp;<br><br><strong>General Population is Urged to Take Circuit Breaker Measures Seriously<br><br></strong>14&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We urge all in Singapore to stay home and avoid going out except to purchase food and daily necessities, procure essential services or for urgent medical needs. Everyone must observe the circuit breaker measures strictly so that we can quickly break transmissions and bring down the number of cases in the community.<br><br>15&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We ask all to observe the spirit of the circuit breaker measures. Individuals who need to leave their homes should do so <em>on their own</em>, and not in groups or as a household. These trips are not meant to be family outings. Likewise, if there is a need to exercise outside, we urge everyone to do so alone and in their immediate neighbourhoods, rather than travel unnecessarily to other parts of Singapore.&nbsp; &nbsp;<br><br>16&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We want to minimise the number of people out and about, to reduce the chances of community transmission. We understand that some members of the public will need to be accompanied by a caregiver, for example, frail seniors, the disabled, and young children. We encourage everyone to adhere to the spirit of the guidelines to minimise movement, and complete their tasks and return to their homes quickly.<br><br>17&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; There are some local areas that are susceptible to crowding at certain times, and where it is difficult to uphold safe distancing measures. The site owners may introduce access restrictions, and we ask that members of the public comply with them. In particular, at four popular wet markets (Geylang Serai Market; Blk 505, Jurong West St 52; Blk 20/21, Marsiling Lane; and Blk 104/105, Yishun Ring Road), entry will be permitted only on alternate dates, depending on the last digit of the individuals’ NRIC/FIN. Individuals with even/odd last digits in their NRIC/FIN will be allowed entry only on even/odd dates of the month respectively. This will help spread out the crowd over the week, and reduce the crowding and long queues seen at these popular markets, especially on weekends. Other wet markets, as well as supermarkets, which experience crowding, may also introduce similar access restrictions. The list of hotspot areas will be updated at <a href=\"https://www.nea.gov.sg/our-services/hawker-management/announcements\">https://www.nea.gov.sg/our-services/hawker-management/announcements</a>.<br><br><strong>Extension of Circuit Breaker Period<br><br></strong>18&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; These tighter measures will be in place minimally for a two-week period from 21 April 2020 until 4 May 2020 (inclusive). In view of the current situation, the Taskforce will also extend the circuit breaker period by another 4 weeks until 1 June 2020 (inclusive). &nbsp;We will continue to monitor the situation closely, and may be able to gradually ease some of the measures if there is a significant decline in our local transmission numbers. <br><br>19&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The Government will provide the same level of support to our workers and businesses, even as we extend the circuit breaker period. Please refer to the Ministry of Finance’s media release for details.<br><br>20&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; To fight COVID-19 successfully, all of us must play our part. Stay home; minimise the time spent outside; and strictly observe safe distancing measures. The Government is doing everything we can on multiple fronts to keep Singaporeans as well as our migrant workers safe. Please work with us.</p> <p><strong>&nbsp;</strong></p> <div><br clear=\"all\"> <hr align=\"left\" size=\"1\" width=\"33%\"> <div id=\"ftn1\"> <p><sup>[1]&nbsp;</sup>These cases comprise all Singapore Citizens, Permanent Residents and Pass holders (excluding work permit holders).</p> </div> </div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "strong-national-push-to-stem-spread-of-covid-19", "CurrentPageUrl": null}, {"Title": "1,111 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1587445500000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "21 Apr 2020", "Summary": "", "MainContent": "<div style=\"text-align: justify;\"><span style=\"font-family: Arial;\"><span style=\"font-size: 14px;\">&nbsp; &nbsp; &nbsp; &nbsp; As of 21 April 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 1,111 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders residing in foreign worker dormitories. 20 cases are Singaporeans/ Permanent Residents.<br><br>2. &nbsp; &nbsp; &nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight. </span></span></div><div style=\"text-align: justify;\"><span style=\"font-family: Arial;\"><span style=\"font-size: 14px;\"><br><strong>MINISTRY OF HEALTH<br>21 APRIL 2020</strong></span></span><br></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "1-111-new-cases-of-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}