{"pressItemDictionary": {"Press Releases": [{"Title": "Second Meeting of the Singapore - Malaysia Joint Working Group for COVID-19 ", "PublishedDate": "/Date(1585065600000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "25 Mar 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp; The second Singapore-Malaysia Joint Working Group (JWG) meeting was held via video conference on 24 March 2020. The meeting was co-chaired by Dr Lam Pin Min, Senior Minister of State for Transport and Health for Singapore, with his &nbsp;counterpart YB Dato’ Dr Haji Noor Azmi Ghazali, Deputy Minister for Health I for Malaysia.<br></p> <p style=\"text-align: justify;\">2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; At the meeting, both countries updated on the COVID-19 situations in their respective countries, shared existing temperature screening procedures at land and sea checkpoints, and discussed a set of protocols for the transfer of symptomatic travellers detected at entry screening back across the land and sea checkpoints between Singapore and Malaysia.<br></p> <p style=\"text-align: justify;\">3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The JWG agreed to continue entry screenings by both countries, align temperature screening protocols by applying the same temperature cut-off (&gt;37.5°C) for febrile travellers, and implement reciprocal arrangements for the transfer of symptomatic travellers detected at entry screening back across the land and sea checkpoints. The co-chairs tasked the senior officials of the JWG to coordinate the implementation of these initiatives, which would serve as a comprehensive package to enhance joint border screening at both the land and sea borders connecting Singapore and Malaysia.<br></p> <p style=\"text-align: justify;\">4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The JWG acknowledged the recent establishment of the Singapore – Malaysia Special Working Committee (SWC) on COVID-19 to discuss a joint plan to ensure the safe and sustainable movement of people, goods and services between both countries during Malaysia’s Movement Control Order. The JWG agreed to continue health discussions specific to these matters separately under the SWC.<br></p> <p style=\"text-align: justify;\">5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The third meeting of the JWG is planned for April 2020.</p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "second-meeting-of-the-singapore---malaysia-joint-working-group-for-covid-19", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}