{"pressItemDictionary": {"Press Releases": [{"Title": "253 More Cases Discharged, 257 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1595171400000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "19 Jul 2020", "Summary": "", "MainContent": "1. As of 19 July 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 257 cases of COVID-19 infection in Singapore. The breakdown of the cases is as follows:\n<br>\n<br><strong>a) Imported cases: 5</strong> (3 Singaporeans/Permanent Residents, 1 Work Permit holder, 1 Dependant’s Pass holder)\n<br>\n<br>Amongst the 5 imported cases, 3 (Cases 47737, 47785 and 47939) are Singaporeans/Permanent Residents who returned to Singapore from India on 26 June and 3 July, and from Azerbaijan on 4 July. The remaining 2 cases are a Dependant’s Pass holder (Case 47735) and Work Pass holder (Case 47745) who is currently employed in Singapore. They arrived in Singapore from India and Philippines on 7 July. All of them had been placed on 14-day Stay-Home Notice (SHN) upon arrival in Singapore, and had been tested while serving their SHN.\n<br>\n<br><strong>b) Cases in the community: 8 </strong>(2 Singaporeans, 1 Work Pass holder, 5 Work Permit holders)\n<br>\n<br>Of the 8 cases in the community, 6 were picked up as a result of our proactive surveillance and screening, and 1 had already been placed on quarantine earlier. 7 of the cases are asymptomatic, and were detected through our proactive testing. \n<br>\n<br>3 of the community cases today are linked to previous cases or clusters. Of these, 1 (Case 47807) had been identified as a contact of a previously confirmed case, and had been placed on quarantine earlier. She was tested during quarantine to determine her status, even though she is asymptomatic. Another case (Case 47809) was identified from our testing of individuals working in frontline COVID-19 operations. The remaining case (Case 47945) was swabbed for COVID-19 under our enhanced community testing to test all individuals aged 13 and above who are diagnosed with acute respiratory infection at first presentation to a doctor. \n<br>\n<br>5 of the community cases are currently unlinked. They are all asymptomatic, and were detected from our proactive screening. Of these, 3 cases (Cases 47746, 47808 and 47810) were identified as a result of our periodic screening of workers in essential services who are living outside the dormitories. The remaining cases (Cases 47747 and 47899) were tested as part of our efforts to screen individuals working in frontline COVID-19 operations. \n<br>\n<br>Epidemiological investigations of the unlinked cases are in progress. In the meantime, all the identified close contacts of the cases have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for their household contacts to determine if these cases could have been infected by them. \n<br>\n<br>Overall, the number of new cases in the community has decreased, from an average of 16 cases per day in the week before, to an average of 10 per day in the past week. The number of unlinked cases in the community has also decreased, from an average of 8 cases per day in the week before, to an average of 6 per day in the past week.&nbsp;We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.\n<br>\n<br><strong>c) Cases residing in dormitories: 244\n</strong><br>\n<br>We continue to pick up cases amongst Work Permit holders residing in dormitories, including in factory-converted dormitories, because of extensive testing in these premises, as part of our process to verify and test the status of all workers. \n<br>\n<br>2. Details of these trends can be found in MOH’s daily situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\">www.moh.gov.sg/covid-19/situation-report</a>). Please refer to <a title=\"Annex A\" href=\"/docs/librariesprovider5/default-document-library/annex-a-(19-jul).pdf?sfvrsn=b7fb2c0c_0\">Annex A</a>&nbsp;for the summary of the confirmed cases. \n<br>\n<br>3. Of the new cases, 98% are linked to known clusters, while the rest are pending contact tracing. \n<br>\n<br>4. The Inter-Agency Task Force has been systematically and progressively clearing dormitories through aggressive testing of migrant workers residing in dormitories. The dormitories at 3 Loyang Way 6 and 216 Tagore Lane have been cleared, and now house only recovered individuals and those who have recently tested negative for COVID-19 infection. As such, the clusters have now been closed.\n<br>\n<br><strong>Links between previous cases found\n</strong><br>\n<br>5. In the past week (12 July to 18 July), MOH has uncovered links for 3 previously unlinked cases in the community. \n<br>\n<br>6. Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <a title=\"Annex B\" href=\"/docs/librariesprovider5/default-document-library/annex-b-(19-jul).pdf?sfvrsn=557af58e_0\">Annex B</a>&nbsp;and <a title=\"Annex C\" href=\"/docs/librariesprovider5/default-document-library/annex-c-(19-jul).pdf?sfvrsn=b0d3a935_0\">Annex C</a>&nbsp;for details. \n<br>\n<br><strong>Update on condition of confirmed cases\n</strong><br>\n<br>7. 253 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 44,086 have fully recovered from the infection and have been discharged from hospitals or community care facilities. \n<br>\n<br>8. There are currently 181 confirmed cases who are still in hospital. Of these, most are stable or improving, and none is in the intensive care unit. 3,618 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 27 have passed away from complications due to COVID-19 infection. \n<br>\n<br>\n<strong><br>MINISTRY OF HEALTH\n<br>19 JULY 2020</strong>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "253-more-cases-discharged-257-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "257 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1595143560000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "19 Jul 2020", "Summary": "", "MainContent": "1. As of 19 July 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 257 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders residing in foreign worker dormitories. Based on our investigations so far, there are 8 cases in the community, of whom 2 are Singaporeans/ Permanent Residents and 6 are Work Pass holders.\n<br>\n<br>2. In addition, there are 5 imported cases who had been placed on Stay-Home Notice upon arrival in Singapore. \n<br>\n<br>3. We are still working through the details of the cases today, and further updates will be shared via the MOH press release that will be issued tonight. \n<br>\n<br>\n<br><strong>MINISTRY OF HEALTH\n<br>19 JULY 2020</strong>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "257-new-cases-of-covid-19-infection-19Jul", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}