{"pressItemDictionary": {"Press Releases": [{"Title": "President’s Award for Nurses 2020", "PublishedDate": "/Date(1595325600000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "21 Jul 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; Five nurses have been honoured with the President’s Award for Nurses this year, the highest accolade in Singapore’s nursing profession. This brings the total number of recipients since the inception of the award in 2000 to 77.&nbsp;<br><br>2.&nbsp; &nbsp; This national award recognises nurses who have shown sustained outstanding performance and contributions to patient care delivery, education, research and administration.&nbsp;<br><br>3.&nbsp; &nbsp; The award is open to all registered nurses from healthcare institutions in the public, private, and community care sectors, as well as the educational institutions. Nurses are nominated by their institutions, public or peers, and interviewed by a panel chaired by Dr Chia Shi-Lu.<br><br>4.&nbsp; &nbsp; This year’s award recipients include two from acute hospitals, and one each from hospice, national speciality centre and community nursing settings. Of the five recipients, two are Advanced Practice Nurses.<br><br>5.&nbsp; &nbsp; The five recipients are:&nbsp;<br><strong><br>- Ms Chin Soh Mun</strong><br>Director of Nursing, Dover Park Hospice<br><strong><br>- Dr Alice Chua Foong Sin</strong><br>Assistant Director of Nursing, Advanced Practice Nurse, National Cancer Centre&nbsp;Singapore<br><br><strong>- Ms Kala D/O Narayanasamy&nbsp;</strong><br>Deputy Director of Nursing, Woodlands Health Campus<br><br><strong>- Ms Tay Yee Kian</strong><br>Assistant Director of Nursing, Advanced Practice Nurse, Regional Health System Office, National University Health System&nbsp;<br><br><strong>- Ms Patricia Yong Yueh Li</strong><br>Deputy Director of Nursing, Singapore General Hospital<br><br>7.&nbsp; &nbsp; Each awardee received a trophy, a certificate signed by President and a $10,000 cash prize that can be used for their professional and personal development. More information on the award recipients is in the <a href=\"/docs/librariesprovider5/default-document-library/annex---award-recipients.pdf?sfvrsn=c4577b01_0\" title=\"Annex \">Annex </a>.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>21 JULY 2020</strong><br></p><div><br></div>", "PressCategory": ["Press Releases"], "CustomDetailUrl": "", "UrlName": "president-s-award-for-nurses-2020", "CurrentPageUrl": null}, {"Title": "399 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1595318400000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "21 Jul 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;As of 21 July 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 399 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders residing in foreign worker dormitories. Based on our investigations so far, there are 9 cases in the community, of whom 1 is a Singaporean and 8 are Work Pass holders. In addition, there are 3 imported cases who had been isolated or placed on Stay-Home Notice upon arrival in Singapore.&nbsp;<br><br>2.&nbsp; &nbsp; &nbsp; &nbsp;The higher number of cases today is mainly due to a batch of test results from the previous day reported to MOH after the 12pm cut-off for yesterday’s reporting.&nbsp;&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;<br><br><strong>MINISTRY OF HEALTH<br>21 JULY 2020</strong><br></p><div><br></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "399-new-cases-of-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}