{"pressItemDictionary": {"Press Releases": [{"Title": "Additional Precautionary Measures to Minimise  Risk of Community Spread in Singapore", "PublishedDate": "/Date(1580202000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "28 Jan 2020", "Summary": "", "MainContent": "<p><strong>Background</strong></p><p>1. &nbsp; &nbsp; &nbsp; &nbsp;The three latest confirmed cases over the past 24 hours indicate that the trend of infection among the population of Chinese nationals from Hubei province in Singapore is accelerating. All of the confirmed cases in Singapore thus far are Chinese nationals from Hubei. <br><br>2. &nbsp; &nbsp; &nbsp; &nbsp;This is similar to what is being observed elsewhere, including in other Chinese cities outside Hubei.&nbsp;&nbsp;According to the PRC authorities, 95 per cent of confirmed cases in Chinese cities were recently in Hubei, confirming that the infection has spread most widely in that province. <br><br>3. &nbsp; &nbsp; &nbsp; &nbsp;We expect to see more confirmed cases arising from this group in Singapore. While there is currently no evidence of community spread here, this group poses a heightened risk to Singapore. Therefore the Multi-Ministry Taskforce on the Wuhan coronavirus has decided to take further steps to limit the risk that travellers to Hubei pose to Singapore.<br><br><br><strong>Recent travellers from Hubei already in Singapore<br><br></strong>4. &nbsp; <strong>&nbsp; &nbsp; &nbsp;</strong>As the Taskforce announced yesterday, the Ministry of Health (MOH) is contacting all recent travellers from Hubei province who are in Singapore. MOH estimates that about 2,000 such persons have arrived here in the last two weeks, of whom roughly 1,000 are on short-term visas.<br><br>5. &nbsp; &nbsp; &nbsp; &nbsp;MOH will assess who among this group are at higher risk and will place them under quarantine.&nbsp;</p><p><p style=\"margin-left: 40px;\">a. &nbsp; &nbsp; Singapore Citizens, Permanent Residents and foreigners on long-term visas will be quarantined at home or other suitable facilities.<br><br>b. &nbsp; &nbsp; Those on short-term visas will be housed at Government Quarantine Facilities.</p><p style=\"\"><br><strong>Returning residents and long-term pass holders – either with travel history in Hubei OR with PRC passports issued in Hubei</strong></p></p><p><p>6. &nbsp; &nbsp; &nbsp; &nbsp;The following returning groups will be quarantined at home or other suitable facilities:</p></p><p><p style=\"margin-left: 40px;\">a. &nbsp; &nbsp; Residents (Singaporean Citizens/ PRs) with recent Hubei travel history within the last 14 days;<br><br>b. &nbsp; &nbsp; Long-term pass holders (including Work Passes and Permits, Student Pass, Dependent Pass and Long-term Visit Pass) with recent Hubei travel history within the last 14 days; and<br><br>c. &nbsp; &nbsp; PRs and long-term pass holders with PRC passports issued in Hubei.</p><p style=\"\">7. &nbsp; &nbsp; &nbsp; &nbsp;Quarantine orders have legal force, with severe penalties for non-compliance.<br><br><br><strong>New visitors with travel history in Hubei OR with PRC passports issued in Hubei<br><br></strong>8. &nbsp; &nbsp; &nbsp; &nbsp;From 29 January 2020, 12pm, all new visitors with recent Hubei travel history within the last 14 days, or those with PRC passports issued in Hubei, will not be allowed entry into Singapore, or transit through Singapore.<br><br>9. &nbsp; &nbsp; &nbsp; &nbsp;The Immigration and Checkpoints Authority (ICA) will suspend the issuance of all forms of new visas to those with PRC passports issued in Hubei with immediate effect.<br><br>10. &nbsp; &nbsp; &nbsp; Previously issued short-term and multiple-visit visas, as well as visa-free transit facilities, for those with PRC passports issued in Hubei, will also be suspended with immediate effect. During this period of suspension, they will not be allowed entry into Singapore.<br><br><br><strong>Remaining cautious and calm<br><br></strong>11. &nbsp; &nbsp; &nbsp; There is so far no evidence of community spread in Singapore. However there is international evidence of growing infection among Hubei residents and those who have visited the province. We are therefore taking further precautions to reduce the risk of community spread in Singapore, and to protect Singaporeans. The Taskforce will continue to monitor the situation and take further steps as needed, depending on how the situation develops.<br><br>12. &nbsp; &nbsp; &nbsp; Meanwhile, Singaporeans can play their part by being socially responsible and practising good personal hygiene habits. Singaporeans are reminded to wash their hands regularly. Those who are unwell should wear a mask and see a doctor immediately. However, there is no general necessity to wear a mask if you are well.<br><br>13. &nbsp; &nbsp; &nbsp; We urge Singaporeans to remain calm, and to refer to official sources such as the MOH website or subscribe to the gov.sg WhatsApp, to get the latest updates on the situation.<br><br><br><strong>MINISTRY OF HEALTH<br></strong><strong>28 JANUARY 2020</strong></p></p>", "PressCategory": ["Press Releases"], "CustomDetailUrl": "", "UrlName": "additional-precautionary-measures-to-minimise-risk-of-community-spread-in-singapore", "CurrentPageUrl": null}, {"Title": "Two more confirmed imported cases of Wuhan coronavirus infection in Singapore", "PublishedDate": "/Date(1580202000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "28 Jan 2020", "Summary": "", "MainContent": "<p style=\"text-align: left;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As of 28 January 2020, 12pm, the Ministry of Health (MOH) has confirmed an additional two imported cases of Wuhan coronavirus infection in Singapore. Five confirmed cases were earlier announced by MOH.<br><br><strong>About the cases<br><br></strong><u>Sixth case<br><br></u>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;The six confirmed case is a&nbsp;<a name=\"m_-8198993966986806108_m_-8381106143550367804_OLE_LINK2\">56 year-old male Chinese national from Wuhan&nbsp;</a>who arrived in Singapore with his family on 19 January. He is currently warded in an isolation room at Changi General Hospital (CGH) and his condition is stable.<br><br>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;The case reported that he was asymptomatic during the flight to Singapore. He subsequently developed symptoms on 25 January, and self-presented to CGH in a private car on 26 January. He was classified as a suspect case and immediately isolated. Subsequent test results confirmed Wuhan coronavirus infection on 27 January at about 11pm.<br><br>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Prior to hospital admission, the case stayed with his family at their home at Pasir Ris Grove.<br><br><u>Seventh case<br><br></u>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;The seventh confirmed case is a 35 year-old&nbsp;male&nbsp;Chinese national from Wuhan who arrived in Singapore on 23 January with family and friends. He is currently warded in an isolation room at the National Centre for Infectious Diseases (NCID) and his condition is stable.<br><br>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;The case reported that he was asymptomatic during the flight to Singapore. He subsequently developed symptoms on 24 January, and self-presented to Raffles Hospital via public transport on the same day. He was classified as a suspect case and immediately conveyed to NCID via an ambulance. Subsequent test results confirmed Wuhan coronavirus infection on 27 January at about 11pm.<br><br>7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Prior to hospital admission, the case stayed at Marina Bay Sands Singapore located at 10 Bayfront Avenue, and had travelled on public transport.&nbsp;The risk of infection from transient contact, such as on public transport or in public places, is assessed to be low.<br><br>8.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;MOH has initiated epidemiological investigations and contact tracing to identify individuals who had close contact with the cases. Both cases have&nbsp;no known links to the other confirmed imported cases.<br><br><strong>Health advisory<br><br></strong>9.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Singaporeans are advised to defer all travel to Hubei Province and all non-essential travel to Mainland China.<br><br>10.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;All travellers should monitor their health closely for two weeks upon return to Singapore and seek medical attention promptly if they feel unwell. Travellers should inform their doctor of their travel history. If they have a fever or respiratory symptoms (e.g. cough, shortness of breath), they should wear a mask and call the clinic ahead of the visit.<br><br>11.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Travellers and members of the public should adopt the following precautions at all times:<br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Avoid contact with live animals including poultry and birds, and consumption of raw and undercooked meats;<br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Avoid close contact with people who are unwell or showing symptoms of illness;<br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Observe good personal hygiene;<br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Practise frequent hand washing with soap (e.g. before handling food or eating, after going to toilet, or when hands are dirtied by respiratory secretions after coughing or sneezing);<br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Wear a mask if you have respiratory symptoms such as a cough or shortness of breath;<br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Cover your mouth with a tissue paper when coughing or sneezing, and dispose the soiled tissue paper in the rubbish bin immediately; and<br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Seek medical attention promptly if you are feeling unwell.<br><br>12.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;MOH will continue to monitor the situation closely. As medical practitioners are on the lookout for cases with pneumonia who have recently been in China, Singapore is likely to see more suspect cases that will need to be investigated for possible links to the Wuhan cluster.</p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "two-more-confirmed-imported-cases-of-wuhan-coronavirus-infection-in-singapore", "CurrentPageUrl": null}, {"Title": "Update on Wuhan Coronavirus Infection in Singapore", "PublishedDate": "/Date(1580148000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "28 Jan 2020", "Summary": "", "MainContent": "<p><strong><u>Update on Wuhan Coronavirus Infection in Singapore</u></strong></p><p><u>Update on suspect cases</u><br></p><p>As of 28 January, 12pm, 91 of the suspect cases have tested negative for the Wuhan coronavirus, and seven have tested positive. Test results for the remaining 72 cases are pending.<br></p><p><u>Update on contact tracing for confirmed cases</u><br></p><p>MOH has identified 160 close contacts from seven confirmed cases. Of the 130 who are still in Singapore, 116 have been contacted and are being quarantined or isolated. Efforts are ongoing to contact the remaining 14 close contacts.<br></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "update-on-wuhan-coronavirus-infection-in-singapore-28Jan", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}