{"pressItemDictionary": {"Press Releases": [{"Title": "Controlling the Outbreak, Preparing for the Next Phase", "PublishedDate": "/Date(1589278800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "12 May 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The various initiatives implemented by the Multi-Ministry Taskforce have substantially reduced the number of COVID-19 infections in the community, and stabilised the infections at the foreign worker dormitories. The number of new daily community cases are at its lowest since mid-March, and more migrant workers are recovering. The Taskforce has also implemented plans for a systemic clearance of migrant worker dormitories, to ensure that migrant workers are well and can safely resume work when their sectors gradually re-open after the end of the circuit breaker period.&nbsp;<br><br><strong>Controlling the outbreak in the Community and Dormitories<br></strong><br>2.&nbsp; &nbsp; &nbsp; The circuit breaker measures have achieved our objective of substantially reducing COVID-19 infections locally. The number of new cases in the community has continued to fall to 8 new cases daily in the past week. <span style=\"text-decoration: underline;\"><a href=\"/docs/librariesprovider5/default-document-library/annex-acbdec1b8a5f74716858480ccd431c781.pdf?sfvrsn=be7d66da_0\" title=\"Annex A\">Annex A</a></span> provides details of the trend of infection in the community.&nbsp;<br><br>3.&nbsp; &nbsp; We have also made progress in controlling the outbreak in the migrant worker dormitories. From 20 April to 26 April 2020, there were 686 workers from the Purpose Built Dormitories reporting sick every day with acute respiratory symptoms. The figure has come down to 463 workers last week. However, we are still picking up many cases every day across the dormitories (average of 700 cases per day in the past week) because of our extensive testing regime, covering the workers who are well and asymptomatic. We are doing this to verify and test the status of all workers, so that we can provide them with the necessary medical care and eventually allow them to resume work. With the aggressive testing regime of all migrant workers living in dormitories, we expect the reported daily confirmed cases to remain high for some time.<br><br>4.&nbsp; &nbsp; Thus far, 1,735 migrant workers have recovered and have been discharged. Significantly more are expected to enter the recovery phase in the coming weeks. We expect as many as 20,000 migrant workers to be ready for discharge by the end of this month. These recovered migrant workers are assessed to be well and are no longer infectious. They will be returned to their dormitories or transferred to other temporary accommodations after they are discharged.&nbsp;<br><br>5.&nbsp; &nbsp; &nbsp;If we continue with this trend of low new community cases, we will be in a good position to ease the measures in a careful and calibrated manner after the circuit breaker period. As we do so, we have to be prepared for new cases emerging in the community. The key is to be able to detect these cases quickly and prevent large clusters from forming. That is why we are building up our capacity for faster contact tracing and more comprehensive testing [1].&nbsp;<br><br><strong>Process to Clear Migrant Worker Dormitories<br></strong><br>6.&nbsp; &nbsp; &nbsp; &nbsp;The Multi-Ministry Taskforce has embarked on a systematic plan to test all migrant workers in the dormitories to ensure that the workers are well, and can safely resume work when their sectors gradually re-open. The plan employs a mix of COVID-19 polymerase chain reaction (PCR) tests and serological tests.&nbsp;<br><br>7.&nbsp; &nbsp; &nbsp; &nbsp; The Ministry of Health (MOH) has been testing more than 3,000 migrant workers in the dormitories daily, and will increase the rate of testing over time, as we build up our testing capacity. To date, more than 32,000 migrant workers in dormitories have been tested. Many of these workers showed no symptoms when they were tested.<br><br>8.&nbsp; &nbsp; &nbsp; We have thus far relied on the COVID-19 PCR test to diagnose if someone is currently infected in Singapore. This is the accepted testing standard used globally. Increasingly, the use of serological tests has also helped different nations understand the progression of the disease in their populations and manage the outbreak. Serological tests detect antibodies to COVID-19 from a blood sample, as a marker of past infection. Typically, individuals who have been infected by COVID-19 more than 10 to 14 days ago will have a positive serology test. We have used serology testing in research and among selected populations, and will start to use this among migrant workers.<br><br>9.&nbsp; &nbsp; &nbsp; &nbsp;Our strategy to test and clear all migrant workers over the coming weeks will therefore involve a combination of mass serological and mass PCR tests. For the dormitories with higher levels of infection, we will apply serological testing to the workers. Those with a positive serological test would have been infected in the past (at least 10 to 14 days ago), and would no longer be infectious after a period of isolation. For those with a negative serological test, and for the workers in the other dormitories, we will apply the PCR tests either individually or in batches [2]. The protocol requires those who are negative to be isolated for a further 14 days before we re-swab to confirm they are negative. This is because a PCR test before Day 14 will not be able to exclude that disease may develop later on during the incubation period.&nbsp;<br><br>10.&nbsp; &nbsp; &nbsp; &nbsp; The testing regime has already started, and will take some time to complete. We will do this systematically across all the dormitories to ensure the health and wellbeing of every worker.<br><br><strong>Preparing for the Next Phase<br></strong><br>11.&nbsp; &nbsp; &nbsp; &nbsp;We are seeing lower numbers of new community cases daily, and we are making progress in our efforts to test the workers and clear the dormitories. We are also ramping up our testing capacity, and strengthening our contact tracing abilities. With these plans and enablers, we will be ready to gradually ease the circuit breaker restrictions and resume normal activities safely.&nbsp;<br><br><strong>MINISTRY OF HEALTH<br>12 MAY 2020<br><br></strong>[1] We have conducted over 224,262 tests for COVID-19, or 3,900 tests per hundred thousand people in Singapore. This is among the highest testing rates in the world. Currently, we have the capacity to conduct more than 8,000 PCR tests a day, and will further ramp up our testing capacity to up to 40,000 a day by later this year.<br><br>[2] Such pooled tests involve combining swabs of up to five individuals into one laboratory test, which does not affect the sensitivity of the tests. Where a pooled test is positive, the original five individuals could be re-tested individually to identify the infected person. This is an effective strategy where the infection prevalence rates are likely to be low.<br></p>", "PressCategory": ["Press Releases"], "CustomDetailUrl": "", "UrlName": "controlling-the-outbreak-preparing-for-the-next-phase", "CurrentPageUrl": null}, {"Title": "884 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1589267100000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "12 May 2020", "Summary": "", "MainContent": "<div style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 14px;\">&nbsp; &nbsp;&nbsp; As of 12 May 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 884 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders residing in foreign worker dormitories. Three cases are Singaporeans/ Permanent Residents.<br><br></span><span style=\"font-family: Arial; font-size: 14px;\">2. &nbsp; &nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight. </span></div><div style=\"text-align: justify;\"><span style=\"font-family: Arial;\"><span style=\"font-size: 14px;\"><br><strong>MINISTRY OF HEALTH<br>12 MAY 2020</strong></span></span><br></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "884-new-cases-of-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}