{"pressItemDictionary": {"Press Releases": [{"Title": "277 More Cases Discharged; 93 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1597849800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "19 Aug 2020", "Summary": "", "MainContent": "<span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As of 19 August 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 93 cases of COVID-19 infection in Singapore. The breakdown of the cases is as follows:<br><br><strong>a)&nbsp; &nbsp; Imported cases: 6 </strong>(2 Singaporeans, 1 Work Permit holder, 2 Dependant’s Pass holders, 1 Student’s Pass holder)<br>&nbsp;<br>Amongst the 6 imported cases, 2 (Cases 56046 and 56105) are Singaporeans who returned to Singapore from India on 7 August and the UAE on 8 August. 2 other cases (Cases 56113 and 56114) are Dependant’s Pass holders who arrived from India on 10 August. Another case (Case 56023) is a Work Permit holder currently employed in Singapore, who arrived from China on 7 August. The remaining case (Case 56024) is a Student’s Pass holder who arrived from Vietnam on 7 August. All of them had been placed on 14-day Stay-Home Notice (SHN) upon arrival in Singapore, and had been tested while serving their SHN.<br>&nbsp;<br><strong>b)&nbsp; &nbsp; Cases in the community: 2</strong> (2 Work Permit holders)<br>&nbsp;<br>Both cases in the community were picked up as a result of our proactive surveillance and screening, even though they are asymptomatic. Cases 56100 and 56104 were detected from our periodic testing of workers in essential services who are living outside the dormitories. Epidemiological investigations of the cases are in progress. In the meantime, all their identified close contacts have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for their household contacts to determine if these cases could have been infected by them.<br>&nbsp;<br>Overall, the number of new cases in the community has remained stable at an average of 2 cases per day in the past 2 weeks. The number of unlinked cases in the community has also remained stable at an average of 1 case per day in the past 2 weeks. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br>&nbsp;<br><strong>c)&nbsp; &nbsp; Cases residing in dormitories: 85</strong><br>&nbsp;<br>The Inter-agency Taskforce has completed the testing of all workers in the dormitories. There are currently about 16,800 workers who are still serving out their quarantine period. These workers will be tested when their quarantine ends, and we expect the case counts to remain high in the coming days, before tapering down thereafter.<br><br>2.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Details of these trends can be found in MOH’s daily situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\" title=\"\" class=\"\" target=\"\">www.moh.gov.sg/covid-19/situation-report</a>). Please refer to <span style=\"text-decoration: underline;\"><a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-a---19-aug-2020.pdf?sfvrsn=6ff39468_0\" title=\"Annex A\">Annex A</a></span> for the summary of the confirmed cases.<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Of the new cases, 95% are imported or linked to known cases/ clusters, while the rest are pending contact tracing.<br><br>4.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;The dormitories at 2 Fan Yoong Road, 10 Shaw Road and 15 Tuas View Square have been cleared by the Inter-agency Taskforce, and now house only recovered individuals and those who have recently tested negative for COVID-19 infection. As such, the clusters have now been closed.<br><br>5.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;MOH has contacted 321 individuals who had visited Jewel Music Box KTV at HomeTeamNS Khatib on 1 August and 2 August, and facilitated COVID-19 testing for them. This is a precautionary measure following the detection of 3 cases (Cases 55169, 55469 and 55712) who had visited the KTV during the affected dates, even though the risk of infection for visitors is assessed to be low. So far, a total of 293 individuals have been swabbed, and 193 test results have been processed. All 193 test results have come back negative for COVID-19, including 4 individuals who had reported acute respiratory infection symptoms, and were conveyed to the hospital for further medical assessment. 100 conducted swabs are pending test results. MOH is facilitating testing for the remaining 28 individuals who have yet to be swabbed.<br><strong>&nbsp;<br>Links between previous cases found</strong><br><br>6.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <span style=\"text-decoration: underline;\"><a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-b---19-aug-2020.pdf?sfvrsn=5bf55906_0\" title=\"Annex B\">Annex B</a></span> and <span style=\"text-decoration: underline;\"><a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-c---19-aug-2020.pdf?sfvrsn=874742cc_0\" title=\"Annex C\">Annex C</a></span> for details.<br><strong><br>Update on condition of confirmed cases</strong><br><br>7.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;277 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 52,810 have fully recovered from the infection and have been discharged from hospitals or community care facilities.<br><br>8.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;There are currently 87 confirmed cases who are still in hospital. Of these, most are stable or improving, and none is in the intensive care unit. 3,107 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 27 have passed away from complications due to COVID-19 infection.<br><br><br><strong>MINISTRY OF HEALTH<br>19 AUGUST 2020</strong><br><br>&nbsp;</span>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "277-more-cases-discharged-93-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "93 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1597822500000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "19 Aug 2020", "Summary": "", "MainContent": "<p><span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As of 19 August 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 93 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders currently under quarantine. Based on our investigations so far, there are 2 cases in the community, both of whom are Work Pass holders.<br><br>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In addition, there are 6 imported cases, who had all been placed on Stay-Home Notice upon arrival in Singapore. <br><br>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.<br><br><strong>MINISTRY OF HEALTH<br></strong><strong>19 AUGUST 2020</strong></span></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "93-new-cases-of-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}