{"pressItemDictionary": {"Press Releases": [{"Title": "Measures to Contain the Covid-19 Outbreak In Migrant Worker Dormitories", "PublishedDate": "/Date(1607938740000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "14 Dec 2020", "Summary": "", "MainContent": "1.&nbsp; &nbsp; &nbsp;The vast majority of the COVID-19 cases in Singapore occurred in migrant worker dormitories, where the SARS-CoV-2 virus spread quickly due to their communal living arrangements. Earlier health and safe distancing measures turned out to be inadequate, given the highly infectious nature of the novel virus, and because pre-symptomatic and asymptomatic transmission was also taking place.&nbsp;<br><br>2.&nbsp; &nbsp; &nbsp;In all, 54,505 out of the 58,320 who tested positive in Singapore for COVID-19 via a Polymerase Chain Reaction (PCR) test were migrant workers living in dormitories. This is out of a total of over 320,000 migrant workers who live in dormitories [1].&nbsp; At the peak of the outbreak in April, more than 1,000 new cases a day were being detected in the dormitories.&nbsp;[2]<br><br>3.&nbsp; &nbsp; &nbsp;We acted swiftly and decisively to stabilise the situation in the dormitories. Working closely with dormitory operators, employers, the medical community, NGOs and other community groups, we contained the outbreak and cleared the dormitories of the virus. By August, all migrant workers living in dormitories had been tested for COVID-19 at least once. Almost all of them have since also been cleared to resume work safely.<br><br>4.&nbsp; &nbsp; &nbsp;Despite the scale of the outbreak in the dormitories, the morbidity and mortality rate among our migrant workers has been very low. There were 25 COVID-19-related ICU admissions amongst migrant workers living in dormitories and only two deaths due to COVID-19, including one of those who had been admitted to the ICU.&nbsp;<br><br><strong>Containment and testing strategy</strong>&nbsp;<br><br><em><span style=\"text-decoration: underline;\">April – May 2020: Containing the outbreak</span></em>&nbsp;<br><br>5.&nbsp; &nbsp; &nbsp;Initially, our top priority was to contain the spread of COVID-19 in the dormitories. We placed all dormitories under isolation by mid-April, in line with the national Circuit Breaker measures. Throughout this phase, we stepped up our capacity to detect and isolate cases in the dormitories, and to care for the health of all our migrant workers.<br><br>6.&nbsp; &nbsp; &nbsp;We stepped up testing to help us assess the situation in each dormitory. By the end of April, 1 in every 15 workers in dormitories had been PCR tested, far higher than the testing rates in other countries. Even so, due to the large numbers, we were not able to test all the migrant workers in the dormitories at once. We prioritised PCR testing for migrant workers in essential services so they could be cleared to continue working safely during the Circuit Breaker period.&nbsp;<br><br>7.&nbsp; &nbsp; &nbsp;At the same time, any worker who reported sick or showed symptoms of acute respiratory infection during this period was isolated, and given medical care regardless of whether he had received a PCR test.<br><br>8.&nbsp; &nbsp; &nbsp;To complement the testing and identify potential new cases quickly, thermometers and more than 25,000 oximeters were distributed. Every migrant worker living in the dormitories checked and reported his temperature and oximeter readings twice a day. Medical teams monitored these reports, and intervened early when they found abnormalities.&nbsp;<br><br>9.&nbsp; &nbsp; &nbsp;Medical support was set up at the dormitories by the end of April to care for those who were unwell, and monitor the health of those who were well. These included:<br><br>&nbsp; &nbsp; &nbsp;a.&nbsp; &nbsp; &nbsp;Medical posts staffed by teams of doctors, nurses and technicians at all 43 Purpose-Built Dormitories (PBDs).&nbsp;<br><br>&nbsp; &nbsp; &nbsp;b.&nbsp; &nbsp; &nbsp;8 medical posts, complemented by roving medical teams, that served all non-PBDs (e.g. Factory-Converted Dormitories and Construction Temporary Quarters).&nbsp;<br><br>Migrant workers living in the community also had access to the nation-wide network of more than 900 Public Health Preparedness Clinics and Polyclinics.&nbsp;<br><br><span style=\"text-decoration: underline;\"><em>June – August 2020: Clearing the dormitories of COVID-19 infection</em></span>&nbsp;<br><br>10.&nbsp; &nbsp; &nbsp;By June, our focus shifted to clearing the dormitories of COVID-19, so the migrant workers could resume work safely. Testing was key.&nbsp;<br><br>11.&nbsp; &nbsp; &nbsp;Our measures reflected the growing scientific understanding of COVID-19. We were discovering that a significant number of infected persons had no or mild symptoms, but could nevertheless spread COVID-19 to others. We also found that infected persons who had recovered could still continue shedding non-infectious viral fragments for several months.<br><br>12.&nbsp; &nbsp; &nbsp;Our testing strategy therefore had to help us distinguish who had never been infected; who had had an old infection but had since recovered; and who was currently infected and still harbouring the virus, with or without symptoms. This would help us separate those who had never been infected or had had the virus earlier but were no longer infectious, from those who were currently infected or potentially harbouring the virus even without symptoms.<br><br>13.&nbsp; &nbsp; &nbsp;Over time, more testing methods were becoming available, including serology tests. While PCR tests are used to diagnose current or new infections, serology tests identify those who had been infected in the past, by detecting the presence of COVID-19 antibodies in blood samples.&nbsp;&nbsp;<br><br>14.&nbsp; &nbsp; &nbsp;A detailed comparison of various testing methods used is in <span style=\"text-decoration: underline;\"><a href=\"/docs/librariesprovider5/default-document-library/appendix-i47e4ee9f78bc41d0a14c14d70143467c.pdf?sfvrsn=da169db1_0\" title=\"Appendix I\">Appendix I</a></span>.&nbsp;<br><br>15.&nbsp; &nbsp; &nbsp;In June, we took the extraordinary decision to systematically test all migrant workers living in dormitories, symptomatic or otherwise. In dormitories with a high incidence of infections, we applied a differentiated approach. All workers in these dormitories were screened with a combination of serology as well as PCR tests.&nbsp;<br><br>&nbsp; &nbsp; &nbsp;a.&nbsp; &nbsp; &nbsp;If they tested serology-positive, it meant that they had been infected earlier. These workers underwent a seven-day period of isolation, at the end of which we could be confident that they were no longer infectious, and did not need to be tested further.<br><br>&nbsp; &nbsp; &nbsp;b.&nbsp; &nbsp; &nbsp;Those who tested serology-negative were separately isolated for a longer period of 14 days, in case they were incubating the virus despite being asymptomatic. They were given a PCR test at the end of the isolation period to confirm that they were free from infection.<br><br>16.&nbsp; &nbsp; &nbsp;This combination of PCR and serology tests enabled us avoid isolating or quarantining recovered workers for prolonged periods, so that they could return to their dormitories or workplaces sooner.&nbsp;<br><br>17.&nbsp; &nbsp; &nbsp;By August, all migrant workers had been tested at least once for COVID-19. We were confident that the outbreak had been contained. By early November, more than 98 per cent of our migrant workers living in dormitories were cleared to resume work.&nbsp;<br><br><strong>Overall case count and prevalence rate</strong><br>&nbsp;<br>18.&nbsp; &nbsp; &nbsp;Our comprehensive testing strategy has provided us a more complete picture of the prevalence of COVID-19 in our migrant worker dormitories.&nbsp;<br><br><span style=\"text-decoration: underline;\"><em>PCR and serology test results of migrant workers</em></span><br><br>19.&nbsp; &nbsp; &nbsp;As at 13 December 2020:&nbsp;<br><br>&nbsp; &nbsp; &nbsp;a.&nbsp; &nbsp; &nbsp;54,505 dormitory residents have tested positive using the PCR test.&nbsp;<br><br>&nbsp; &nbsp; &nbsp;b.&nbsp; &nbsp; &nbsp;Another 98,289 have tested serology-positive though they did not have a positive PCR test.&nbsp;<br><br>The data is summarised in Table 1.&nbsp;<br><br><p align=\"center\"><u>Table 1: Dormitory-dwelling migrant workers and their test results (as at </u><u>13 December 2020</u><u>)</u></p> <div align=\"center\"> <table border=\"1\" cellspacing=\"0\" cellpadding=\"0\" width=\"601\"> <tbody><tr> <td width=\"301\" valign=\"top\"> <p>A. PCR-positive* </p> </td> <td width=\"301\" valign=\"top\"> <p>54,505</p> </td> </tr> <tr> <td width=\"301\" valign=\"top\"> <p>B. Serology-positive only </p> </td> <td width=\"301\" valign=\"top\"> <p>98,289</p> </td> </tr> <tr> <td width=\"301\" valign=\"top\"> <p>Ratio of PCR-positive to serology-positive only (A:B)</p> </td> <td width=\"301\" valign=\"top\"> <p>1:1.8</p> </td> </tr> <tr> <td width=\"301\" valign=\"top\"> <p>Prevalence rate, i.e. (A+B)/(total dormitory dwellers)</p> </td> <td width=\"301\" valign=\"top\"> <p>47% (of 323,000 dormitory dwellers)</p> </td> </tr> <tr> <td width=\"601\" colspan=\"2\" valign=\"top\"> <p><em>*Including some who have tested both PCR-positive and serology-positive.</em></p> </td> </tr> </tbody></table> </div><br>20.&nbsp; &nbsp; &nbsp;Among the migrant workers who tested PCR-positive or serology-positive, the vast majority were asymptomatic or had very mild symptoms. Only about 1 in 5 of migrant workers living in PBDs presented with symptoms, with the remaining 4 in 5 displaying very mild or no symptoms.&nbsp;[3]<br><br>21.&nbsp; &nbsp; &nbsp;Including the serology test results, the prevalence rate of COVID-19 in the dormitories is currently 47 per cent. For every COVID-19 infection in the dormitories detected through PCR testing, another 1.8 cases were untested and undetected at the time, and were identified subsequently only through serology testing. This is not surprising as many migrant workers did not have any symptoms, and thus would not have sought treatment and received a PCR test in the process. The ratio of PCR-positive to serology-positive among migrant workers in dormitories is comparable to the ratio of 1:1.8 for the whole of South Korea, and lower than 1:4 in Spain, and 1:15 in France [4]. Our low ratio reflects the extensive PCR testing we carried out in the dormitories.<br><br><span style=\"text-decoration: underline;\"><em>Reporting of cases</em></span><br><br>22.&nbsp; &nbsp; &nbsp;Singapore reports COVID-19 cases in accordance with international practice. Every case who tested positive through a PCR test and was assessed to be an acute infection is reported and included in our case count. We follow WHO’s criterion that only positive results from confirmatory tests (i.e. PCR tests) are included in the case count. This ensures consistency in reporting cases across countries.<br><br>23.&nbsp; &nbsp; &nbsp;A different approach is taken for reporting the results of serology tests. As these tests identify past cases of infection, they are used to aid epidemiological investigations and for retrospective assessment of the overall prevalence of infections within a population. Therefore, serology test outcomes are aggregated and presented as an estimate of prevalence in the population, separate from the daily case counts.&nbsp;<br><br>24.&nbsp; &nbsp; &nbsp;Most countries only do serology testing on a sampling basis, to estimate the prevalence of infections in a population. But Singapore went further to do serology tests on our entire population of migrant workers living in the dormitories. This was a unique aspect of our efforts to clear the dormitories of COVID-19.&nbsp;<br><br>25.&nbsp; &nbsp; &nbsp;As at 13 December 2020, we are still in the process of completing serology tests for 65,000 or so migrant workers living in dormitories who had not taken a serology test before. This will give us the full picture of the infection prevalence among our migrant workers.&nbsp;<br><br><strong>Phase Three</strong>&nbsp;<br><br>26.&nbsp; &nbsp; &nbsp;Having tested all migrant workers living in the dormitories, we will continue with Rostered Routine Testing (RRT) of every worker who may still be susceptible to infection, in order to detect and contain new infections rapidly. All such workers living in dormitories, and those who work in the construction, marine and process (CMP) sectors, have been undergoing RRT once every 14 days.&nbsp;<br><br>27.&nbsp; &nbsp; &nbsp;After several RRT cycles, the number of new infections have remained very low. Since October, no new cases were detected in the dormitories on many days.&nbsp;<br><br>28.&nbsp; &nbsp; &nbsp;Having brought the outbreak in the dormitories under control, and instituted Safe Living and Safe Working measures at all dormitories and worksites, we will progressively ease the restrictions on migrant workers.&nbsp;<br><br>&nbsp; &nbsp; &nbsp;a.&nbsp; &nbsp; &nbsp;With the transition into Phase Three, we are preparing to return migrant workers to the community in a controlled manner, with strict measures in place.<br><br>&nbsp; &nbsp; &nbsp;b.&nbsp; &nbsp; &nbsp;We will start a pilot scheme in the first quarter of 2021 to allow migrant workers in some dormitories to access the community once a month, subject to compliance with RRT, wearing of contact-tracing devices and safe living measures.<br><br>29.&nbsp; &nbsp; &nbsp;We will continue to keep our migrant workers safe, and to ensure that we detect and contain any new cases or clusters quickly.&nbsp;<br><br>&nbsp; &nbsp; &nbsp;a.&nbsp; &nbsp; &nbsp;Meanwhile, we are monitoring the earliest cohort of migrant workers who have recovered from COVID-19 and are currently exempt from RRT. We are studying how their antibodies change over time. We will resume RRT for these workers if we detect their antibodies starting to fade, or if there is evidence of re-infection among them.&nbsp;<br><br>&nbsp; &nbsp; &nbsp;b.&nbsp; &nbsp; &nbsp;We will continue our multi-layered strategy of aggressive routine testing using both PCR and antigen rapid testing, accompanied by isolation strategies.<br><br>&nbsp; &nbsp; &nbsp;c.&nbsp; &nbsp; &nbsp;By end-December, we will complete distributing contact-tracing devices to more than 450,000 workers living in dormitories, or working in the construction, marine and process sectors. These devices will improve our ability to isolate and ringfence potential cases once they are detected.&nbsp;<br><br>&nbsp; &nbsp; &nbsp;d.&nbsp; &nbsp; &nbsp;We are also building new dormitories with improved safety standards to minimise the risk of a resurgence of COVID-19 among migrant workers, and prevent new public health threats.&nbsp;<br><br>30.&nbsp; &nbsp; &nbsp;The Government will continue to work with our partners and the community to ensure a safe living and working environment for our migrant workers, as we move towards Phase Three.&nbsp;<br><br><br>[1] Includes all Purpose-Built Dormitories (PBDs) and non-PBDs (e.g. Factory-Converted Dormitories, Construction Temporary Quarters, and temporary living quarters).<br><br>[2] Our highest daily COVID-19 case count in the dormitories was recorded on 20 April 2020, with a total of 1,397 new cases detected among dormitory residents that day.<br><br>[3] Based on a study of migrant workers living in PBDs who had tested positive by PCR or serology tests as of 25 July 2020.<br><br>[4] Lai et al. Population-based seroprevalence surveys of anti-SARS-CoV-2 antibody: An up-to-date review. Int Journal of Infectious Diseases 101 (2020) 314-322.", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "measures-to-contain-the-covid-19-outbreak-in-migrant-worker-dormitories", "CurrentPageUrl": null}, {"Title": "Expert Committee On Covid-19 Vaccination Endorses Use of Pfizer-biontech Covid-19 Vaccine", "PublishedDate": "/Date(1607938680000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "14 Dec 2020", "Summary": "", "MainContent": "<strong>Press release by the Expert Committee on COVID-19 Vaccination <br></strong><br>1. The Expert Committee on COVID-19 Vaccination welcomes the interim authorisation of the Pfizer-BioNTech COVID-19 vaccine by the Health Sciences Authority (HSA), for use in Singapore in individuals aged 16 years and above to prevent COVID-19 disease, in view of the pandemic conditions globally. \n<br>\n<br>2. The Expert Committee has reviewed the Pfizer-BioNTech vaccine’s safety and efficacy data for different population segments in Singapore, and been briefed by HSA on its full range of considerations in granting interim authorisation, and is thus satisfied with its safety and efficacy. The vaccine demonstrated a high vaccine efficacy of 95%, and its safety profile is consistent with the high standards set for other registered vaccines used in the immunisation against other diseases. We agree with HSA’s recommendation for the suitability of its use in individuals aged 16 years and above in Singapore. However pregnant women, immuno-compromised persons and those under the age of 16 should not receive the vaccine yet, until more data is available.\n<br>\n<br>3. The Expert Committee further recommends that Singapore should achieve as comprehensive a coverage of COVID-19 vaccination as possible across its entire population, and everyone who is medically eligible should be vaccinated, although vaccination should remain voluntary. \n<br>\n<br>4. As vaccine supply will arrive in Singapore in batches over several months as manufacturers ramp up their production of vaccines, we recommend that vaccination should start with groups who are at greater risk and hence most in need of COVID-19 vaccination, including healthcare workers and COVID-19 frontline workers, as well as vulnerable groups at greater risk of severe disease from COVID-19 infection, such as the elderly. \n<br>\n<br>5. We will provide further details regarding our complete set of recommendations to the government on the use and priority groups for vaccination in the coming weeks.\n<br>\n<br>\n<strong><br>EXPERT COMMITTEE ON COVID-19 VACCINATION \n<br>14 DECEMBER 2020\n</strong><br>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "expert-committee-on-covid-19-vaccination-endorses-use-of-pfizer-biontech-covid-19-vaccine", "CurrentPageUrl": null}, {"Title": "Moving Into Phase Three of Re-opening", "PublishedDate": "/Date(1607938200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "14 Dec 2020", "Summary": "", "MainContent": "<p><span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp; As we have made good progress on the key enablers supporting further resumption of activities, the Multi-Ministry Taskforce will start Phase Three of re-opening from 28 December 2020. Even as we cross this milestone, we must continue to remain vigilant in the coming months and avoid an uncontrolled resurgence of cases which could slow or even reverse our progress.&nbsp;<br><br><strong>UPDATE ON ENABLERS FOR MOVING INTO PHASE THREE</strong></span></p><p><span style=\"font-size: 16px;\">2.&nbsp; &nbsp; The Multi-Ministry Taskforce had outlined three pre-conditions for moving into Phase Three, which each of us has contributed to in the past few months:&nbsp;<br><br></span></p><p style=\"margin-left: 40px;\"><span style=\"font-size: 16px;\"><u>a) Adherence to safe management measures</u>. Most businesses and members of the public have been cooperating with safe management measures, and these efforts have helped keep community transmission low.<br><br><u>b)&nbsp;</u><u>Sufficient testing capabilities for early detection and public health action</u>. We have ramped up Polymerase Chain Reaction (PCR) test capacity significantly to be able to run over 50,000 tests a day. We have also introduced antigen rapid tests for larger and higher-risk events.</span></p><p style=\"margin-left: 40px;\"><span style=\"font-size: 16px;\">c)&nbsp;<u>High adoption of TraceTogether for quick and effective contact tracing</u>. As at 13 December, around 65% of Singapore residents are on the TraceTogether Programme, and we are on track to reaching the target of around 70% by the end of the year.<br><br></span></p><p><span style=\"font-size: 16px;\"><strong>FURTHER RE-OPENING IN THE COMMUNITY&nbsp;</strong><br><br>3.&nbsp; &nbsp;&nbsp;Having assessed that these pre-conditions and enablers are in place, the Multi-Ministry Taskforce will allow for the following further re-opening of activities in the community from 28 December 2020:&nbsp;<br><br></span></p><p style=\"margin-left: 40px;\"><span style=\"font-size: 16px;\">a. Social gatherings will be allowed to comprise up to <strong>8 persons</strong>, an increase from 5 persons today. Households may also receive up to <strong>8 visitors</strong> at any point in time. To reduce the likelihood of spread, we should continue to limit our social circle to a small group of regular contacts.<br><br>b. We will gradually increase the capacity limits of premises. For malls and large standalone stores, <strong>we will increase the capacity limit from 10 square metres per person to 8 square metres per person; attractions may also start applying to the Singapore Tourism Board (STB) to increase their operating capacity from 50% to up to 65%. </strong>Measures must continue to be put in place to prevent crowding in popular areas.<br><br>c. Religious Organisations (ROs) have been piloting increases in congregational and other worship services to up to 250 persons and allowance of live music for congregational and other worship services since 3 October 2020. The pilot has shown that the ROs were able to enforce safe management measures such as ensuring clear segregation between zones and minimising intermingling between groups of up to five persons. Hence, we will allow all ROs to increase their capacity for congregational and other worship services to up to 250 persons (in zones of up to 50 persons each for congregational services). Congregational and other worship services as well as religious rites/ prayers conducted at places of worship may involve live performance elements (e.g. with a limited number of singers, wind and other instruments) with the necessary safe management measures in place.<strong></strong></span></p><p style=\"margin-left: 40px;\"><span style=\"font-size: 16px;\"><br>d. For marriage solemnisations held in the home, currently, a total of <strong>10 persons</strong> (including members of the hosting household, excluding the solemniser and vendors) are allowed. In Phase Three, the hosting household will be able to invite up to <strong>8 visitors</strong> (<u>excluding</u> members of the hosting household, the solemniser and vendors), even if this exceeds the existing cap of 10 persons.<br><br>e. Marriage solemnisations (in indoor venues only), funerals and funerary-related activities will also be allowed to have live instrumental music (except for wind instruments) with the necessary safe management measures in place.<br><br>f. Live performances in the Arts and Culture sector have been allowed to resume since 1 November 2020. Some venues have been piloting larger-scale performances of up to 250 persons and outdoor performances of up to 100 persons. Going forward, we will allow indoor live performances to have up to 250 persons in zones of up to 50 persons each. We will also be expanding outdoor live performance pilots to 250 persons in zones of up to 50 persons each, to ensure that venues are still able to safely manage larger outdoor performances and mitigate the gathering of peripheral crowds.<br></span></p><p><span style=\"font-size: 16px;\"><br>4.&nbsp; &nbsp;&nbsp;We will continue to conduct pilots in some higher-risk activities and settings such as busking and live performances in outdoor venues, karaoke, nightlife, which will allow us to assess how these activities can take place and scale up safely.&nbsp;<br><br>5.&nbsp; &nbsp;&nbsp;If the local COVID situation remains stable and we are able to deploy more of our enablers to allow more activities to resume safely, the Multi-Ministry Taskforce will consider allowing further resumption of activities, over the course of Phase Three.&nbsp;&nbsp;<br><br>6.&nbsp; &nbsp;&nbsp;TraceTogether-only SafeEntry, where the TraceTogether App or Token is required for SafeEntry check-ins, will only be implemented[1] early next year, after everyone who wants a Token has had a chance to collect one at a Community Club or Centre in their constituency. Until we implement TraceTogether-only SafeEntry, visitors can still perform SafeEntry check-in via the TraceTogether App, SingPass Mobile, or QR reader apps, or use their identity cards with barcodes such as NRIC, Pioneer or Merdeka Generation cards, and so on.&nbsp;</span></p><p><span style=\"font-size: 16px;\"><br><strong>KEEPING OUR MIGRANT WORKERS SAFE&nbsp;</strong><br><br>7.&nbsp; &nbsp;&nbsp;As we move into Phase Three of our re-opening, we are also taking stock of our efforts to prevent any new COVID-19 outbreak in our migrant worker dormitories, and reviewing how we can continue to keep our migrant workers safe – both physically and mentally. Our migrant workers’ contributions to Singapore are immense, and it is our responsibility to ensure that they are well and can return home safely to their families.&nbsp;<br><br>8.&nbsp; &nbsp;&nbsp;Over the past few months, the government has been working closely with multiple stakeholders to care for our migrant workers. Through a whole-of-society effort, and with a comprehensive testing and isolation strategy, we have brought the outbreak in our migrant worker dormitories under control. The morbidity and mortality rate among our migrant workers living in dormitories were kept very low, although there were unfortunately two deaths due to COVID-19 amongst this group.<br><br>9.&nbsp; &nbsp;&nbsp;By August 2020, all migrant workers living in dormitories had undergone at least one test for COVID-19, and almost all have been cleared to return to work safely. Among other measures to detect and contain new infections, we will continue to carry out Rostered Routine Testing (RRT) of every worker who is still susceptible to infection.&nbsp;<br><br>10.&nbsp; &nbsp;&nbsp;We will also start a pilot scheme in 1Q 2021 with some dormitories to allow migrant workers to access the community once a month, subject to compliance with RRT, wearing of contact tracing tokens and safe living measures.&nbsp;<br><strong><br>SECURING SINGAPORE’S ACCESS TO VACCINES&nbsp;</strong><br><br>11.&nbsp; &nbsp;&nbsp;Vaccination is one of the key enablers to protect us and our loved ones against the COVID-19 disease, allow our economy to open up and more social activities to resume. It will also enable all of us to safely and more quickly return to normalcy.<br><br>12.&nbsp; &nbsp;&nbsp;Safety and efficacy of the vaccines for Singaporeans are key. The government has put in place stringent processes to assess the safety of the COVID-19 vaccines we bring in and ensure they comply with the World Health Organization’s guidelines and international standards on safety and efficacy. Health Sciences Authority (HSA) is reviewing all the available scientific and clinical evidence in detail, and in constant consultation with other benchmark regulatory authorities around the world, to ensure that regulatory requirements and standards for safety and efficacy are met. The Expert Committee on COVID-19 Vaccination is assessing how best to deploy the portfolio of vaccines that we have acquired across all segments of the population to achieve the optimal health outcome for Singapore and Singaporeans.&nbsp;<br><br>13.&nbsp; &nbsp;&nbsp;To secure early access to safe and effective vaccines for our population, the government’s discussions with pharmaceutical companies that had promising vaccine candidates began in May 2020. We have signed Advance Purchase Agreements with Moderna, Pfizer-BioNTech and Sinovac, and are in discussions with a few other pharmaceutical companies. HSA has since received enough scientific and clinical data, evaluated the available evidence and authorised the Pfizer-BioNTech COVID-19 vaccine for pandemic use in Singapore. Pfizer has indicated that the first batch of Pfizer-BioNTech vaccines will arrive in Singapore by around the end of this month. Subsequent batches from the three companies will arrive over the course of next year.&nbsp;<br><br>14.&nbsp; &nbsp;&nbsp;We are also a strong supporter and active participant in the work of the global COVID-19 Vaccine Global Access (COVAX) Facility, which enables countries to pool risk and resources, and promote equitable access to a portfolio of vaccines from different vaccine developers. Singapore has entered into a Commitment Agreement with the COVAX Facility to give us the right to purchase a certain amount of vaccines. This is part of Singapore’s strategy to securing access to a portfolio of COVID-19 vaccines for our population, while promoting and actively enabling affordable, fair and equitable access to safe and effective COVID-19 vaccines for all globally.&nbsp;<br><br>15.&nbsp; &nbsp;&nbsp;We have made provision for all Singaporeans and long-term residents in Singapore to be able to get vaccinated by end-2021, if there are no unforeseen disruptions to vaccine shipments. While COVID-19 vaccination will be voluntary, we strongly encourage everyone to get vaccinated when the vaccine is offered to you. To ensure the accessibility of the vaccine and enable us to achieve a higher rate of vaccination for the population, this vaccination will be free[2].<br></span></p><p><span style=\"font-size: 16px;\">16.&nbsp; &nbsp;&nbsp;Vaccine supply will be limited globally at the outset and will arrive in Singapore in batches over several months as manufacturers ramp up production of vaccines. Therefore, we will progressively vaccinate our entire population[3],&nbsp;with our first priority for those who are at greater risk and hence most in need of COVID-19 vaccination, such as healthcare workers and COVID-19 frontline workers, and vulnerable groups, in terms of age and health, at greater risk of severe disease from COVID-19 infection. This is consistent with WHO’s recommendations. The Expert Committee has issued a preliminary set of recommendations which the government has accepted, and the Expert Committee will be sharing its detailed advice on the overall vaccination strategy for Singapore and its specific recommendations on each of the vaccines in the coming weeks, as more scientific and clinical data becomes available.&nbsp;</span></p><p><span style=\"font-size: 16px;\"><br><strong>LOOKING AHEAD TO FURTHER RE-OPENING&nbsp;</strong><br><br>17.&nbsp; &nbsp;&nbsp;<strong></strong>Comprehensive vaccination coverage in the population will enable us to re-open further and expedite our recovery from the pandemic, but vaccination is not a silver bullet. While vaccination will protect vaccinated individuals against the disease, the virus has not been eradicated and it may still be possible for vaccinated individuals to spread the virus and infect those who are not yet vaccinated. It will thus be some time before Singapore and the entire world return to pre-COVID normalcy.&nbsp;<br><br>18.&nbsp; &nbsp;&nbsp;We cannot afford to let our guard down, especially during the upcoming festive period where we might want to meet up with family and friends, and must continue to be vigilant and keep up the good practices which we have cultivated over the past year. Our existing key enablers – safe management measures, testing, and contact tracing – continue to be necessary and effective in helping us to mitigate spread and keep community transmission low. We will continue with our checks and will not hesitate to take strict enforcement actions against any breaches, so that we can continue to keep Singapore safe from the virus.&nbsp;<br><br>19.&nbsp; &nbsp;&nbsp;We seek the cooperation of all Singaporeans to continue to remain united and disciplined in our fight against COVID-19. If we all work together, we can look forward to a safer and healthier 2021.<br><strong><br><br>MINISTRY OF HEALTH<br>14 DECEMBER 2020<br><br></strong></span></p><div><div><div id=\"ftn1\"></div></div><p><span style=\"font-size: 16px;\">[1] i.e., implemented as the exclusive mode of entry, beyond the existing pilots already in place today.<br>[2] For Singaporeans and long-term residents in Singapore, which includes long-term work-permit holders.<br>[3] We will defer vaccinating pregnant women and children under 16 until more data on safety and efficacy for these groups are available.</span></p><span style=\"font-size: 16px;\"><br></span></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "moving-into-phase-three-of-re-opening", "CurrentPageUrl": null}, {"Title": "No New Cases of Locally Transmitted  Covid-19 Infection ", "PublishedDate": "/Date(1607931060000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "14 Dec 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\"><span style=\"font-family: Arial;\"><span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp;As of 14 December 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed that there are no new cases of locally transmitted COVID-19 infection.&nbsp;<br><br>2.&nbsp; &nbsp; &nbsp;There are 5 imported cases, who had already been placed on Stay-Home Notice upon arrival in Singapore.&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.<br><br><br><strong>MINISTRY OF HEALTH<br>14 DECEMBER 2020</strong><br></span></span></p><div style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 16px;\"><br></span></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "no-new-cases-of-locally-transmitted-covid-19-infection-14-12-2020", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}