{"pressItemDictionary": {"Press Releases": [{"Title": "35 More Cases Discharged; 799 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1587999600000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "27 Apr 2020", "Summary": "", "MainContent": "<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; As of 27 April 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 799 cases of COVID-19 infection in Singapore. The breakdown is as follows: </p><p><strong>a)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Imported cases: 0</strong></p><p>There are no imported cases today. </p><p><strong>b)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Cases in the community: 18</strong> (14 Singaporeans/Permanent Residents, 4 Work Passes)</p><p>The number of new cases in the community has decreased, from an average of 29 cases per day in the week before, to an average of 20 per day in the past week. The number of unlinked cases in the community has also decreased, from an average of 19 cases per day in the week before, to an average of 13 per day in the past week. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.</p><p><strong>c)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Work Permit holders (residing outside dormitories): 17</strong></p><p>The number of new cases amongst Work Permit holders residing outside dormitories has continued to increase, from an average of 23 cases per day in the week before, to an average of 24 per day in the past week.&nbsp; </p><p><strong>d)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Work Permit holders (residing in dormitories): 764</strong></p><p>The main increase today continues to be for Work Permit holders residing in dormitories, where we are picking up many more cases because of extensive testing. Most of these cases have a mild illness and are being monitored in the community isolation facilities or general ward of our hospitals. None of them is in the intensive care unit. </p><p>&nbsp;</p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Details of these trends can be found in MOH’s daily situation Report (<a title=\"\" href=\"http://www.moh.gov.sg/covid-19/situation-report\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?q=http://www.moh.gov.sg/covid-19/situation-report&amp;source=gmail&amp;ust=1588088221231000&amp;usg=AFQjCNF808jrPSjp9eNkhqyj0jPPsTPvSg\">www.moh.gov.sg/covid-19/<wbr>situation-report</a>). Please refer to <a title=\"Annex A\" href=\"/docs/librariesprovider5/pressroom/annex-a-27-4.pdf?sfvrsn=afcecb94_2\">Annex A</a>&nbsp;for the summary of the confirmed cases. </p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Of the new cases, 51% are linked to known clusters, while the rest are pending contact tracing. </p><p>&nbsp;</p><p><strong>Links between previous cases found</strong></p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In the past week (20 April to 26 April), MOH has uncovered links for 1,216 previously unlinked cases. </p><p>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <a title=\"Annex B\" href=\"/docs/librariesprovider5/pressroom/annex-b-27-4.pdf?sfvrsn=ca87c1fd_2\">Annex B</a>&nbsp;for details.</p><p>&nbsp;</p><p><strong>Update on condition of confirmed cases</strong></p><p>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 35 more cases<sup>[1] </sup>of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 1,095 have fully recovered from the infection and have been discharged from hospitals or community isolation facilities. </p><p>7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; There are currently 1,451 confirmed cases who are still in hospital. Of these, most are stable or improving, and 20 are in critical condition in the intensive care unit. 11,863 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 14 have passed away from complications due to COVID-19 infection. </p><p>8.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Cases 1595 and 9682 have passed away from complications due to COVID-19 infection on 27 April 2020. Case 1592 was an 82 year-old male Singapore Citizen who was confirmed to have COVID-19 infection on 8 April. Case 9682 was an 81 year-old male Singapore Citizen, who was confirmed to have COVID-19 infection on 20 April. The National Centre for Infectious Diseases has reached out to their families and is extending assistance to them.</p><p>&nbsp;</p><p><strong>MINISTRY OF HEALTH<br>27 APRIL 2020</strong></p><p><sup>[1]&nbsp;</sup> Cases 350, 334, 412, 467, 551, 612, 715, 795, 916, 1058, 1075, 1102, 1157, 1178, 1251, 1456, 1485, 1761, 1882, 2146, 2633, 2803, 3108, 3539, 3628, 3984, 5568, 6247, 7088, 7101, 8655, 9934, 10129, 10130 and 12352.</p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "35-more-cases-discharged-799-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "Scaling Up of Covid-19 Testing ", "PublishedDate": "/Date(1587987600000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "27 Apr 2020", "Summary": "", "MainContent": "1. Testing is a critical enabler of our fight against COVID-19. The Multi-Ministry Taskforce has been steadily building up our national capacity to conduct tests for COVID-19. From an average of 2,900 tests per day in early April, we are now able to conduct more than 8,000 tests per day. To date, Singapore has tested about 2,100 per 100,000 persons. In comparison, the US has tested 1,600 per 100,000 and the UK 1,000 per 100,000. The higher intensity of testing allows us to pick up far more cases than many other countries.\n<br>\n<br>2. We have taken steps to continue building up our testing capacity over the coming weeks and months. Even as we do so, we will continue to prioritise our existing testing capacity based on public health considerations.\n<br>\n<strong><br>Testing for Diagnosis and Surveillance\n</strong><br>\n<br>3. Testing is used for three key purposes. First, for diagnosis in order to provide the appropriate treatment early for persons who are unwell. Second, for active case finding in order to identity infected individuals early and isolate them. Contact tracing around confirmed cases allows us to ring-fence any clusters, and prevent further transmissions. And third, for surveillance purposes, in particular of groups at higher risk of contracting or transmitting the disease.\n<br>\n<br>4. Such testing is done systematically across our hospitals, polyclinics and general practitioner clinics. We test high risk groups showing symptoms of acute respiratory infection (ARI), such as those who are close contacts of confirmed cases, those with travel history, patients already diagnosed with pneumonia, or patients with prolonged ARI. We also conduct testing as a means of general surveillance to detect signs of community spread and to pick up unlinked cases. \n<br>&nbsp;&nbsp;&nbsp; \n<br><strong>Testing in the Migrant Worker Dormitories\n</strong><br>\n<br>5. A similar testing strategy is applied to our migrant worker community, including those living in dormitories. The Ministry of Health (MOH) has been testing close to 3,000 migrant workers residing at the dormitories every day, and will continue to do more tests. Many of these workers showed no symptoms when they were tested. In most countries, people who are asymptomatic are not tested. To date, more than 21,000 migrant workers living in dormitories have been tested. This means that we have tested about one in 15 workers in dormitories (or 6,500 per 100,000), far higher than the testing rates seen in countries like South Korea (one in 90, or 1,100 per 100,000).\n<br>\n<br>6. This aggressive testing regime enables us to determine the extent of infection in the dormitories. Those who are confirmed with COVID-19 infection will be reported in the daily tally of newly confirmed cases. We started with the dormitories with a higher incidence of infections, and are continuing to test the workers in the other dormitories.  \n<br>\n<br>7. Due to the need to prioritise, we are not be able to test all in the dormitories at one go. But if any worker were to report sick or show ARI symptoms, we will immediately pull aside and isolate the worker from his room-mates, and ensure that he receives the necessary medical care. This allows us to provide medical care quickly to the symptomatic foreign workers, and to ensure that those with higher risk factors or have more severe illnesses are transferred to receive care at our healthcare institutions.\n<br>\n<br>8. One urgent priority is to test migrant workers who have moved out of the dormitories but are continuing to work in essential services. This is to reduce the risk of transmission in workplaces and to the wider community.   \n<br>\n<br><strong>Testing for Protection and Monitoring \n</strong><br>\n<br>9. Finally, we are doing more tests to protect vulnerable groups.  For instance, we are testing the staff at nursing homes where there is close contact with seniors, as well as healthcare workers and frontline officers who have regular contact with confirmed cases. This will help to ensure that they continue to stay healthy, and receive medical treatment promptly if required.\n<br>\n<br>10. As more testing capacity is brought on-stream, we will gradually expand testing to the wider pool of workers in order to ensure the continuity of critical functions and services. This is important, as it will also enable us to progressively resume economic activities beyond the circuit breaker period.  \n<br>\n<br><strong>Holistic Strategy \n</strong><br>\n<br>11. While testing is important, it has to be part of a broader strategy to fight COVID-19.  Testing alone cannot substitute for other important measures like safe distancing and infection control. Individual responsibility in upholding good personal hygiene, minimising contact, and seeing a doctor immediately when sick are all critical aspects of the overall strategy. Together, we can slow down transmissions, beat the virus, and emerge stronger after the crisis.  \n<br>\n<br>\n<strong><br>MINISTRY OF HEALTH\n<br>27 APRIL 2020</strong>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "scaling-up-of-covid-19-testing", "CurrentPageUrl": null}, {"Title": "799 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1587916800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "27 Apr 2020", "Summary": "", "MainContent": "<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; As of 27 April 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 799 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders residing in foreign worker dormitories. 14 cases are Singaporeans/ Permanent Residents.</p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight. </p><p>&nbsp;&nbsp;</p><p><strong>MINISTRY OF HEALTH<br>27 APRIL 2020</strong></p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "799-new-cases-of-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}