{"pressItemDictionary": {"Press Releases": [{"Title": "Premise Ordered to Close Under Infectious Diseases Act", "PublishedDate": "/Date(1586102400000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "06 Apr 2020", "Summary": "", "MainContent": "1. The Ministry of Health (MOH) has, on 6 April 2020, ordered the immediate closure of the shop premises of UniverCell Mobile Market (located at 122 Serangoon Road) under Section 19 of the Infectious Diseases Act. \n<br>\n<br>2.\tOn 5 April at about 1pm, officers from the Singapore Tourism Board (STB) conducting safe distancing checks found the premises of UniverCell Mobile Market to be severely overcrowded, and lacking proper crowd management controls, such as limiting the number of customers in the premises and ensuring a minimum of one metre of spacing between customers. Despite verbal warnings by the STB officers, the premises continued to be overcrowded upon checks at about 7.15pm on the same day. STB officers then issued an advisory letter. \n<br>\n<br>3.\tIn view of the lack of crowd management controls and repeated overcrowding at UniverCell Mobile Market, MOH has reason to believe that the conditions on the premises are likely to lead to the outbreak or spread of COVID-19.\n<br>\n<br>4.\tIn light of the above, MOH has ordered that the premises must immediately be closed for a period of 14 days, and that the owners must cleanse and disinfect the premises during this period. In addition, the owners must take measures to ensure the abatement of any overcrowding or any other conditions that may contribute to the likelihood of the outbreak or spread of COVID-19 at the premises. \n<br>\n<br>5.\tThe order had been served on UniverCell Mobile Market on 6 April at 2pm, and the premise has since been closed. It will remain closed after the 14-day period to 4 May (inclusive) pursuant to the elevated safe distancing measures implemented by the Multi-Ministry Taskforce. \n<br>\n<br>6.\tMOH will not hesitate to take action against any individual or business that violates the Infectious Diseases Act. We urge everyone to observe the safe distancing measures that have been put in place, and to be socially responsible.  \n<br>\n<br>\n<strong><br>MINISTRY OF HEALTH\n<br>6 APRIL 2020\n</strong><br>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "premise-ordered-to-close-under-infectious-diseases-act", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}