{"pressItemDictionary": {"Press Releases": [{"Title": "Three more cases discharged; 49 new cases of COVID-19 infection confirmed", "PublishedDate": "/Date(1585057500000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "24 Mar 2020", "Summary": "", "MainContent": "1. Three more cases of COVID-19 infection have been discharged from hospital (Cases 94, 140 and 520). In all, 155 have fully recovered from the infection and have been discharged from hospital. \n<br>\n<br>2. As of 24 March 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 32 imported and 17 local cases of COVID-19 infection in Singapore.\n<br>\n<br>•&nbsp;&nbsp; The 32 imported cases<sup>1</sup> had travel history to Europe, North America, Australia, the Middle East, ASEAN and other parts of Asia. All except two were returning residents and Long Term Pass holders.\n<br>\n<br>•&nbsp;&nbsp; Four cases<sup>2</sup> are linked to previous cases.\n<br>\n<br>•&nbsp;&nbsp; 13 cases<sup>3</sup> are currently unlinked, and contact tracing is ongoing. \n<br>\n<br>3. All Singapore Citizens, Permanent Residents and Long Term Pass holders returning to Singapore are issued a 14-day Stay-Home Notice (SHN). Persons under SHN must remain in their place of residence at all times. \n<br>\n<br><strong>Links between previous cases found\n</strong><br>\n<br>4. Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. This was made possible with the assistance of the Singapore Police Force.\n<br>\n<br>a) 14 of the confirmed cases (Cases 93, 95, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 108 and 110) are linked to Wizlearn Technologies Pte Ltd.\n<br>\n<br>b) 47 of the confirmed cases (Cases 94, 96, 107, 112, 114, 115, 116, 117, 118, 120, 121, 122, 125, 127, 128, 129, 130, 131, 133, 134, 137, 139, 140, 142, 144, 145, 146, 148, 149, 150, 155, 156, 157, 158, 159, 160, 161, 164, 166, 174, 179, 185, 186, 196, 201, 218 and 224) are linked to a private dinner function at SAFRA Jurong on 15 February. Two (Cases 142 and 144) are linked to boulder+ Gym and Church of Singapore (Bukit Timah).\n<br>\n<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; i. Six  of the confirmed cases (Cases 142, 162, 163, 305, 345 and 443) are linked to boulder+ Gym (12 Kallang Avenue).\n<br>\n<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ii. Five  of the confirmed cases (Cases 144, 208, 214, 235 and 283) are linked to the Church of Singapore (Bukit Timah) (2B Hindhede Road). \n<br>\n<br>c) Three  of the confirmed cases (Cases 183, 252 and 310) are linked to Masjid Al-Muttaqin (5140 Ang Mo Kio Avenue 6).\n<br>\n<br>5. Contact tracing is underway for 41 locally transmitted cases to establish any links to previous cases or travel history to affected countries or regions.\n<br>\n<br>6. Please refer to the <a title=\"Annex\" href=\"/docs/librariesprovider5/default-document-library/annex-(24-march).pdf?sfvrsn=a6eaed9f_0\">Annex</a>&nbsp;for a summary of the confirmed cases. \n<br>\n<br><strong>Update on condition of confirmed cases\n</strong><br>\n<br>7. To date, a total of 155 cases have fully recovered from the infection and have been discharged from hospital. Of the 401 confirmed cases who are still in hospital, most are stable or improving. 17 are in critical condition in the intensive care unit. Two have passed away from complications due to COVID-19 infection. \n<br>\n<br><strong>Update on contact tracing for confirmed cases \n</strong><br>\n<br>8. Contact tracing for the confirmed cases is ongoing. Once identified, MOH will closely monitor all close contacts. As a precautionary measure, they will be quarantined for 14 days from their last exposure to the patient. In addition, all other identified contacts who have a low risk of being infected will be under active surveillance, and will be contacted daily to monitor their health status. \n<br>\n<br>9. As of 24 March 2020, 12pm, MOH has identified 8,822 close contacts who have been quarantined. Of these, 2,803 are currently quarantined, and 6,019 have completed their quarantine. \n<br>\n<br>\n<br><strong>MINISTRY OF HEALTH\n<br>24 MARCH 2020\n<br><br></strong>[1] Cases 512, 513, 514, 515, 517, 518, 519, 522, 523, 526, 529, 530, 532, 534, 537, 538, 540, 541, 542, 543, 544, 545, 546, 547, 548, 549, 551, 552, 554, 555, 557 and 558.<br><br>[2] Cases 520, 539, 550 and 553.<br><br>[3] Cases 510, 511, 516, 521, 524, 525, 527, 528, 531, 533, 535, 536 and 556.", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "three-more-cases-discharged-49-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "Tighter Measures to Minimise Further Spread of COVID-19", "PublishedDate": "/Date(1584979200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "24 Mar 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The recent spike in imported cases signals a new phase in our fight against COVID-19. The Multi-Ministry Taskforce recently disbarred all short-term visitors from entering or transiting through Singapore, and further curtailed the entry of work pass holders. We have also implemented safe distancing measures within Singapore.&nbsp; But more still needs to be done to reduce the risk of further local transmission of COVID-19.&nbsp;</p><p>&nbsp;</p><p><strong>Safe Distancing Measures for the General Population</strong></p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Many countries have imposed total lockdowns to prevent the spread of the virus. Such lockdowns have significantly disrupted lives and economies throughout the world, but were deemed necessary to ease the strain on healthcare systems in those countries.<br></p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We therefore cannot afford to be complacent in Singapore. We must implement tighter safe distancing measures now to minimise activities and exposure, so as to significantly reduce the risks of seeding new local clusters. For safe distancing to be effective, all Singaporeans must take it seriously and do their part.&nbsp; Otherwise, we will need more drastic measures later.<br></p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The Multi-Ministry Taskforce has decided to enforce stricter measures that would limit gatherings outside of work and school to 10 persons or fewer, and ensure that physical distancing of at least one metre can be achieved in settings where interactions are non-transient. These measures will take effect from 26 March 2020, 2359 hours. &nbsp;We expect these measures to be in place until 30 April 2020, but this may be extended if the situation does not improve.&nbsp;<br></p><p>&nbsp;</p><p><u>Entertainment Venues</u></p><p>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We will close all bars and entertainment venues like night clubs, discos, cinemas, theatres, and karaoke outlets, where there is a high risk of transmission due to sustained close contact over a period of time.<br></p><p>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Other public venues such as retail malls, museums and attractions, where contact is more transient, may remain open. However, operators are to ensure the following:<br></p><p>a.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Reduce operating capacity within the venue at any one time, so that the venue does not have more than one person per 16 square metres of usable space. This is to significantly reduce the density of crowds in these venues, especially during peak periods.<br></p><p>b.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Groups must not exceed 10 persons. Shows within attractions (indoor and outdoor), group tours at the museums, and open atrium sales events<sup>1</sup> will be suspended.<br></p><p>c.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Disperse congregations and provide an environment that allows at least one metre physical spacing between patrons. These include queues and waiting areas. Operators are encouraged to offer services by appointment or through digital services where possible, to minimise queues. Crowds should be quickly dispersed.&nbsp;&nbsp;<br></p><p>7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Retail malls and attractions that are unable to adhere to these requirements must be closed. Additional penalties may be imposed on those which are found to have been a place of transmission of COVID-19, if the venues are found not to have adhered to these requirements.<br></p><p>8.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Organised tours in public venues (e.g., sightseeing or guided walking tours) will be suspended.<br></p><p>9.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Existing measures for food and beverage venues continue to apply. Other activities such as live music or karaoke which are likely to cause patrons to congregate will have to cease. Food and beverage outlets must set up their spaces (arrangement of tables and seating) to ensure separation of at least one metre between tables or different groups of diners.<br></p><p>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Related diners (e.g. family members, couples) can be seated together at one table, but the tables must be spaced out.<br></p><p>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Groups of diners should also be limited to 10 persons or fewer.</p><p>Patrons of eating establishments with fixed seating – for example, hawker centres and coffee shops – must use alternate seats. Premise managers should mark out seats to facilitate these arrangements.&nbsp;<br></p><p>&nbsp;</p><p><u>Tuition and Enrichment Centres</u></p><p>10.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; All centre-based tuition and enrichment classes will be suspended. This is to reduce the intermingling of students from different schools and enhance the safety of our students.&nbsp;<br></p><p>&nbsp;</p><p><u>Faith-based Activities</u></p><p>11.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; All religious services and congregations will be suspended. Places of worship (e.g. temples, mosques, churches) may remain open for private worship and essential rites, subject to group sizes of 10 persons or fewer at any one time.&nbsp; &nbsp;<br><br></p><p><u>Events</u><br></p><p>12.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; All events and mass gatherings (e.g. conferences, exhibitions, festivals, concerts, sporting events, trade fairs) must be deferred or cancelled, regardless of size. This is a tightening of the previous requirement where all events and gatherings were to be limited to fewer than 250 participants.<br></p><p>13.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Singaporeans are advised to avoid holding and participating in social events and gatherings involving more than 10 persons at any one time. These include private celebrations like birthdays and weddings. For funerals and wakes, attendance should be limited as far as possible to family members only, and gatherings of 10 or fewer people at any one point. Much as we understand the need for friends and acquaintances to pay their last respects and give comfort to families in their grief, we urge the public to do their part in minimising social interactions so that we can slow down the spread of the virus together.&nbsp;<br></p><p>&nbsp;</p><p><u>Workplaces</u></p><p>14.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Existing measures for workplaces continue to apply. Employers should put in place measures to reduce close physical interactions amongst employees. Tele-conferencing should be used in place of physical meetings wherever possible. Where employees can perform their work by telecommuting from home, employers must ensure that they do so.<br></p><p>&nbsp;</p><p><strong>Advisory for Seniors and Persons with Underlying Conditions</strong></p><p>15.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We will extend the suspension of activities for seniors<sup>2</sup>&nbsp;to 30 April 2020. During this time, we advise seniors and individuals with underlying chronic medical conditions (e.g. heart disease, diabetes, lung disease) to avoid social gatherings and crowded places as far as possible, and to only go out for essential purposes (e.g. work, purchase food and supplies). They should be vigilant in maintaining good personal hygiene, such as by washing their hands frequently and avoiding touching their face and eyes unnecessarily. They should see a doctor immediately if they feel unwell.<br><br></p><p><strong>Enhanced Precautions for UK/US Returnees</strong><br></p><p>16.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The UK and US account for the largest share of imported cases by far. We expect more Singapore residents, including a sizeable group of Singaporean students, to return from these countries over the coming weeks in response to lockdowns in these countries.&nbsp;<br></p><p>17.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; To prevent potential spread of infection from the UK and US returnees to their family members, we will work with hotel operators to provide dedicated facilities for the returnees to serve their 14-day SHN. Transportation will be arranged to send the returnees directly from the airport to the hotels. Each will have their own room/toilet, and will be provided all their meals, so that they may avoid physical contact with other individuals. These SHN requirements will be strictly enforced so as to reduce the risk of community transmission from imported cases.&nbsp;<br></p><p>18.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; This new SHN arrangement will take effect for all UK/US returnees from 25 March 2020, 2359 hours. All returnees from the UK and US who are presently still serving out their SHN in their homes may also apply to stay in these dedicated facilities. They can contact the SHN Helpline at 6812-5555 for more information.<br></p><p>&nbsp;</p><p><strong>Regulations Under the Infectious Disease Act</strong></p><p>19.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The Ministry of Health (MOH) will be promulgating Regulations under the Infectious Diseases Act to give legal force to the safe distancing measures, as well as to provide enhanced enforcement for breaches of the SHN. The penalty for an offence under the Regulations, including any SHN breach, would be a fine of less than $10,000 or imprisonment of less than six months or both. In addition, existing levers under the Infectious Diseases Act, including the temporary suspension of operations, may be used against persons and operators found to be non-compliant with the Regulations.<br></p><p>20.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Government agencies will also step up enforcement efforts against persons on SHN, using a combination of mobile applications, phone surveillance and house visits. The number of officers conducting such checks will be increased substantially to tighten enforcement efforts. Detailed checks will also be carried out to verify the declared addresses of returning residents on the SHN forms. To provide expeditious support to persons on SHN, a centralised call centre will be set up from 26 March 2020 to handle all SHN-related queries.<br></p><p>&nbsp;</p><p><strong>Singapore Residents and Long-Term Pass Holders who Disregard Travel Advisory</strong></p><p>21.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; MOH has noted that there are still Singapore residents and Long Term Pass holders who are travelling abroad even after the Government issued travel advisories. They risk the health of other Singaporeans and residents when they return.<br></p><p>22.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Any Singapore resident or Long Term Pass holder who leaves Singapore from 27 March 2020, in disregard of the prevailing travel advisories, will be charged at unsubsidised rates for their inpatient stay at public hospitals, if they are admitted for suspected COVID-19 and have onset of symptoms within 14 days of returning to Singapore. Singapore residents will also not be able to claim from MediShield Life or Integrated Shield Plans for these treatments at public and private hospitals.<br></p><p>23.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Any work pass holder or his/her dependant who leaves Singapore from 27 March 2020 will be deprioritised for entry approval<sup>3</sup> and could see significant delays before they are allowed to return to Singapore if they persist in travelling abroad and return infected.<br></p><p>&nbsp;</p><p> </p><p><strong>Commencement of Community Isolation Facility</strong></p><p>24.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Even as we take further steps to minimise further spread of the disease, MOH is making the necessary preparations to cope with a possible surge. This includes ensuring that our healthcare facilities are able to cope with a larger number of cases.<br></p><p>25.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We have set up a Community Isolation Facility at D’Resort NTUC (1 Pasir Ris Close) with maximum capacity of about 500 persons, which is operational from 24 March 2020. We will be placing patients who are clinically well enough to be discharged from medical care but still test positive for COVID-19 to the facility for isolation and care. These patients have thus far been isolated in our hospitals. But this has not been an efficient use of our hospital resources as they do not generally require significant medical care.<br></p><p>26.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The Community Isolation Facility is modelled after the existing Government Quarantine Facilities, and will be managed with a higher baseline level of infection control by staff. Patients who are clinically fit for discharge but are still COVID-19 positive will be isolated and safely managed in this facility until after they test negative for COVID-19. The cost of isolation in the Community Isolation Facility will be borne by the Government.<br></p><p>&nbsp;</p><p><strong>Social Responsibility is Key</strong></p><p>27.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Social responsibility is critical in slowing the transmission of the virus. We need all Singaporeans to play their part in the fight against COVID-19. Everyone should observe the safe distancing measures announced, and fully comply with the quarantine order and SHN issued by authorities. All travel plans should also be deferred until the global outbreak is under control. Those who are unwell, even with mild flu-like symptoms, should see a doctor immediately and stay at home to prevent spreading illness to others.&nbsp;<br></p><p>28.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; During this time, it is important to look after our own and each other’s wellbeing. Seniors especially should find ways to stay fit and healthy even while at home, stay socially connected through phone or other means, or pick up a new hobby or skill through online learning.<br></p><p>29.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We understand these measures are disruptive and require significant effort from all of us to adjust to them. However we must all do our part to protect ourselves, our family and friends, and the people around us.<br></p><p>30.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The Multi-Ministry Taskforce will regularly review its measures and calibrate them as the global and local situation evolves. Members of the public are advised to refer to the MOH website (<a href=\"https://www.moh.gov.sg/covid-19\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?q=https://www.moh.gov.sg/covid-19&amp;source=gmail&amp;ust=1585132165318000&amp;usg=AFQjCNE1xD-u2SeD08ita-_-r4LLp6sytw\">https://www.moh.gov.sg/covid-<wbr>19</a>) for the latest measures.<br></p><p>&nbsp;</p><p><strong>MINISTRY OF HEALTH<br></strong><strong>24 MARCH 2020</strong></p><p>&nbsp;</p><p><sup>1&nbsp;</sup>&nbsp;Except for supermarket retailers where atrium sales may be used to disperse crowds from their stores.<br><sup>2</sup>&nbsp; Since 11 March 2020, all senior-centric activities at community clubs, residents’ committees, Senior Activity Centres, Active Ageing Hubs, CREST Centres, Health Promotion Board (HPB) and ActiveSG sport centres had been suspended for two weeks. The list of activities can be found on PA’s and MyActiveSG’s websites, as well as the HPB’s HealthHub portal or Healthy 365 mobile app.<br><sup>3</sup>&nbsp; Currently, all work pass holders and their dependants planning to enter/return to Singapore from any country are required to obtain MOM’s approval before they can commence their journey.</p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "tighter-measures-to-minimise-further-spread-of-covid-19", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}