{"pressItemDictionary": {"Press Releases": [{"Title": "Two new cases of COVID-19 infection confirmed", "PublishedDate": "/Date(1583236800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "03 Mar 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;As of 3 March 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified two more cases of COVID-19 infection in Singapore. Of these, one is linked to the cluster at Wizlearn Technologies Pte Ltd. Contact tracing is underway for the other case to establish any links to previous cases or travel history to affected countries or regions.<br><br><strong>Links between previous cases found<br><br></strong>2.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. This was made possible with the assistance of the Singapore Police Force.<br><br>a)&nbsp; &nbsp; Six of the locally transmitted confirmed cases (Cases 31, 33, 38, 83, 90 and 91), as well as Cases 8 and 9, are linked to The Life Church and Missions Singapore. These six cases are linked to another 23 confirmed cases (Cases 48, 49, 51, 53, 54, 57, 58, 60, 61, 62, 63, 66, 67, 68, 70, 71, 73, 74, 78, 80, 81, 84, 88) who are linked to the Grace Assembly of God.<br>b)&nbsp; &nbsp; Nine of the confirmed cases (Cases 19, 20, 21, 24, 25, 27, 28, 34 and 40) are linked to Yong Thai Hang.<br>c)&nbsp; &nbsp; Three of the confirmed cases (Cases 30, 36 and 39) are linked to the business meeting held at Grand Hyatt Singapore from 20 to 22 January.<br>d)&nbsp; &nbsp; Five of the confirmed cases (Cases 42, 47, 52, 56 and 69) are linked to the Seletar Aerospace Heights construction site.<br>e)&nbsp; &nbsp; 14 of the confirmed cases (Cases 93, 95, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106,&nbsp;108 and 110) are linked to Wizlearn Technologies Pte Ltd.<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Investigations on these clusters are ongoing. In addition to the clusters, our investigations have identified the following links between cases:</p> <ul><li>Case 44 is linked to Cases 13 and 26;</li><li>Case 72 is linked to Cases 59 and 79; </li><li>Case 50 is linked to Cases 55, 65 and 77; </li><li>Case 75 is linked to Case 41; </li><li>Case 86 is linked to Case 82; and</li><li>Case 107 is linked to Cases 94 and 96.</li></ul><p><br>4.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Contact tracing is underway for the other 11 locally transmitted cases to establish any links to previous cases or travel history to affected countries or regions.<br><br><strong>About the confirmed cases<br><br></strong><u>Case 109<br><br></u>5.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Case 109 is a 70 year-old male Singapore Citizen who has no recent travel history to affected countries and regions. He is currently warded in an isolation room at the Singapore General Hospital (SGH).<br><br>6.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;He reported onset of symptoms on 25 February and had sought treatment at a general practitioner (GP) clinic on 27 February and 28 February. He presented at SGH on 29 February and was immediately isolated. Subsequent test results confirmed COVID-19 infection on 2 March afternoon.<br><br>7.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Prior to hospital admission, he had gone to work at Fish Mart Sakuraya (154 West Coast Road) but had not served customers or handled food. He stays at Everton Park.<br><br><u>Case 110<br><br></u>8.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Case 110 is a 33 year-old male Singapore Citizen who has no recent travel history to affected countries and regions. He is currently warded in an isolation room at the National Centre for Infectious Diseases. He is linked to the cluster at Wizlearn Technologies Pte Ltd.<br><br><u>Case 108 (Announced on 2 March)<br><br></u>9.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Case 108 is a 34 year-old female Filipino national who is a Singapore Work Pass holder, and has no recent travel history to affected countries and regions. She is a foreign domestic worker employed by Case 101, and works in the same household as Case 102. She is currently warded in an isolation room at Ng Teng Fong General Hospital (NTFGH).<br><br>10.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;She reported onset of symptoms on 25 February. She presented at NTFGH on 28 February, and was immediately isolated. Subsequent test results confirmed COVID-19 infection on 2 March morning.<br><br>11.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Prior to hospital admission, she had sought treatment for an unrelated condition at a dental clinic. She stays at Bukit Batok Street 24.<br><br><strong>Update on condition of confirmed cases<br><br></strong>12.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;To date, a total of 78 cases have fully recovered from the infection and have been discharged from hospital. Of the 32 confirmed cases who are still in hospital, most are stable or improving. Seven are in critical condition in the intensive care unit.<br><br><strong>Update on contact tracing for confirmed cases<br><br></strong>13.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Contact tracing for the confirmed cases is ongoing. Once identified, MOH will closely monitor all close contacts. As a precautionary measure, they will be quarantined for 14 days from their last exposure to the patient. In addition, all other identified contacts who have a low risk of being infected will be under active surveillance, and will be contacted daily to monitor their health status.<br><br>14.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;As of 3 March 2020, 12pm, MOH has identified 3,173 close contacts who have been quarantined. Of these, 336 are currently quarantined, and 2,837 have completed their quarantine.<br><br><strong>Health advisory<br><br></strong>15.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Singaporeans are advised to defer all travel to Hubei Province and all non-essential travel to mainland China, Iran, northern Italy, Japan and the Republic of Korea.<br><br>16.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;All travellers should monitor their health closely for two weeks upon return to Singapore and seek medical attention promptly if they feel unwell. Travellers should inform their doctor of their travel history. If they have a fever or respiratory symptoms (e.g. cough, shortness of breath), they should wear a mask and call the clinic ahead of the visit.<br><br>17.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Travellers and members of the public should adopt the following precautions at all times:</p> <ul><li>Avoid close contact with people who are unwell or showing symptoms of illness; </li><li>Observe good personal hygiene; </li><li>Practise frequent hand washing with soap (e.g. before handling food or eating, after going to toilet, or when hands are dirtied by respiratory secretions after coughing or sneezing); </li><li>Wear a mask if you have respiratory symptoms such as a cough or shortness of breath; </li><li>Cover your mouth with a tissue paper when coughing or sneezing, and dispose the soiled tissue paper in the rubbish bin immediately; and </li><li>Seek medical attention promptly if you are feeling unwell.<p>&nbsp;</p></li></ul> <p>18.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;MOH will continue to monitor the situation closely. As medical practitioners are on the lookout for suspect cases, Singapore is likely to see more cases that will need to be investigated. </p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "two-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "Additional Precautionary Measures in Response to Escalating Global Situation ", "PublishedDate": "/Date(1583164800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "03 Mar 2020", "Summary": "<p align=\"center\"><strong>&nbsp; </strong></p>", "MainContent": "In view of the surge in the number of confirmed cases around the world – in particular in Iran, northern Italy[1], Japan and Republic of Korea – the Multi-Ministry Taskforce will put in place further precautionary measures to limit the risk that these affected regions may pose to Singapore.<br><br>2.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As of 3 March 2020, 12pm, there were 90,689 confirmed cases of COVID-19 globally, including 10,538 cases outside mainland China. The Republic of Korea has reported 4,812 cases, an increase of 600 cases in the last day. There were 1,835 cases reported in Italy, mostly in its northern region. Iran has reported 1,501 cases, an increase of 523 cases in the last day, and Japan has confirmed 268 cases.&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The Taskforce is monitoring the situation closely. It will continue to take a calibrated and risk-based approach in determining the appropriate precautions and measures for Singapore. In the days ahead, it is likely that we will see a surge of infected cases in countries around the world, including in America, Europe, the Middle East and the rest of Asia.&nbsp;Singapore is a small, globally-connected city-state, and we are faced with a higher risk of imported cases.&nbsp;<br><br><br><strong>Additional precautions for outgoing and incoming travellers</strong><br><br>4.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; To protect Singaporeans, the Taskforce will put in place additional precautions for outgoing and incoming travelers.<br><br>5.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; In particular, Singaporeans are advised to defer non-essential travel to Iran, northern Italy, Japan and the Republic of Korea. Singaporeans should note that the Ministry of Foreign Affairs’ advisory issued on 8 January 2020 against travelling to or remaining in Iran due to rising tensions in the Middle East remains in place.<br><br>6.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As the situation will continue to evolve, Singapore residents who need to travel to the affected regions are advised to regularly check the Ministry of Health’s (MOH) website for updates. Travellers are also advised to stay vigilant, monitor developments and heed the advice of the local authorities while overseas.<br><br>7.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; From 4 March 2020, 2359 hours, all new visitors with recent travel history to Iran, northern Italy or the Republic of Korea within the last 14 days will not be allowed entry into Singapore, or transit through Singapore. With immediate effect, the Immigration and Checkpoints Authority (ICA) will suspend the issuance of all forms of new visas to those with Iranian passports[2].&nbsp;Previously issued short-term and multiple-visit visas for those with Iranian passports will also be suspended. During this period of suspension, they will not be allowed entry into Singapore.&nbsp;<br><br>8.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; From 4 March 2020, 2359 hours, the following returning groups will be issued with a Stay-Home Notice (SHN):<br><br>a)&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Residents (Singapore Citizens and Permanent Residents) with recent travel history to Iran, northern Italy, or the Republic of Korea within the last 14 days; and<br><br>b)&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Long-term pass holders (including work passes, Student’s Pass, Dependant’s Pass and Long-term Visit Pass) with recent travel history to Iran, northern Italy or the Republic of Korea within the last 14 days.&nbsp;<br><br>Under the SHN, they will have to remain in their place of residence at all times for a 14-day period after returning to Singapore.<br><br><strong><br>Expanded clinical case definition</strong><br><br>9.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; MOH has expanded the definition of suspect cases to include persons with pneumonia or severe respiratory infection with breathlessness who had been to Iran, northern Italy, Japan and the Republic of Korea within 14 days before onset of symptoms. Cases meeting the expanded definition will be referred to hospitals for further assessment.<br><br><br><strong>Precautionary testing for symptomatic travellers</strong><br><br>10.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; From 4 March 2020, 2359 hours, travellers entering Singapore and exhibiting fever and/or other symptoms of respiratory illness but who do not meet the clinical suspect case definition may be required to undergo a COVID-19 swab test at the checkpoint.[3] They may carry on with their journey immediately after undergoing the test. Pending the results, which may take between three and six hours, the travellers are advised to minimise contact with others as a precautionary measure. Individuals will be contacted on their swab test results and those with positive results will be conveyed to the hospital in a dedicated ambulance.<br><br>11.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Short-term visitors who are identified for testing but refuse to do so will not be allowed entry into Singapore. Singapore Permanent Residents and long-term pass holders who refuse testing may have their immigration facilities and work pass privileges revoked or the validity shortened. All travellers, including Singapore Citizens, who do not comply with the testing or who cannot be contacted subsequently may face penalties and can be prosecuted under the Infectious Diseases Act.<br><br>12.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The COVID-19 swab test kit deployed at checkpoints allows us to test beyond persons who are referred to hospitals, and extend testing to lower-risk symptomatic travellers as an added precautionary measure. This additional testing capability deployed upfront at checkpoints further increases our likelihood of detecting imported cases at the point of entry. As with any test, a negative result does not completely rule out the possibility of infection. As such, symptomatic travellers with a negative test result should continue to minimise social contact and seek medical attention should symptoms not improve over the next three days.&nbsp; &nbsp; &nbsp;<br><br><br><strong>Preparing ahead</strong><br><br>13.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The additional precautions we are taking will help to reduce the risk of imported cases in Singapore. But the virus is spreading quickly around the world, and there are likely to be many undetected cases in countries that are not undertaking proactive testing.&nbsp; So we will be exposed to new waves of infection, and increasingly it will not be possible to stop the virus at our borders. We also cannot isolate Singapore and shut ourselves from the world. So despite our best efforts, we have to be prepared for new spikes in COVID-19 cases in Singapore, as has happened elsewhere.&nbsp;<br><br>14.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; We will therefore have to redouble our efforts within Singapore. All of us have a role to play. The Government will continue to put in resources to detect and isolate all cases of infection, as well as identify and quarantine their close contacts so as to break the chain of infection. Individuals will need to continue with practices that have proven effective in reducing the spread of infectious diseases. These include:<br><br>•&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Staying home when unwell and during the period covered by medical certificates;<br>•&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Practising good personal hygiene such as washing hands regularly with soap and water, and not touching the face unnecessarily; and<br>•&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Cleaning up after oneself at hawker centres and not sharing utensils.<br><br>These need to become part of our daily life permanently. Such habits will enable us to resist infections like COVID-19, while going about our daily lives normally as much as possible.<br><br>[1]&nbsp;&nbsp; Refers to eight administrative regions in northern Italy: Aosta Valley, Piedmont, Liguria, Lombardy, Emilia-Romagna, Veneto, Friuli-Venezia Giulia and Trentino-Alto Adige/Südtirol.<br>[2]&nbsp;&nbsp; Travellers from Italy and the Republic of Korea do not require visas to visit Singapore.<br>[3]&nbsp; Travellers who meet the clinical suspect case definition will be conveyed directly to the hospital.<br><div><br></div>MINISTRY OF HEALTH<br>3 MARCH 2020", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "additional-precautionary-measures-in-response-to-escalating-global-situation", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}