{"pressItemDictionary": {"Press Releases": [{"Title": "60 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1598426100000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "26 Aug 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;As of 26 August 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 60 cases of COVID-19 infection in Singapore. Based on our investigations so far, there are 3 cases in the community, of whom 1 is a Singaporean and 2 are Work Pass holders.&nbsp;<br><br>2.&nbsp; &nbsp; &nbsp;There are 10 imported cases, who had all been placed on Stay-Home Notice upon arrival in Singapore.&nbsp;&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;<br><br><strong>MINISTRY OF HEALTH<br>26 AUGUST 2020</strong><br></p><div><br></div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "60-new-cases-of-covid-19-infection", "CurrentPageUrl": null}, {"Title": "Updated Border Measures for Travellers From the Republic of Korea", "PublishedDate": "/Date(1598410800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "26 Aug 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;The Multi-Ministry Taskforce has been closely monitoring the COVID-19 situation in the Republic of Korea. There have been reported clusters in gatherings at places of worship that have spread to workplaces. Authorities in the Republic of Korea have warned of a possible nationwide outbreak. Across the Republic of Korea, stricter social distancing measures have been imposed.&nbsp;&nbsp;</p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Given the resurgence in the number of cases in the Republic of Korea, we will adjust our border measures. Travellers entering Singapore from <strong>29 August 2020, 0000 hours, </strong>who have recent travel history, including transit, to the Republic of Korea, within the last 14 days will be required to serve a 14 day Stay-Home Notice (SHN) at dedicated SHN facilities instead of their own place of residence.<em> </em>They will also need to undergo a COVID-19 test before the end of their SHN, as is the current requirement.</p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; As the global situation evolves, we will continue to adjust our border measures to manage the risk of importation and transmission to the community. Travellers planning to enter Singapore must be prepared to be subjected to the prevailing border measures upon entry, including payment for their stay at dedicated SHN facilities and tests, where applicable<font size=\"1\">&nbsp;[1]</font>.&nbsp; We will continue to review the situation and adjust our border measures accordingly.</p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We must continue to remain vigilant in our efforts to control the spread of the virus.</p><p>&nbsp;</p><div><br clear=\"all\"><hr align=\"left\" size=\"1\" width=\"33%\"><div id=\"ftn1\"><p>[1] Singapore Citizens and Permanent Residents who last left before 27 Mar 2020 will not be required to pay for their stay at dedicated SHN facility but will still be required to pay for their COVID-19 test when entering Singapore from 1 September 2020 (waived if they enter by 31 Aug 2020). All other travellers must pay for their stay at dedicated SHN facility and COVID-19 test.</p></div></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "updated-border-measures-for-travellers-from-the-republic-of-korea", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}