{"pressItemDictionary": {"Press Releases": [{"Title": "482 More Cases Discharged, 386 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1591627500000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "08 Jun 2020", "Summary": "", "MainContent": "<div style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 14px;\">&nbsp; &nbsp;&nbsp; As of 8 June 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 386 cases of COVID-19 infection in Singapore. The breakdown is as follows: </span></div><div style=\"text-align: justify; margin-left: 40px;\"><span style=\"font-family: Arial; font-size: 14px;\"><br><strong>a)&nbsp;Imported cases: 0</strong></span></div><div style=\"text-align: justify; margin-left: 40px;\"><span style=\"font-family: Arial; font-size: 14px;\"><br>There are no imported cases today. </span></div><div style=\"text-align: justify; margin-left: 40px;\"><span style=\"font-family: Arial; font-size: 14px;\"><br><strong>b)&nbsp;Cases in the community: 2</strong> (1 Singaporean, 1 Work Pass holder)</span></div><div style=\"text-align: justify; margin-left: 40px;\"><span style=\"font-family: Arial; font-size: 14px;\"><br>Epidemiological investigations are ongoing for the 2 cases in the community today. Both were symptomatic, and had been tested after seeking medical treatment at Public Health Preparedness Clinics. </span></div><div style=\"text-align: justify; margin-left: 40px;\"><span style=\"font-family: Arial; font-size: 14px;\"><br>Overall, the number of new cases in the community has increased, from an average of 3 cases per day in the week before, to an average of 9 per day in the past week. The number of unlinked cases in the community has also increased, from an average of 2 cases per day in the week before, to an average of 4 per day in the past week. This is partly due to our active surveillance and screening of targeted groups, which have picked up more cases in the past week <sup>[1]</sup>. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.</span></div><div style=\"text-align: justify; margin-left: 40px;\"><span style=\"font-family: Arial; font-size: 14px;\"><br><strong>c)&nbsp;Cases residing in dormitories: 384</strong></span></div><div style=\"text-align: justify; margin-left: 40px;\"><span style=\"font-family: Arial; font-size: 14px;\"><br>We continue to pick up cases amongst Work Permit holders residing in dormitories, including in factory-converted dormitories, because of extensive testing in these premises, as part of our process to verify and test the status of all workers. </span></div><div style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 14px;\"><br>2. &nbsp;&nbsp; Details of these trends can be found in MOH’s daily situation Report (<a title=\"\" href=\"http://www.moh.gov.sg/covid-19/situation-report\" target=\"\">www.moh.gov.sg/covid-19/situation-report</a>). Please refer to <a title=\"Annex A\" href=\"/docs/librariesprovider5/pressroom/press-releases/moh-press-release---annex-a-(8-jun-2020).pdf?sfvrsn=2967ab48_0\">Annex A</a>&nbsp;for the summary of the confirmed cases. </span></div><div style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 14px;\"><br>3. &nbsp;&nbsp; Of the new cases, 99% are linked to known clusters, while the rest are pending contact tracing. </span></div><div style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 14px;\"><br><strong>Links between previous cases found</strong></span></div><div style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 14px;\"><br>4. &nbsp;&nbsp; In the past week (1 June to 7 June), MOH has uncovered links for 4 previously unlinked cases. </span></div><div style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 14px;\"><br>5. &nbsp;&nbsp; Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <a title=\"Annex B\" href=\"/docs/librariesprovider5/pressroom/press-releases/moh-press-release---annex-b-(8-jun-2020).pdf?sfvrsn=fde90ca2_0\">Annex B</a>&nbsp;and <a title=\"Annex C\" href=\"/docs/librariesprovider5/pressroom/press-releases/moh-press-release---annex-c-(8-jun-2020).pdf?sfvrsn=cb854354_0\">Annex C</a>&nbsp;for details.</span></div><div style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 14px;\"><br><strong>Update on condition of confirmed cases</strong></span></div><div style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 14px;\"><br>6. &nbsp; &nbsp; 482 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 25,368 have fully recovered from the infection and have been discharged from hospitals or community care facilities. </span></div><div style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 14px;\"><br>7. &nbsp; &nbsp; There are currently 269 confirmed cases who are still in hospital. Of these, most are stable or improving, and 4 are in critical condition in the intensive care unit. 12,634 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 25 have passed away from complications due to COVID-19 infection. </span></div><div style=\"text-align: justify;\"><span style=\"font-family: Arial;\"><span style=\"font-size: 14px;\"><br><strong>MINISTRY OF HEALTH<br>8 JUNE 2020</strong><br><br>==<br><span style=\"font-size: 12px;\">[1]&nbsp;These include surveillance testing of workers in essential services, staff in preschools, and school staff and students above the age of 12 who are diagnosed with acute respiratory infection (ARI) at first presentation to a doctor, as well as those with prolonged ARI symptoms. </span></span></span><span style=\"font-size: 12px;\"><br></span></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "482-more-cases-discharged-386-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "Regional Screening Centres Set Up to Facilitate Testing", "PublishedDate": "/Date(1591612560000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "08 Jun 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;COVID-19 testing is a key enabler of the Government’s overall efforts to safely re-open after the circuit breaker. Besides diagnostic testing, we have started to conduct active surveillance testing on targeted groups, to help detect cases early and reduce the risk of large COVID-19 clusters from developing. This has been enabled by screening centres set up across the island to support the national testing efforts.<br><br>2.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Over the past months, our national capacity to conduct tests for COVID-19 has been ramped up steadily. As of 1 June 2020, we have conducted over 408,000 tests, or 71,700 tests per million population.<br><strong><br>Testing for Safe Re-Opening</strong><br><br>3.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Besides diagnostic testing in the community and foreign worker dormitories, we have started to conduct active surveillance testing amongst targeted groups. In May 2020, we completed testing for all staff and residents in the Ministry of Health and Ministry of Social and Family Development residential homes for seniors, as seniors living in residential institutions are more vulnerable to COVID-19. We also completed testing of pre-school and early intervention staff as a precautionary measure before pre-schools resumed their full services.<br><br>4.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Testing in the migrant worker dormitories continues, both to contain the spread of the virus as well as to enable migrant workers to return to work. With the gradual re-opening of more workplaces, we have also started testing workers who are returning to work in the construction, marine and process sectors. This is because of the presence of a higher proportion of confirmed cases within these sectors in the past, and the greater difficulty in maintaining strict safe management and distancing measures at all times given the nature of their work. Testing will also be expanded to cover workers with higher risk of exposure to COVID-19, such as frontline workers supporting COVID-19 operations.<br><br>5.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;We have also extended testing to individuals who are diagnosed with acute respiratory infection (ARI) at first presentation to a doctor, starting first with groups such as seniors 65 years old and above, healthcare workers, as well as staff and older students<sup>[1]</sup>&nbsp;of our education institutions<sup>[2]</sup>. This is to allow us to identify COVID-19 cases earlier and to quickly contain any potential spread in the community.<br><br><strong>Regional Screening Centres to Support Testing<br></strong><br>6.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;The Health Promotion Board (HPB) has been appointed as the national agency to support COVID-19 testing, working closely with our healthcare partners. HPB has been setting up Regional Screening Centres (RSC) progressively across the island to support our screening and testing needs. These centres are integral to the implementation of our national testing strategy, and play a critical role in keeping Singapore COVID-19 safe.<br><br>7.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;The RSCs were deployed at temporary sites in May 2020 to carry out the screening services for preschool staff. Starting in June, they have been deployed to other sites, working closely with sector lead agencies (such as the Building and Construction Authority for the construction sector, and Economic Development Board for the marine and process sector) to support the screening requirements for workers in the identified sectors. Where possible, RSCs will be located in places that are easily accessible to support the screening needs in the community.<br><br>8.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Two of these centres, at the Old Police Academy and The Float @ Marina Bay, have commenced operations from 2 June 2020. HPB has set up two more centres on 8 June at the Bukit Gombak sport hall and Bishan sport hall, with another centre on the way at&nbsp;7 Bedok North Street 2 (former Sepak Takraw sport hall). There are also other swabbing sites set up in partnership with private partners to support these efforts, such as the testing facility at One Farrer Hotel. As testing capacity and operations ramp up, HPB will set up more of such centres as necessary at suitable locations across the island.<br><br>9.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;The RSCs are set up with proper infection control measures, and strict safe distancing requirements will be observed to protect individuals and the community. The RSCs do not take in walk-in requests for screening. Individuals who are unwell or have medical concerns should consult their primary care doctors, and will be referred for screening at the RSCs if necessary.<br><br><strong>Testing for Safe Transition<br></strong><br>10.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;As we build up our testing capacity, we will continually review our testing policies, as part of our broader strategy to fight COVID-19. While testing helps us to detect, isolate and contain possible spread, strong infection control measures will continue to be the mainstay of disease prevention in our community. We must continue to practise strict safe distancing and good personal hygiene, to reduce the risk of transmissions. Together, we can make our homes, schools, workplaces and communities safe as we ease into the phased resumption of our social and economic activities.</p> <div><br clear=\"all\"> <hr width=\"33%\" size=\"1\" align=\"left\"> <div id=\"ftn1\"> <p><sup>[1]</sup>&nbsp;This refers to students who are 13 years-old and above. For younger students, doctors will assess whether a test is required, as younger children may require different clinical considerations than older children.</p> </div> <div id=\"ftn2\"> <p><sup>[2]</sup>&nbsp;This includes preschools (including early intervention centres), primary and secondary schools (including student care centres), special education schools, Institutes of Higher Learning, and Private Education Institutions.</p> </div> </div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "regional-screening-centres-set-up-to-facilitate-testing", "CurrentPageUrl": null}, {"Title": "386 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1591599600000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "08 Jun 2020", "Summary": "", "MainContent": "<div style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 14px;\">&nbsp; &nbsp;&nbsp; As of 8 June 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 386 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders residing in foreign worker dormitories. Based on our investigations so far, there are two cases in the community, of whom one is a Singaporean and the other is a Work Pass holder.<br><br></span><span style=\"font-family: Arial; font-size: 14px;\">2. &nbsp; &nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight. </span></div><div style=\"text-align: justify;\"><span style=\"font-family: Arial;\"><span style=\"font-size: 14px;\"><br><strong>MINISTRY OF HEALTH<br>8 JUNE 2020</strong></span></span></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "386-new-cases-of-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}