{"pressItemDictionary": {"Press Releases": [{"Title": "139 More Cases Discharged, 54 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1598801400000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "30 Aug 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As of 30 August 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 54 cases of COVID-19 infection in Singapore. The breakdown of the cases is as follows:<br><br><strong>Summary of new cases</strong><br></p><p>Amongst the new cases today, 47 are asymptomatic, and were detected from our proactive screening and surveillance, while 7 were symptomatic.</p><table border=\"1\" cellspacing=\"0\" cellpadding=\"0\"><tbody><tr><td width=\"241\" valign=\"top\"><p>&nbsp;</p></td><td width=\"120\"><p align=\"center\"><strong>Already in quarantine/ isolation before detection</strong></p></td><td width=\"120\"><p align=\"center\"><strong>Detected from surveillance</strong></p></td><td width=\"120\"><p align=\"center\"><strong>Total</strong></p></td></tr><tr><td width=\"241\" valign=\"top\"><p><strong>Imported cases</strong></p></td><td width=\"120\"><p align=\"center\">7</p></td><td width=\"120\"><p align=\"center\">0</p></td><td width=\"120\"><p align=\"center\">7</p></td></tr><tr><td width=\"241\" valign=\"top\"><p><strong>Cases in the community</strong></p></td><td width=\"120\"><p align=\"center\">7</p></td><td width=\"120\"><p align=\"center\">1</p></td><td width=\"120\"><p align=\"center\">8</p></td></tr><tr><td width=\"241\" valign=\"top\"><p><strong>Cases residing in dormitories</strong></p></td><td width=\"120\"><p align=\"center\">22</p></td><td width=\"120\"><p align=\"center\">17</p></td><td width=\"120\"><p align=\"center\">39</p><div><br></div></td></tr></tbody></table><p><strong><br>a) Imported cases: 7 </strong>(5 Singaporeans/ Permanent Residents, 1 Work Permit holder, 1 Dependant’s Pass holder)<br><p><br>Amongst the 7 imported cases, 5 (Cases 56816, 56821, 56822, 56842 and 56852) are Singaporeans/ Permanent Residents who returned to Singapore from Bangladesh on 17 August, India on 18 August and 22 August, the Philippines on 18 August and UAE on 8 August [1]. Another case (Case 56824) is a Work Permit holder currently employed in Singapore who arrived from the Philippines on 18 August. The remaining case (Case 56820) is a Dependant’s Pass holder who arrived from Pakistan on 18 August. All of them had been placed on 14-day Stay-Home Notice (SHN) upon arrival in Singapore, and had been tested while serving their SHN at dedicated facilities. </p><p><strong>b) Cases in the community: 8 </strong>(7 Singaporeans, 1 Work Pass holder)</p></p><p><p>Of the 8 cases in the community, 2 were picked up as a result of our proactive surveillance and screening, and 6 had already been placed on quarantine earlier. 3 of the cases are asymptomatic, and were detected through our proactive testing</p><p>7 of the community cases today are linked to previous cases or clusters. Of these, 6 cases had been identified as contacts of previously confirmed cases, and had been placed on quarantine earlier. They were tested during quarantine to determine their status. Amongst them, 5 cases (Cases 56823, 56827, 56830, 56831 and 56832) are part of a family cluster involving individuals across 2 households. These individuals had participated in family gatherings, and investigations are ongoing to see if there were any breaches of safe distancing rules. We take a serious view of such breaches and will not hesitate to take enforcement actions against any offenders.</p><p>Another case (Case 56826) is a colleague of Case 56184 at SLR Revolution at Excelsior Shopping Centre (5 Coleman Street), and had earlier been placed on quarantine. As a precautionary measure following the detection of an earlier case (Case 56626) who had visited the shop during Case 56184’s infectious period, MOH has identified and contacted 240 individuals who had visited SLR Revolution at Excelsior Shopping Centre between 15 August and 18 August 2020, and facilitated COVID-19 testing for all of them, even though the risk of infection for visitors is assessed to be low. So far, a total of 224 individuals have been swabbed and the results are pending. MOH is facilitating testing for the remaining individuals.</p><p>The remaining case (Case 56829) had gone to see a General Practitioner under the Swab and Send Home (SASH) Programme on 27 August and was diagnosed with acute respiratory infection (ARI), and was administered with a swab&nbsp; test. Before the test result was ready, Case 56828 was separately identified as a close contact of Case 56740 and was placed on quarantine on 28 August. The test result from the clinic subsequently confirmed that this was a positive case.</p><p>There is 1 case in the community who is currently unlinked. Case 56851 was detected as a result of our Rostered Routine Testing of workers in the construction, marine and process sectors who are living outside the dormitories. Epidemiological investigations of the case are in progress. In the meantime, all the identified close contacts of the case have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for his household contacts to determine if he could have been infected by them.</p><p>Overall, the number of new cases in the community has increased, from an average of 2 cases per day in the week before, to an average of 3 per day in the past week. The number of unlinked cases in the community has remained stable at an average of 1 case per day in the past 2 weeks.&nbsp;We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.</p></p><p><strong>c) Cases residing in dormitories: 39</strong></p> <p>Amongst the 39 cases residing in dormitories, 22 had been identified earlier as contacts of previous cases, and had already been quarantined to prevent further transmission. They were tested during quarantine to determine their status.&nbsp;&nbsp;</p> <p>The remaining 17 cases were detected through surveillance testing, such as our bi-weekly Rostered Routine Testing of workers living in dormitories and testing of those with ARI symptoms. This allows us to pick up cases early, including asymptomatic ones, so that we are able to ring-fence them quickly to prevent further transmission, by aggressively containing, tracing and isolating the close contacts.</p> <p>Besides the polymerase chain reaction (PCR) test, we have also conducted serological tests to determine if some of these cases are current or past infections [2].The serological test results for 14 cases have come back positive so far, which indicate likely past infections.</p><p>2.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Details of these trends can be found in MOH’s daily situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\" style=\"font-size: 13px;\">www.moh.gov.sg/covid-19/situation-report</a><span style=\"font-size: 13px;\">). Please refer to </span><u style=\"font-size: 13px;\"><a href=\"/docs/librariesprovider5/pressroom/annex-a-30-aug.pdf?sfvrsn=55d69c4a_0\" title=\"Annex A \">Annex A </a></u><span style=\"font-size: 13px;\"> for the summary of the confirmed cases.</span></p><p><p>3.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Of the new cases, 91% are imported or linked to known cases/ clusters, while the rest are pending contact tracing.</p></p><p><p><strong>Links between previous cases found</strong></p><p>4.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <u><a href=\"/docs/librariesprovider5/default-document-library/annex-b-30-aug.pdf?sfvrsn=6c09abda_0\" title=\"Annex B \">Annex B </a></u> and <u><a href=\"/docs/librariesprovider5/default-document-library/annex-c-30-aug.pdf?sfvrsn=97219b_0\" title=\"Annex C \">Annex C </a></u> for details.</p></p><p><p><strong>Update on condition of confirmed cases</strong></p><p>5.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; 139 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 55,586 have fully recovered from the infection and have been discharged from hospitals or community care facilities.</p></p><p><p>6.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;There are currently 74 confirmed cases who are still in hospital. Of these, most are stable or improving, and none is in the intensive care unit. 1,084 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 27 have passed away from complications due to COVID-19 infection.</p></p><div> <hr align=\"left\" size=\"1\" width=\"33%\"> <div id=\"ftn1\"> <p>[1] Case 56816 had returned to Singapore on 8 August and served SHN at a dedicated facility with her parent. She was subsequently placed on quarantine when her parent was tested positive for COVID-19. Due to an administrative error, this case had not been included in the case count earlier although public health actions commenced from the date of confirmation.</p> </div> <div id=\"ftn2\"> <p>[2] Cases whose serological tests are positive are likely to have a past infection, and could be shedding minute fragments of the virus RNA picked by the PCR test, which were no longer transmissible and infective to others.</p> </div> </div><br><br><br>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "139-more-cases-discharged-54-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "54 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1598771700000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "30 Aug 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As of 30 August 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 54 cases of COVID-19 infection in Singapore. Based on our investigations so far, there are 8 cases in the community, of whom 7 are Singaporeans/ Permanent Residents and 1 is a Work Pass holder.</p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; There are 7 imported cases, who had all been placed on Stay-Home Notice upon arrival in Singapore.&nbsp;</p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.</p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "54-new-cases-of-covid-19-infection", "CurrentPageUrl": null}, {"Title": "Advisory On the Increase In the Number of Invasive Group B Streptococcus Cases", "PublishedDate": "/Date(1598766840000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "30 Aug 2020", "Summary": "", "MainContent": "&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The Ministry of Health (MOH) and Singapore Food Agency (SFA) are investigating a recent uptrend in the number of Group B Streptococcus (GBS) cases. As GBS infections had earlier been associated with the consumption of raw freshwater fish, we advise members of the public who choose to consume ready-to-eat (RTE) raw fish to exercise caution.<br><br>&nbsp;2.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; In July 2020, MOH received reports of 50 GBS cases from public hospitals. This compares with an average of 25 GBS cases per month from January to June 2020. Further laboratory investigations showed that 18 of the cases reported in July were GBS Type III ST283. This compares with an average of 4 cases per month from April to June 2020. The majority of the cases with GBS Type III ST283 were aged 65 and above. Most have since been discharged and have recovered from the infection while one case has passed away due to an unrelated cause.<br><br>&nbsp;3.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; MOH and SFA are currently collecting information on the affected individuals’ food history and conducting field investigations at various locations, to determine possible sources of GBS in these cases.&nbsp;<br><br>&nbsp;<br><strong>No detection of GBS in fish samples so far</strong><br><br>&nbsp;4.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Based on SFA’s routine sampling and testing of fish samples for GBS between May 2019 and August 2020, the presence of ST283 has not been detected. SFA also conducted inspections at food stalls visited by recent cases and found that none of the stalls sold any RTE raw fish dishes.<br><br>&nbsp;5.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Nevertheless, SFA is issuing reminders to retail food establishments to adhere to the ban on<strong> the use of freshwater fish</strong> for sale of RTE raw fish dishes, which has been in force since December 2015. Food establishments selling RTE raw fish are also reminded to ensure good hygiene practices and proper handling of the RTE raw fish. MOH has also alerted doctors to remain vigilant and report suspected invasive GBS cases.<br><br>&nbsp;<br><strong>Health Advisory</strong><br><br>&nbsp;6.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; GBS is a common bacterium found in the human gut and urinary tract of about 15% to 30% of adults without causing disease. However, GBS may occasionally cause invasive infections of the skin, joints, heart and brain. The risk factors for GBS infection include underlying chronic or co-morbid conditions, such as diabetes. Transmission may also occur during childbirth. Most GBS infections are treatable with antibiotics.<br><br>&nbsp;7.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; GBS infections have previously been associated with the consumption of raw freshwater fish. Raw food is likely to contain more bacteria compared to well-cooked food. Members of the public who choose to consume RTE raw fish must be aware of the risks involved. Cooking raw food well is still the most effective way to kill bacteria. As a general precaution, vulnerable groups of people, especially young children, pregnant women, elderly persons, or people with chronic illness such as diabetes, may be more susceptible and should exercise caution by avoiding the consumption of raw food. Individuals can also reduce their risk of infection by:<br><br>•&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Thoroughly cooking food;<br>•&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Washing hands and kitchen utensils such as knives and cutting boards thoroughly before handling food; and<br>•&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Using separate sets of knives and cutting board for raw and cooked food.<br><br>&nbsp;<br><strong>MINISTRY OF HEALTH<br>SINGAPORE FOOD AGENCY<br>29 AUGUST 2020</strong><br><br><a href=\"/docs/librariesprovider5/pressroom/annex-a-gbs.pdf?sfvrsn=91fce52b_2\" title=\"Annex A\"><strong>Annex A</strong></a><strong> -</strong> Good Hygiene Practices and Proper Handling of Ready-to-Eat Raw Fish", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "advisory-on-the-increase-in-the-number-of-invasive-group-b-streptococcus-cases", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}