{"pressItemDictionary": {"Press Releases": [{"Title": "142 More Cases Discharged, 49 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1599057900000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "02 Sep 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\"><span style=\"font-family: Arial;\"><span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp; As of 2 September 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 49 cases of COVID-19 infection in Singapore. The breakdown of the cases is as follows:<br><br><strong>Summary of new cases</strong><br><br>Amongst the new cases today, 46 are asymptomatic, and were detected from our proactive screening and surveillance, while 3 were symptomatic.&nbsp;<br><br></span></span></p><table border=\"1\" cellspacing=\"0\" cellpadding=\"0\"> <tbody><tr> <td width=\"220\" valign=\"top\"> <p>&nbsp;</p> </td> <td width=\"117\"> <p align=\"center\"><strong>Already in quarantine/ isolation before detection </strong></p> </td> <td width=\"118\"> <p align=\"center\"><strong>Detected from surveillance </strong></p> </td> <td width=\"110\"> <p align=\"center\"><strong>Total</strong></p> </td> </tr> <tr> <td width=\"220\" valign=\"top\"> <p><strong>Imported cases</strong></p> </td> <td width=\"117\"> <p align=\"center\">3</p> </td> <td width=\"118\"> <p align=\"center\">0</p> </td> <td width=\"110\"> <p align=\"center\">3</p> </td> </tr> <tr> <td width=\"220\" valign=\"top\"> <p><strong>Cases in the community </strong></p> </td> <td width=\"117\"> <p align=\"center\">0</p> </td> <td width=\"118\"> <p align=\"center\">3</p> </td> <td width=\"110\"> <p align=\"center\">3</p> </td> </tr> <tr> <td width=\"220\" valign=\"top\"> <p><strong>Cases residing in dormitories </strong></p> </td> <td width=\"117\"> <p align=\"center\">14</p> </td> <td width=\"118\"> <p align=\"center\">29</p> </td> <td width=\"110\"> <p align=\"center\">43</p> </td> </tr> </tbody></table><p style=\"text-align: justify;\"><span style=\"font-family: Arial;\"><span style=\"font-size: 16px;\"><br><strong>a) Imported cases: 3</strong> (1 Work Pass holder, 2 Work Permit holders)<br><br>Amongst the 3 imported cases, 2 (Cases 56959 and 56962) are Work Pass/ Work Permit holders currently employed in Singapore who arrived from India and the Philippines on 21 August. Both of them had been placed on 14-day Stay-Home Notice (SHN) upon arrival in Singapore, and had been tested while serving their SHN at dedicated facilities.&nbsp;<br><br>The remaining case (Case 56971) is a seaman who had been tested upon arrival from Indonesia on 26 August. He had been isolated while awaiting his test result, and was subsequently conveyed in an ambulance to a hospital when it came back positive.&nbsp;&nbsp;<br><br><strong>b) Cases in the community: 3</strong> (1 Singaporean, 1 Work Pass holder, 1 Work Permit holder)<br><br>All 3 cases in the community were picked up as a result of our proactive surveillance and screening. 2 of the cases are asymptomatic, and were detected through our proactive testing.<br><br>All 3 cases in the community are currently unlinked. Amongst them, 2 (Cases 56944 and 56946) were detected as a result of our Rostered Routine Testing of workers in the construction, marine and process sectors who are living outside the dormitories. The remaining case (Case 56960) was detected under our enhanced community testing to test all individuals aged 13 and above who are diagnosed with acute respiratory infection (ARI) at first presentation to a doctor. This allows us to identify infected individuals early and to quickly contain further spread.<br><br>Epidemiological investigations of the cases are in progress. In the meantime, all the identified close contacts of the cases have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for their household contacts to determine if they could have been infected by them.&nbsp;<br><br>Overall, the number of new cases in the community has increased, from an average of 2 cases per day in the week before, to an average of 3 per day in the past week. The number of unlinked cases in the community has remained stable at an average of 1 case per day in the past 2 weeks. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br><br><strong>c) Cases residing in dormitories: 43</strong><br><br>Amongst the 43 cases residing in dormitories, 14 had been identified earlier as contacts of previous cases, and had already been quarantined to prevent further transmission. They were tested during quarantine to determine their status.&nbsp;&nbsp;<br><br>The remaining 29 cases were detected through surveillance testing, such as our bi-weekly Rostered Routine Testing of workers living in dormitories and testing of those with ARI symptoms. This allows us to pick up cases early, including asymptomatic ones, so that we are able to ring-fence them quickly to prevent further transmission, by aggressively containing, tracing and isolating the close contacts.&nbsp;<br><br>Besides the polymerase chain reaction (PCR) test, we have also conducted serological tests to determine if some of these cases are current or past infections.&nbsp; The serological test results for 23 cases have come back positive so far, which indicate likely past infections.<br><br>2.&nbsp; &nbsp; &nbsp;Details of these trends can be found in MOH’s daily situation Report (<a href=\"https://www.moh.gov.sg/covid-19/situation-report/\" title=\"\" class=\"\" target=\"\">www.moh.gov.sg/covid-19/situation-repor</a>t). Please refer to <a href=\"/docs/librariesprovider5/default-document-library/annex-a9a9a581e38654a5facb93a9183ecf713.pdf?sfvrsn=4cbf01ef_0\" title=\"Annex A\">Annex A</a>&nbsp;for the summary of the confirmed cases.&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp;Of the new cases, 82% are imported or linked to known cases/ clusters, while the rest are pending contact tracing.&nbsp;<br><br><strong>Links between previous cases found</strong><br><br>4.&nbsp; &nbsp; &nbsp;Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <a href=\"/docs/librariesprovider5/default-document-library/annex-b3c801ba018624642a769cd6504c2b5c8.pdf?sfvrsn=42453d00_0\" title=\"Annex B\">Annex B</a>&nbsp;and <a href=\"/docs/librariesprovider5/default-document-library/annex-cae9e3af8ce524674b1caac44964c260c.pdf?sfvrsn=33d2188a_0\" title=\"Annex C\">Annex C</a>&nbsp;for details.&nbsp;<br><br><strong>Update on condition of confirmed cases</strong><br><br>5.&nbsp; &nbsp; &nbsp;142 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 55,891 have fully recovered from the infection and have been discharged from hospitals or community care facilities.&nbsp;<br><br>6.&nbsp; &nbsp; &nbsp;There are currently 75 confirmed cases who are still in hospital. Of these, most are stable or improving, and none is in the intensive care unit. 867 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 27 have passed away from complications due to COVID-19 infection.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>2 SEPTEMBER 2020</strong><br></span></span></p><div style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 16px;\"><br></span></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "142-more-cases-discharged-49-new-cases-of-covid-19-infection-confirmed-published", "CurrentPageUrl": null}, {"Title": "49 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1599030960000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "02 Sep 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\"><span style=\"font-family: Arial;\"><span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; As of 2 September 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 49 cases of COVID-19 infection in Singapore. Based on our investigations so far, there are 3 cases in the community, of whom 1 is a Singaporean and 2 are Work Pass holders.&nbsp;<br><br>2.&nbsp; &nbsp; &nbsp;There are 3 imported cases, who had all been placed on Stay-Home Notice or isolated upon arrival in Singapore.&nbsp;&nbsp;<br><br>3.&nbsp; &nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>2 SEPTEMBER 2020</strong></span></span></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "49-new-cases-of-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}