{"pressItemDictionary": {"Press Releases": [{"Title": "347 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1594716780000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "14 Jul 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;As of 14 July 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 347 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders residing in foreign worker dormitories. Based on our investigations so far, there are 7 cases in the community, of whom 1 is a Singaporean and 6 are Work Pass holders. In addition, there are 2 imported cases who had been placed on Stay-Home Notice upon arrival in Singapore.<br><br>2.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; We have to date tested and cleared more than 215,000 workers (or two-thirds of those living in dormitories). Work is ongoing to prepare these dormitories to be declared cleared, and for workers to resume work. We are on track to clear about 80% of workers staying in the dormitories by end-July, and to complete the testing of dormitory residents around mid-August.<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;In the next few days, we have a larger population of migrant workers in various purpose-built dormitories completing their isolation period and being tested for COVID-19. As some of them came from dormitories with higher prevalence of COVID-19 infection, we can expect a higher number of confirmed cases in the next few days from this group of migrant workers.<br><br>4.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;We are still working through the details of the cases today, and further updates will be shared via the MOH press release that will be issued tonight.<br><br><br><strong>MINISTRY OF HEALTH<br></strong><strong>14 JULY 2020</strong></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "347-new-cases-of-covid-19-infection-14jul", "CurrentPageUrl": null}, {"Title": "Mis-reported Covid-19 Case Due to Laboratory Error", "PublishedDate": "/Date(1594708500000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "14 Jul 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\"><span style=\"font-family: Arial;\"><span style=\"font-size: 14px;\">&nbsp; &nbsp; &nbsp; &nbsp;An error made by a COVID-19 testing laboratory has resulted in an erroneous reporting of a COVID-19 case as positive, when the result is in fact negative.&nbsp;<br><br>2.&nbsp; &nbsp;Case 45655, a Secondary One student from Jurong West Secondary School who is asymptomatic, was reported as a confirmed case by the Ministry of Health (MOH) on 10 July 2020. This was based on the erroneous test results submitted by the laboratory. Due to a human error, the laboratory had mislabelled a swab sample from a COVID-19 positive individual as belonging to Case 45655 without properly verifying the patient identifiers of the specimen tubes. Consequently, Case 45655 was recorded as being positive for COVID-19, and was reported to MOH as such.&nbsp;<br><br>3.&nbsp; The error was discovered upon re-testing of Case 45655 and MOH was informed of the error on 13 July. The mislabelled positive sample belongs to a migrant worker who had been isolated since his swab, and had not been in contact with any other individuals. He is currently well.<br><br>4.&nbsp; &nbsp; Further testing of the correct sample and new swab samples from the student all produced negative results for COVID-19. The test results for the close contacts who had been placed on quarantine following the first confirmed case at the school (Case 45160) have all tested negative for COVID-19 as well. This means there is no transmission at the school.&nbsp;<br><br>5.&nbsp; &nbsp; The student had so far been isolated and had not come into contact with any other COVID-19 patients and is therefore not at risk of infection from other patients in the hospital. MOH has informed the Ministry of Education, and rescinded the Quarantine Orders of the close contacts who had previously been placed on quarantine.&nbsp;<br><br>6.&nbsp; &nbsp; MOH takes a serious view of this error. We are investigating this matter, and will take appropriate actions against the laboratory if it is found to be in breach of protocols. In the meantime, the laboratory has reviewed and tightened its processes to prevent a recurrence of the error.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>14 JULY 2020</strong></span></span></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "mis-reported-covid-19-case-due-to-laboratory-error", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}