{"pressItemDictionary": {"Press Releases": [{"Title": "213 More Cases Discharged, 399 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1595342100000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "21 Jul 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As of 21 July 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 399 cases of COVID-19 infection in Singapore. The higher number of cases today is mainly due to a batch of test results from the previous day reported to MOH after the 12pm cut-off for yesterday’s reporting. The breakdown of the cases is as follows:<br><br><strong>a) Imported cases: 3</strong> (2 Work Pass holders, 1 Special Pass holder)<br><br>Amongst the imported cases, 2 (Cases 48148 and 48149) arrived in Singapore from India on 9 July. They are Work Pass holders who are currently employed in Singapore. They had been placed on 14-day Stay-Home Notice (SHN) upon arrival in Singapore, and had been tested while serving their SHN.<br><br>The remaining case (Case 48146) had arrived in Singapore from the Philippines on 19 July, and was conveyed directly to the National Centre for Infectious Diseases as he was symptomatic. He is a seaman currently holding a Special Pass who will join a vessel that called in our Port.&nbsp;<br><br><strong>b) Cases in the community: 9</strong> (1 Singaporean, 3 Work Pass holders, 5 Work Permit holders)<br><br>Of the 9 cases in the community, 7 were picked up as a result of our proactive surveillance and screening, and 2 had already been placed on quarantine earlier. 8 of the cases are asymptomatic, and were detected through our proactive testing.&nbsp;<br><br>3 of the community cases today are linked to previous cases or clusters. Of these, 2 (Cases 48259 and 48513) had been identified as contacts of previously confirmed cases, and had been placed on quarantine earlier. They are asymptomatic and were tested during quarantine to determine their status. The remaining case (Case 48154) is also asymptomatic, and was swabbed as part of our efforts to screen individuals working in frontline COVID-19 operations.&nbsp;<br><br>6 of the community cases are currently unlinked. All of them were detected from our proactive screening of workers in essential services who are living outside the dormitories, even though 5 of them are asymptomatic.<br><br>Epidemiological investigations of the unlinked cases are in progress. In the meantime, all the identified close contacts of the cases have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for their household contacts to determine if these cases could have been infected by them.&nbsp;<br><br>Overall, the number of new cases in the community has decreased, from an average of 13 cases per day in the week before, to an average of 10 per day in the past week. The number of unlinked cases in the community has also decreased, from an average of 7 cases per day in the week before, to an average of 6 per day in the past week. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br><br><strong>c) Cases residing in dormitories: 387<br></strong><br>We continue to pick up cases amongst Work Permit holders residing in dormitories, including in factory-converted dormitories, because of extensive testing in these premises, as part of our process to verify and test the status of all workers.&nbsp;<br><br>2.&nbsp; &nbsp;Details of these trends can be found in MOH’s daily situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\" title=\"\" class=\"\" target=\"\">www.moh.gov.sg/covid-19/situation-report</a>). Please refer to <a href=\"/docs/librariesprovider5/default-document-library/annex-a092b172d93c14e1f8d684c7bbf4ce7b6.pdf?sfvrsn=4bf2a4c_0\" title=\"Annex A\">Annex A</a>&nbsp;for the summary of the confirmed cases.&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp;Of the new cases, 96% are linked to known clusters, while the rest are pending contact tracing.&nbsp;<br><br>4.&nbsp; &nbsp; &nbsp; The Inter-Agency Task Force has been systematically and progressively clearing dormitories through aggressive testing of migrant workers residing in dormitories. Woodlands Lodge II (190 Woodlands Industrial Park E7) and SSKBJV Dormitory (31A Tanah Merah Coast Road) have been cleared, and now house only recovered individuals and those who have recently tested negative for COVID-19 infection. As such, the clusters have now been closed.<br><br><strong>Links between previous cases found<br></strong><br>5.&nbsp; &nbsp; &nbsp; In the past week (14 July to 20 July), MOH has uncovered links for 2 previously unlinked cases in the community.&nbsp;<br><br>6.&nbsp; &nbsp; &nbsp;Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <a href=\"/docs/librariesprovider5/default-document-library/annex-b1f7571e32f65411d9f5561c3b3dec3f9.pdf?sfvrsn=ba4c4b5_0\" title=\"Annex B\">Annex B</a>&nbsp;and <a href=\"/docs/librariesprovider5/default-document-library/annex-cc26f2676861a48218be4764ef2efebae.pdf?sfvrsn=132b2e37_0\" title=\"Annex C\">Annex C</a>&nbsp;for details.&nbsp;<br><br><strong>Update on condition of confirmed cases<br></strong><br>7.&nbsp; &nbsp; &nbsp;213 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 44,584 have fully recovered from the infection and have been discharged from hospitals or community care facilities.&nbsp;<br><br>8.&nbsp; &nbsp; &nbsp; &nbsp;There are currently 170 confirmed cases who are still in hospital. Of these, most are stable or improving, and none is in the intensive care unit. 3,653 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 27 have passed away from complications due to COVID-19 infection.&nbsp;<br><br><strong>MINISTRY OF HEALTH<br>21 JULY 2020</strong></p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "213-more-cases-discharged-399-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "President’s Award for Nurses 2020", "PublishedDate": "/Date(1595325600000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "21 Jul 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; Five nurses have been honoured with the President’s Award for Nurses this year, the highest accolade in Singapore’s nursing profession. This brings the total number of recipients since the inception of the award in 2000 to 77.&nbsp;<br><br>2.&nbsp; &nbsp; This national award recognises nurses who have shown sustained outstanding performance and contributions to patient care delivery, education, research and administration.&nbsp;<br><br>3.&nbsp; &nbsp; The award is open to all registered nurses from healthcare institutions in the public, private, and community care sectors, as well as the educational institutions. Nurses are nominated by their institutions, public or peers, and interviewed by a panel chaired by Dr Chia Shi-Lu.<br><br>4.&nbsp; &nbsp; This year’s award recipients include two from acute hospitals, and one each from hospice, national speciality centre and community nursing settings. Of the five recipients, two are Advanced Practice Nurses.<br><br>5.&nbsp; &nbsp; The five recipients are:&nbsp;<br><strong><br>- Ms Chin Soh Mun</strong><br>Director of Nursing, Dover Park Hospice<br><strong><br>- Dr Alice Chua Foong Sin</strong><br>Assistant Director of Nursing, Advanced Practice Nurse, National Cancer Centre&nbsp;Singapore<br><br><strong>- Ms Kala D/O Narayanasamy&nbsp;</strong><br>Deputy Director of Nursing, Woodlands Health Campus<br><br><strong>- Ms Tay Yee Kian</strong><br>Assistant Director of Nursing, Advanced Practice Nurse, Regional Health System Office, National University Health System&nbsp;<br><br><strong>- Ms Patricia Yong Yueh Li</strong><br>Deputy Director of Nursing, Singapore General Hospital<br><br>7.&nbsp; &nbsp; Each awardee received a trophy, a certificate signed by President and a $10,000 cash prize that can be used for their professional and personal development. More information on the award recipients is in the <a href=\"/docs/librariesprovider5/default-document-library/annex---award-recipients.pdf?sfvrsn=c4577b01_0\" title=\"Annex \">Annex </a>.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>21 JULY 2020</strong><br></p><div><br></div>", "PressCategory": ["Press Releases"], "CustomDetailUrl": "", "UrlName": "president-s-award-for-nurses-2020", "CurrentPageUrl": null}, {"Title": "399 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1595318400000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "21 Jul 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;As of 21 July 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 399 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders residing in foreign worker dormitories. Based on our investigations so far, there are 9 cases in the community, of whom 1 is a Singaporean and 8 are Work Pass holders. In addition, there are 3 imported cases who had been isolated or placed on Stay-Home Notice upon arrival in Singapore.&nbsp;<br><br>2.&nbsp; &nbsp; &nbsp; &nbsp;The higher number of cases today is mainly due to a batch of test results from the previous day reported to MOH after the 12pm cut-off for yesterday’s reporting.&nbsp;&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;<br><br><strong>MINISTRY OF HEALTH<br>21 JULY 2020</strong><br></p><div><br></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "399-new-cases-of-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}