{"pressItemDictionary": {"Press Releases": [{"Title": "2 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1602517800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "12 Oct 2020", "Summary": "", "MainContent": "1.&nbsp; &nbsp; &nbsp; As of 12 October 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified 2 new cases of locally transmitted COVID-19 infection. Of these, 1 is in the community, and 1 resides in a dormitory. In addition, there are 2 imported cases, who had both been placed on Stay-Home Notice (SHN) upon arrival. All new cases today are asymptomatic, and were detected from our proactive screening and surveillance.&nbsp;<br><br><p><strong>Summary of new cases</strong></p><table border=\"1\" cellspacing=\"0\" cellpadding=\"0\" width=\"605\"><tbody><tr><td width=\"129\"><p align=\"right\">&nbsp;</p></td><td width=\"60\"><p>&nbsp;</p></td><td width=\"192\" colspan=\"2\"><p align=\"center\"><strong>Breakdown by</strong></p></td><td width=\"192\" colspan=\"2\"><p align=\"center\"><strong>Breakdown by</strong></p></td></tr><tr><td width=\"129\"><p align=\"right\">&nbsp;</p></td><td width=\"60\"><p><strong>Number of cases</strong></p></td><td width=\"96\"><p><strong>Already in quarantine/ isolation before detection</strong></p></td><td width=\"96\"><p><strong>Detected from surveillance</strong></p></td><td width=\"96\"><p><strong>Symptomatic</strong></p></td><td width=\"96\"><p><strong>Asymptomatic</strong></p></td></tr><tr><td width=\"129\"><p><strong>Cases in the community</strong></p></td><td width=\"60\"><p align=\"center\">1</p></td><td width=\"96\"><p align=\"center\">1</p></td><td width=\"96\"><p align=\"center\">0</p></td><td width=\"96\"><p align=\"center\">0</p></td><td width=\"96\"><p align=\"center\">1</p></td></tr><tr><td width=\"129\"><p><strong>Cases residing in dormitories</strong></p></td><td width=\"60\"><p align=\"center\">1</p></td><td width=\"96\"><p align=\"center\">1</p></td><td width=\"96\"><p align=\"center\">0</p></td><td width=\"96\"><p align=\"center\">0</p></td><td width=\"96\"><p align=\"center\">1</p></td></tr><tr><td width=\"129\"><p><strong>Imported cases</strong></p></td><td width=\"60\"><p align=\"center\">2</p></td><td width=\"96\"><p align=\"center\">2</p></td><td width=\"96\"><p align=\"center\">0</p></td><td width=\"96\"><p align=\"center\">0</p></td><td width=\"96\"><p align=\"center\">2</p></td></tr><tr><td width=\"129\"><p><strong>Total</strong></p></td><td width=\"60\"><p align=\"center\">4</p></td><td width=\"96\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">&nbsp;</p></td></tr></tbody></table><br><br>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Overall, the number of new cases in the community has decreased from an average of 1 case per day in the week before, to an average of fewer than 1 per day in the past week. The number of unlinked cases in the community has also decreased from an average of fewer than 1 case per day in the week before, to none in the past week. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br><br>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; All the new cases today are imported or linked to known cases/ clusters.<br><br><strong>Case Details</strong><br><br><strong>a)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Cases in the community: 1</strong><br><br>There is 1 case in the community today who is a family member of previously confirmed cases. Case 58037 had been identified as a contact of Cases 57860 and 57933, and had been placed on quarantine earlier. All 3 cases had arrived from India on 16 September, and were placed on SHN at a dedicated facility. Cases 57860 and 57933 subsequently tested positive for COVID-19 infection on 27 September and 1 October respectively. Case 58037 was tested during quarantine to determine her status, even though she is asymptomatic.<br><br><strong>b)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Cases residing in dormitories: 1</strong><br><br>There is 1 case residing in a dormitory today who had been identified earlier as a contact of previous cases, and had already been quarantined to prevent further transmission. He was tested during quarantine to determine his status, even though he is asymptomatic.<br><br><strong>c)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Imported cases: 2</strong><br><br>There are 2 imported cases today. Case 58032 is a Singapore Permanent Resident who returned to Singapore from the Philippines, and Case 58036 is a Work Pass holder currently employed in Singapore who arrived from India and the UAE. They had both been placed on 14-day SHN upon arrival in Singapore, and were tested while serving SHN even though they are asymptomatic.<br><br>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Details of these trends can be found in MOH's daily situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\" title=\"\" class=\"\" target=\"\">www.moh.gov.sg/covid-19/situation-report</a>).<br><br>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Epidemiological investigations are in progress. In the meantime, all the identified close contacts of the cases have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for the close contacts to determine if the cases could have been infected by them.<br><br>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; MOH has been monitoring existing clusters for any further transmission. As there have been no more cases linked to the dormitory at 9 Sungei Kadut Avenue for the past two incubation periods (i.e. 28 days), the cluster has now been closed.<br><br><strong>Links between previous cases found</strong><br><br>7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-a---12-oct-2020.pdf?sfvrsn=7abc4c37_2\" title=\"Annex A\">Annex A</a>&nbsp;and <a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-b---12-oct-2020.pdf?sfvrsn=65aa29ea_2\" title=\"Annex B\">Annex B</a>&nbsp;for details.<br><br><strong>Update on condition of confirmed cases</strong><br><br>8.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 23 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 57,728 have fully recovered from the infection and have been discharged from hospitals or community care facilities.<br><br>9.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; There are currently 48 confirmed cases who are still in hospital. Of these, most are stable or improving, and none is in the intensive care unit. 76 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 28 have passed away from complications due to COVID-19 infection.<br><br>10.&nbsp;&nbsp;&nbsp;&nbsp; Case 57960, a 64 year-old male Singapore Permanent Resident, has passed away from complications due to COVID-19 infection on 12 October 2020. He had been working in India since December 2019, and was placed on SHN when he returned to Singapore on 23 September 2020. He was confirmed to have COVID-19 infection on 4 October, and had a history of hypertension. Singapore General Hospital has reached out to his family and is extending assistance to them.", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "2-new-cases-of-locally-transmitted-covid-19-infection-12Oct2020-updated", "CurrentPageUrl": null}, {"Title": "Updates On Border Measures and Covid-19 Testing for Travellers", "PublishedDate": "/Date(1602498600000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "12 Oct 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\"><span style=\"font-family: Arial;\"><span style=\"font-size: 14px;\">&nbsp; &nbsp; &nbsp; &nbsp;The Multi-Ministry Taskforce regularly reviews our border measures to manage the risk of importation and onward local transmission from travellers, taking into account the current situation in their source countries/regions.&nbsp;<br><br>2.&nbsp; &nbsp; &nbsp;Given the recent increase in cases, travellers with recent travel history to Sabah, Malaysia will now be required to serve a 14-day Stay-Home Notice (SHN) at dedicated SHN facilities. We will also require travellers who have recent travel history to Indonesia or the Philippines, and who are not Singapore Citizens or Permanent Residents, to present a valid negative COVID-19 test result to enter or transfer through Singapore. As the situation in Hong Kong has improved, we will reduce the SHN period from 14 days at dedicated SHN facilities, to 7 days at their place of residence, for travellers from Hong Kong.&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp;COVID-19 testing is an integral part of the safe re-opening of our borders. We will make COVID-19 tests more accessible to travellers. Laboratories, clinics and swab service providers who are interested can apply to the Ministry of Health (MOH) for approval to provide such COVID-19 testing services. The Immigration &amp; Checkpoints Authority (ICA) will resume the issuance of new visas.&nbsp; However, the possession of a visa alone does not guarantee entry into Singapore; travellers must still seek prior approval via the appropriate COVID-19 travel schemes.&nbsp;&nbsp;<br><br><strong>Update of Border Measures&nbsp;<br></strong><br>4.&nbsp; &nbsp; &nbsp;The risk of importation from travellers varies across countries/regions. Hence, the Taskforce continues to calibrate our border measures based on the latest developments in countries/regions as well as our assessed risk of importation and onward transmission in the community.&nbsp;<br></span></span><span style=\"font-size: 14px; font-family: Arial;\"><br><span style=\"text-decoration: underline;\">14-day SHN in dedicated SHN facility for Travellers from Sabah (Malaysia)</span><br><br>5.&nbsp; &nbsp; &nbsp;We had earlier announced that travellers from Malaysia are allowed to serve a 7-day SHN at their place of residence. As there has been an increase in cases in Sabah recently, </span><strong style=\"font-size: 14px; font-family: Arial;\"><u>all</u>&nbsp;travellers entering Singapore from 14 October 2020, 2359 hours, who have a travel history in the past 14 days to Sabah will be required to serve a 14-day SHN at dedicated SHN facilities</strong><span style=\"font-size: 14px; font-family: Arial;\">&nbsp;</span><span style=\"font-family: Arial; font-size: 12px;\"><sup>[1]</sup></span><span style=\"font-size: 14px; font-family: Arial;\">. This also applies to returning Singapore-based travellers under the Reciprocal Green Lane (RGL), as well as Malaysian Citizens and PRs entering Singapore under the Periodic Commuting Arrangement. We are monitoring the situation across other states and federal territories closely, including Kuala Lumpur, Selangor and Putrajaya. For now, travellers from all other parts of Malaysia (except Sabah), will continue to serve a 7-day SHN at their place of residence.&nbsp;</span></p><p style=\"text-align: justify;\"><span style=\"font-family: Arial;\"><span style=\"font-size: 14px;\">6.&nbsp; &nbsp; &nbsp;All travellers are reminded to accurately declare their travel history. Strict enforcement action will be taken against false declarations. The COVID-19 test will continue to be administered before the end of the SHN period.&nbsp;<br></span></span><span style=\"font-size: 14px; font-family: Arial;\"><br><span style=\"text-decoration: underline;\">Requiring Pre-Departure Tests (PDT) for Travellers from Indonesia and the Philippines</span><br><br>7.&nbsp; &nbsp; &nbsp;To reduce the importation of cases from Indonesia and the Philippines, travellers who are not Singapore Citizens or Permanent Residents and who have recent travel history to Indonesia or the Philippines within the last 14 days prior to entry will be required to take a COVID-19 polymerase chain reaction (PCR) test within 72 hours before departure. Travellers will need to present a valid negative COVID-19 test result as a condition of approval to enter or transfer through Singapore. This requirement will take effect for those arriving in or transferring through Singapore from </span><strong style=\"font-size: 14px; font-family: Arial;\">19 October 2020, 2359 hours</strong><span style=\"font-size: 14px; font-family: Arial;\">. Travellers from Indonesia and the Philippines entering Singapore will still be required to serve a 14-day SHN at dedicated SHN facilities and to take a negative COVID-19 test before the end of their SHN.<br><br></span><span style=\"font-size: 14px; font-family: Arial;\">8.&nbsp; &nbsp; &nbsp;We had earlier announced that travellers who are not Singapore Citizens or Permanent Residents and who have recent travel history to India within the last 14 days prior to entry will need to present a valid negative COVID-19 test result as a condition of approval to enter Singapore. We will now also require travellers from India transferring through Singapore to present a valid negative COVID-19 test result.<br><br><span style=\"text-decoration: underline;\">Reduced SHN of 7 Days for Travellers from Hong Kong&nbsp;<br></span><br></span><span style=\"font-size: 14px; font-family: Arial;\">9.&nbsp; &nbsp; &nbsp; There are countries/regions where the virus is well under control and the risk of importation is low. We have thus lifted our border restrictions and updated our travel advisory to allow general travel between Singapore and such low risk countries – Brunei Darussalam, New Zealand, Australia (excluding Victoria State) and Vietnam </span><span style=\"font-family: Arial; font-size: 12px;\"><sup>[2]</sup></span><span style=\"font-size: 14px; font-family: Arial;\">. Travellers who have remained in these countries/regions in the last consecutive 14 days prior to their entry and travel directly to Singapore will undergo a COVID-19 test upon arrival in lieu of serving SHN.&nbsp;<br><br></span><span style=\"font-size: 14px; font-family: Arial;\">10.&nbsp; &nbsp; &nbsp;Travellers from other low risk countries/regions undergo a reduced 7-day SHN, and are allowed to serve the SHN at their place of residence </span><span style=\"font-family: Arial; font-size: 12px;\"><sup>[3]</sup></span><span style=\"font-size: 14px; font-family: Arial;\"> instead of a designated SHN facility. These low risk countries/regions are Macao, Mainland China, Malaysia (excluding Sabah) and Taiwan. </span><strong style=\"font-size: 14px; font-family: Arial;\">Hong Kong will now be added to this list, for travellers entering Singapore from 14 October 2020, 2359 hours.&nbsp;<br><br></strong><span style=\"font-size: 14px; font-family: Arial;\"><span style=\"text-decoration: underline;\">Resuming Visa Regime<br></span></span><strong style=\"font-size: 14px; font-family: Arial;\"><br></strong><span style=\"font-size: 14px; font-family: Arial;\">11.&nbsp; &nbsp; &nbsp; In line with the calibrated reopening of Singapore’s borders, ICA will lift visa suspension and resume the issuance of new visas. Short-term visitors who require a visa to enter Singapore can apply for visas though a local contact, Singapore overseas mission, or authorised visa agent from </span><strong style=\"font-size: 14px; font-family: Arial;\">18 October 2020, 2359 hours</strong><span style=\"font-size: 14px; font-family: Arial;\">. Visitors who had already been issued with visas which are still valid, as well as those who are eligible for the visa-free transit facility, do not need to re-apply/ apply.<br><br></span><span style=\"font-size: 14px; font-family: Arial;\">12.&nbsp; &nbsp; &nbsp;</span><strong style=\"font-size: 14px; font-family: Arial;\">Possession of a valid visa alone does not guarantee entry into Singapore. All short-term visitors must still seek prior approval via appropriate COVID-19 travel channels (e.g. obtain a Safe Travel Pass under Green/Fast Lane arrangements, or Air Travel Pass) before they can enter Singapore. </strong><span style=\"font-size: 14px; font-family: Arial;\">More information will be available at ICA’s website (</span><a href=\"http://www.ica.gov.sg/covid-19/\" title=\"\" class=\"\" target=\"\" style=\"font-size: 14px; font-family: Arial;\">https://www.ica.gov.sg/covid-19</a><span style=\"font-size: 14px; font-family: Arial;\">).<br><br></span><strong style=\"font-size: 14px; font-family: Arial;\">Facilitating COVID-19 Testing for Travellers<br><br></strong><span style=\"font-size: 14px; font-family: Arial;\">13.&nbsp; &nbsp; &nbsp; COVID-19 testing is an integral element to the safe resumption of travel. We will make COVID-19 testing more accessible for travellers. There are currently over 150 clinics that provide pre-departure testing to eligible travellers. We will increase the number of clinics and providers who can administer the COVID-19 PCR tests for pre-departure testing.&nbsp;<br><br></span><span style=\"font-size: 14px; font-family: Arial;\">14.&nbsp; &nbsp; &nbsp; Individuals who have been approved for such tests via the Safe Travel website (</span><a href=\"http://safetravel.ica.gov.sg/pre-departure-test/\" title=\"\" class=\"\" target=\"\" style=\"font-size: 14px; font-family: Arial;\">https://safetravel.ica.gov.sg/pre-departure-test</a><span style=\"font-size: 14px; font-family: Arial;\">) will be able to make a test appointment with an expanded list of approved clinics and providers. Laboratories, clinics and swab service providers who are interested to provide such COVID-19 testing services can apply to MOH for approval.&nbsp;<br><br></span><span style=\"font-size: 14px; font-family: Arial;\">15.&nbsp; &nbsp; &nbsp;We will also gradually liberalise COVID-19 testing to allow those who require a test more options to procure such services from approved providers.<br><br></span><strong style=\"font-size: 14px; font-family: Arial;\">Regular Review of Border Measures<br><br></strong><span style=\"font-size: 14px; font-family: Arial;\">16.&nbsp; &nbsp; &nbsp;Singapore’s border measures will evolve as the global situation changes. We will continue to monitor the global health situation closely and update our border measures in accordance with the public health risk assessment. If the situation in a country/region deteriorates, more stringent measures will be put in place to limit the risk of importation and prevent community transmission from imported cases.&nbsp;<br><br><br></span><strong style=\"font-size: 14px; font-family: Arial;\">MINISTRY OF HEALTH<br></strong><strong style=\"font-size: 14px; font-family: Arial;\">12 OCTOBER 2020<br><br></strong><span style=\"font-size: 14px; font-family: Arial;\">==<br></span><span style=\"font-size: 12px; font-family: Arial;\">[1]&nbsp;Except for Malaysia-based travellers under the RGL, who will continue to be subject to existing RGL health measures (i.e. pre-departure test, on-arrival test, pre-declared controlled itinerary).&nbsp;<br></span><span style=\"font-size: 12px; font-family: Arial;\">[2] </span><a href=\"http://www.caas.gov.sg/who-we-are/newsroom/Detail/singapore-welcomes-visitors-from-australia-and-vietnam-from-8-october-2020/\" title=\"\" class=\"\" target=\"\" style=\"font-size: 12px; font-family: Arial;\">https://www.caas.gov.sg/who-we-are/newsroom/Detail/singapore-welcomes-visitors-from-australia-and-vietnam-from-8-october-2020/</a><br><span style=\"font-size: 12px; font-family: Arial;\">[3]&nbsp;Singapore Citizens and Permanent Resident may serve their 7-day SHN at their place of residence. Long-Term Pass holders may serve their 7-day SHN at a place of residence that they or their family members own or are sole tenants of, or in suitable accommodations such as a hotel.</span></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "updates-on-border-measures-and-covid-19-testing-for-travellers", "CurrentPageUrl": null}, {"Title": "2 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1602432000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "12 Oct 2020", "Summary": "", "MainContent": "1.&nbsp; &nbsp; &nbsp; As of 12 October 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 2 new cases of locally transmitted COVID-19 infection. Based on our investigations so far, 1 is in the community, and 1 resides in a dormitory.&nbsp;<br><br>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In addition, there are 2 imported cases, who had both been placed on Stay-Home Notice upon arrival in Singapore. In total, there are 4 new cases of COVID-19 infection in Singapore today.<br><br>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "2-new-cases-of-locally-transmitted-covid-19-infection-12Oct2020", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}