{"pressItemDictionary": {"Press Releases": [{"Title": "Updates On Border Measures and Community Surveillance Testing Operations", "PublishedDate": "/Date(1606391400000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "26 Nov 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\">&nbsp; &nbsp; &nbsp; The Multi-Ministry Taskforce has been closely monitoring the global COVID-19 situation, and will be tightening border measures given the increase in cases in Finland and Turkey. In addition, to ensure the continued safe resumption of social and economic activities, the Taskforce will extend its community surveillance testing operations to more identified groups in the community.&nbsp;<br><br><strong>Travellers from Finland and Turkey to serve 14-Day SHN at dedicated SHN facilities&nbsp;<br></strong><br>2.&nbsp; &nbsp; &nbsp; As there has been a recent increase in cases reported by Finland and Turkey, all travellers entering Singapore from 28 November 2020, 2359 hours, who have a travel history in the past 14 days to Finland and Turkey will be required to serve a 14-day Stay-Home Notice (SHN) at dedicated SHN facilities, even if they have obtained approval to opt-out earlier.<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp;This is revised from our announcement on 27 October that travellers from Finland and Turkey were allowed to serve their 14-day SHN at a suitable place of residence.<br><br>4.&nbsp; &nbsp; &nbsp; Travellers from Fiji, Republic of Korea, Sri Lanka and Thailand are still allowed to apply to opt out of dedicated SHN facilities and serve their 14-day SHN at their place of residence, if they fulfil the following criteria:&nbsp;<br><br>a. Travelled to no other country/region than above-mentioned countries [1], in the last consecutive 14 days prior to entry; and&nbsp;<br><br>b. Are occupying their place of residence (i.e. residential address) alone, or only with household members who are also persons serving SHN with the same travel history and duration of SHN.&nbsp;<br><br>The COVID-19 tests will continue to be administered before the end of the SHN.&nbsp;<br><br>5.&nbsp; &nbsp; &nbsp; As the global situation evolves, we will continue to adjust our border measures to manage the risk of importation and transmission to the community. Any changes to border measures will be updated on the <a href=\"https://safetravel.ica.gov.sg/\" title=\"\" class=\"\" target=\"\">SafeTravel website</a>. Travellers are advised to visit the website to check for the most updated border measures before entering Singapore and be prepared to be subjected to the prevailing border measures upon entry, including payment for their stay at dedicated SHN facilities, tests and treatment.<br><br><strong>COVID-19 testing for more identified community groups&nbsp;<br></strong><br>6.&nbsp; &nbsp; &nbsp; &nbsp;The Multi-Ministry Taskforce has been progressively conducting testing operations for identified community groups, such as stallholders, food delivery personnel and cashiers across the island. These operations aim to provide a better picture of population prevalence and facilitate the early containment of cryptic cases in the community, especially as we continue to reopen our economy and allow more activities to resume.&nbsp;<br><br>7.&nbsp; &nbsp; &nbsp; &nbsp;More than 5,000 individuals have been tested at Marine Parade, Ang Mo Kio and Taman Jurong since September 2020, and all who have participated in these voluntary testing exercises have tested negative for COVID-19. The results of the community testing operations indicate very low prevalence rates in the community, and is an indicator that our safe management measures are helping to keep our community safe.&nbsp;<br><br>8.&nbsp; &nbsp; &nbsp; &nbsp;Even whilst community prevalence is low, we must not let our guard down. Hence government agencies will be reaching out to other identified community groups to offer COVID-19 testing on a one-time basis. We are offering COVID-19 testing to stallholders in and around Tekka Centre this week. In the coming weeks, we will also be offering COVID-19 testing to individuals working at key delivery centres (e.g. Pasir Panjang Wholesale Centre) and key logistics delivery companies.&nbsp;<br><br>9.&nbsp; &nbsp; &nbsp; We strongly encourage individuals in these identified community groups to come forward and utilise the testing services offered. The costs of these tests will be fully borne by the government.&nbsp;<br><br><strong>Enabling A Safe Reopening<br></strong><br>10.&nbsp; &nbsp; We will continue to review and calibrate our border measures to enable a safe reopening of our borders, while facilitating the resumption of key economic activities which are critical for livelihoods. Testing remains a key enabler to safe reopening, and we will continue to extend surveillance testing progressively to more community groups across Singapore.&nbsp; &nbsp; &nbsp;&nbsp;<br><br><strong>MINISTRY OF HEALTH<br>26 NOVEMBER 2020<br><br></strong>[1] Including the following countries/regions: Australia, Brunei Darussalam, Hong Kong, Macao, Mainland China, New Zealand, Taiwan and Vietnam (correct as of 26 November 2020).</p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "updates-on-border-measures-and-community-surveillance-testing-operations", "CurrentPageUrl": null}, {"Title": "1 New Case of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1606320000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "26 Nov 2020", "Summary": "", "MainContent": "1.&nbsp; &nbsp; &nbsp; As of 26 November 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 1 new case of locally transmitted COVID-19 infection. Based on our investigations so far, the case is in the community, and there are no new cases in the dormitories.<br><br>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In addition, there are 4 imported cases, who had already been placed on Stay-Home Notice upon arrival in Singapore. In total, there are 5 new cases of COVID-19 infection in Singapore today.<br><br>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "1-new-case-of-locally-transmitted-covid-19-infection-26nov2020", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}