{"pressItemDictionary": {"Press Releases": [{"Title": "Passing of Two Patients with COVID-19 Infection", "PublishedDate": "/Date(1584720000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "21 Mar 2020", "Summary": "", "MainContent": "<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The Ministry of Health (MOH) has confirmed that two patients have passed away from complications due to COVID-19 infection on 21 March morning.&nbsp; </p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The first patient was a 75 year-old female Singapore Citizen. She was admitted to the National Centre for Infectious Diseases (NCID) on 23 February for pneumonia, and was confirmed to have COVID-19 infection on the same day. She had been cared for in the intensive care unit (ICU) since admission to NCID. She developed serious complications and eventually succumbed to the infection after 26 days in the ICU on 21 March at 7.52am. She had a history of chronic heart disease and hypertension. </p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The second patient was a 64 year-old male Indonesian national. He was admitted in critical condition to the ICU at NCID on 13 March, after arriving in Singapore from Indonesia on the same day, and was confirmed to have COVID-19 infection on 14 March. He had been cared for in the ICU since 13 March. He developed serious complications and eventually succumbed to the infection after nine days in the ICU on 21 March at 10.15am. Prior to his arrival in Singapore on 13 March, he had been hospitalised in Indonesia for pneumonia, and had a history of heart disease.</p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Minister for Health Mr Gan Kim Yong said, “We are deeply saddened by their passing. Our thoughts are with their families during this difficult time. We will render all necessary assistance to their families. I understand that Singaporeans will be affected by this news. But we must take courage and continue to play our part to fight this virus.” </p><p>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The Ministry of Health and NCID have reached out to their families and are extending assistance to them.<br> </p><p><strong>MINISTRY OF HEALTH<br></strong><strong>21 MARCH 2020</strong></p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "passing-of-two-patients-with-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}