{"pressItemDictionary": {"Press Releases": [{"Title": "350 More Cases Discharged, 344 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1591454580000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "06 Jun 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;As of 6 June 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 344 cases of COVID-19 infection in Singapore. The breakdown is as follows:<br><br><strong>&nbsp; a)&nbsp; </strong>&nbsp;<strong>Imported cases: 0<br><br></strong>There are no imported cases today.<br><br><strong>&nbsp; b)&nbsp; &nbsp;Cases in the community: 7 </strong>(3 Singaporeans/Permanent Residents, 4 Work Permit holders)<br><br>Of the 7 cases in the community, 5 are asymptomatic, but we had swabbed them as part of our proactive surveillance and screening.<br><br>Amongst the 3 Singaporeans/Permanent Residents, 1 (Case 37304) is a family member of a previously confirmed case, and had already been quarantined earlier. Another (Case 37553) is a cleaner at the preschool section of an international school, and was tested as part our proactive screening of preschool staff. Epidemiological investigations are ongoing for the remaining case (Case 37515).<br><br>All 4 Work Permit holders had been picked up as a result of proactive screening. Of these, 3 (Cases 37225, 37425 and 37426) were tested as part of our efforts to screen workers in essential services, and 1 (Case 37514) was tested as part of our screening of migrant workers deployed at public healthcare institutions. He had been doing building maintenance works at Khoo Teck Puat Hospital and had not interacted with hospital staff or patients.&nbsp; <br><br>Overall, the number of new cases in the community has increased, from an average of 5 cases per day in the week before, to an average of 7 per day in the past week. The number of unlinked cases in the community has remained stable at an average of 2 per day in the past two weeks.&nbsp;We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br><strong><br>&nbsp; c)&nbsp; &nbsp;Cases residing in dormitories: 337<br><br></strong>We continue to pick up cases amongst Work Permit holders residing in dormitories, including in factory-converted dormitories, because of extensive testing in these premises, as part of our process to verify and test the status of all workers. <br><br>2.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Details of these trends can be found in MOH’s daily situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\">www.moh.gov.sg/covid-19/situation-report</a>). Please refer to <u><a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-a---6-june-2020.pdf?sfvrsn=ba42d055_0\" title=\"Annex A\">Annex A</a></u> for the summary of the confirmed cases.<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Of the new cases, 98% are linked to known clusters, while the rest are pending contact tracing.<br><br>4.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;MOH has been monitoring existing clusters for any further transmission. As there have been no more cases linked to the construction site at 15 Serangoon North Avenue 1 for the past two incubation periods (i.e. 28 days), the cluster has now been closed.<br><br><strong>Links between previous cases found<br></strong><br>5.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;In the past week (30 May to 5 June), MOH has uncovered links for 7 previously unlinked cases.<br><br>6.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <u><a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-b---6-june-2020.pdf?sfvrsn=45473521_0\" title=\"Annex B\">Annex B</a></u> and <u><a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-c---6-june-2020.pdf?sfvrsn=124b68bb_0\" title=\"Annex C\">Annex C</a></u> for details.<br><br><strong>Cases from public healthcare sector<br><br></strong><u>Case 37515<br></u><br>7.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Case 37515 is a 27 year-old male Singapore Citizen who has no recent travel history to affected countries or regions. He was confirmed to have COVID-19 infection on 5 June, and is currently warded at the National Centre for Infectious Diseases.<br><br>8.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;He is employed as a physiotherapist at Tampines Polyclinic but had not gone to work since onset of symptoms.<br><br><strong>Update on condition of confirmed cases<br></strong><br>9.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;350 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 24,559 have fully recovered from the infection and have been discharged from hospitals or community care facilities.<br><br>10.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;There are currently 308 confirmed cases who are still in hospital. Of these, most are stable or improving, and 4 are in critical condition in the intensive care unit. 12,635 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 25 have passed away from complications due to COVID-19 infection.<br><br>11.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Case 11714, a 41 year-old male Chinese national, has passed away on 4 June 2020. He was confirmed to have COVID-19 infection on 22 April. He had recovered from the infection, and was discharged on 17 May. He collapsed on 4 June and the Coroner has certified that the cause of death was massive pulmonary thromboembolism following SARS-CoV-2 infection.</p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "350-more-cases-discharged-344-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": " 344 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1591431840000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "06 Jun 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As of 6 June 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 344 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders residing in foreign worker dormitories. Based on our investigations so far, there are 7 cases in the community, of whom 3 are Singaporeans/Permanent Residents and 4 are Work Pass holders.<br><br>2.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight</p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "344-new-cases-of-covid-19-infection-6Jun", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}