{"pressItemDictionary": {"Press Releases": [{"Title": "Safeguarding Lives and Livelihoods", "PublishedDate": "/Date(1605006000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "10 Nov 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\"><span style=\"font-family: Arial;\"><span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp; As we continue on our journey towards Phase Three, the Multi-Ministry Taskforce will continue to build on our efforts to enable the public and businesses to resume normal activities as much as possible, within safe limits. We aim to safeguard both lives and livelihoods, and will seek to buffer the social and economic impact of the pandemic on Singaporeans, even as we strive to protect Singaporeans from the risk of COVID-19 infection.<br><br>2.&nbsp; &nbsp; &nbsp; With the cooperation of Singaporeans and businesses, we have brought the situation under control and kept community transmission low. Singaporeans have supported the comprehensive set of border, community and healthcare measures laid out by the Multi-Ministry Taskforce as Singapore emerged from the Circuit Breaker. We have regularly reviewed and adjusted the measures in line with the latest circumstances and scientific evidence, and in preparation for subsequent steps forward.<br><br><strong>Re-Opening Borders Safely through Risk-Managed Controls and Testing Protocols</strong>&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp;We need to re-open our borders safely to safeguard our aviation hub status which is essential to many of our businesses, our jobs and our future. Beyond supporting our businesses to resume activities and protect jobs, re-opening our borders is also critical to supporting our social and community needs, such as allowing families to reunite and facilitating the entry of foreign domestic workers who help to care for our loved ones.<br><br><strong>Adopting a risk-managed approach in border control measures&nbsp;</strong><br><br>4.&nbsp; &nbsp; &nbsp; &nbsp;In re-opening our borders, we must do so safely so that we can facilitate more travel while minimising the impact on public health. We recognise that different countries/ regions are at different stages of putting in place effective systems to control the spread of COVID-19. We have therefore taken a risk-managed approach to our border controls, based on the assessed risk of importation and onward transmission in the community.<br><br>5.&nbsp; &nbsp;&nbsp;<span style=\"text-decoration: underline;\">Lower-risk countries/regions.</span>&nbsp;These countries/ regions are assessed to have a lower incidence of COVID-19 and comprehensive measures in place to detect and keep community spread at bay. Travellers from these countries/regions are either required to take a COVID-19 test upon arrival in lieu of a Stay-Home Notice (SHN) , or required to serve a 7-day SHN&nbsp; at their place of residence with a COVID-19 test administered at the end of their SHN.&nbsp;<br><br>6.&nbsp; &nbsp; &nbsp;&nbsp;<span style=\"text-decoration: underline;\">Higher-risk countries/regions.</span> Travellers from higher-risk countries/ regions are subject to more stringent measures including a 14-day SHN at home&nbsp; or at dedicated SHN facilities, with a COVID-19 test administered at the end of their SHN. We minimise the risk of community spread from such COVID-positive travellers as they are isolated during their potentially infectious period.&nbsp;<br><br>7.&nbsp; &nbsp; &nbsp; We have also allowed selected groups of travellers to enter on Green/ Fast Lane arrangements for essential business, official or work purposes. They are not isolated under SHN, but we manage the risk through strict quotas, and by requiring them to undergo COVID-19 tests before departure and upon arrival, and to follow a strict controlled itinerary limiting interactions with the wider community for the first 14 days.&nbsp;<br><br><strong>Implementing pre-departure testing for inbound travellers</strong><br><br>8.&nbsp; &nbsp; &nbsp; &nbsp;To reduce the risks of importation, we have required travellers who are not Singapore Citizens or Permanent Residents, and who have recent travel history to India, Indonesia and the Philippines, to present a valid negative COVID-19 Polymerase Chain Reaction (PCR) test to enter or transfer through Singapore. To further reduce importation risk from similarly high-risk countries/regions, from 17 November 2020 2359 hours, all inbound travellers who are not Singapore Citizens or Permanent Residents, except those from lower-risk countries/ regions , will need to take a COVID-19 PCR test within 72 hours before departure. These travellers will still be required to serve their SHN upon arrival in Singapore and be tested at the end of their SHN.<br><br>9.&nbsp; &nbsp; &nbsp; &nbsp;Singapore’s border measures will evolve as the global situation changes. If the situation in a country/region deteriorates, more stringent measures will be put in place to limit the risk of importation and prevent community transmission from imported cases. Similarly, if the situation in a country/region improves, we will consider relaxing our border health measures to facilitate travel. We encourage everyone to check the Safe Travel website (<a href=\"https://safetravel.ica.gov.sg\" title=\"\" class=\"\" target=\"\">https://safetravel.ica.gov.sg</a>) regularly for the latest updates. All travellers will be subject to the prevailing border measures upon entry, including staying in dedicated SHN facilities at the traveller’s cost, where applicable.<br><br><strong>Re-Opening Community Safely with Enhanced Testing, Safe Management, and Contact Tracing</strong>&nbsp;<br><br>10.&nbsp; &nbsp; &nbsp; Globally, many countries are continuing to see a high number of new infections. Locally, we have kept community transmission low, but the virus has not been eradicated. As we progressively re-open our borders and resume more social and economic activities in Phase Three, we should expect to see the number of cases increase, beyond the current single digits or even low teens each day. This is why we need to double down on our surveillance and testing efforts to nip the seeds of transmission&nbsp; to prevent further spread. And because there will still always be the possibility of asymptomatic or undetected cases among us, a strong set of safe management measures and a comprehensive test-trace-isolate system are key to keeping the virus under control and avoiding the number of cases spiralling out of control.&nbsp;<br><br><strong>Making COVID-19 Testing More Accessible</strong><br><br>11.&nbsp; &nbsp; &nbsp;Testing is a key enabler. The Multi-Ministry Taskforce regularly reviews our testing strategies to ensure COVID-19 testing is conducted widely and aggressively as required, for public health and in settings or sectors where there are higher risks.&nbsp;<br><br>12.&nbsp; &nbsp; &nbsp; To support a larger range of needs as we resume more economic and community activities, we will now make COVID-19 testing more accessible for all. From 30 November 2020 2359hrs, any company or individual who requires a PCR test will be able to procure such services from approved providers. This includes individuals who require pre-departure testing. Individuals will no longer be required to seek approval from MOH for pre-departure tests.&nbsp;<br><br>13.&nbsp; &nbsp; There are currently around 600 clinics and providers that can provide PCR testing. Laboratories, clinics and swab service providers who are interested to provide such COVID-19 testing services at premises, beyond a licensed clinic / laboratory / hospital premise, can apply for an off-site COVID-19 testing application at <a href=\"https://go.gov.sg/offsitecovid19swab\" title=\"\" class=\"\" target=\"\">https://go.gov.sg/offsitecovid19swab</a>. The list of clinics and providers approved to provide COVID-19 testing at off-site locations can be found on <a href=\"https://go.gov.sg/covid19pcrtestproviders\" title=\"\" class=\"\" target=\"\">https://go.gov.sg/covid19pcrtestproviders</a>. We will continue to increase the number of clinics and providers who can administer the COVID-19 PCR tests.<br><br>14.&nbsp; &nbsp; &nbsp; We are also conducting pilots on pre-event testing using antigen rapid tests (ARTs) to enable more large-scale and higher-risk activities to resume in a safer manner. We have conducted a number of pilots, such as at the Singapore International Energy Week and the ONE Championship Mixed Martial Arts events last month. We will continue to pilot different workflows in different settings, and will provide more details on requirements for pre-event testing when ready.&nbsp;<br><br><strong>Safe Management Measures&nbsp;</strong><br><br>15.&nbsp; &nbsp; &nbsp; The most important enabler is safe management. By keeping our social groups small, maintaining safe distancing and exercising social responsibility, we are all contributing to the nationwide effort to prevent spread. With such measures in place, even if there is a COVID-positive case at any event or activity, the risk of spreading to a large number of people is limited, which will slow down the rate of transmission and therefore decrease the risk of large clusters forming.&nbsp;<br><br><strong>Contact Tracing&nbsp;</strong><br><br>16.&nbsp; &nbsp; &nbsp; While testing and safe management can help to mitigate spread, it is not foolproof. This is where a strengthened contact tracing regime incorporating both SafeEntry and TraceTogether is important. By quickly identifying and isolating the close contacts of any COVID-positive person, we can limit the number of further infections. SafeEntry and TraceTogether are complementary tools that work together to ringfence cases and identify potential clusters. We encourage everyone to download and use the TraceTogether App or collect a TraceTogether Token for use at TraceTogether-only SafeEntry (ToS) premises, when ToS is implemented. ToS will only be enforced after everyone who prefers to use the TraceTogether Token has had the chance to collect one at a Community Centre/Club (CC) in their constituency. Please refer to the TokenGoWhere website (<a href=\"https://token.gowhere.gov.sg\" title=\"\" class=\"\" target=\"\">https://token.gowhere.gov.sg</a>) for the latest schedule for token collection at your constituency’s collection point. For those who prefer the TraceTogether App, please ensure that you have updated to the latest version of the App.<br><br>17.&nbsp; &nbsp; &nbsp;Venues required to enforce SafeEntry check-ins for all its public customers and visitors are also progressively implementing the Token check-in method. We will work with venues to implement these SafeEntry check-ins for TraceTogether Token users. This will also facilitate a smooth transition to ToS later.&nbsp;<br><br><strong>Ensuring Access to Vaccines when Available</strong>&nbsp;<br>&nbsp;<br>18.&nbsp; &nbsp;There are various COVID-19 vaccines currently under development and entering clinical trials globally. Different vaccinations may confer varying degrees of protection against a disease, and work in conjunction with other preventive measures such as safe management and contact tracing, to prevent further disease transmission in Singapore.<br><br>19.&nbsp; &nbsp; &nbsp; Singapore has been actively monitoring the global progress in COVID-19 vaccine development, and has taken steps to secure access for our population amidst expected strong global demand. We are a strong supporter and active participant in driving the work of the global COVID-19 Vaccine Global Access (COVAX) Facility. Co-led by Gavi the Vaccine Alliance, the Coalition for Epidemic Preparedness (CEPI) and the World Health Organization (WHO), this global collaboration enables countries to pool risk and resources to gain accelerated access to a portfolio of vaccines from different vaccine developers. To date, there are 186 participants of the COVAX Facility which represent over 85% of the world’s population.&nbsp;<br><br>20.&nbsp; &nbsp; &nbsp; On top of our efforts through the COVAX Facility, we have further broadened and diversified our COVID-19 vaccine portfolio with a number of pharmaceutical companies that use different technologies for their vaccines, and in different phases of clinical trials. Not all of these vaccines will succeed, nor be suitable, safe and efficacious for all segments of our population. Our proactive efforts to secure a broad and diversified vaccine portfolio will improve our chances of securing a suitable vaccine for Singapore.&nbsp;<br><br>21.&nbsp; &nbsp; &nbsp;The safety of Singaporeans is a top priority in all our vaccination efforts. To ensure the safe and efficacious use of the vaccines in our population, MOH has set up an Expert Committee on COVID-19 Vaccination, comprising experts in infectious diseases, immunology, and other relevant fields, to closely monitor the vaccine clinical trials data as they become available globally, to advise on the suitability, safety and efficacy of the COVID-19 vaccines and to recommend the vaccination approach for the different segments of our population. Only vaccines that are assessed to be relatively safe and efficacious will be offered to the relevant population segments.<br><br>22.&nbsp; &nbsp; &nbsp; Meanwhile, we will continue to closely track the progress of the different vaccine candidates under development globally in the next few months, and will provide further updates on our plans.&nbsp;<br><br><strong>Emerging Stronger Together</strong>&nbsp;<br><br>23.&nbsp; &nbsp; &nbsp;The road ahead remains long. We must not let our guard down and become lax in adherence to safe management measures, as doing so could result in a resurgence of COVID-19 cases, putting all our sacrifices thus far to waste. While we are in a much better position today than we were earlier in the year, we must not be complacent. Should there be a spike in cases, we need to respond swiftly and decisively together to keep the virus under control. As we journey ahead into Phase Three and beyond, let us continue to support one another so that we can emerge stronger together.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>10 NOVEMBER 2020</strong></span></span></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "safeguarding-lives-and-livelihoods", "CurrentPageUrl": null}, {"Title": "2 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1604994000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "10 Nov 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\"><span style=\"font-family: Arial;\"><span style=\"font-size: 14px;\">&nbsp; &nbsp; &nbsp; &nbsp; As of 10 November 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 2 new cases of locally transmitted COVID-19 infection. Based on our investigations so far, 1 is in the community, and 1 resides in a dormitory.&nbsp;&nbsp;<br><br>2.&nbsp; &nbsp; In addition, there are 7 imported cases, who had already been placed on Stay-Home Notice or isolated upon arrival in Singapore. In total, there are 9 new cases of COVID-19 infection in Singapore today.&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>10 NOVEMBER 2020</strong></span></span></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "2-new-cases-of-locally-transmitted-covid-19-infection-10-Nov-2020", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}