{"pressItemDictionary": {"Press Releases": [{"Title": "5 New Cases of Locally Transmitted  Covid-19 Infection ", "PublishedDate": "/Date(1609402200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "31 Dec 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; As of 31 December 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 5 new cases of locally transmitted COVID-19 infection. Based on our investigations so far, the cases are in the community, and there are no new cases in the dormitories. Of these, 2 are family members of Case 58810 [1], and 3 are a family cluster involving a harbour pilot (Case 58817) who was detected from Rostered Routine Testing (RRT). <br><br>2.&nbsp; &nbsp;In addition, there are 25 imported cases, who had already been placed on Stay-Home Notice or isolated upon arrival in Singapore. Amongst them, 5 are Singaporeans or Singapore Permanent Residents, and 9 are foreign domestic workers. In total, there are 30 new cases of COVID-19 infection in Singapore today. <br><br>3.&nbsp; &nbsp;We are aggressively tracing and testing the close contacts of the community cases so as to ringfence these cases and prevent further transmission. In addition, MOH will commence a special testing operations to test individuals who had boarded the ships that Cases 58810 and 58817 had recently worked on. We will also test harbour pilots, marine surveyors and ship repair workers in the coming days, regardless of their RRT schedule, to determine their COVID-19 status. In view of the recent cases involving the marine sector, we will review the need to tighten our precautionary measures for these workers. <br><br>4.&nbsp; &nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.<br></p> <div> <p><strong>MINISTRY OF HEALTH<br></strong><strong>31 DECEMBER 2020</strong></p> </div> <div><br clear=\"all\"> <hr align=\"left\" size=\"1\" width=\"33%\"> <div id=\"ftn1\"> <p>[1] Case 58810 is a Singapore Permanent Resident who works as a Marine Surveyor. He was reported in MOH’s press release on 30 December. </p> </div> </div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "5-new-cases-of-locally-transmitted-covid-19-infection-31dec", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}