{"pressItemDictionary": {"Press Releases": [{"Title": " 256 More Cases Discharged, 322 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1594655880000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "13 Jul 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;As of 13 July 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 322 cases of COVID-19 infection in Singapore. The higher number of cases today is mainly due to fewer tests being conducted by the COVID-19 testing laboratories over the public holiday and weekend on 10 July and 11 July, with the backlog of samples being cleared from 12 July. The number of cases reported for 9 July and before were not affected. The breakdown of the cases today is as follows:</p><p><strong>a)&nbsp;&nbsp;&nbsp; </strong><strong>Imported cases: 5 </strong>(2 Permanent Residents, 2 Work Pass holders, 1 Dependant’s Pass holder)</p><p>Amongst the 5 imported cases, 2 (Cases 46217 and 46258) are Singapore Permanent Residents who returned to Singapore from India on 6 July and from Pakistan on 20 June respectively. Another 2 cases (Cases 46212 and 46214) are Work Pass holders who are currently employed in Singapore. They arrived in Singapore from the Philippines on 30 June. The remaining case (Case 46213) is a Dependant’s Pass holder who returned to Singapore from the USA on 30 June. All of them had been placed on 14-day Stay-Home Notice (SHN) upon arrival in Singapore, and had been tested while serving their SHN.</p><p><strong>b)&nbsp;&nbsp;&nbsp; </strong><strong>Cases in the community: 11 </strong>(2 Singaporeans/ Permanent Residents, 6 Work Pass holders, 3 Work Permit holders)</p><p>4 of the community cases today are linked to previous cases or clusters. Of these, 2 (Cases 46218 and 46291) had been identified as contacts of previously confirmed cases, and had been tested during their quarantine to determine their status, even though they are asymptomatic. Another case (Case 46374) was swabbed as he works in essential services. The remaining case (Case 46254) was tested as part of our efforts to screen individuals working in frontline COVID-19 operations.</p><p>7 of the community cases are currently unlinked. Of these, 6 (Cases 46248, 46249, 46250, 46251, 46252 and 46253) are asymptomatic, and were identified from our periodic screening of workers in essential services who are living outside the dormitories. The remaining case (Case 46017) was tested for COVID-19 after he sought treatment for symptoms.</p><p>Epidemiological investigations of the unlinked cases are in progress. In the meantime, all the identified close contacts of the cases have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for their household contacts to determine if these cases could have been infected by them.</p><p>Overall, the number of new cases in the community has increased, from an average of 12 cases per day in the week before, to an average of 14 per day in the past week. The number of unlinked cases in the community has also increased, from an average of 6 cases per day in the week before, to an average of 8 per day in the past week.&nbsp;We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.</p><p><strong>c)&nbsp;&nbsp;&nbsp; </strong><strong>Cases residing in dormitories: 306</strong></p><p>We continue to pick up cases amongst Work Permit holders residing in dormitories, including in factory-converted dormitories, because of extensive testing in these premises, as part of our process to verify and test the status of all workers.</p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Details of these trends can be found in MOH’s daily situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\">www.moh.gov.sg/covid-19/situation-report</a>). Please refer to <u><u><a href=\"/docs/librariesprovider5/default-document-library/annex-a-(14-jul).pdf?sfvrsn=850761b7_0\">Annex A</a>&nbsp;</u></u>for the summary of the confirmed cases.</p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Of the new cases, 97% are linked to known clusters, while the rest are pending contact tracing.</p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; MOH had earlier identified three cases (Cases 42616, 45227 and 45821) who are employees of Mini Environment Service Pte Ltd (120 Lower Delta Road), and had investigated the company for its compliance with safe management and safe distancing measures. As there were non-compliances observed, MOH has directed that the workplace be closed for a period of 14 days, from 13 July to 26 July (inclusive), under Section 19 of the Infectious Diseases Act to prevent further spread at the workplace. The closure will allow the company to review and tighten its safe management measures. Close contacts of the cases had been placed on quarantine earlier, and all its employees will also be placed under health surveillance and tested for COVID-19.</p><p><strong>Links between previous cases found</strong></p><p>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In the past week (6 July to 12 July), MOH has uncovered links for 6 previously unlinked cases.</p><p>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <u><u><a href=\"/docs/librariesprovider5/default-document-library/annex-b-(14-jul).pdf?sfvrsn=296127c1_0\">Annex B</a>&nbsp;</u></u>and <u><u><a href=\"/docs/librariesprovider5/default-document-library/annex-c-(14-jul)1dfa5db24935473aaf92162540a6eac0.pdf?sfvrsn=683a6741_0\">Annex C</a>&nbsp;</u></u>for details.</p><p><strong>Update on condition of confirmed cases</strong></p><p>7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 256 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 42,541 have fully recovered from the infection and have been discharged from hospitals or community care facilities.</p><p>8.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; There are currently 166 confirmed cases who are still in hospital. Of these, most are stable or improving, and 1 is in critical condition in the intensive care unit. 3,550 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 26 have passed away from complications due to COVID-19 infection.</p><p>&nbsp;</p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "256-more-cases-discharged-322-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": " 322 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1594629900000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "13 Jul 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As of 13 July 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 322 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders residing in foreign worker dormitories. Based on our investigations so far, there are 11 cases in the community, of whom 2 are Singaporeans/ Permanent Residents and 9 are Work Pass holders. In addition, there are 5 imported cases who had been placed on Stay-Home Notice upon arrival in Singapore.</p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The higher number of cases today is mainly due to fewer tests being conducted by the COVID-19 testing laboratories over the public holiday and weekend on 10 July and 11 July, with the backlog of samples being cleared from 12 July. The number of cases reported for 9 July and before were not affected.</p><p>3.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.</p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "322-new-cases-of-covid-19-infection", "CurrentPageUrl": null}, {"Title": "Enhanced Subsidies for Nationally Recommended Vaccinations and Childhood Developmental Screening", "PublishedDate": "/Date(1594623600000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "13 Jul 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\">&nbsp; &nbsp; &nbsp; &nbsp; As part of our efforts to better protect Singaporeans from vaccine-preventable diseases and to reduce the risk of outbreaks in the community, the Ministry of Health (MOH) will enhance subsidies for vaccinations recommended under the National Childhood Immunisation Schedule (NCIS) and National Adult Immunisation Schedule (NAIS) at all Community Health Assist Scheme (CHAS) General Practitioner (GP) clinics and polyclinics from 1 November 2020.&nbsp;<br><br>2.&nbsp; &nbsp; &nbsp;All eligible Singaporean children will also receive full subsidies for childhood developmental screening at all CHAS GP clinics and polyclinics, so that they may receive the necessary developmental assessments together with their childhood immunisations from their family doctor.&nbsp;&nbsp;<br><br><strong>Inclusion of varicella, influenza and pneumococcal polysaccharide vaccines into the NCIS<br></strong><br>3.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; From 1 November 2020, the following vaccines will be added to the NCIS to better protect children against various vaccine-preventable diseases:&nbsp;<br><br>&nbsp; &nbsp;a) Two types of varicella-containing vaccines will be available for the prevention of chickenpox:&nbsp;<br><br>&nbsp; &nbsp; &nbsp; &nbsp;i) combined measles, mumps, rubella and varicella (MMRV) vaccine; and&nbsp;<br>&nbsp; &nbsp; &nbsp; &nbsp;ii) monovalent varicella vaccine.<br><br>&nbsp; &nbsp; &nbsp;b) Influenza vaccines for target groups of children who are at higher risk of developing influenza-related complications.&nbsp;<br><br>&nbsp; &nbsp;c) The pneumococcal 23-valent polysaccharide vaccine will be included to protect children with chronic or rare medical conditions who are at high risk of developing severe pneumococcal disease caused by the bacterium Streptococcus pneumoniae. This is in addition to the existing pneumococcal conjugate vaccines currently recommended for all young children.&nbsp;&nbsp;<br><br>Please see <a href=\"/docs/librariesprovider5/default-document-library/annex-ab14d617f16ce4930a09384fc9a494d58.pdf?sfvrsn=84dafe56_0\" title=\"Annex A\">Annex A</a>&nbsp;for the updated NCIS.&nbsp;<br><br><strong>Enhanced Subsidy for Nationally Recommended Vaccinations and Childhood Developmental Screening&nbsp;<br></strong><br>4.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;From 1 November 2020, Singaporeans will benefit from higher subsidies of between $35 to $125 for nationally-recommended vaccinations listed on the Subsidised Vaccine List (SVL) administered at CHAS GP clinics. Eligible Singaporeans need only pay the following amounts for the range of nationally recommended vaccinations at CHAS GP clinics, after government subsidies:&nbsp;<br><br>&nbsp; &nbsp; &nbsp; &nbsp;i. Eligible Singaporean children: $0&nbsp;<br>&nbsp; &nbsp; &nbsp; &nbsp;ii. Eligible Pioneer Generation cardholders: capped at $9 to $16 per vaccination&nbsp; dose&nbsp;&nbsp;<br>&nbsp; &nbsp; &nbsp; &nbsp;iii. Eligible Merdeka Generation, CHAS Blue and Orange cardholders: capped at $18 to $31 per vaccination dose&nbsp;<br>&nbsp; &nbsp; &nbsp; &nbsp;iv. Other eligible adult Singaporeans: capped at $35 to $63 per vaccination dose&nbsp;<br><br>5.&nbsp; &nbsp; &nbsp; At the polyclinics, adult Singaporeans will receive up to 75% subsidy for NAIS vaccinations. Pioneer Generation and Merdeka Generation seniors will also receive an additional 50% and 25% subsidy from their subsidised vaccination bills respectively. Prices after government subsidies are expected to be similar to that at the CHAS GP clinics. Please see <a href=\"/docs/librariesprovider5/default-document-library/annex-b9f5b65d6265a484d9c55a845de2595d2.pdf?sfvrsn=cc3f6e14_0\" title=\"Annex B\">Annex B</a>&nbsp;for vaccinations listed under the NAIS.<br><br>6.&nbsp; &nbsp; &nbsp; &nbsp; Eligible Singaporean children will also receive full subsidy for the seven childhood developmental screening milestones, at&nbsp;CHAS GP clinics and polyclinics.&nbsp;<br><br>7.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Please see <a href=\"/docs/librariesprovider5/default-document-library/annex-ccc11b38be28c4718bf104e5432281c74.pdf?sfvrsn=940da15b_0\" title=\"Annex C\">Annex C</a>&nbsp;for details on patient fees and subsidies.&nbsp;<br><br>8.&nbsp; &nbsp; &nbsp;Only selected vaccine brands listed on the SVL will be eligible for vaccination subsidies. MOH may review the listings periodically, in response to new price proposals from manufacturers, regulatory approval of new vaccines and other changes in global market conditions.<br><br>9.&nbsp; &nbsp; &nbsp; As clinics may require time to procure vaccines that are required, individuals are encouraged to make appointments with their preferred clinics for their vaccinations before their visit.&nbsp;<br><br><strong>MINISTRY OF HEALTH<br>13 JULY 2020</strong></p>", "PressCategory": ["Press Releases"], "CustomDetailUrl": "", "UrlName": "enhanced-subsidies-for-nationally-recommended-vaccinations-and-childhood-developmental-screening", "CurrentPageUrl": null}, {"Title": "New Personal Guide Based On 1-hr Pm2.5 Concentration Readings to Guide the Public During Haze Season", "PublishedDate": "/Date(1594608600000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "13 Jul 2020", "Summary": "&nbsp;", "MainContent": "1. The National Environment Agency (NEA) and the Ministry of Health (MOH) have introduced a personal guide to the 1-hour average concentration of fine particulate matter (PM2.5) to help individuals decide on their immediate outdoor activities during the haze season. The personal guide is now available on the haze microsite (<a href=\"http://www.haze.gov.sg/\">www.haze.gov.sg</a>) and the myENV app. <br><br><strong>Using the 1-hr PM2.5 Concentration for Immediate/Current Activities </strong><br><br>2. The 1-hr PM2.5 concentration is the average concentration of PM2.5, in micrograms per cubic metre (µg/m3), measured in the air over the past hour. Since 2014, NEA has been publishing the 1-hr PM2.5 concentration readings on an hourly basis across the five regions in Singapore. The 1-hr PM2.5 concentration is a useful indication of the current air quality. In 2016, NEA introduced bandings and descriptors to help the public interpret the 1-hr PM2.5 concentration readings. <br><br>3. MOH and NEA are now making available a personal guide to the 1-hr PM2.5 concentration level that the public can refer to when deciding on their immediate activities, such as going for a walk or run (see <a title=\"Annex A\" href=\"/docs/librariesprovider5/default-document-library/annex-a-(pm25).pdf?sfvrsn=e2f751f5_0\">Annex A</a>). The 1-hr PM2.5 concentration levels can be volatile and can fluctuate over the day due to weather conditions, especially during periods of transboundary haze. When planning activities within the same day, members of the public are advised to closely monitor the 1-hr PM2.5 readings and check the latest readings before proceeding. <br><br>4. The public are advised to consider their own individual health and physical conditions when using the personal guide. This is because each individual’s reaction to pollutants may vary, and the amount of physical exertion that can be performed differs. For the general population, symptoms that may arise from short-term exposure to PM2.5, such as throat or eye irritations, are expected to resolve after withdrawing from the exposure. <br><br><strong>Using the 24-hr PSI Forecast for Future Activities </strong><br><br>5. To plan for the next day’s activities or events, individuals and organisations should continue to refer to the 24-hr PSI forecast and accompanying health advisory. The 24-hr PSI is a rolling average of the PSI readings over the past 24 hours. Since 2013, during the Southwest Monsoon months when there is likelihood of transboundary haze affecting Singapore, NEA has been publishing a forecast of the 24-hr PSI for the next 24 hours accompanied with a corresponding health advisory. The forecast is based on NEA’s assessment of the air quality, weather conditions, hotspot and haze situation in the region. <br><br>6. The Government’s Haze Task Force comprising 28 government agencies and led by NEA will continue to use the 24-hr PSI forecast to implement action plans to minimise and manage the impact of haze on Singapore, guide risk assessment of immediate activities and advise major decisions such as school closure and suspension of training or outdoor work. <br><br>7. Singapore’s air quality readings are taken from a network of air quality monitoring stations across the island. Current air quality readings, including the forecast range for the 24-hr PSI, as well as NEA’s daily haze advisory<sup>1</sup> are available on NEA’s website (www.nea.gov.sg), the haze microsite (www.haze.gov.sg), NEA’s Facebook (<a href=\"http://www.facebook.com/NEASingapore\">www.facebook.com/NEASingapore</a>) and Twitter (@NEAsg), and the myENV app.<br><br>[1] Forecast air quality readings and NEA’s daily haze advisory are only available during periods of transboundary haze.<br><br><strong>NATIONAL ENVIRONMENT AGENCY AND MINISTRY OF HEALTH<br>13 JULY 2020</strong>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "new-personal-guide-based-on-1-hr-pm2.5-concentration-readings-to-guide-the-public-during-haze-season", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}