{"pressItemDictionary": {"Press Releases": [{"Title": "Risk assessment raised to DORSCON Orange", "PublishedDate": "/Date(1581066900000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "07 Feb 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Contact tracing for Case 29 (announced on 6 February) so far has not established a link to previous cases or travel history to mainland China.<br><br>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Today, the Ministry of Health (MOH) has confirmed three additional cases of 2019 novel coronavirus (2019-nCoV) infection in Singapore. Contact tracing is underway; as of now, we have not uncovered links to previous cases or travel history to China.<br><br>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;As there are now a few local cases without any links to previous cases or travel history to China,&nbsp;we have stepped up our risk assessment from DORSCON Yellow to DORSCON Orange.<br><br><strong>Precautionary measures calibrated to manage escalating scenarios<br><br></strong>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;We have planned for such a scenario involving community spread.&nbsp;Since last month, the Government has implemented a series of defensive measures to reduce the risk of imported cases and community transmission. We have strengthened these measures progressively as the situation escalated, both globally and in Singapore. <br><br>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;With the heightened risk posture of DORSCON Orange, we will be introducing the following additional precautionary measures&nbsp;to minimise the risk of&nbsp;further transmission of the virus in the community:<br><br><u>Additional precautions for large-scale events<br><br></u>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;We advise event organisers to cancel or defer non-essential large-scale events. For those who choose to proceed, they should take all necessary precautions. These include:<br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Carry out temperature screening;<br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Look out for respiratory symptoms such as cough or runny nose, and deny entry to unwell individuals;<br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Remind participants not to attend if the participants have recent travel history to mainland China, and require travel declaration, if possible;<br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Ensure that event venues are ventilated and are adequately equipped with facilities for hand washing; and<br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Increase the frequency of cleaning commonly used areas; and<br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Maintain a registration list of participants, if practical.<br><br>7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Individuals who are unwell, on Leave of Absence, or have recent travel history to mainland China, should not attend such events.<br><br><u>Daily health checks at the workplace<br><br></u>8.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;All employers should require their employees to conduct regular temperature-taking and check whether they have respiratory symptoms such as cough and runny nose. Temperature should be taken at least twice daily, and anyone with a fever or is unwell should leave office immediately to see a doctor.&nbsp;<br><br><u>Enhance business continuity capability at workplaces<br><br></u>9.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;All workplaces should step up their business continuity plans, and prepare for widespread community transmission.&nbsp;The business continuity plans can include allowing employees to telecommute or dividing the workforce into segregated teams.<br><br><u>Raise protection of vulnerable groups<br><br></u><em>Healthcare institutions<br><br></em>10.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;MOH will be implementing temperature screening and closer controls of entry points into the hospitals. Our hospitals will introduce measures to care for patients with pneumonia separately from other patients, to reduce risk of transmission. MOH will continue to work with the healthcare institutions to enhance infection control.<br><br><em>Schools<br><br></em>11.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;With immediate effect, schools will suspend inter-school and external activities till the end of the March school holidays. These include the national school games, learning journeys and camps. All schools and teachers will also continue to implement the enhanced measures announced on 4 February, such as classroom-based assemblies, school-based co-curricular activities in smaller groups and staggered recesses.&nbsp;&nbsp;<br><br><em>Preschools and social/ eldercare services<br><br></em>12.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Preschools and social/ eldercare services will limit the number of visitors to their premises.<br><br><strong>Role of individuals in preventing transmission<br><br></strong>13.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;The measures we are taking will only be effective in containing the spread of the virus if individuals also play their part. The 2019-nCoV is transmitted through contact with droplets from infected individuals, either directly or indirectly through hands that have come into contact with these droplets. The virus can also transmit through surfaces that have been contaminated with these droplets.<br><br>14.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Even with community transmission, the most effective method to prevent transmission remains through good personal hygiene of regular hand washing with soap and water, and the use of hand sanitisers when soap and water are unavailable. We should avoid touching our face unnecessarily, and especially if our hands are not clean.<br><br>15.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;As a general good practice, we advise people not to shake hands during this period, but adopt alternative greetings. <br><br>16.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;People who are unwell should stay at home, and wear a mask if they must go out, such as to see the doctor. In particular, they should avoid coming into close and sustained proximity with others.&nbsp; Workers who come across customers who are unwell, should immediately advise customers to leave and go see a doctor.</p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "risk-assessment-raised-to-dorscon-orange", "CurrentPageUrl": null}, {"Title": "Three more confirmed cases of novel coronavirus infection in Singapore", "PublishedDate": "/Date(1581066900000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "07 Feb 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As of 7 February 2020, 2pm, the Ministry of Health (MOH) has confirmed three additional cases of 2019 novel coronavirus (2019-nCoV) infection in Singapore. While contact tracing is underway, there are not yet any links to previous cases or travel history to China.<br><br><strong>About the confirmed cases<br><br></strong><a name=\"m_-6659826204272683559_OLE_LINK5\"><u><span style=\"color: rgb(0, 0, 0);\">Case 31</span></u></a><br><br>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;The case is a 53 year-old male Singapore Citizen with no recent travel history to China, but had been in Malaysia on 6, 11 and 17 January 2020.&nbsp;He is currently warded in an isolation room at&nbsp;Changi General Hospital (CGH).<br><br>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;He reported onset of symptoms on 23 January, and had visited a general practitioner (GP) clinic on the same day. He visited another GP clinic on 28 January, and was admitted to CGH on 1 February.&nbsp;Subsequent test results confirmed 2019-nCoV infection on 6 February at about 11pm.<br><br>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;He stays at Tampines Street 24. Prior to hospital admission, he had been to The Life Church and Missions Singapore (146B Paya Lebar Road) and had gone visiting family and friends during Chinese New Year.<br><br><u>Case 32<br><br></u>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Case 32 is a 42 year-old female Singapore Citizen who has no recent travel history to mainland China. She is currently warded in an isolation room at the National Centre for Infectious Diseases (NCID).<br><br>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;She reported onset of symptoms on 2 February and was admitted to Parkway East Hospital on 5 February. Subsequent test results confirmed 2019-nCoV infection on 6 February at about 11pm.<br><br>7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Prior to hospital admission, she worked at Victoria Junior College, but had not interacted with her colleagues and students after onset of symptoms. She stays at Elias Road and had visited Changi Airport and Singapore Zoo.</p><p><u>Case 33<br><br></u>8.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Case 33 is a 39 year-old female Singapore Citizen who has no recent travel history to mainland China, but who had been in Malaysia from 22 to 29 January. She is currently warded in an isolation room at Sengkang General Hospital (SKH).<br><br>9.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;She reported that she had developed symptoms on 30 January, and went to the emergency department at SKH on 2 February where she was admitted. Subsequent test results confirmed 2019-nCoV infection on 6 February at about 11pm.<br><br><u>Case 30 (announced on 6 February)<br><br></u>10.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Case 30 is a 27 year-old male Singapore Citizen who had attended a private business meeting at Grand Hyatt Singapore from 20 to 22 January, and was confirmed to have 2019-nCoV infection on 6 February at about 2pm.<br><br>11.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;He reported onset of fever on 21 January&nbsp;and visited a GP clinic on 28 January. He sought treatment at another GP clinic on 3 February before being admitted to the National Centre for Infectious Diseases on 6 February.<br><br>12.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Prior to hospital admission, he had gone to Far East Square (19 China Street) and Junction 8 (9 Bishan Place), and stays at Shunfu Road.<br><br><strong>Update on condition of confirmed cases<br><br></strong>13.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Amongst the confirmed cases, two have been discharged. Of the remaining 31, most are stable or improving. Two are in critical condition in the intensive care unit.<br><br><strong>Health advisory<br><br></strong>14.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Singaporeans are advised to defer all travel to Hubei Province and all non-essential travel to Mainland China.<br><br>15.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;All travellers should monitor their health closely for two weeks upon return to Singapore and seek medical attention promptly if they feel unwell. Travellers should inform their doctor of their travel history. If they have a fever or respiratory symptoms (e.g. cough, shortness of breath), they should wear a mask and call the clinic ahead of the visit.<br><br>16.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Travellers and members of the public should adopt the following precautions at all times:<br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Avoid close contact with people who are unwell or showing symptoms of illness;<br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Observe good personal hygiene;<br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Practise frequent hand washing with soap (e.g. before handling food or eating, after going to toilet, or when hands are dirtied by respiratory secretions after coughing or sneezing);<br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Wear a mask if you have respiratory symptoms such as a cough or shortness of breath;<br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Cover your mouth with a tissue paper when coughing or sneezing, and dispose the soiled tissue paper in the rubbish bin immediately; and<br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Seek medical attention promptly if you are feeling unwell.<br><br>17.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;MOH will continue to monitor the situation closely. As medical practitioners are on the lookout for suspect cases who have recently been in China, Singapore is likely to see more cases that will need to be investigated.</p><p>&nbsp;</p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "three-more-confirmed-cases-of-novel-coronavirus-infection-in-singapore", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}