{"pressItemDictionary": {"Press Releases": [{"Title": " 110 More Cases Discharged, 51 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1598715300000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "29 Aug 2020", "Summary": "", "MainContent": "<span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;As of 29 August 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 51 cases of COVID-19 infection in Singapore. The breakdown of the cases is as follows:<br><br><strong>Summary of new cases</strong><br><br>All new cases today are asymptomatic, and were detected from our proactive screening and surveillance.&nbsp;<br><br> </span><table border=\"1\" cellspacing=\"0\" cellpadding=\"0\"> <tbody><tr> <td width=\"241\" valign=\"top\"> <p><span style=\"font-size: 16px;\"><br></span></p> </td> <td width=\"120\"> <p align=\"center\"><span style=\"font-size: 16px;\"><strong>Already in quarantine/ isolation before detection </strong></span></p> </td> <td width=\"120\"> <p align=\"center\"><span style=\"font-size: 16px;\"><strong>Detected from surveillance </strong></span></p> </td> <td width=\"120\"> <p align=\"center\"><span style=\"font-size: 16px;\"><strong>Total</strong></span></p> </td> </tr> <tr> <td width=\"241\" valign=\"top\"> <p><span style=\"font-size: 16px;\"><strong>Imported cases</strong></span></p> </td> <td width=\"120\"> <p align=\"center\"><span style=\"font-size: 16px;\">3</span></p> </td> <td width=\"120\"> <p align=\"center\"><span style=\"font-size: 16px;\">0</span></p> </td> <td width=\"120\"> <p align=\"center\"><span style=\"font-size: 16px;\">3</span></p> </td> </tr> <tr> <td width=\"241\" valign=\"top\"> <p><span style=\"font-size: 16px;\"><strong>Cases in the community </strong></span></p> </td> <td width=\"120\"> <p align=\"center\"><span style=\"font-size: 16px;\">0</span></p> </td> <td width=\"120\"> <p align=\"center\"><span style=\"font-size: 16px;\">1</span></p> </td> <td width=\"120\"> <p align=\"center\"><span style=\"font-size: 16px;\">1</span></p> </td> </tr> <tr> <td width=\"241\" valign=\"top\"> <p><span style=\"font-size: 16px;\"><strong>Cases residing in dormitories </strong></span></p> </td> <td width=\"120\"> <p align=\"center\"><span style=\"font-size: 16px;\">37</span></p> </td> <td width=\"120\"> <p align=\"center\"><span style=\"font-size: 16px;\">10</span></p> </td> <td width=\"120\"> <p align=\"center\"><span style=\"font-size: 16px;\">47</span></p> </td> </tr> </tbody></table><p style=\"\"><span style=\"font-size: 16px;\"><br><br><strong>a) Imported cases: 3</strong> (1 Singaporean, 1 Work Pass holder, 1 Student’s Pass holder)<br><br>Amongst the 3 imported cases, 1 (Case 56777) is a Singaporean who returned to Singapore from India on 16 August. Another case (Case 56791) is a Work Pass holder currently employed in Singapore who arrived from Bangladesh on 17 August. The remaining case (Case 56778) is a Student’s Pass holder who arrived from Bangladesh on 17 August. All of them had been placed on 14-day Stay-Home Notice (SHN) upon arrival in Singapore, and had been tested while serving their SHN at dedicated facilities.&nbsp;<br><br><strong>b) Cases in the community: 1 </strong>(1 Work Permit holder)<br><br>There is 1 case in the community who is currently unlinked. Case 56765 was detected as a result of our Rostered Routine Testing of workers in the construction, marine and process sectors who are living outside the dormitories. Epidemiological investigations of the case are in progress. In the meantime, all the identified close contacts of the case have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for his household contacts to determine if he could have been infected by them.&nbsp;<br><br>Overall, the number of new cases in the community has remained stable at an average of 2 cases per day in the past 2 weeks. The number of unlinked cases in the community has also remained stable at an average of 1 case per day in the past 2 weeks. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br><br><strong>c) Cases residing in dormitories: 47</strong><br><br>Amongst the 47 cases residing in dormitories, 37 had been identified earlier as contacts of previous cases, and had already been quarantined to prevent further transmission. They were tested during quarantine to determine their status.&nbsp;&nbsp;<br><br>The remaining 10 cases were detected through surveillance testing, such as our bi-weekly Rostered Routine Testing of workers living in dormitories and testing of those with ARI symptoms. This allows us to pick up cases early, including asymptomatic ones, so that we are able to ring-fence them quickly to prevent further transmission, by aggressively containing, tracing and isolating the close contacts.&nbsp;<br><br>2.&nbsp; &nbsp; &nbsp; &nbsp; Details of these trends can be found in MOH’s daily situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\" title=\"\" class=\"\" target=\"\"><span style=\"text-decoration: underline;\">www.moh.gov.sg/covid-19/situation-report</span></a>). Please refer to <span style=\"text-decoration: underline;\"><a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-a9ce404c0274d447cb102240172e829c7.pdf?sfvrsn=996ddf63_0\" title=\"Annex A\">Annex A</a></span> for the summary of the confirmed cases.&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Of the new cases, 98% are imported or linked to known cases/ clusters, while the rest are pending contact tracing.&nbsp;<br><br><strong>Links between previous cases found</strong><br><br>4. &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Further epidemiological investigations and contact tracing have uncovered links between previously announced and new cases. Please refer to <span style=\"text-decoration: underline;\"><a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-b71df316c391b460baeaacbf2f1d0d93a.pdf?sfvrsn=bf7b3d6_0\" title=\"Annex B\">Annex B</a></span> and <span style=\"text-decoration: underline;\"><a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-ce9f68929ccf04edab0328c254736ddde.pdf?sfvrsn=8e21eec2_0\" title=\"Annex C\">Annex C</a></span> for details.&nbsp;<br><br><strong>Update on condition of confirmed cases</strong><br><br>5. &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;110 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 55,447 have fully recovered from the infection and have been discharged from hospitals or community care facilities.&nbsp;<br><br>6. There are currently 70 confirmed cases who are still in hospital. Of these, most are stable or improving, and none is in the intensive care unit. 1,173 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 27 have passed away from complications due to COVID-19 infection.&nbsp;<br><br><strong><br>MINISTRY OF HEALTH<br>29 AUGUST 2020<br></strong></span></p><div><span style=\"font-size: 16px;\"><br></span></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "110-more-cases-discharged-51-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "Expanded Covid-19 Testing to Specific Community Groups and Updated Guidance On Use of Masks", "PublishedDate": "/Date(1598697240000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "29 Aug 2020", "Summary": "", "MainContent": "<span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The Multi-Ministry Taskforce will expand the COVID-19 testing regime to identified community groups in the upcoming weeks. These tests will be offered to these groups to provide a better picture of population prevalence and facilitate the early containment of any cryptic cases in the community.<br><br>2.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;The Taskforce also recommends that makeshift face coverings such as bandanas, scarves, and neck gaiters should not be used.<br><br><strong>Expanded COVID-19 Testing to Specific Community Groups<br></strong><br>3.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;The Ministry of Health (MOH) regularly reviews our testing strategies to enhance and step up our surveillance regime for the community. Beyond the comprehensive surveillance testing on individuals above the age of 12 diagnosed with acute respiratory infections (ARI), the Government has activated numerous testing operations for targeted groups such as preschool teachers and staff and residents of residential homes serving the elderly<sup>[1]</sup>.<br><br>4.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Although the number of community cases remains low and stable today, we must not let our guard down. As we gradually reopen our economy and resume social activities, we will be testing more extensively in the community. MOH, together with other government agencies, will be progressively reaching out to identified community groups to offer COVID-19 testing on a one-time basis. These testing operations aim to provide a better picture of population prevalence.<br><br>5.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;For a start, we have plans to provide testing to community groups such as taxi and Private Hire Car (PHC) drivers, food delivery personnel, key vendors servicing foreign worker dormitories, as well as stallholders at hawker centres, markets and similar F&amp;B establishments such as coffeeshops. While there has been no local evidence that these community groups are of higher risks of getting infected, MOH will be offering tests to them given the nature of their working environment, such as the high frequency of interactions with members of public.<br><br>6.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;We strongly encourage individuals in the identified community groups to come forward and utilise the tests offered. The costs of the tests will be fully borne by the government.<br><br>Updated Guidance on Use of Masks<br><br>7.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;There have been recent queries on the efficacy of makeshift coverings such as bandanas, scarves, and neck gaiters in preventing disease transmission. As these makeshift coverings may not have a good fit around the person’s nose and mouth and are made from materials that are not specific for disease prevention, they may not perform as well as purpose-built masks.<br><br>8.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;To ensure transmission rates in the community are kept low, it is critical for every member of public to put on masks that are designed or made specifically to prevent disease transmission. A mask should be worn such that it closely and completely covers the wearer’s nose and mouth, without leaving a gap between the mask and the face. Therefore, face coverings such as neck gaiters, bandanas, scarves, or handkerchiefs should not be used.<br><br><strong>Playing Our Part in the Fight Against COVID-19<br></strong><br>9.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Everyone has a role to play to ensure the safe resumption of social and economic activities. To be socially responsible, those who are unwell, including those showing early/mild symptoms of fever, cough, sore throat, runny nose and loss of smell, should seek medical attention immediately and stay at home to prevent the spread of illness to others. We strongly urge everyone to do their part by observing safe distancing and practicing good personal hygiene to reduce the risk of transmission. Together, we can continue in our fight against COVID-19 to protect ourselves, our loved ones and our community.<br><br>&nbsp;<br><strong>MINISTRY OF HEALTH<br>29 AUGUST 2020</strong></span>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "expanded-covid-19-testing-to-specific-community-groups-and-updated-guidance-on-use-of-masks", "CurrentPageUrl": null}, {"Title": "51 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1598686200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "29 Aug 2020", "Summary": "", "MainContent": "<span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;As of 29 August 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 51 cases of COVID-19 infection in Singapore. Based on our investigations so far, there is 1 case in the community, who is a Work Pass holder.&nbsp;<br><br>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;There are 3 imported cases, who had all been placed on Stay-Home Notice upon arrival in Singapore.&nbsp;&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>29 AUGUST 2020</strong><br></span><div><span style=\"font-size: 16px;\"><br></span></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "51-new-cases-of-covid-19-infection-29Aug", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}