{"pressItemDictionary": {"Press Releases": [{"Title": "End of Circuit Breaker, Phased Approach to Resuming Activities Safely ", "PublishedDate": "/Date(1589889600000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "19 May 2020", "Summary": "", "MainContent": "<p style=\"text-align: justify;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;The Multi-Ministry Taskforce has assessed the situation and decided to exit the Circuit Breaker when it ends on 1 June 2020. The daily number of new community cases has declined significantly. The dormitory situation has stabilised and we have been able to prevent the large clusters in the dormitories from spreading to the wider community. Therefore we will embark on a controlled approach to resume activities safely over three phases.&nbsp;<br><br>2.&nbsp; &nbsp; &nbsp;With more activities and interactions, we are likely to see a rise in new community cases. What is critical is our ability to detect and contain these cases quickly, and prevent large clusters from forming. More importantly, our re-opening plans will not be a return to life before COVID-19. We must get used to a new normal, with the widespread adoption of safe management measures and technology so we can carry out our daily activities safely.&nbsp;<br><br><strong>Phase One (“Safe Re-opening”)&nbsp;<br></strong><br>3.&nbsp; &nbsp; &nbsp;Phase One will be implemented from 2 June 2020. As the risk of a resurgence in community transmission remains high, we must exercise caution as we progressively lift the circuit breaker measures. So we will first resume economic activities that do not pose high risk of transmission. But social, economic and entertainment activities that carry higher risk will remain closed. Everyone should continue to leave home only for essential activities, and should wear a mask when doing so. As seniors are a particularly vulnerable group, they should continue to stay at home as much as possible.<br><br>4.&nbsp; &nbsp; &nbsp;As more of us return to work and school, we must ensure that we conduct these activities safely, to minimise the risk of community transmission.&nbsp;<br><br>a. <strong><span style=\"text-decoration: underline;\">Safe Work.</span></strong> Besides the essential businesses that are already operating, we will gradually allow more Singaporeans to return to work, starting with businesses that operate in settings with lower transmission risks. Most manufacturing companies can resume full production, subject to the issued guidelines set for the manufacturing sector. Most offices can also re-open, but with tele-commuting adopted to the maximum extent. Those who have been working from home so far should continue to do so, and employees should go to the office only where it is demonstrably necessary, e.g. to access specialised systems/ equipment that cannot be accessed from home, or to fulfil legal requirements (e.g. to complete contracts or transactions). Employers must put in place and enforce safe management measures at the workplace, and employees must adhere strictly to them. Checks will be conducted. Businesses whose employers do not provide a safe workplace, or whose workers do not adhere to safe management measures, will have to close their workplaces. Most retail outlets and other personal services will not re-open in Phase One. Dining in at F&amp;B outlets will continue to be disallowed. Only selected services, namely, motor vehicle servicing, aircon servicing, basic pet services [1], school bookshops and retail shops selling school uniforms, will be allowed to resume. Hairdressers and barbers will also be allowed to resume offering all hairdressing services, beyond basic haircut services. All home-based businesses that operate using a delivery/ collection model will also be allowed to resume. The list of businesses that can resume operations from 2 June 2020 is in <a href=\"/docs/librariesprovider5/default-document-library/annex-a05667c7d43454b05b072239ceb582db1.pdf?sfvrsn=8e583f6_0\" title=\"Annex A\">Annex A</a>. Businesses in this list do not need to apply for exemption before resuming operations. Taking into consideration the large number of businesses involved, the Ministry of Trade and Industry (MTI) will grant these businesses a class exemption to resume business. Businesses must submit their manpower details via the GoBusiness portal (<a href=\"https://covid.gobusiness.gov.sg\" title=\"\" class=\"\" target=\"\">https://covid.gobusiness.gov.sg</a>) within two weeks of the date of resumption of operations. MTI’s advisory on the gradual resumption of business activities is in <a href=\"/docs/librariesprovider5/default-document-library/annex-b720556c0e56b4cdfaf670b03c548045d.pdf?sfvrsn=d22dbb8b_0\" title=\"Annex B\">Annex B</a>.&nbsp;<br><br>b. <strong><span style=\"text-decoration: underline;\">Safe Home and Community.</span></strong> We should continue to limit our contacts with others outside of our household. However to allow families to spend time and provide support to one another, each household will be allowed to visit their parents or grandparents staying elsewhere. Each receiving household should limit such visits to only one per day, and to not more than two persons who must be from the same visiting household. As part of this policy, dropping off children at parents’ and grandparents’ homes for childcare will also be allowed, subject to the same limit of two visitors from the same visiting household per day. This is on top of the existing provisions for informal childcare arrangements for essential workers. All members of both households must observe good hygiene practices during the visit. We will allow marriage solemnisations to take place in-person again, involving up to 10 persons. Places of worship can re-open for private worship, with up to 5 members of the same household praying together at any one time. Families can continue to gather for wakes and funerals, with no more than 10 persons at any one time. Other non-essential activities and social gatherings will remain prohibited, as these will invariably bring together more people from different households, undermining our efforts to keep our families safe. Sports and recreation facilities will remain closed.<br><br>c. <strong><span style=\"text-decoration: underline;\">Safe School.</span> </strong>Preschools will gradually re-open by levels from 2 June 2020, with full resumption by 10 June 2020, so that young children can be cared for safely while their parents return to work. Students from graduating cohorts at primary and secondary levels will attend school daily, while other cohorts will rotate weekly, alternating between Home-Based Learning (HBL) and returning to school for lessons. Junior Colleges and Millennia Institute will arrange to have half of their students back in school at any one time. Students in the Institutes of Higher Learning (IHLs) whose terms are in session will be able to return to campus for practical and lab-based sessions, with lectures remaining online. All staff and students will be required to wear masks or face shields when in school or on campus. Further details will be provided by the Ministry of Education (MOE) and the respective educational institutions. Co-Curricular Activities, enrichment activities and tuition will not resume as they encourage mingling across classes and schools. Student Care Centres will fully re-open on 2 June 2020, along with the reopening of schools.<br><br>d. <span style=\"text-decoration: underline;\"><strong>Safe Care.</strong></span> Healthcare services such as specialist outpatient services, medical procedures, allied health services, community-based services, and chronic disease management will resume, prioritised by healthcare providers based on medical necessity and available capacity while maintaining appropriate safe distancing and precautionary measures. Some examples include surgeries for advanced cataracts, joint surgeries for patients with severe impairment, cancer screening and surveillance services including scopes for high-risk groups, ongoing dental procedures with guidance to minimise aerosol-generation, and diabetic foot screening. Preventive health services, such as flu vaccinations, will recommence. Complementary healthcare services will resume for one-to-one sessions and by appointment, and Traditional Chinese Medicine (TCM) needle acupuncture will be allowed for all conditions. The current measures limiting the scope of senior services and senior-centric activities will remain, in order to protect our seniors. However, Senior Activity Centres will gradually resume some activities in a safe and controlled manner, to address the psychosocial well-being of seniors with little or no social support. Community-based centre services for persons with disabilities will also gradually re-open to serve those who need the services, with safe distancing measures in place. Activities, where needed, will be held in smaller groups, and persons who have medical conditions are encouraged to remain at home to receive home-based support. Staff will continue to adhere to necessary precautions including the wearing of masks, maintaining good personal hygiene and ensuring regular cleaning of activity equipment and shared spaces. Further details will be provided by the respective agencies and centres.<br><br><strong>Phases Two and Three<br></strong><br>5.&nbsp; &nbsp; &nbsp; &nbsp;The Multi-Ministry Taskforce will monitor the daily infection rates which are expected to rise with increased activity in Phase One. If the community transmission rates remain low and stable over the subsequent few weeks, and the dormitory situation remains under control, then we can move into <strong>Phase Two (“Safe Transition”)</strong>, with the gradual resumption of more activities.&nbsp;<br><br>6.&nbsp; &nbsp; &nbsp; In Phase Two, we expect to allow social activities in small groups. More firms and businesses, starting with F&amp;B dine-in and retail outlets, gyms and fitness studios, and tuition and enrichment centres, will gradually be allowed to re-open, subject to safe management measures being implemented and practised by employers and employees in these workplaces and their ability to also maintain a safe environment for their customers. Employers should, however, still ensure that those who can work from home continue to do so. Depending on the situation, we hope to have all students fully return to school and IHLs will increase the number of students back on campus at any one time for face-to-face learning. Sports, recreation and outdoor facilities will also start to re-open, subject to safe management practices for both facility staff and users being in place.&nbsp;&nbsp;<br><br>7.&nbsp; &nbsp; &nbsp; Depending on the COVID-19 situation and our risk assessment, we will continue to ease measures gradually until we reach <strong>a new normal in Phase 3 (“Safe Nation”)</strong>, a state at which we expect to remain until an effective vaccine or treatment for COVID-19 is developed. By this time, social, cultural, religious and business gatherings or events would have resumed, although gathering sizes would still have to be limited in order to prevent large clusters from arising. Seniors would have been able to resume day-to-day activities while practising safe distancing measures and avoiding peak period travel, crowded places and large groups. Services and activities that involve significant prolonged close contact (e.g. spas and massages) or significant crowd management risk in an enclosed space (e.g. cinemas, theatres, bars, pubs and nightclubs) would also have been allowed to re-open, subject to their ability to implement strict safe management measures effectively. See <a href=\"/docs/librariesprovider5/default-document-library/annex-c43ac18ad1e064ae18b7f1bdfb16b0bf1.pdf?sfvrsn=3354de94_0\" title=\"Annex C\">Annex C</a>&nbsp;for a summary of what to expect in each of the three phases.&nbsp;<br><br><strong>Resuming Activities Safely&nbsp;<br></strong><br>8.&nbsp; &nbsp; &nbsp; With more people returning to work and school, more of us will also be taking public transport. Businesses will be required to stagger their working hours to minimise travel during peak periods. Despite these efforts, it will be difficult to maintain physical distancing between commuters, especially during peak periods. So we will focus on other safe management practices for public transport. In particular, commuters will be required to wear a mask, refrain from talking to one another or on their mobile phones, and maintain good personal hygiene. Our transport operators have also stepped up the cleaning of buses and trains, and will use anti-microbial chemical coatings on exposed surfaces.&nbsp;<br><br>9.&nbsp; &nbsp; &nbsp; We will gradually re-open our borders for Singaporeans to conduct essential activities overseas and to allow safe travel for foreigners entering or transiting through Singapore. We will do so in a careful manner with the necessary precautions and safeguards. As the global situation remains volatile, such moves will be assessed and implemented separately from the timing of the three broad phases of re-opening outlined above. For example, Singapore is currently exploring the possibility of piloting green lane arrangements with a few countries assessed to be at equivalent or lower risk of community transmission as Singapore, for which essential travel in limited numbers and with safeguards, could be conducted safely. We will consider expanding such arrangements gradually as global conditions improve.&nbsp;<br><br>10.&nbsp; &nbsp; &nbsp;A critical pre-condition for us to be able to move into the next phase or ease certain measures further within each phase is to have improved capabilities to control and contain any subsequent outbreaks. We are therefore continuing to build our capabilities in the following areas:<br><br>• <strong>Expand our testing capacity</strong> with the ability to diagnose cases early, screen all individuals at risk, and protect the more vulnerable groups. We will also expand our ongoing sentinel surveillance for undetected cases in the community. As of 17 May 2020, we have conducted over 290,000 tests for COVID-19, or around 5,100 per 100,000 people in Singapore. This includes the testing of around 22,000 residents and staff at our residential care facilities [2], and around 82,000 migrant workers in dormitories [3]. In addition, we recently commenced tests for our preschools, and to-date around 8,500 preschool and early intervention staff have been swabbed;&nbsp;<br><br>• <strong>Speed up contact tracing</strong> to identify and isolate close contacts of infected persons. Upon detection of a case, we aim to be able to identify their close contacts quickly, and notify them of the need to be quarantined. This will help to ring-fence the cases and reduce the likelihood of clusters forming; and&nbsp;<br><br>• <strong>Ensure sufficient healthcare capacity </strong>to deal with any potential surges in COVID-19 cases that we must still expect from time to time. The Ministry of Health will ensure that Singaporeans and our fellow residents, including migrant workers, receive the necessary healthcare, from the point they are diagnosed with COVID-19 to the time they are discharged.<br><br><strong>Working Together to Make Singapore COVID-safe&nbsp;<br></strong><br>11.&nbsp; &nbsp; &nbsp; As more people return to their workplaces or take part in social activities, the risk of community transmission will increase as the virus will have more opportunities to spread among people. We will need all Singaporeans and fellow residents to play our part to keep Singapore COVID-safe.&nbsp;<br><br><em>For individuals and families&nbsp;<br><br></em>12.&nbsp; &nbsp; We must each develop a greater sense of social responsibility, by raising and maintaining overall cleanliness and hygiene levels through changes in our personal habits and inculcating new social norms. This remains the strongest defence against COVID-19. Beyond wearing masks whenever outside one’s home, which will continue to be mandatory, we should maintain good personal hygiene and wash our hands with soap frequently. When eating, we should avoid sharing food and crockery, or to do so only with separate utensils. At hawker centres, coffee shops and food courts, we should clear trays and used crockery after meals and keep the table clean for other users. If we fall ill, we should stay home and refrain from going to work or for social activities.<br><br>13.&nbsp; &nbsp; &nbsp; To protect ourselves and others, we should observe safe distancing measures, avoid crowded places, and minimise time spent outside the home. Where possible, families should continue to keep in touch via digital or other non-physical means as much as possible, and avoid unnecessary social gatherings. Families should continue to pay special attention to seniors and other vulnerable groups, such as bringing them groceries and other essential supplies so that they do not have to leave their homes.<br><br>14.&nbsp; &nbsp; To facilitate efforts in contact tracing and identification of clusters, we should download and use TraceTogether, and check-in and check-out of premises using SafeEntry wherever it is deployed.&nbsp;<br><br>15.&nbsp; &nbsp; &nbsp; &nbsp;Many of us may experience dips in our emotional or psychological wellbeing with the COVID-19 situation. If you need to talk to someone about what you are experiencing, do not hesitate to call the National CARE Hotline at 1800-202-6868.&nbsp;<br><br><em>For employers and businesses&nbsp;<br></em><br>16. Employers are required to implement a system of safe management measures that will protect their employees and strengthen the resilience of their businesses to any further disruptions. This includes implementation of work from home arrangements, staggered working hours, shift or split team arrangements, safe distancing, regular disinfection of common touch points and equipment, provision of cleaning and disinfecting agents, and avoiding physical meetings (both business and social). Employers also need to monitor their employees’ health and have evacuation and follow-up plans in the event of a confirmed case. Businesses must appoint Safe Management Officers to implement this system of measures (see full requirements for Safe Management Measures and checklist on MOM’s website [4]). Where relevant, businesses should adhere to the sector-specific requirements released by the respective agencies [5]. They should ensure that their workers stay safe by avoiding activities with close and prolonged contact, and ensure that they do not socialise and congregate in groups at the workplace, including at common spaces, and during meals and break times. Employees should do their part by adhering to these safe management measures at and outside workplaces, such as by avoiding socialising outside the workplace. Businesses are encouraged to leverage technology to assist in the implementation of safe management measures. Businesses should continue to act in a responsible manner, and not plan or organise events that could draw large numbers of employees or customers.&nbsp;<br><br><em>For students&nbsp;<br></em><br>17.&nbsp; &nbsp; &nbsp; Students should only return to schools and other educational institutions approved to be open, based on the requirements set out by the respective institutions. In school, students should remain in their respective classes and avoid mingling with students from other classes, including during recess and break times. Students should head home after school and school-related activities, avoid crowded areas, and should not linger outside home or mix with others.&nbsp;<br><br><em>For seniors&nbsp;<br></em><br>18.&nbsp; &nbsp; &nbsp; Seniors should continue to stay active as they stay at home and keep in touch with family members and friends via digital and non-physical means as much as possible. Families who visit seniors at home should continue to observe good personal hygiene, and safe distancing measures where possible. It is very important to not physically interact with seniors at all if unwell. Seniors and caregivers who require assistance may call the Agency for Integrated Care at 1800-650-6060.&nbsp;<br><br>19.&nbsp; &nbsp; &nbsp;Seniors who need help in learning how to use digital technology for daily tasks can tap on the Digital Pods and Virtual Digital Clinics newly launched by Infocomm Media Development Authority as part of the Stay Healthy, Go Digital Campaign. An online repository of entertainment and learning content for seniors has been curated to help seniors stay engaged and connected. A new season of infotainment “Learn Together with Me” on Channel 8 will also share tips on digital services like video calls with family, and using teleconsultation to see a doctor online. Podcasts on similar topics in Malay and Tamil will also be available on MeListen from 25 - 29 May. More information is available at <a href=\"http://imsilver.imda.gov.sg\" title=\"\" class=\"\" target=\"\">imsilver.imda.gov.sg</a>.&nbsp;<br><br><strong>SG United, Stronger and Safer Singapore&nbsp;<br></strong>&nbsp;<br>20.&nbsp; &nbsp; &nbsp;The road ahead to a new COVID-safe environment may be long. But with everyone playing their part and staying united, we can get through this and emerge stronger from this experience. #SGUnited.&nbsp;<br><br><strong>MINISTRY OF HEALTH<br>19 MAY 2020</strong><br></p><div style=\"text-align: justify;\">[1] This refers to basic grooming, physiotherapy and rehabilitation services for pets.<br>[2]&nbsp;This includes Nursing Homes, Sheltered Homes, Adult Disability Homes, and Welfare Homes.&nbsp;<br>[3] MOH’s 12 May 2020 press release indicated that more than 32,000 migrant workers in dormitories had been tested. This included migrant workers living in Purpose Built Dormitories, and excluded those in Factory Converted Dormitories, Construction Temporary Quarters, and Temporary Occupation Licence Quarters. The revised figure should be 64,000. Each migrant worker could have been tested more than once.&nbsp;<br>[4] See <a href=\"http://www.mom.gov.sg/covid-19/requirements-for-safe-management-measures\" title=\"\" class=\"\" target=\"\">www.mom.gov.sg/covid-19/requirements-for-safe-management-measures</a><br>[5] See <a href=\"https://covid.gobusiness.gov.sg/safemanagement/general\" title=\"\" class=\"\" target=\"\">https://covid.gobusiness.gov.sg/safemanagement/general</a></div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "end-of-circuit-breaker-phased-approach-to-resuming-activities-safely", "CurrentPageUrl": null}, {"Title": "451 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1589871960000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "19 May 2020", "Summary": "", "MainContent": "<p align=\"center\" style=\"text-align: left;\"><span style=\"text-align: left;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;As of 19 May 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 451 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders residing in foreign worker dormitories. There is one Singaporean/ Permanent Resident case.</span><br></p> <p style=\"text-align: left;\">2&nbsp; &nbsp; &nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.</p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "451-new-cases-of-covid-19-infection", "CurrentPageUrl": null}, {"Title": "No Award of Tender for Site At Gibraltar Cresecent for Dementia Care Village", "PublishedDate": "/Date(1589817600000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "19 May 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; On behalf of the Ministry of Health, the Urban Redevelopment Authority announced today that no award was made for the site at Gibraltar Crescent.<br><br>2 &nbsp; &nbsp; The site at Gibraltar Crescent was launched for sale via the Concept and Price Revenue Tender<b><font color=\"#000032\"><sup>1</sup></font></b> approach on 16 July 2019 to pilot a new residential care community concept for individuals with varying stages of dementia. One of the objectives of the tender was to seek ideas from the private sector to develop new care options for persons with dementia to facilitate ageing-in-place.<br><br>3 &nbsp; &nbsp; The tender closed on 15 January 2020. One tender submission was received from Pre 11 Pte. Ltd. and Orpea Singapore Pte. Ltd.<br><br>4 &nbsp; &nbsp; The tender has been rejected as the sole price bid of $15,000,000 (details of the price bid are shown in Annex B) offered by Pre 11 Pte. Ltd. and Orpea Singapore Pte. Ltd. was deemed too low.<br><br>5 &nbsp; &nbsp; The Government will continue to review the range of options available for seniors to age-in-place in the community as well as the viability of a dedicated residential care option for individuals with dementia. We will continue to consult public and private sector stakeholders.</p> <p>&nbsp;</p> <p><strong>MINISTRY OF HEALTH</strong></p> <p><strong>URBAN REDEVELOPMENT AUTHORITY </strong></p> <div><br clear=\"all\"> <hr width=\"33%\" size=\"1\" align=\"left\"> <div id=\"ftn1\"> <p><font color=\"#000120\"><strong><sup>1</sup></strong></font>Under the Concept and Price Revenue Tender approach, the concept proposals would first be evaluated by a Concept Evaluation Committee against a set of criteria, which included suitability of the proposed model of care for persons with dementia, as well as the quality of the care programmes and services (see details in Annex A). Acceptable concept proposals would proceed to the second stage of the tender evaluation, where the price envelopes of acceptable concept proposals would then be opened and evaluated based on price.<br><br></p><p><strong>ANNEX A</strong><br><br><strong><u>Concept Evaluation Criteria<br><br></u></strong></p><table><tbody><tr><td><strong>Criteria</strong></td><td><strong>Guidelines</strong></td></tr><tr><td> <p><strong>Overall Model of Care (50%)</strong></p> </td><td> <p><strong>(i) Overall Model of Care </strong></p> <p>The services should be less medicalised and more enabling for the dementia residents with efficient use of resources. </p> <p>The model of care should be developed with consideration of client safety, and tenderers will be assessed on their proposed processes to complement and support a safe environment. </p> <p>Tenderers will also be assessed on past international projects (if any), in terms of bed numbers, model of care and client safety. Performance assessment will consider tenderer’s track record (e.g. ability to meet KPIs). </p> <p>&nbsp;</p> <p><strong>(ii) Quality Care Programmes and Services </strong></p> <p>The proposed programmes and services should achieve the following objectives:</p> <ul><li>Create opportunities for meaningful participation and positive environmental stimuli for residents and family/caregivers; </li><li>Provide varying levels of activities and services that can be adjusted to the long-term needs of each residents (e.g. as care needs increase), with the involvement of family/caregivers; and</li><li>Encourage social interaction and communal living among residents and family/caregivers, through the provision of ample opportunities for mutual support and bonding as a community and formation of informal social networks, and include collaboration with nearby community partners to bring the outside community into the proposed development and similarly, residents should have access to supporting services and amenities in the larger community.</li></ul> </td></tr><tr><td><strong>Facilities Design and Management (25%)</strong></td><td> <p><strong>(i) Overall Layout of Uses and Services </strong></p> <p>The design, layout and placement of uses for the proposed development should achieve the following objectives:</p> <ul><li>Provide a friendly and secure environment for residents to undertake activities of daily living independently;</li><li>Create seamless connectivity between the facilities;</li><li>Include suitable signage and appropriate landscaping for ease of way-finding;</li><li>Provide communal spaces for residents to linger, mingle and interact in the public realm in safe, welcoming and accessible settings; and</li><li>Incorporate flexibility that can comprehensively cater to the changing needs of the residents as they age-in-place.</li></ul> <p>&nbsp;</p> <p><strong>(ii) Facility Management </strong></p> <p>The proposal should articulate the extent to which infrastructure, services and programming will be maintained and refreshed in a timely manner to continue to stay relevant to residents’ needs. This should include having proper feedback channels, quality improvement processes and timely responses to feedback where appropriate. Proposals will be assessed on their plans’ scope, comprehensiveness and timeliness.</p> <br></td></tr><tr><td><strong>Business Sustainability (25%)</strong></td><td><p><strong>Service and Financial Track Record </strong></p> Tenderers will be assessed based on their financial strength. Tenderers must submit their company cash flow and balance sheets, as well as audited financial statements (if available). <br></td></tr></tbody></table><p><br><strong><br>ANNEX B<br><br></strong><strong><u>Price Bid of Acceptable Concept Proposal</u></strong></p><p align=\"center\"><strong><u>&nbsp;</u></strong></p><table border=\"1\" cellspacing=\"0\" cellpadding=\"0\"> <tbody><tr> <td width=\"37\" valign=\"top\"> <p align=\"center\"><strong>S/N</strong></p> </td> <td width=\"274\" valign=\"top\"> <p align=\"center\"><strong>Name of Tenderer</strong></p> </td> <td width=\"156\" valign=\"top\"> <p align=\"center\"><strong>Tendered Land Price </strong></p> <p align=\"center\"><strong>(S$)</strong></p> </td> <td width=\"156\" valign=\"top\"> <p align=\"center\"><strong>Tendered Land Price </strong></p> <p align=\"center\"><strong>(S$psm of GFA)</strong></p> </td> </tr> <tr> <td width=\"37\" valign=\"top\"> <p align=\"center\">1</p> </td> <td width=\"274\" valign=\"top\"> <p align=\"left\">Pre 11 Pte. Ltd. and Orpea Singapore Pte. Ltd.</p> <p align=\"left\">&nbsp;</p> </td> <td width=\"156\" valign=\"top\"> <p align=\"center\">$15,000,000.00</p> </td> <td width=\"156\" valign=\"top\"> <p align=\"center\">$1,392.76</p> </td> </tr> </tbody></table><p><strong> <br><br></strong><strong><u><br></u></strong></p> </div> </div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "no-award-of-tender-for-site-at-gibraltar-cresecent-for-dementia-care-village", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}