{"pressItemDictionary": {"Press Releases": [{"Title": "1,164 More Cases Discharged; 752 New Cases of Covid-19 Infection Confirmed", "PublishedDate": "/Date(1589467740000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "14 May 2020", "Summary": "", "MainContent": "As of 14 May 2020, 12pm, the Ministry of Health (MOH) has confirmed and verified an additional 752 cases of COVID-19 infection in Singapore. The breakdown is as follows:&nbsp;<br><br><strong>a) Imported cases: 0&nbsp;<br><br></strong>There are no imported cases today.&nbsp;<br><br><strong>b) Cases in the community: 2 (2 Singaporeans/Permanent Residents)</strong><br><br>The number of new cases in the community has decreased, from an average of 8<br>cases per day in the week before, to an average of 5 per day in the past week.<br>The number of unlinked cases in the community has also decreased, from an<br>average of 3 cases per day in the week before, to an average of 2 per day in the<br>past week. We will continue to closely monitor these numbers, as well as the<br>cases detected through our surveillance programme.<br><br><strong>c) Work Permit holders (residing outside dormitories): 0</strong><br><br>The number of new cases amongst Work Permit holders residing outside<br>dormitories has decreased, from an average of 6 cases per day in the week<br>before, to an average of 3 per day in the past week.&nbsp;<br><br><strong>d) Work Permit holders (residing in dormitories): 750<br></strong><br>We continue to pick up many more cases amongst Work Permit holders residing<br>in dormitories, including in factory-converted dormitories, because of extensive<br>testing in these premises, as part of our process to verify and test the status of all<br>workers. <br><br>2. Details of these trends can be found in MOH’s daily situation Report<br>(www.moh.gov.sg/covid-19/situation-report). Please refer to&nbsp;<a href=\"/docs/librariesprovider5/default-document-library/annex-a211f07ad802340e7950a3356f40b7e9a.pdf?sfvrsn=acf882e1_0\" title=\"Annex A\">Annex A</a>&nbsp;for the<br>summary of the confirmed cases.<br><br>3. Of the new cases, 99% are linked to known clusters, while the rest are pending contact tracing.<br><br><strong>Links between previous cases found&nbsp;<br><br></strong>4. In the past week (7 May to 13 May), MOH has uncovered links for 147 previously unlinked cases.<br><br>5. Further epidemiological investigations and contact tracing have uncovered<br>links between previously announced and new cases. Please refer to <a href=\"/docs/librariesprovider5/default-document-library/annex-b2903a91188834b52a8cbda8ea9166318.pdf?sfvrsn=b1b15924_0\" title=\"Annex B\">Annex B</a>&nbsp;and<br><a href=\"/docs/librariesprovider5/default-document-library/annex-c4529a7b13bb24192acb43607f0999fea.pdf?sfvrsn=cb86ee6d_0\" title=\"Annex C\">Annex C</a> for details.<br><br><strong>Update on condition of confirmed cases</strong><br><br>6. 1,164 more cases of COVID-19 infection have been discharged from hospitals<br>or community isolation facilities. In all, 5,973 have fully recovered from the infection<br>and have been discharged from hospitals or community care facilities.<br><br>7. There are currently 1,072 confirmed cases who are still in hospital. Of these,<br>most are stable or improving, and 20 are in critical condition in the intensive care<br>unit. 19,032 are isolated and cared for at community facilities. These are those who<br>have mild symptoms, or are clinically well but still test positive for COVID-19. 21<br>have passed away from complications due to COVID-19 infection.<br><br>MINISTRY OF HEALTH<br>14 MAY 2020", "PressCategory": ["Press Releases"], "CustomDetailUrl": "", "UrlName": "1-164-more-cases-discharged-752-new-cases-of-covid-19-infection-confirmed", "CurrentPageUrl": null}, {"Title": "752 New Cases of Covid-19 Infection", "PublishedDate": "/Date(1589440020000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "14 May 2020", "Summary": "", "MainContent": "<p align=\"center\" style=\"text-align: left;\"><span style=\"text-align: left;\">As of 14 May 2020, 12pm, the Ministry of Health (MOH) has preliminarily confirmed an additional 752 cases of COVID-19 infection in Singapore, the vast majority of whom are Work Permit holders residing in foreign worker dormitories. Two cases are Singaporeans/ Permanent Residents.<br><br></span>We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.</p>", "PressCategory": ["Press Releases"], "CustomDetailUrl": "", "UrlName": "752-new-cases-of-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}