{"pressItemDictionary": {"Press Releases": [{"Title": "No Award of Tender for Site At Gibraltar Cresecent for Dementia Care Village", "PublishedDate": "/Date(1589817600000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "19 May 2020", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; On behalf of the Ministry of Health, the Urban Redevelopment Authority announced today that no award was made for the site at Gibraltar Crescent.<br><br>2 &nbsp; &nbsp; The site at Gibraltar Crescent was launched for sale via the Concept and Price Revenue Tender<a name=\"_ftnref1\" title=\"\" href=\"file:///C:/Users/shireen/Desktop/Final_Joint%20Press%20Release%20to%20Reject%20Tender.docx#_ftn1\"><strong><strong>[1]</strong></strong></a> approach on 16 July 2019 to pilot a new residential care community concept for individuals with varying stages of dementia. One of the objectives of the tender was to seek ideas from the private sector to develop new care options for persons with dementia to facilitate ageing-in-place.<br><br>3 &nbsp; &nbsp; The tender closed on 15 January 2020. One tender submission was received from Pre 11 Pte. Ltd. and Orpea Singapore Pte. Ltd.<br><br>4 &nbsp; &nbsp; The tender has been rejected as the sole price bid of $15,000,000 (details of the price bid are shown in Annex B) offered by Pre 11 Pte. Ltd. and Orpea Singapore Pte. Ltd. was deemed too low.<br><br>5 &nbsp; &nbsp; The Government will continue to review the range of options available for seniors to age-in-place in the community as well as the viability of a dedicated residential care option for individuals with dementia. We will continue to consult public and private sector stakeholders.</p> <p>&nbsp;</p> <p><strong>MINISTRY OF HEALTH</strong></p> <p><strong>URBAN REDEVELOPMENT AUTHORITY </strong></p> <div><br clear=\"all\"> <hr width=\"33%\" size=\"1\" align=\"left\"> <div id=\"ftn1\"> <p><a name=\"_ftn1\" title=\"\" href=\"file:///C:/Users/shireen/Desktop/Final_Joint%20Press%20Release%20to%20Reject%20Tender.docx#_ftnref1\">[1]</a> Under the Concept and Price Revenue Tender approach, the concept proposals would first be evaluated by a Concept Evaluation Committee against a set of criteria, which included suitability of the proposed model of care for persons with dementia, as well as the quality of the care programmes and services (see details in Annex A). Acceptable concept proposals would proceed to the second stage of the tender evaluation, where the price envelopes of acceptable concept proposals would then be opened and evaluated based on price.<br><br></p><p><strong>ANNEX A</strong><br><br><strong><u>Concept Evaluation Criteria<br><br></u></strong></p><table><tbody><tr><td><strong>Criteria</strong></td><td><strong>Guidelines</strong></td></tr><tr><td> <p><strong>Overall Model of Care (50%)</strong></p> </td><td> <p><strong>(i) Overall Model of Care </strong></p> <p>The services should be less medicalised and more enabling for the dementia residents with efficient use of resources. </p> <p>The model of care should be developed with consideration of client safety, and tenderers will be assessed on their proposed processes to complement and support a safe environment. </p> <p>Tenderers will also be assessed on past international projects (if any), in terms of bed numbers, model of care and client safety. Performance assessment will consider tenderer’s track record (e.g. ability to meet KPIs). </p> <p>&nbsp;</p> <p><strong>(ii) Quality Care Programmes and Services </strong></p> <p>The proposed programmes and services should achieve the following objectives:</p> <ul><li>Create opportunities for meaningful participation and positive environmental stimuli for residents and family/caregivers; </li><li>Provide varying levels of activities and services that can be adjusted to the long-term needs of each residents (e.g. as care needs increase), with the involvement of family/caregivers; and</li><li>Encourage social interaction and communal living among residents and family/caregivers, through the provision of ample opportunities for mutual support and bonding as a community and formation of informal social networks, and include collaboration with nearby community partners to bring the outside community into the proposed development and similarly, residents should have access to supporting services and amenities in the larger community.</li></ul> </td></tr><tr><td><strong>Facilities Design and Management (25%)</strong></td><td> <p><strong>(i) Overall Layout of Uses and Services </strong></p> <p>The design, layout and placement of uses for the proposed development should achieve the following objectives:</p> <ul><li>Provide a friendly and secure environment for residents to undertake activities of daily living independently;</li><li>Create seamless connectivity between the facilities;</li><li>Include suitable signage and appropriate landscaping for ease of way-finding;</li><li>Provide communal spaces for residents to linger, mingle and interact in the public realm in safe, welcoming and accessible settings; and</li><li>Incorporate flexibility that can comprehensively cater to the changing needs of the residents as they age-in-place.</li></ul> <p>&nbsp;</p> <p><strong>(ii) Facility Management </strong></p> <p>The proposal should articulate the extent to which infrastructure, services and programming will be maintained and refreshed in a timely manner to continue to stay relevant to residents’ needs. This should include having proper feedback channels, quality improvement processes and timely responses to feedback where appropriate. Proposals will be assessed on their plans’ scope, comprehensiveness and timeliness.</p> <br></td></tr><tr><td><strong>Business Sustainability (25%)</strong></td><td><p><strong>Service and Financial Track Record </strong></p> Tenderers will be assessed based on their financial strength. Tenderers must submit their company cash flow and balance sheets, as well as audited financial statements (if available). <br></td></tr></tbody></table><p><br><strong><br>ANNEX B<br><br></strong><strong><u>Price Bid of Acceptable Concept Proposal</u></strong></p><p align=\"center\"><strong><u>&nbsp;</u></strong></p><table border=\"1\" cellspacing=\"0\" cellpadding=\"0\"> <tbody><tr> <td width=\"37\" valign=\"top\"> <p align=\"center\"><strong>S/N</strong></p> </td> <td width=\"274\" valign=\"top\"> <p align=\"center\"><strong>Name of Tenderer</strong></p> </td> <td width=\"156\" valign=\"top\"> <p align=\"center\"><strong>Tendered Land Price </strong></p> <p align=\"center\"><strong>(S$)</strong></p> </td> <td width=\"156\" valign=\"top\"> <p align=\"center\"><strong>Tendered Land Price </strong></p> <p align=\"center\"><strong>(S$psm of GFA)</strong></p> </td> </tr> <tr> <td width=\"37\" valign=\"top\"> <p align=\"center\">1</p> </td> <td width=\"274\" valign=\"top\"> <p align=\"left\">Pre 11 Pte. Ltd. and Orpea Singapore Pte. Ltd.</p> <p align=\"left\">&nbsp;</p> </td> <td width=\"156\" valign=\"top\"> <p align=\"center\">$15,000,000.00</p> </td> <td width=\"156\" valign=\"top\"> <p align=\"center\">$1,392.76</p> </td> </tr> </tbody></table><p><strong> <br><br></strong><strong><u><br></u></strong></p> </div> </div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "no-award-of-tender-for-site-at-gibraltar-cresecent-for-dementia-care-village", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}