{"pressItemDictionary": {"Press Releases": [{"Title": "16 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1619685000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "29 Apr 2021", "Summary": "", "MainContent": "&nbsp; &nbsp;As of 29 April 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 16 new cases of locally transmitted COVID-19 infection. Based on our investigations so far, the cases are in the community, and there are no new cases in the dormitories. Amongst them, 7 are family members of Case 62517 [1], and had &nbsp;already been placed on quarantine earlier. 8 are linked to Case 62541 [2], and were detected from our proactive testing of patients and staff in the affected ward. <br><br>2.&nbsp; &nbsp; In addition, there are 19 imported cases, who had already been placed on Stay-Home Notice upon arrival in Singapore. In total, there are 35 new cases of COVID-19 infection in Singapore today. <br><br>3.&nbsp; &nbsp; Following the detection of Case 62541, Tan Tock Seng Hospital (TTSH) has locked down Ward 9D, and tested the patients who had been in the ward. As a precautionary measure, all staff working in TTSH wards will also be tested for COVID-19 infection. All close contacts of the cases, including patients, visitors and staff who had been in Ward 9D, will be placed on quarantine. Visitors will not be allowed into the hospital wards while investigations are ongoing. <br><br>4.&nbsp; &nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.<p>&nbsp;</p> <p>&nbsp;</p> <div> <p><strong>MINISTRY OF HEALTH<br></strong><strong>29 APRIL 2021</strong></p> </div> <div><br clear=\"all\"> <hr align=\"left\" size=\"1\" width=\"33%\"> <div id=\"ftn1\"> <p>[1] Case 62517 is a 38 year-old male Singaporean who works as an Immigration &amp; Checkpoints Authority Officer deployed at Changi Airport Terminal 1. He was confirmed to have COVID-19 infection on 27 April. </p> </div> <div id=\"ftn2\"> <p>[2] Case 62541 is a 46 year-old female Philippines national who is a nurse at Tan Tock Seng Hospital, and is deployed at Ward 9D. She was confirmed to have COVID-19 infection on 27 April. There are 9 cases in total linked to TTSH so far. </p> </div> </div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "16-new-cases-of-locally-transmitted-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}