{"pressItemDictionary": {"Press Releases": [{"Title": "9 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1619770560000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "30 Apr 2021", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;As of 30 April 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 9 new cases of locally transmitted COVID-19 infection, of whom 8 are linked to previous cases. Amongst them, 4 cases are linked to Case 62541[1]&nbsp;and were detected from our proactive testing of patients and staff at Tan Tock Seng Hospital. Based on our investigations so far, the cases are in the community, and there are no new cases in the dormitories.</p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In addition, there are 15 imported cases, who had already been placed on Stay-Home Notice upon arrival in Singapore. In total, there are 24 new cases of COVID-19 infection in Singapore today.</p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.</p><div><br clear=\"all\"><hr align=\"left\" size=\"1\" width=\"33%\"><div id=\"ftn1\"><p>[1] Case 62541 is a 46 year-old female Philippines national who is a nurse at Tan Tock Seng Hospital (TTSH), and is deployed at Ward 9D. She was confirmed to have COVID-19 infection on 27 April. There are 13 cases in total linked to TTSH so far.</p></div></div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "9-new-cases-of-locally-transmitted-covid-19-infection-30-apr", "CurrentPageUrl": null}, {"Title": "Suspension of Chilli Api Catering Pte Ltd (located At 3015 Bedok North Street 5 #05-26/#06-19/#06-24/#06-27/15, Shimei East Kitchen) Lifted After Meeting Required Standards", "PublishedDate": "/Date(1619766000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "30 Apr 2021", "Summary": "", "MainContent": "&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The Singapore Food Agency (SFA) has lifted the suspension of Chilli Api Catering Pte Ltd’s food business operations today. As the licensee has implemented the required measures as stipulated by SFA, operations can be resumed.&nbsp;&nbsp;<br><br>2&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The Ministry of Health (MOH) and SFA had received reports of gastroenteritis involving 129 persons who consumed food prepared by Chilli Api Catering Pte Ltd between 10 and 13 March 2021. 23 persons were hospitalised and they have since been discharged. The remaining cases either sought outpatient treatment, self-medicated, or recovered without treatment. To protect consumers from further public health risks, the food business operations of Chilli Api Catering Pte Ltd was suspended by SFA from 14 March to 30 April 2021.<br><br>3&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Investigation into the cause of the gastroenteritis illness is ongoing.<br><br><strong><br>Measures Taken by Chilli Api Catering Pte Ltd</strong><br><br>4&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; During the suspension period, Chilli Api Catering Pte Ltd has complied with measures stipulated by SFA. The licensee has disposed all ready-to-eat food, thawed food and perishable food items, and also cleaned and sanitised their premises, including their equipment and utensils.<br><br>5&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Food handlers who will be involved in food preparation have since re-attended and passed the Basic Food Hygiene course. The Food Hygiene Officers&nbsp; (FHO) for Chilli Api Catering Pte Ltd have also undergone retraining and passed the WSQ Conduct Food and Beverage Hygiene Audit course.<br><br><strong><br>Continuing Surveillance</strong><br><br>6&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Following the lifting of suspension, SFA will continue to place Chilli Api Catering Pte Ltd under close surveillance to ensure that it adheres to food safety requirements.<br><br><strong><br>Public Advisory</strong><br><br>7&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; To prevent the spread of disease and protect oneself from acquiring infections, individuals should practise good personal hygiene at all times. These include:<br><br>•&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Washing hands with soap and water before eating and after going to the toilet;<br>•&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Covering mouth and nose with a tissue when coughing or sneezing, and throwing the tissue away into a bin immediately; and<br>•&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Not sharing food/drinks, eating utensils, toothbrushes or towels with others.<br><br>8&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; In the interest of maintaining a high standard of food hygiene at all eating establishments, we would also like to advise members of the public who come across poor hygiene practices in food establishments not to patronise such outlets but to report to SFA via the online feedback form (www.sfa.gov.sg/feedback) with details for our follow-up investigations.<br><br><strong><br>MINISTRY OF HEALTH<br>SINGAPORE FOOD AGENCY<br>30 APRIL 2021</strong>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "suspension-of-chilli-api-catering-pte-ltd-(located-at-3015-bedok-north-street-5-05-26-06-19-06-24-06-27-15-shimei-east-kitchen)-lifted-after-meeting-required-standards", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}