{"pressItemDictionary": {"Press Releases": [{"Title": "118 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1629886800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "25 Aug 2021", "Summary": "", "MainContent": "<span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp;As of 25 August 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 118 new cases of locally transmitted COVID-19 infection.<br><br>2.&nbsp; &nbsp; 26 of the cases are linked to the North Coast Lodge cluster, of whom 25 have been placed on quarantine earlier. Of the remaining 92 cases, 19 are linked to previous cases, and have already been placed on quarantine. 44 are linked to previous cases and were detected through surveillance. 29 are currently unlinked. Amongst the cases are 2 seniors above 70 years who are unvaccinated/ partially vaccinated, and are at risk of serious illness.<br><br>3.&nbsp; &nbsp; In addition, there are 2 imported cases, who have already been placed on Stay-Home Notice (SHN) or isolated upon arrival in Singapore. 1 was detected upon arrival in Singapore, while 1 developed the illness during SHN or isolation.<br><br>4.&nbsp; &nbsp;In total, there are 120 new cases of COVID-19 infection in Singapore today.<br><br>5.&nbsp; &nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.<br><br><br><strong>MINISTRY OF HEALTH<br>25 AUGUST 2021</strong><br></span><div><span style=\"font-size: 16px;\"><br></span></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "118-new-cases-of-locally-transmitted-covid-19-infection-25-aug-2021", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}, {"Title": "Termination of Rafflesia Dental Surgery From Chas", "PublishedDate": "/Date(1629874800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "25 Aug 2021", "Summary": "", "MainContent": "<p align=\"center\" style=\"color: rgb(34, 34, 34); margin: 0px 0px 0in; padding: 0px; font-size: small; font-family: Arial, Helvetica, sans-serif; text-align: left;\"><span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp;The Ministry of Health (MOH) has, on 5 August 2021, served a notice of intended termination on Rafflesia Dental Pte Ltd, for the intended termination of Rafflesia Dental Surgery from the Community Health Assist Scheme (CHAS). The termination will take effect from 28 August 2021.<br><br>2.&nbsp; &nbsp; &nbsp;Audits on Rafflesia Dental Surgery (100 Jalan Sultan #01-04A Sultan Plaza) conducted in late 2020 revealed severe non-compliances, including numerous improper claims for CHAS subsidies with no proper supporting documentation and overclaims[1].&nbsp;&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp;The termination from CHAS means that Rafflesia Dental Surgery will no longer be allowed to make claims for CHAS subsidies on behalf of its patients. Affected patients may wish to visit other nearby CHAS accredited dental clinics instead.<br><br>4.&nbsp; &nbsp; &nbsp;MOH encourages patients to actively engage their doctors and dentists if they have any queries on their bills. CHAS, Pioneer Generation and Merdeka Generation cardholders who wish to check on claims for CHAS subsidies made on their behalf, may do so by logging into the “MY CHAS” module on the CHAS website (<a href=\"http://www.chas.sg\" title=\"\" class=\"\" target=\"\">www.chas.sg</a>) or by calling the CHAS hotline (1800-275-2427).&nbsp;<br><br>5.&nbsp; &nbsp; &nbsp;If they come across any suspicious or unusual claims for CHAS subsidies made on their behalf, they may contact MOH at 1800-225-4122 or send their feedback to MOH_QSM@moh.gov.sg. MOH also reminds healthcare professionals to uphold a high standard of professionalism and to adhere to their Ethical Code and Ethical Guidelines.<br><br>6.&nbsp; &nbsp; &nbsp;MOH takes a serious view of such errant practices and will not hesitate to take enforcement actions where required, including referral of the errant healthcare professionals to their respective professional boards. We have referred this case to the Police for further investigation.<br><br><br><strong>MINISTRY OF HEALTH<br>25 AUGUST 2021</strong><br><br><br></span></p><hr><p align=\"center\" style=\"color: rgb(34, 34, 34); margin: 0px 0px 0in; padding: 0px; font-size: small; font-family: Arial, Helvetica, sans-serif; text-align: left;\"><span style=\"font-size: 16px;\"><br>[1] Claims reflecting a higher subsidy amount in the claims system than in the receipts<br></span></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "termination-of-rafflesia-dental-surgery-from-chas", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}