{"pressItemDictionary": {"Press Releases": [{"Title": "Community Surveillance Testing At 438 Ang Mo Kio Avenue 10 and 430/445a Clementi Avenue 3", "PublishedDate": "/Date(1627475400000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "28 Jul 2021", "Summary": "", "MainContent": "&nbsp; &nbsp; &nbsp; &nbsp; The Ministry of Health (MOH) is investigating likely COVID-19 transmission at Ang Mo Kio Avenue 10 and Clementi Avenue 3. So far, 10 cases of COVID-19 infection have been detected in six households at 438 Ang Mo Kio Avenue 10. Separately, 10 cases of COVID-19 infection have been detected in seven households at 430 Clementi Avenue 3, and three cases in three households at 445A Clementi Avenue 3. Most of these cases are linked to the Jurong Fishery Port cluster. Epidemiological investigations are ongoing.<br><br><strong>438 ANG MO KIO AVENUE 10</strong><br><br>2.&nbsp; &nbsp; &nbsp;In order to uncover community infection cases, MOH will conduct mandatory COVID-19 testing for all residents of 438 Ang Mo Kio Avenue 10. Testing is optional for those who have tested negative for COVID-19 infection from 24 July onwards. Mandatory testing will be conducted at the void deck of 438 Ang Mo Kio Avenue 10 on 29 July 2021 between 9am and 4pm.<br><br>3.&nbsp; &nbsp; &nbsp;To detect possible asymptomatic cases in the community, MOH will also conduct voluntary COVID-19 testing for visitors and those who have interacted with residents of 438 Ang Mo Kio Avenue 10 between 13 July and 27 July 2021. We encourage these individuals to come forward for testing. Testing will be conducted by appointment only at designated Regional Screening Centres from 29 July to 30 July 2021 between 9am and 4pm. To book an appointment and for information on the alternate test locations, please visit <a href=\"http://go.gov.sg/438-amk-appt\" title=\"\" class=\"\" target=\"\">https://go.gov.sg/438-amk-appt</a>, or call 1800 333 9999 if you have any queries.<br><br><strong>430 &amp; 445A CLEMENTI AVENUE 3&nbsp;</strong><br><br>4.&nbsp; &nbsp; &nbsp;MOH will conduct mandatory COVID-19 testing for all residents of 430 and 445A Clementi Avenue 3. Testing is optional for those who have tested negative for COVID-19 infection from 24 July onwards. Mandatory testing will be conducted at the void deck of 430 Clementi Avenue 3 from 29 July to 30 July 2021 between 9am and 4pm.<br><br>5.&nbsp; &nbsp; &nbsp;MOH will also conduct voluntary COVID-19 testing for visitors and those who have interacted with residents of 430 and 445A Clementi Avenue 3 between 13 July and 27 July 2021. Testing will be conducted by appointment only at designated Regional Screening Centres, and at the void deck of 321 Clementi Avenue 5 from 29 July to 31 July 2021 between 9am and 4pm. To book an appointment and for information on the alternate test locations, please visit <a href=\"http://go.gov.sg/430-445a-clementi-appt \" title=\"\" class=\"\" target=\"\">https://go.gov.sg/430-445a-clementi-appt </a>or call 1800 333 9999 if you have any queries.<br><br>6.&nbsp; &nbsp; &nbsp;All residents are to bring along their NRIC for identification purposes. Leaflets have been distributed and SMS notifications have been sent to the residents to provide them with more information. Residents are reminded to keep to their appointment time. Residents are also advised to monitor their health closely and consult a doctor immediately if they feel unwell. Those who are still awaiting their test results are advised to minimise social interactions as much as possible. They should continue to monitor their health and seek immediate medical attention if they feel unwell.<br><br><br><strong>MINISTRY OF HEALTH&nbsp;<br>28 JULY 2021</strong><br>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "community-surveillance-testing-at-438-ang-mo-kio-avenue-10-and-430-445a-clementi-avenue-3", "CurrentPageUrl": null}, {"Title": "Updates to Eligibility for Covid-19 Vaccination", "PublishedDate": "/Date(1627468500000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "28 Jul 2021", "Summary": "", "MainContent": "With the international roll-out of COVID-19 vaccination, accrued data has shown that vaccination is safe and can provide protection against infection and severe disease among immunocompromised persons, who are at increased risk of complications from COVID-19. As such, the Expert Committee on COVID-19 Vaccination now recommends that persons who are severely immunocompromised can be vaccinated.<br><br>2. To help ensure that they are vaccinated when their immune systems are better able to respond to the vaccination, the following groups of patients should obtain a memo on their suitability from their treating specialist and present it to the vaccination provider before being vaccinated:<br><br>a. Patients with active cancer on treatment (chemotherapy, immunotherapy or radiotherapy), defined as treatment in the last three months or planned in the next two months;<br><br>b. Patients with recent transplants within the past three months (solid organ or stem cell); and<br><br>c. Patients on aggressive immunotherapy for non-cancer conditions.<br><br>3. People living with HIV can also now be vaccinated regardless of their CD4 count, without a need for a memo.<br><br>4. The above groups can be vaccinated in the hospital setting or in a community vaccination site.<br><br>5. The effectiveness of vaccines in persons who are immunocompromised may be reduced. As such, it is important for them to take precautions against infection, including avoiding crowded places and practicing good hand hygiene. Household members and persons around immunocompromised persons are urged to be vaccinated to reduce the risk of being infected and transmitting COVID-19 to them.<br><br>6. Separately, recovered persons who have not completed COVID-19 vaccination can do so, and are recommended to receive a single dose of vaccine under the national vaccination programme at least three months after the date of infection. This is a reduction from the previous six-month restriction.&nbsp;<br><br>7. COVID-19 vaccination is important to protect oneself and those around us from COVID-19 infection and severe disease. With the change in recommendations, more vulnerable persons can be vaccinated. The Expert Committee encourages all eligible persons to be vaccinated, especially with the current surge in local COVID-19 cases.<br><br><br><strong>EXPERT COMMITTEE ON COVID-19 VACCINATION<br>28 JULY 2021</strong>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "updates-to-eligibility-for-covid-19-vaccination-28jul2021", "CurrentPageUrl": null}, {"Title": "130 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1627467900000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "28 Jul 2021", "Summary": "", "MainContent": "&nbsp; &nbsp; &nbsp;As of 28 July 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 130 new cases of locally transmitted COVID-19 infection, of which 27 are linked to the Jurong Fishery Port cluster and 2 belong to the KTV cluster. Of the 130 cases today, 61 are linked to previous cases, and have already been placed on quarantine. 21 are linked to previous cases and were detected through surveillance. 48 are currently unlinked. Amongst the cases are 3 seniors above 70 years who are unvaccinated or partially vaccinated, and are at risk of serious illness.<br><br>2.&nbsp; &nbsp; In addition, there are 6 imported cases, who have already been placed on Stay-Home Notice (SHN) or isolated upon arrival in Singapore. 2 were detected upon arrival in Singapore, while 4 developed the illness during SHN or isolation.<br><br>3.&nbsp; &nbsp; In total, there are 136 new cases of COVID-19 infection in Singapore today.<br><br>4.&nbsp; &nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.<br><br><strong>MINISTRY OF HEALTH<br>28 JULY 2021</strong><br>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "130-new-cases-of-locally-transmitted-covid-19-infection(28jul)", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}