{"pressItemDictionary": {"Press Releases": [{"Title": "No New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1614352800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "26 Feb 2021", "Summary": "", "MainContent": "1.&nbsp; &nbsp; &nbsp; As of 26 February 2021, 12pm, the Ministry of Health (MOH) has confirmed and verified that there are no new cases of locally transmitted COVID-19 infection. There are 13 imported cases, who had already been placed on Stay-Home Notice (SHN) upon arrival in Singapore. Amongst the new cases today, 12 are asymptomatic, and were detected from our proactive screening and surveillance, while 1 was symptomatic.<br><div><br><p><strong>Summary of new cases<br></strong></p><table border=\"1\" cellspacing=\"0\" cellpadding=\"0\" width=\"0\"><tbody><tr><td width=\"129\"><p align=\"right\">&nbsp;</p></td><td width=\"60\"><p>&nbsp;</p></td><td width=\"16\" valign=\"top\"><p>&nbsp;</p></td><td width=\"192\" colspan=\"2\"><p align=\"center\"><strong>Breakdown by</strong></p></td><td width=\"16\" valign=\"top\"><p>&nbsp;</p></td><td width=\"192\" colspan=\"2\"><p align=\"center\"><strong>Breakdown by</strong></p></td></tr><tr><td width=\"129\"><p align=\"right\">&nbsp;</p></td><td width=\"60\"><p><strong>Number of cases</strong></p></td><td width=\"16\" valign=\"top\"><p>&nbsp;</p></td><td width=\"96\"><p><strong>Already in quarantine/ isolation before detection</strong></p></td><td width=\"96\"><p><strong>Detected from surveillance</strong></p></td><td width=\"16\" valign=\"top\"><p>&nbsp;</p></td><td width=\"96\"><p><strong>Symptomatic</strong></p></td><td width=\"96\"><p><strong>Asymptomatic</strong></p></td></tr><tr><td width=\"129\"><p><strong>Cases in the community</strong></p></td><td width=\"60\"><p align=\"center\">0</p></td><td width=\"16\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">0</p></td><td width=\"96\"><p align=\"center\">0</p></td><td width=\"16\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">0</p></td><td width=\"96\"><p align=\"center\">0</p></td></tr><tr><td width=\"129\"><p><strong>Cases residing in dormitories</strong></p></td><td width=\"60\"><p align=\"center\">0</p></td><td width=\"16\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">0</p></td><td width=\"96\"><p align=\"center\">0</p></td><td width=\"16\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">0</p></td><td width=\"96\"><p align=\"center\">0</p></td></tr><tr><td width=\"129\"><p><strong>Imported cases</strong></p></td><td width=\"60\"><p align=\"center\">13</p></td><td width=\"16\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">13</p></td><td width=\"96\"><p align=\"center\">0</p></td><td width=\"16\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">1</p></td><td width=\"96\"><p align=\"center\">12</p></td></tr><tr><td width=\"129\"><p><strong>Total</strong></p></td><td width=\"60\"><p align=\"center\">13</p></td><td width=\"16\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">&nbsp;</p></td><td width=\"16\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">&nbsp;</p></td></tr></tbody></table><br>2.&nbsp; &nbsp; &nbsp; Overall, the number of new cases in the community has increased from 1 case in the week before to 4 cases in the past week. The number of unlinked cases in the community has also increased from 1 case in the week before to 2 cases in the past week. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br><br>3.&nbsp; &nbsp; &nbsp; Amongst the 67 confirmed cases reported from 20 February to 26 February, 36 cases have tested positive for their serology tests, 18 have tested negative, and 13 serology test results are pending.<br><br><strong>Case Details</strong><br><br><strong>a) Cases in the community: 0</strong><br><br>There are no cases in the community today.<br><br><strong>b) Cases residing in dormitories: 0</strong><br><br>There are no cases residing in dormitories today.<br><br><strong>c) Imported cases: 13</strong><br><br>Amongst the 13 imported cases,&nbsp;<br><br>• 1 (Case 60492) is a Singaporean and 4 (Cases 60472, 60473, 60477 and 60480) are Singapore Permanent Residents who returned from India and the UK.<br>• 1 (Case 60488) is a Dependant’s Pass holder who arrived from Myanmar.<br>• 1 (Case 60476) is a Long-Term Visit Pass holder who arrived from India.<br>• 1 (Case 60489) is a Work Pass holder who arrived from Myanmar.<br>• 5 are Work Permit holders who arrived from Indonesia, Malaysia and the Philippines, of whom 4 (Cases 60482, 60484, 60486 and 60487) are foreign domestic workers.<br><br>They had all already been placed on SHN upon arrival in Singapore and were tested while serving SHN.<br><br>4.&nbsp; &nbsp; &nbsp; Please refer to the <a href=\"/docs/librariesprovider5/pressroom/press-releases/annexes---26-feb-2021.pdf?sfvrsn=18dbee9d_2\" title=\"Annexes\">Annexes</a>&nbsp;and MOH’s daily Situation Report (<a href=\"https://www.moh.gov.sg/covid-19/situation-report\" title=\"\" class=\"\" target=\"\">www.moh.gov.sg/covid-19/situation-report</a>) for details.<br><br>5.&nbsp; &nbsp; &nbsp; Epidemiological investigations are in progress. In the meantime, all the identified close contacts of the cases have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for the close contacts to determine if the cases could have been infected by them.<br><br><strong>Update on condition of confirmed cases</strong><br><br>6.&nbsp; &nbsp; &nbsp; 18 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 59,803 have fully recovered from the infection and have been discharged from hospitals or community care facilities.<br><br>7.&nbsp; &nbsp; &nbsp; There are currently 15 confirmed cases who are still in hospital. Of these, most are stable or improving, and 1 is in critical condition in the intensive care unit. 66 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 29 have passed away from complications due to COVID-19 infection.<br></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "no-new-cases-of-locally-transmitted-covid-19-infection-26feb2021-update", "CurrentPageUrl": null}, {"Title": "Voluntary Listing of Direct Telemedicine Service Providers to Help Patients Make Informed Choices", "PublishedDate": "/Date(1614319200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "26 Feb 2021", "Summary": "", "MainContent": "<p style=\"text-align: justify;\"><span style=\"font-family: Arial;\"><span style=\"font-size: 14px;\">&nbsp; &nbsp; &nbsp; &nbsp; The Ministry of Health (MOH) has introduced a voluntary listing of direct telemedicine service providers to help patients make an informed choice when selecting a telemedicine service provider. The list will comprise service providers that have committed to meeting essential training, process and governance measures stipulated by MOH. As of 22 February 2021, close to 500 providers have declared to meet MOH’s process and governance measures and are listed.<br><br>2.&nbsp; &nbsp; &nbsp; MOH has been working with the telemedicine industry since April 2018 through a telemedicine-specific regulatory sandbox under the Licensing Experimentation and Adaptation Programme (LEAP). The telemedicine sandbox sought to co-create process and governance measures to support an effective and efficient regulatory regime and allow the safe growth of telemedicine. With the introduction of the listing and the objectives of the telemedicine sandbox having been met, MOH will discontinue the telemedicine sandbox.&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp; Telemedicine is increasingly becoming an important feature of our healthcare landscape, by offering greater convenience, improving accessibility to medical care and medications, and strengthening continuity of care. It also supports MOH’s care transformation efforts by complementing the functions of general practitioners, polyclinics, specialists and the intermediate and long-term care sector in areas such as triaging, follow-up management, chronic condition/symptom management and healthcare administration. In the past year, telemedicine has been an important pillar in our fight against COVID-19, by ensuring patients have access to healthcare while supporting safe distancing measures and mitigating the spread and exposure to the virus.<br><br>4.&nbsp; &nbsp; &nbsp; With the growth in the number of telemedicine providers over the last few years, there is a need to ensure such providers offer services that prioritise patient safety and welfare. There is also a need to help patients identify providers who are aware of the risks of telemedicine, have put in place mitigations to address these risks, and agree to comply with MOH’s measures.<br><br>5.&nbsp; &nbsp; &nbsp; As such, before direct telemedicine services are licensed under HCSA in 2022, MOH will, in the interim, list providers that have committed to abide by specific process and governance measures on the MOH website. To be eligible for listing, these providers must first:<br> <br>a. Have their doctors and/or dentists complete MOH’s telemedicine e-training;<br><br>b. Put in place professional and process measures to provide safe telemedicine care (e.g. having in place appropriate follow-up protocols to direct patients to in-person care where needed, verifying patient identity, and requesting for patient’s current location during the teleconsultation to direct emergency services if required), and ensure compliance to these measures; and&nbsp;<br><br>c. Submit an application form to MOH to be listed (including declaring compliance to MOH’s measures).&nbsp;<br><br>6.&nbsp; &nbsp; &nbsp; From 1 April 2021, only listed providers will be allowed to offer Community Health Assist Scheme (CHAS) subsidies and/or submit MediSave claims for the follow-up of chronic conditions via video consultations under the Chronic Disease Management Programme (CDMP). Providers currently on the CHAS/ MediSave video-consultation list <span style=\"font-size: 12px;\"><sup>[1]</sup></span> have been earlier informed to resubmit their applications to continue providing claimable video consultations. Patients who have scheduled a follow-up for their CDMP condition through video consultation on or after 1 April 2021, and intend to use CHAS subsidies or MediSave, should verify beforehand that their provider is listed by checking the voluntary listing.&nbsp;<br><br>7.&nbsp; &nbsp; &nbsp; While listing is voluntary, MOH strongly encourages providers to participate in the listing, and to address risks and comply with measures early. Doing so will facilitate providers in their transition to becoming licensees under the Healthcare Services Act (HCSA) in 2022.<br><br>8.&nbsp; &nbsp; &nbsp; The full listing of direct telemedicine service providers can be found on the MOH website <span style=\"font-size: 12px;\"><sup>[2]</sup></span>.<br><br><strong>Closure of LEAP Regulatory Sandbox&nbsp;<br></strong><br>9.&nbsp; &nbsp; &nbsp; Since 2018, MOH has worked with 11 telemedicine providers, with varying business and care models, to meet the objectives of the LEAP regulatory sandbox for telemedicine:&nbsp;<br><br>a. Ensure patients and caregivers have early access to telemedicine services with essential safety and risk mitigation measures in place;&nbsp;<br><br>b. Allow participating sandbox providers to introduce new care models or evolve their current models in a safe manner, with early visibility over the eventual regulatory environment; and<br><br>c. Allow MOH to keep in step with the evolving healthcare landscape and to co-create fit-for-purpose and effective mitigations.<br><br>10.&nbsp; &nbsp; &nbsp; In the last three years, these 11 providers have offered over 40,000 unique teleconsultations through the sandbox with no major patient safety issues or complaints reported. Through close collaboration with sandbox providers, and interviews with doctors and patients, MOH co-developed key process and governance controls with the telemedicine community to enable the safe growth of the modality. Some examples include using live video consultation to authenticate the patients’ identity, assess visual cues and build better rapport with the patients, and determining the patient’s exact location at the start of the teleconsultation to direct emergency services when necessary.<br><br>11.&nbsp; &nbsp; &nbsp; These insights were collated into a free telemedicine e-training programme <span style=\"font-size: 12px;\"><sup>[3]</sup></span> launched in March 2020 to guide doctors and other healthcare professionals and staff on the safe use, limitations and implementation of telemedicine into their current practices. As of 22 February 2021, over 6,200 learners have completed MOH’s telemedicine e-training.&nbsp;<br><br>12.&nbsp; &nbsp; &nbsp; This open collaborative effort between private providers and MOH has shown how active engagement and participation in the regulatory sandbox can guide better regulatory clarity and also enable a safe space for providers to innovate. This is in line with MOH’s efforts in adopting a participatory approach in engaging providers on new models of care. MOH would like to express its appreciation to all 11 telemedicine providers for working with the Ministry to develop fit-for-purpose regulatory requirements.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>26 FEBRUARY 2021</strong><br><br>==<br><span style=\"font-size: 12px;\">[1] <a href=\"https://www.moh.gov.sg/covid-19/vc\" title=\"\" class=\"\" target=\"\">https://www.moh.gov.sg/covid-19/vc</a><br>[2] <a href=\"https://www.moh.gov.sg/licensing-and-regulation/telemedicine\" title=\"\" class=\"\" target=\"\">https://www.moh.gov.sg/licensing-and-regulation/telemedicine</a><br>[3] <a href=\"https://go.gov.sg/tmetraining\" title=\"\" class=\"\" target=\"\">https://go.gov.sg/tmetraining</a>&nbsp;</span></span></span></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "voluntary-listing-of-direct-telemedicine-service-providers-to-help-patients-make-informed-choices", "CurrentPageUrl": null}, {"Title": "No New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1614268800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "26 Feb 2021", "Summary": "", "MainContent": "<p>1.&nbsp; &nbsp; &nbsp; As of 26 February 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed that there are no new cases of locally transmitted COVID-19 infection.</p><p>2.&nbsp; &nbsp; &nbsp; There are 13 imported cases, who had already been placed on Stay-Home Notice upon arrival in Singapore.<br><br>3.&nbsp; &nbsp; &nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.</p><p>&nbsp;</p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "no-new-cases-of-locally-transmitted-covid-19-infection-26feb2021", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}