{"pressItemDictionary": {"Press Releases": [{"Title": "Updates On Border Measures for Travellers From Guangdong Province, Mainland China", "PublishedDate": "/Date(1622781000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "04 Jun 2021", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp;The Multi-Ministry Taskforce has been closely monitoring the global COVID-19 situation. We will tighten our border measures for travellers from Guangdong province, Mainland China given the increase in the number of COVID-19 cases there.</p> <p><strong>Travellers from Guangdong Province to Serve 7-Day SHN at Place of Residence </strong></p> <p>2.&nbsp; &nbsp;We had earlier announced that travellers from Mainland China will be allowed to undergo a COVID-19 Polymerase Chain Reaction (PCR) test upon arrival, and if the PCR test result is negative, they will be allowed to go about their activities in Singapore, without a need to serve a Stay-Home Notice (SHN).</p><p><p>3.&nbsp; &nbsp; Given the increased cases observed in Guangzhou, we will be tightening border control measures for travellers with travel history to Guangdong province. From <strong>5 June 2021, 2359 hours:</strong></p></p><p>a) Singapore Citizens (SCs), Permanent Residents (PRs) and Long-Term Pass holders entering Singapore with travel history to Guangdong province, Mainland China within the last 21 days before departure for Singapore, will be subject to an on-arrival COVID-19 PCR test, a 7-day SHN at their place of residence, and a COVID-19 PCR test before the end of the SHN period. </p><p>b) Short-term travellers holding an Air Travel Pass (ATP) with travel history to Guangdong province, Mainland China within the last 21 days before departure for Singapore, will <u>not</u> be allowed to enter Singapore.</p><p>4.&nbsp; &nbsp; All other travellers departing from Mainland China who have been in Mainland China (excluding Guangdong province) in the last 21 days prior to travel will continue to be subject to a COVID-19 test upon arrival at the airport, in lieu of their SHN.</p><p><strong>Regular Review of Border Measures</strong></p><p>5.&nbsp; &nbsp; As the global situation evolves, we will continue to adjust our border measures to manage the risk of importation and transmission to the community. Any changes to border measures will be updated on the <a href=\"https://safetravel.ica.gov.sg/\">SafeTravel website</a>. Travellers are advised to visit the website to check for the most updated border measures before entering Singapore and be prepared to be subjected to the prevailing border measures upon entry.</p> <div> <p><strong>MINISTRY OF HEALTH<br></strong><strong>4 JUNE 2021</strong></p> </div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "updates-on-border-measures-for-travellers-from-guangdong-province-mainland-china", "CurrentPageUrl": null}, {"Title": "Joint Moh-moe Statement On Erroneous Administration of Moderna Covid-19 Vaccine to 16 Year-old Youth", "PublishedDate": "/Date(1622737200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "04 Jun 2021", "Summary": "", "MainContent": "<p><span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; On 3 June 2021, a 16 year-old youth was administered the first dose of the Moderna COVID-19 vaccine<sup>[1]</sup> at Kolam Ayer Community Club Vaccination Centre. The error was discovered onsite when vaccination centre staff identified that the individual was under 18 years of age during the post-vaccination observation period. As an additional precaution, he was placed under a longer observation time of 50 minutes, and remains generally well. </span></p> <p><span style=\"font-size: 16px;\">2&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Our investigations found that the individual’s date of birth had been erroneously entered when booking a vaccination appointment after receiving the sign-up link. This resulted in his age being incorrectly registered as above 18 years of age, making it possible for a Moderna vaccination centre to be selected. The vaccination centre staff had failed to verify his age during registration, which should have been carried out. </span></p><p><span style=\"font-size: 16px;\">3&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;The safety of those receiving the vaccination is of utmost priority. The Ministry of Health (MOH) and Ministry of Education (MOE) take a serious view of this incident. We apologise for the inconvenience and anxiety caused, and have reached out to the youth’s parents to explain the situation. The Expert Committee for COVID-19 Vaccination has reviewed this case, and does not expect him to suffer any safety issues from this incident.</span></p><p><span style=\"font-size: 16px;\">4&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;A thorough review of our internal processes at vaccination sites has been carried out by MOH to prevent a recurrence. This includes strengthening our online registration process to ensure individuals make appointments at suitable vaccination centres based on their eligibility, as well as putting in place more stringent protocols at our vaccination sites to verify eligibility. We are in close contact with the individual and his family, and will continue to monitor his health closely and provide the necessary support.</span></p> <p><span style=\"font-size: 16px;\"><strong><br>MINISTRY OF HEALTH<br></strong><strong></strong><strong>MINISTRY OF EDUCATION<br></strong><strong></strong><strong>4 JUNE 2021</strong></span></p><div> <hr align=\"left\" size=\"1\" width=\"33%\"> <div id=\"ftn1\"> <p><span style=\"font-size: 16px;\"><sup>[1] </sup>The Moderna COVID-19 vaccine is currently authorised for use in individuals aged 18 and above. </span></p> </div> </div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "joint-moh-moe-erroneous-administration-of-moderna-youth", "CurrentPageUrl": null}, {"Title": "Expert Committee On Covid-19 Vaccination On the Incident of 16 Year-old Youth Administered With Moderna Covid-19 Vaccine ", "PublishedDate": "/Date(1622737200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "04 Jun 2021", "Summary": "", "MainContent": "<span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The Expert Committee on COVID-19 Vaccination has reviewed the incident where a 16 year-old youth had been erroneously administered the first dose of the Moderna COVID-19 vaccine on 3 June 2021.<br><br>2 &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;The Moderna COVID-19 vaccine is currently authorised for use in Singapore for individuals aged 18 and above. Data from a trial&nbsp; involving more than 3,700 adolescents aged 12 to 17 years old has found that the Moderna COVID-19 vaccine is safe and effective among adolescents with no significant safety issues identified. The majority of adverse events were mild or moderate in severity, and the common ones were injection site pain, headache, fatigue, muscle aches and chills.&nbsp;&nbsp;<br><br>3 &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;The Expert Committee for COVID-19 Vaccination does not expect any safety issues from the receipt of the Moderna COVID-19 vaccine in the 16-year-old youth, and the medical team will consult the Expert Committee on what would be best for the youth for the completion of the vaccination.&nbsp;<br><br>4 &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;The Expert Committee will continue to closely monitor the global evidence and developments on COVID-19 vaccines, in particular the emerging data on the efficacy and safety of vaccine use for more population subgroups, as more people are vaccinated globally and locally.<br><br><br><strong>EXPERT COMMITTEE ON COVID-19 VACCINATION<br>4 JUNE 2021</strong></span><br><div><br></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "EC19V_moderna-youth", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}