{"pressItemDictionary": {"Press Releases": [{"Title": "182 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1626771480000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "20 Jul 2021", "Summary": "", "MainContent": "<p style=\"text-align: justify;\"><span style=\"font-size: 16px; font-family: Arial;\"><span><span><span style=\"color: black;\">1.&nbsp; &nbsp; &nbsp;As of 20 July 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 182 new </span></span></span></span><span style=\"font-size: 16px; font-family: Arial;\"><span><span><span>cases of locally transmitted COVID-19 infection, of which 135 are linked to the Jurong Fishery Port cluster and 12 belong to the KTV cluster.&nbsp;Of the 182 cases today, 81 are <span class=\"bumpedfont15\">linked to previous cases, and have already been placed on quarantine. 75 are linked to previous cases and were detected through surveillance. 26 are currently unlinked. Amongst the cases are 2 seniors above 70 years who are unvaccinated, and are at risk of serious illness. </span></span></span></span></span></p> <p style=\"text-align: justify;\"><span style=\"font-size: 16px; font-family: Arial;\"><span><span><span>2.&nbsp; &nbsp; &nbsp;</span></span></span></span><span style=\"text-align: left; font-size: 16px; font-family: Arial;\">In addition, there are 13 imported cases, who have already been placed on Stay-Home Notice (SHN) or isolated </span><span style=\"text-align: left; font-size: 16px; font-family: Arial;\">upon arrival in Singapore</span><span style=\"text-align: left; font-size: 16px; font-family: Arial;\">. 6 were detected upon arrival in Singapore, while 7 developed the illness during SHN or isolation.</span></p><p><p><span style=\"font-size: 16px; font-family: Arial;\"><span>3.&nbsp; &nbsp; &nbsp;</span></span><span style=\"font-family: Arial; font-size: 16px;\">In total, there are 195 new cases of COVID-19 infection in Singapore today.</span></p></p><p><p><span style=\"font-size: 16px; font-family: Arial;\"><span>4.&nbsp; &nbsp; &nbsp;</span></span><span style=\"font-family: Arial; font-size: 16px;\">We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.</span></p></p> <p><strong style=\"font-family: Arial; font-size: 16px;\">MINISTRY OF HEALTH</strong><br></p><div style=\"padding: 0in 0in 1pt; border-top: none; border-right: none; border-bottom-width: 1pt; border-bottom-style: solid; border-left: none;\"> <p style=\"padding: 0in; border: none;\"><span style=\"font-size: 16px; font-family: Arial;\"><strong>20 JULY 2021</strong></span></p> <p style=\"padding: 0in; border: none;\"><span style=\"font-size: 16px; font-family: Arial;\">&nbsp;</span></p> </div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "182-new-cases-of-locally-transmitted-covid-19-infection_20_July_2021", "CurrentPageUrl": null}, {"Title": "Going Back to Phase 2 Heightened Alert", "PublishedDate": "/Date(1626765900000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "20 Jul 2021", "Summary": "", "MainContent": "In response to growing COVID-19 clusters detected at KTV lounges or nightclubs that had pivoted as Food &amp; Beverage (F&amp;B) establishments, the Multi-Ministry Taskforce (MTF) had earlier announced a tightening of community measures under Phase 3 (Heighted Alert) from <strong>19 July 2021</strong> through <strong>8 August 2021</strong>. Since then, the Ministry of Health (MOH) has uncovered more clusters linked to the Jurong Fishery Port, especially in wet markets and hawker food centres. This is very concerning, as it can affect many people in our community all over the island.<br><br>2. Furthermore, unlike the KTV cluster, which had spread first amongst younger population segments, the current wave of infection affects a wider spectrum of the population including many seniors. At the current rate of transmission, it is likely that infection cases will rise sharply, and many people in the community will catch the virus. While close to 50% of the population have completed their vaccination regimen, there remains a number of vulnerable individuals, such as our seniors, who have yet to take up vaccination. Unvaccinated individuals are at higher risk of being infected, and higher risk of being seriously ill if infected. Hence, in the meantime, we must act decisively to contain the current outbreak and minimise the risk of our hospital capacity being overwhelmed, while we race ahead to vaccinate those who have not completed or started their vaccination. We remain on track to having two-thirds of our population complete the vaccination regimen by National Day, and are aiming for much higher coverage amongst our seniors.<br><br><strong>Update on Local Situation<br></strong><br>3. Within the community, we have several clusters emerging around (i) multiple nightlife establishments, (ii) the Jurong Fishery Port (JFP), and (iii) several wet markets and hawker food centres. We have cast a wide net and are testing widely to ringfence possible emerging transmissions. We have placed all JFP workers under quarantine and have started mass surveillance testing of all stallholders and stall assistants of market and cooked food stalls at markets and hawker centres managed by the National Environment Agency (NEA) or NEA-appointed operators. NEA and Town Councils have also started progressively implementing access control with interim fencing and mandatory SafeEntry check-in at markets where COVID-19 cases have been detected amongst stallholders and stall assistants. Residents living near such markets are advised to minimise their movement and social interactions, and to collect and perform self-testing using antigen rapid test (ART) kits that will be made available at Residents’ Committee Centres near them. Those who are vaccinated but who live with seniors who are unvaccinated should also limit their social interactions and movement, as they may inadvertently bring the virus home and infect the unvaccinated seniors.<br><br>4. Despite these measures, the number of community linked and unlinked cases has continued to escalate. Between 12 July 2021 and 18 July 2021, we detected an average of 46 community cases per day. This is the highest number of cases we have detected since April 2020. The porous nature of wet markets and hawker food centres which serve a range of customers including vulnerable seniors, also increases the risk of undetected cryptic transmission. As we continue to conduct extensive testing for individuals exposed to the risk of infection, we can expect case numbers to increase in the coming days. With the growing number of clusters linked to JFP, the ongoing measures to break the chains of transmission may not be sufficient.<br><br><strong>Reversion to Safe Management Measures for Phase 2 (Heightened Alert)&nbsp;</strong><br><br>5. We will therefore be further tightening community safe management measures by going back to Phase 2 (Heightened Alert)<sup>1</sup>. The following measures will take effect from <strong>22 July 2021</strong> through <strong>18 August 2021 </strong>and will supersede those that were introduced on 19 July 2021. We will do a review of the measures two weeks after implementation, and will adjust further based on the infection situation at that time. Please refer to <a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-a---20-jul-2021.pdf?sfvrsn=8a63c6f1_4\" title=\"Annex A\">Annex A</a>&nbsp;for full details on the updated safe management measures.<br><br><span style=\"text-decoration: underline;\">Permissible Group Sizes</span><br><br>6. Permissible group sizes for social gatherings will be reduced from maximum of 5 persons to <strong><span style=\"text-decoration: underline;\">maximum of 2 persons</span></strong>, together with a cap of 2 distinct visitors per household per day. Individuals should continue to limit their overall number of social gatherings to not more than 2 per day, whether to another household, or meeting with friends and family members in a public place.<br><br>7. To allow families’ current childcare arrangements to continue, grandchildren being cared for daily by their grandparents will not be counted towards the cap of 2 distinct visitors per household, or to the number of social gatherings per day. Grandparents are strongly encouraged to be vaccinated against COVID-19, to protect both themselves and their grandchildren. To reduce the risk of transmission, grandparents should also minimise intermingling between grandchildren from different households.<br><br><span style=\"text-decoration: underline;\">Minimising Workplace Interactions</span><br><br>8. Work-from-home will continue to be the default at workplaces. Employers must ensure that employees who are able to work from home do so. There should continue to be no cross-deployment of workers to multiple worksites. Employers should continue to stagger the start times of employees who need to return to the workplace and implement flexible working hours. Social gatherings at the workplace will not be allowed.<br><br><span style=\"text-decoration: underline;\">Cessation of Mask-Off Activities</span><br><br>9. To reduce the risks of community transmission, both indoor and outdoor dine-in F&amp;B establishments (including hawker centres and food courts) will only be able to offer takeaway and delivery options. Strenuous indoor exercise classes, or strenuous individual and group indoor sports and exercise activities, will also cease. In addition, personalised services which require masks to be removed (e.g. facials, saunas, make-up services), singing, and the playing of instruments that require intentional expulsion of air (e.g. wind or brass instruments) will also not be allowed. These restrictions will not apply to medical and dental consultations that require patients to have their masks removed. Non-medical facial treatments will not be exempted from these restrictions.<br><br>10. Staff who work at settings with unmasked clients/patrons and were placed on mandatory regular Fast and Easy Test (FET) regimes beginning from mid-July, will not be required to conduct FETs during this period if their business operations are suspended. For businesses that continue to remain open (including F&amp;B outlets that stay open for delivery/ takeaways), their staff must continue with the regular 14-day FET requirement. Such regular FET will continue to be made free of charge during this period.<br><br><span style=\"text-decoration: underline;\">Reduction of Activity and Event Sizes and Pre-Event Testing Requirements</span><br><br>11. To minimise the likelihood of large cluster formations, we will scale down event sizes and lower the event size caps. Pre-event testing (PET) remains an essential measure to help ensure that events can proceed safely for attendees.<br><br>a. <span style=\"text-decoration: underline;\">Live performances and MICE</span>. Up to 100 persons may be allowed with PET, and up to 50 persons may be allowed without PET. Unmasking is not allowed for speakers and performers, and there should be no singing or playing of instruments that require intentional expulsion of air (e.g. wind and brass instruments).<br><br>b. <span style=\"text-decoration: underline;\">Spectator and participatory sports events</span>. Up to 100 persons may be allowed for spectator and participatory sports events with PET implemented. PET would not be required if there are 50 persons or less. Further details will be issued by SportSG.<br><br>c. <span style=\"text-decoration: underline;\">Marriage solemnisations and wedding receptions</span>. Marriage solemnisations may continue for up to 100 participants with PET, and 50 participants without PET. We acknowledge that wedding couples have faced significant uncertainties over the past few months. Hence, as a special provision, wedding receptions may be allowed to continue with up to 100 persons with PET for all persons, and with a group size of up to 5 persons per table. This will allow couples to continue with their wedding plans, albeit with some adjustments. All wedding guests must strictly abide by the safe management measures, and in particular maintain social distancing and avoid mingling with others beyond their own table. Given their higher vulnerability, we also strongly discourage unvaccinated individuals from attending such events until they are fully vaccinated.<br><br>d. <span style=\"text-decoration: underline;\">Attractions and shows</span>. The operating capacity of attractions that have received MTI’s prior approval will be reduced to 25% from the current permissible capacity of 50%. Indoor and outdoor shows may proceed with up to 100 persons with PET, and up to 50 persons without PET.<br><br>e. <span style=\"text-decoration: underline;\">Cinemas</span>. Up to 100 persons may be allowed into cinema halls with PET implemented. Only up to 50 persons may be allowed without PET. The prevailing group size of 2 persons applies, and food and beverages may not be sold or consumed in the cinema.<br><br>f. <span style=\"text-decoration: underline;\">Congregational and other worship services</span>. Congregational and other worship services may continue with up to 100 persons with PET, and up to 50 persons may be allowed without PET. To further mitigate the risk of spread through aerosol transmissions, religious workers and all other participants must wear their masks at all times. Live singing and playing of wind or brass instruments will also be suspended during this period.<br><br>g. <span style=\"text-decoration: underline;\">Museums and public libraries</span>. Museums and public libraries will be allowed to operate at a reduced capacity of 25%.<br><br>h. <span style=\"text-decoration: underline;\">Shopping malls and showrooms</span>. The occupancy limits for shopping malls and showrooms will be reduced from the current limit of 10sqm per person of Gross Floor Area, to 16sqm per person.<br><br><strong>Targeted Support Measures</strong><br><br>12. In view of the tightened safe management measures until <strong>18 August 2021</strong>, the Government will provide a support package to affected businesses and workers. The package will take reference from the support provided in the previous Phase Two (Heightened Alert). The Ministry of Finance will announce more details in the next few days.<br><br><strong>Mandatory SafeEntry Check-in at Wet Markets and Hawker Centres Island-wide</strong><br><br>13. Wet markets and hawker centres are places frequently visited by members of the community and are also where many seniors tend to congregate. The potential for transmission is high given the close proximity between individuals or mask-off activities, as evidenced by the recent clusters detected at these settings. There is a need to facilitate quicker contact tracing efforts so that potential transmission at these settings can be curbed. As announced on 18 July 2021, NEA and the Town Councils will be progressively implementing access control with interim fencing and mandatory SafeEntry (SE) check-in at markets where COVID-19 cases have been detected amongst stallholders or stall assistants.<br><br>14. In the coming weeks, we will progressively introduce TraceTogether-only SafeEntry (TT-only SE) and SafeEntry Gateway (SEGW) check-in requirements at all other wet markets and hawker centres island-wide. This means that everyone entering wet markets and hawker centres must check in with their TraceTogether (TT) App or Token using the SEGW, or by scanning the SE QR code with the TT App. We encourage all members of public to comply with SE check-in requirements and to carry their TT Token or keep their TT App active to facilitate contact tracing, and help protect themselves and their loved ones.<br><br><strong>Towards a COVID-19 Resilient Singapore</strong><br><br>15. We have made significant progress in vaccinating the Singapore population and we must not lose our momentum. As Singapore’s vaccination coverage continues to increase, we will re-introduce vaccination differentiated SMMs at an appropriate time. This will allow individuals who have been fully vaccinated under the national vaccination programme to participate in more community and economic activities, and in larger events, while protecting those who are unvaccinated. We urge everyone who is eligible, in particular seniors who are most at risk of developing serious symptoms, to step forward and get vaccinated as soon as possible. We are deploying Mobile Vaccination Teams to estates where there are more unvaccinated seniors. Seniors can also walk into any vaccination centre for their first appointment. We encourage all to register their interest via <a href=\"https://www.vaccine.gov.sg/\" title=\"\" class=\"\" target=\"\">vaccine.gov.sg</a>&nbsp;and book their appointments.<br><br>16. During this period of Phase 2 (Heightened Alert), we seek everyone’s cooperation to observe all safe management measures so that we can lower transmission risks. This can be done with everyone playing their role to minimise their movement and social interactions so that we can reduce footfall at common spaces at or near the workplace and in public places, including public transport. If you are unwell, see a doctor and get tested. It is only together, that we can emerge stronger and safer.<br><br>[1]&nbsp;Prevailing from 16 May 2021 to 13 June 2021.", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "going-back-to-phase-2-heightened-alert", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}