{"pressItemDictionary": {"Press Releases": [{"Title": "Government Enhances Subsidies to Improve Affordability of Cancer Treatment", "PublishedDate": "/Date(1629194400000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "17 Aug 2021", "Summary": "", "MainContent": "<p style=\"margin-top: 0cm; margin-bottom: 0cm; font-size: medium; text-align: justify;\"><span style=\"font-family: Arial;\">&nbsp; &nbsp;The Government has accepted the MediShield Life Council’s recommendations to (a) create a list of clinically proven and cost-effective outpatient cancer drug treatments,&nbsp;(b) allow these cancer drug treatments to be claimable under MediShield Life, and (c) set more granular claim limits to provide better coverage based on the cost of each treatment.&nbsp;The list will cover 90% of existing treatments in the public sector, including some commonly used treatments that do not meet the clinical and cost effectiveness criteria but are grandfathered onto the list.<br><br></span></p><p style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 16px;\">2. &nbsp; &nbsp; These recommendations are in line with the approaches in other developed countries such as the UK, Australia and South Korea. They will support the procurement of cancer drugs at better prices and help to keep MediShield Life premiums sustainable. MediSave withdrawal limits and Integrated Shield Plan (IP) coverage will also be aligned to this framework.<br><br>3. &nbsp; &nbsp; At the same time, the Government will subsidise more cancer drug treatments and&nbsp;extend Medication Assistance Fund (MAF) subsidies to more Singaporeans by raising the eligible income criteria. <br><br>4. &nbsp; &nbsp; The combined effect of these changes is that cancer patients will pay less for clinically proven and cost-effective cancer drug treatments.&nbsp;Close to 90% of subsidised Singaporean patients who use these treatments will have their cancer drug bills fully covered by subsidy and MediShield Life, subject to co-payment which can be paid using MediSave. In comparison, under today’s system, 70% of all subsidised Singaporean patients on cancer drug treatments have their bills fully covered.<br><br>5. &nbsp; &nbsp; There is a small proportion of patients who may find that their current treatment will either no longer be claimable or have the claim limit lowered with no subsidy extended. These changes will therefore be implemented only in September 2022, to allow sufficient time for&nbsp;existing patients&nbsp;to complete their current course of treatment and adjust their treatment plans, where needed, to another treatment that is efficacious, cost-effective and eligible for MediShield Life claims and subsidies. The&nbsp;adjustments to IP coverage will be implemented in April 2023, giving insurers more time to implement the changes required.<br><br><strong>MediShield Life Council’s Recommendations<br></strong><br>6. &nbsp; &nbsp; The MediShield Life Council appointed a Cancer Drug Committee, comprising senior oncologists from the public and private sectors, to review MediShield Life’s coverage of cancer drug treatments&nbsp;to support Singaporeans’ continued access to good and affordable care, amidst rising cancer prevalence and the emergence of higher cost cancer drug therapies. The Government has accepted the recommendations of the Council, which&nbsp;are also in line with the approaches in other&nbsp;developed countries with advanced healthcare systems&nbsp;such as UK, Australia and South Korea.<br><br>7. &nbsp; &nbsp; Currently, patients can claim up to $3,000 per month under MediShield Life for all outpatient cancer drug treatments and related services. This has the unintended effect of raising cancer drug prices to maximise the claims. The Council has therefore recommended that MediShield Life should cover a positive list of clinically proven and cost-effective cancer drug treatments, with more granular claim limits ranging from $200 to $9,600 per month to be better aligned to the different costs of cancer drug treatments. This will support procurement of cancer drugs at better prices, and enable better targeted coverage including higher claims limits where the treatment is clinically appropriate and cost effective. A separate claim limit for outpatient cancer drug services has also been recommended to cover other costs that patients incur, such as scans, blood tests and doctor consultations.<br><br>8. &nbsp; &nbsp; About 90% of the existing cancer drug treatments used in the public sector will be included in the positive list. This may include treatments that are common today but are not registered with the Health Sciences Authority or are not cost-effective. They will be assigned a claim limit similar to their&nbsp;subsidised alternatives, including generics and biosimilars, where available. Patients are strongly encouraged to discuss with their doctors on the use of available clinically proven and cost-effective treatments for their conditions.<br><br>9. &nbsp; &nbsp; The Council’s full report can be found in&nbsp;<a href=\"/docs/librariesprovider5/default-document-library/annex-a12145e9763d74fe587ad80b942d86fdb.pdf?sfvrsn=f1c311a9_0\" title=\"Annex A\">Annex A</a>. The positive list of&nbsp;cancer drug treatments that are claimable under MediShield Life&nbsp;can be found at&nbsp;<a href=\"https://www.moh.gov.sg/home/our-healthcare-system/medishield-life/what-is-medishield-life/what-medishield-life-benefits/outpatient-cancer-drug-list\" title=\"\" class=\"\" target=\"\">here</a>, and will be updated every four months to keep up with medical advancements.[1] <br><br>10. &nbsp; &nbsp; Dr Tan Yew Oo, Chairman of the Cancer Drug Committee and Member of the MediShield Life&nbsp;Councilsaid, “Recent developments in malignant haematology and medical oncology such as the discovery of targetable genes&nbsp;and development of immune checkpoint inhibitors have resulted in a significant increase in the cost of cancer drug treatments. Many patients are prescribed these novel therapies alone or in combination with chemotherapy drugs for some cancer types. In some instances,&nbsp;there is currently insufficient clinical evidence that these drugs are effective in improving overall survival or duration of response. At the same time, we are paying higher prices for many of the cancer drug treatments in Singapore, compared to regional jurisdictions such as South Korea and Australia. The current MediShield Life claim limit of $3,000 per month is quite blunt and does not incentivise drug manufacturers to offer better prices or encourage the use of clinically proven and cost-effective treatments. The Committee has therefore recommended changes to improve the design of the MediShield Life scheme.”<br><br>11. &nbsp; &nbsp; Mrs Fang Ai Lian, Chairman of the MediShield Life Council said, “The Council has been looking at how MediShield Life can better support the Government’s healthcare transformation efforts to ensure quality and sustainable healthcare. This will also help to keep MediShield Life premiums affordable for all Singaporeans.&nbsp;Focusing MediShield Life coverage on clinically proven and cost-effective cancer drug treatments will enable Singapore to negotiate for better drug prices and improve affordability for more patients.The Council recognises the concerns raised by patients during the focus group discussions that the positive list may limit treatment options. To provide greater assurance to patients who are already going through a challenging period, the Council has recommended that existing cancer drug treatments that are commonly used in the public sector be considered for inclusion in the positive list, even if they are not cost-effective.”<br><br><strong>Subsidy Enhancements for all MAF drugs</strong><br><br>12. &nbsp; &nbsp; Subsidised patients in the public healthcare institutions currently receive up to 75% subsidy for drugs under the Standard Drug List (SDL) and MAF[2].&nbsp;Following price negotiations with drug manufacturers to achieve better drug prices and cost-effectiveness, 55 more cancer drugs will be listed under the SDL/MAF, which will increase support for around 150 cancer drug treatments. The new MediShield Life claim limits for cancer drug treatments will be set based on post-subsidy bills.<br><br>13. &nbsp; &nbsp; MAF subsidies will be enhanced with subsidies of up to 50% extended to Singaporeans with per capita household income (PCHI) between $2,800 and $6,500 per month (See&nbsp;<span style=\"text-decoration: underline;\">Table 1</span>), who do not enjoy subsidies today. This subsidy enhancement will improve affordability for eligible patients, and will apply to both cancer and non-cancer drugs listed on MAF.<br></span></p><p align=\"center\"><u>Table 1: Current and Revised Subsidy Framework for MAF</u></p><table border=\"1\" cellspacing=\"0\" cellpadding=\"0\"><tbody><tr><td width=\"288\" rowspan=\"2\" valign=\"top\"><p><strong>Monthly PCHI</strong></p></td><td width=\"312\" colspan=\"2\" valign=\"top\"><p align=\"center\"><strong>Subsidy Tier (Singapore Citizens)</strong></p></td></tr><tr><td width=\"156\" valign=\"top\"><p align=\"center\"><strong>Current</strong></p></td><td width=\"156\" valign=\"top\"><p align=\"center\"><strong>Revised</strong></p></td></tr><tr><td width=\"288\"><p>$0≤PCHI≤$2,000</p></td><td width=\"312\" colspan=\"2\" valign=\"top\"><p align=\"center\">75%</p></td></tr><tr><td width=\"288\"><p>$2,000 &lt; PCHI≤$2,800</p></td><td width=\"312\" colspan=\"2\" valign=\"top\"><p align=\"center\">50%</p></td></tr><tr><td width=\"288\"><p>$2,800 &lt; PCHI≤$3,300</p></td><td width=\"156\" rowspan=\"3\"><p align=\"center\">0%*</p></td><td width=\"156\" valign=\"top\"><p align=\"center\">50%</p></td></tr><tr><td width=\"288\"><p>$3,300 &lt; PCHI≤$6,500</p></td><td width=\"156\" valign=\"top\"><p align=\"center\">40%</p></td></tr><tr><td width=\"288\"><p>PCHI &gt; $6500</p></td><td width=\"156\" valign=\"top\"><p align=\"center\">0%*</p></td></tr></tbody></table><p>* In exceptional deserving cases, MAF may be extended upon appeal.&nbsp;</p><p style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 16px;\"><strong>Adjustments to MediSave Withdrawal Limits&nbsp;<br></strong><br>14. &nbsp; &nbsp; The MediSave withdrawal limits for outpatient chemotherapy and outpatient cancer scans will be adjusted in tandem with the MediShield Life changes (see summary in&nbsp;<span style=\"text-decoration: underline;\">Table 2</span>&nbsp;below).<br></span></p><p align=\"center\"><u>Table 2: Current and Revised MediShield Life and MediSave Limits</u></p><table border=\"1\" cellspacing=\"0\" cellpadding=\"0\" width=\"595\"><tbody><tr><td width=\"101\"><p align=\"center\">&nbsp;</p></td><td width=\"230\"><p align=\"center\"><strong>Current</strong></p></td><td width=\"265\" valign=\"top\"><p align=\"center\"><strong>Revised</strong></p></td></tr><tr><td width=\"101\"><p align=\"center\"><strong>MediShield Life</strong></p></td><td width=\"230\" valign=\"top\"><p>$3,000 per month for all cancer drug treatments and services</p><p align=\"center\">&nbsp;</p></td><td width=\"265\"><p>Ranges from $200 to $9,600 per month for cancer drug treatments on the positive list.</p><p>&nbsp;</p><p>Additional$1,200 per year for cancer drug services.</p><p>&nbsp;</p></td></tr><tr><td width=\"101\"><p align=\"center\"><strong>MediSave</strong></p><p align=\"center\">&nbsp;</p></td><td width=\"230\" valign=\"top\"><p>$1,200 per month for all cancer drug treatmentsand services.</p><p>&nbsp;</p><p>Additional$600 per year for cancer scans^.</p></td><td width=\"265\"><p>$1,200 per month for cancer drug treatments with MediShield Life claim limit above $5,400, and $600 per month for other treatments on the positive list.</p><p>&nbsp;</p><p>Additional $600 per year for cancer drug services and/or other cancer scans^.</p></td></tr></tbody></table><p>^ MediSave can also be used for scans for post-treatment monitoring and radiotherapy patients</p><p style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 16px;\">15. &nbsp; &nbsp; Please refer to&nbsp;<span style=\"text-decoration: underline;\"><a href=\"/docs/librariesprovider5/default-document-library/annex-b880319b554ef4ba881959cd09d6f32b4.pdf?sfvrsn=40ec52a9_0\" title=\"Annex B\">Annex B</a></span>&nbsp;for detailed illustrations on how bills will be affected by the lower cancer drug prices and the changes in subsidy, MediShield Life, and MediSave coverage.<br><br><strong>Integrated Shield Plan (IP) Coverage</strong><br><br>16. &nbsp; &nbsp; Currently, most IPs provide as-charged coverage for outpatient cancer drug treatments, subject to an overall policy year limit. To ensure that IPs are aligned in encouraging the use of clinically proven and cost-effective cancer drug treatments, IPs will be required to only cover treatments that are on the MediShield Life positive list and set claim limits for each cancer drug treatment. <br><br>17. &nbsp; &nbsp; These changes do not affect IP riders, which are paid for fully in cash. These changes will apply to all IPs sold or renewed from April 2023 onwards. Together with the changes to MediShield Life and MediSave, these moves will help contribute to the affordability of cancer drug treatments and sustainability of premiums in the long run.<br><br>18. &nbsp; &nbsp; The Government thanks the MediShield Life Council, as well as the Cancer Drug Committee, for the comprehensive review.<br><br><strong>MINISTRY OF HEALTH&nbsp;<br>17 AUGUST 2021<br><br><br></strong></span></p><div><span style=\"font-family: Arial; font-size: 13px;\">[1]&nbsp;The positive list will be based on recommendations by the MOH Drug Advisory Committee (DAC),&nbsp;supported by the Agency for Care Effectiveness, Singapore’s national Health Technology Assessment agency.</span><div id=\"ftn2\"><p style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 13px;\">[2]&nbsp;Generally, less expensive drugs are listed on the SDL, while more expensive drugs are listed on the MAF where they apply only when prescribed to patients who meet clinical criteria specific to the drug to ensure that their use is cost-effective.&nbsp;</span></p></div></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "government-enhances-subsidies-to-improve-affordability-of-cancer-treatment_17Aug2021", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}, {"Title": "52 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1629129600000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "17 Aug 2021", "Summary": "", "MainContent": "As of 17 August 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 52 new cases of locally transmitted COVID-19 infection. 35 are linked to previous cases, and have already been placed on quarantine. 3 are linked to previous cases and were detected through surveillance. 14 are currently unlinked. Amongst the cases is 1 senior above 70 years who is unvaccinated, and is at risk of serious illness.<br><br>2.&nbsp; &nbsp; &nbsp; In addition, there are 4 imported cases, who have already been placed on Stay-Home Notice (SHN) or isolated upon arrival in Singapore. 3 were detected upon arrival in Singapore, while 1 developed the illness during SHN or isolation.<br><br>3.&nbsp; &nbsp; &nbsp; In total, there are 56 new cases of COVID-19 infection in Singapore today.<br><br>4.&nbsp; &nbsp; &nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "52-new-cases-of-locally-transmitted-covid-19-infection-17aug2021", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}