{"pressItemDictionary": {"Press Releases": [{"Title": "Covid-19 Vaccination Centres Set Up to Support Singapore's Vaccination Programme", "PublishedDate": "/Date(1610526000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "13 Jan 2021", "Summary": "&nbsp;", "MainContent": "<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; To support Singapore’s COVID-19 vaccination efforts, the government is setting up four COVID-19 vaccination centres this month, starting with two – located at Changi Airport Terminal 4 and Raffles City Convention Centre – which have started operations from 13 January 2021. Two more vaccination centres, located at the former Hong Kah Secondary School and Woodlands Galaxy Community Centre, will be ready for operations next week. </p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We expect to set up more vaccination centres over time to support the vaccination efforts. In particular, we are on track to have another four vaccination centres by the end of February. More centres across the island are being planned, and will be rolled out in tandem with the arrival of the vaccine shipments. These centres, together with the polyclinics and selected Public Health Preparedness Clinics, will ensure that every Singaporean and long-term resident in Singapore who is medically eligible can receive their vaccinations conveniently.</p><p>&nbsp;</p><p><strong>VACCINATING OUR HEALTHCARE AND FRONTLINE WORKERS&nbsp; </strong></p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In line with the recommendations by the Expert Committee on COVID-19 Vaccination to prioritise vaccinations of groups that are most at risk, we have started our national vaccination programme with healthcare and frontline workers. </p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Vaccinations have been offered to healthcare workers and staff across all public and private healthcare institutions. Vaccinations are also being rolled out for workers and staff in the community care sector.&nbsp; </p><p>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We have started vaccinating our frontline workers including those at our border entry points, i.e. our airports and sea ports, as well as those involved in the COVID-19 response, such as swabbers and those working in the quarantine and community care facilities. These individuals face considerable risks in being exposed during the course of their duty. We should therefore protect them as they are critical in our national efforts to prevent and contain the spread of COVID-19 in Singapore.</p><p>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; As of 12 January 2021, more than 6,200 individuals have received their first dose of the vaccine. These numbers are expected to rise substantially in the coming weeks as we continue to ramp up our vaccination operations. On 12 January alone, we vaccinated close to 2,800 individuals, including around 2,500 healthcare workers.</p><p>&nbsp;</p><p><strong>VACCINATING OUR SENIORS </strong></p><p>7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We will commence vaccination of our seniors later this month.&nbsp; Letters will be progressively sent to seniors to invite them to book an appointment for their vaccination.</p><p>8.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Residents and clients in the community care sector will also progressively be vaccinated. Nursing homes have begun engaging their residents and their next-of-kin on the vaccinations. We will work with the community care providers to encourage all medically-eligible residents and clients to be vaccinated.</p><p>9.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; More details on the vaccination for seniors will be provided later.</p><p>&nbsp;</p><p><strong>ENCOURAGING HIGHER VACCINATION TAKE-UP</strong></p><p>10.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We are making provision for all Singaporeans and long-term residents in Singapore to be able to get vaccinated by the third quarter of this year, if there are no unforeseen disruptions to vaccine shipments. Vaccination will be progressively rolled out, and we seek everyone’s patience and support as we work to first protect those who are most at risk or most vulnerable.</p><p>11.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; A high level of vaccination coverage will maximise protection for the population, and minimise the proportion of persons still susceptible to COVID-19. This will in turn reduce the risk of large outbreaks, continue to keep community cases low, and allow us to further re-open the economy and resume normal social activities. Thus, we encourage Singaporeans and long-term residents to come forward for vaccination when their turn comes, so that as a society, we can keep each other safe from the disease.</p><p>12.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Even as we progressively vaccinate our population, we must keep in mind that vaccination is not a silver bullet. We must continue to adhere to the safe management measures to help us mitigate the spread and keep community transmission low.&nbsp; </p><p>&nbsp;&nbsp;</p><p><strong>MINISTRY OF HEALTH<br>13 JANUARY 2021</strong></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "covid-19-vaccination-centres-set-up-to-support-singapore's-vaccination-programme", "CurrentPageUrl": null}, {"Title": "1 New Case of Locally Transmitted Covid-19 Infection ", "PublishedDate": "/Date(1610523000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "13 Jan 2021", "Summary": "", "MainContent": "<span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;As of 13 January 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 1 new case of locally transmitted COVID-19 infection. Based on our investigations so far, the case resides in a dormitory and there is none in the community.&nbsp;<br><br>2.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; In addition, there are 37 imported cases, who had already been placed on Stay-Home Notice or isolated upon arrival in Singapore. In total, there are 38 new cases of COVID-19 infection in Singapore today.<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;<br><br></span><div><span style=\"font-size: 16px;\"><strong>MINISTRY OF HEALTH<br>13 JANUARY 2021</strong><br></span><div><span style=\"font-size: 16px;\"><br></span></div><span style=\"font-size: 16px;\"><br></span></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "1-new-case-of-locally-transmitted-covid-19-infection-13-jan", "CurrentPageUrl": null}, {"Title": "Termination of Jesselton Dental Centre From Chas", "PublishedDate": "/Date(1610521200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "13 Jan 2021", "Summary": "", "MainContent": "<p style=\"text-align: justify;\"><span style=\"font-family: Arial;\"><span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;The Ministry of Health (MOH) has, on 10 December 2020, served a notice of intended termination on Resilient Healthcare Group Pte Ltd, for the intended termination of Jesselton Dental Centre<sup>1</sup>&nbsp;from the Community Health Assist Scheme (CHAS). The termination will take effect from 16 January 2021.<br><br>2.&nbsp; &nbsp; &nbsp; Audits on Jesselton Dental Centre conducted in late 2018 to 2019 revealed severe non-compliances, including numerous improper claims for CHAS subsidies with no proper supporting documentation and claims that exceeded the allowed limit.&nbsp; &nbsp;<br><br>3.&nbsp; &nbsp; &nbsp; MOH was informed on 27 April 2020 that the ownership and licensee of Jesselton Dental Centre had been transferred from Resilient Healthcare Group Pte Ltd to Alliance Management Group Pte Ltd. This cessation of Resilient Healthcare Group Pte Ltd as the licensee, coupled with the extent of Jesselton Dental Centre’s non-compliance, made the termination of the clinic from CHAS necessary. MOH will continue to investigate the clinic even with the change in ownership.<br><br>4.&nbsp; &nbsp; &nbsp;The termination from CHAS means that Jesselton Dental Centre will no longer be allowed to make claims for CHAS subsidies on behalf of its patients. Affected patients may wish to visit other nearby CHAS accredited dental clinics instead. Jesselton Dental Centre, which is now under the new ownership of Alliance Management Group Pte Ltd, will however be allowed to continue treating patients as long as its dentists hold valid registration and practising certificates from the Singapore Dental Council. We have received a new application for CHAS accreditation from Alliance Management Group Pte Ltd and will assess the application accordingly.&nbsp;<br><br>5.&nbsp; &nbsp; &nbsp;MOH encourages patients to actively engage their doctors and dentists if they have any queries on their bills. CHAS, Pioneer Generation and Merdeka Generation cardholders who wish to check on claims for CHAS subsidies made on their behalf, may do so by logging into the “MY CHAS” module on the CHAS website (www.chas.sg) or by calling the CHAS hotline (1800-275-2427).&nbsp;&nbsp;<br><br>6.&nbsp; &nbsp; &nbsp;If they come across any suspicious or unusual claims for CHAS subsidies made on their behalf, they may contact MOH at 1800-225-4122 or send their feedback to MOH_QSM@moh.gov.sg. MOH also reminds healthcare professionals to uphold a high standard of professionalism and to adhere to their Ethical Code and Ethical Guidelines.&nbsp;<br><br>7.&nbsp; &nbsp; &nbsp;MOH takes a serious view of such errant practices and will not hesitate to take enforcement actions where required, including referral of the errant healthcare professionals to their respective professional boards.&nbsp;<br><br></span></span><strong><span style=\"font-size: 16px;\"><span style=\"font-family: Arial; font-size: 16px;\">MINISTRY OF HEALTH<br>13 JANUARY 2021</span><br></span><span style=\"font-size: 16px;\"><br></span></strong></p><hr><p style=\"text-align: justify;\"><strong><span style=\"font-size: 16px;\">&nbsp;</span><br></strong><sup>1&nbsp;</sup>9 Scotts Road, #06-05 Pacific Plaza, Singapore 228210</p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "termination-of-jesselton-dental-centre-from-chas", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}