{"pressItemDictionary": {"Press Releases": [{"Title": "22 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1621784280000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "23 May 2021", "Summary": "", "MainContent": "<p>1.&nbsp; &nbsp; &nbsp;As of 23 May 2021, 12pm, the Ministry of Health (MOH) has confirmed and verified that there are 22 new cases of locally transmitted COVID-19 infection. 19&nbsp;are linked to previous cases, amongst which 12 have already been placed on quarantine, and 7 were detected through surveillance. The remaining 3 are currently unlinked.&nbsp;21 are in the community, and 1 resides in a dormitory. There are 3 imported cases, who had already been placed on Stay-Home Notice (SHN) upon arrival in Singapore. Amongst the new cases today, 10 are asymptomatic, and were detected from our proactive screening and surveillance, while 15 were symptomatic.</p> <p><strong>Summary of new cases</strong></p> <table border=\"1\" cellspacing=\"0\" cellpadding=\"0\" width=\"605\"> <tbody><tr> <td width=\"129\"> <p align=\"right\">&nbsp;</p> </td> <td width=\"60\"> <p>&nbsp;</p> </td> <td width=\"16\" valign=\"top\"> <p>&nbsp;</p> </td> <td width=\"192\" colspan=\"2\"> <p align=\"center\"><strong>Breakdown by</strong></p> </td> <td width=\"16\" valign=\"top\"> <p>&nbsp;</p> </td> <td width=\"192\" colspan=\"2\"> <p align=\"center\"><strong>Breakdown by</strong></p> </td> </tr> <tr> <td width=\"129\"> <p align=\"right\">&nbsp;</p> </td> <td width=\"60\"> <p><strong>Number of cases</strong></p> </td> <td width=\"16\" valign=\"top\"> <p>&nbsp;</p> </td> <td width=\"96\"> <p><strong>Already in quarantine/ isolation before detection</strong></p> </td> <td width=\"96\"> <p><strong>Detected from surveillance</strong></p> </td> <td width=\"16\" valign=\"top\"> <p>&nbsp;</p> </td> <td width=\"96\"> <p><strong>Symptomatic</strong></p> </td> <td width=\"96\"> <p><strong>Asymptomatic</strong></p> </td> </tr> <tr> <td width=\"129\"> <p><strong>Cases in the community</strong></p> </td> <td width=\"60\"> <p align=\"center\">21</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">12</p> </td> <td width=\"96\"> <p align=\"center\">9</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">15</p> </td> <td width=\"96\"> <p align=\"center\">6</p> </td> </tr> <tr> <td width=\"129\"> <p><strong>Cases residing in dormitories</strong></p> </td> <td width=\"60\"> <p align=\"center\">1</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">0</p> </td> <td width=\"96\"> <p align=\"center\">1</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">0</p> </td> <td width=\"96\"> <p align=\"center\">1</p> </td> </tr> <tr> <td width=\"129\"> <p><strong>Imported cases</strong></p> </td> <td width=\"60\"> <p align=\"center\">3</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">3</p> </td> <td width=\"96\"> <p align=\"center\">0</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">0</p> </td> <td width=\"96\"> <p align=\"center\">3</p> </td> </tr> <tr> <td width=\"129\"> <p><strong>Total</strong></p> </td> <td width=\"60\"> <p align=\"center\">25</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">&nbsp;</p> </td> </tr> </tbody></table> <p align=\"right\">&nbsp;</p> <p>2.&nbsp; &nbsp; &nbsp;Overall, the number of new cases in the community has increased from 131 cases in the week before to 182 cases in the past week. The number of unlinked cases in the community has also increased from 30 cases in the week before to 46 cases in the past week.&nbsp;We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.</p><p>3.&nbsp; &nbsp; &nbsp;Amongst the 239 confirmed cases reported from 17 May to 23 May, 52 cases have tested positive for their serology tests, 150 have tested negative, and 37 serology test results are pending.</p><p><p><strong>Case Details</strong><br></p><p><strong>a) Cases in the community: 21</strong></p></p><p>There are 21 cases in the community today, of whom 19 are linked to previous cases and 2 are currently unlinked.<br></p><p><p><strong>Currently unlinked cases</strong><br></p><p>Detected through surveillance:<br></p><p><u>Case 63609</u> is a 60 year-old female Singaporean who is a homemaker. She is asymptomatic, and was detected when she was tested for COVID-19 on 21 May as part of our testing operations for residents of 506 Hougang Avenue 8. Her test result came back positive for COVID-19 infection on 22 May. Her serology test result is pending. Case 63609 received her first dose of COVID-19 vaccine on 29 March and the second dose on 19 April.<br></p><p><u>Case 63623</u> is a 74 year-old female Singaporean who is a homemaker. She developed body aches, vomiting and chills on 19 May, and sought medical treatment at a General Practitioner (GP) clinic on the same day, but was not tested for COVID-19 as she did not report any acute respiratory infection (ARI) symptoms. Her condition worsened on 22 May, and she was conveyed to Ng Teng Fong General Hospital where she was tested for COVID-19. Her test result came back positive for COVID-19 infection on the same day. Her serology test result is pending. Case 63623 received her first dose of COVID-19 vaccine on 20 April and the second dose on 11 May.<br></p><p><strong>Changi Airport Terminal 3 cluster</strong><br></p><p>Already quarantined:<br></p><p><u>Case 63605</u> is a 7 year-old male Singaporean who is a student at St Stephen’s School and was last in school on 7 May. He is a family member of Cases 63139[1] and 63447[2].&nbsp;<a href=\"file:///C:/Users/Yap%20Wei%20Qiang/Desktop/Wei%20Qiang/COVID-19/Press%20Release%20-%2022%20New%20Cases%20of%20Locally%20Transmitted%20COVID-19%20Infection%20(23%20May%202021).docx#_ftn2\" name=\"_ftnref2\" title=\"\">&nbsp;</a>As he had been identified as a close contact of Case 63139, he was placed on quarantine on 12 May. He was tested for COVID-19 on 14 May during quarantine and his test result was negative for COVID-19 infection. He developed a fever on 21 May and was tested for COVID-19 again. His test result came back positive for COVID-19 infection on 22 May. His serology test result is pending.<br></p><p><u>Case 63615</u> is a 45 year-old male Philippines national who is an engineer at STMicroelectronics Pte Ltd, and was last at work on 8 May. As he had been identified as a close contact of Case 63055[3], he was placed on quarantine on 10 May. He was tested for COVID-19 on 12 May during quarantine and his test result was negative for COVID-19 infection. He developed anosmia on 20 May but did not report his symptom. He was tested for COVID-19 again on 21 May during quarantine and his test result came back positive for COVID-19 infection the next day. His serology test result is pending.<br></p><p><u>Case 63616</u> is a 67 year-old female Singaporean who is employed by Hong Ye Group Pte Ltd as a cleaner at Changi Business Park. She is a family member of Cases 63382[4] and&nbsp;63458[5], and&nbsp;was placed on quarantine on 17 May. She was tested for COVID-19 on 19 May during quarantine and her test result came back positive for COVID-19 infection on 22 May. That night, she developed a fever. Her serology test result is negative.<br></p><p><strong>JEM/ Westgate cluster</strong><br></p><p>Detected through surveillance:<br></p><p><u>Case 63597</u> is a 39 year-old female Malaysia national who is employed by Eng Leng Contractors Pte Ltd as a cleaner at Westgate shopping mall. She is asymptomatic, and was detected when she was tested for COVID-19 on 21 May as part of our testing operations for those who worked in or visited JEM and Westgate. Her test result came back positive for COVID-19 infection on 22 May. She has tested preliminarily positive for the B.1.617 variant, and is pending further confirmatory tests. Her serology test result is pending.<br></p><p><u>Case 63600</u> is a 59 year-old male Singaporean who works as a music teacher at Yamaha Music School. He developed a fever on 16 May but did not seek medical treatment until 21 May when he went to a GP clinic, and was tested for COVID-19. His antigen rapid test (ART) came back positive on the same day, and he was immediately isolated. A polymerase chain reaction (PCR) test administered on the same day came back positive for COVID-19 infection. His serology test result is negative.<br></p><p><u>Case 63606</u> is a 31 year-old male India national who works as a delivery truck driver at YHI Corporation Pte Ltd. He is asymptomatic, and was detected when he was tested for COVID-19 on 21 May as part of our testing operations for those who worked in or visited JEM and Westgate. His test result came back positive for COVID-19 infection on 22 May. His serology test result is pending.<br></p><p><u>Case 63607</u> is a 44 year-old male India national who works at BlackRock Advisors Singapore Pte Ltd. He is asymptomatic, and was detected when he was tested for COVID-19 on 21 May as part of our testing operations for those who worked in or visited JEM and Westgate. His test result came back positive for COVID-19 infection on 22 May. He has tested preliminarily positive for the B.1.617 variant, and is pending further confirmatory tests. His serology test result is pending.<br></p><p><strong>Marina Bay Sands Casino dealer cluster</strong><br></p><p>Detected through surveillance:<br></p><p><u>Case 63610</u> is a 32 year-old female Singapore Permanent Resident who works as a hairdresser at 98 Hair House Pte Ltd, and was last at work on 17 May. She developed a fever, cough and sore throat on 19 May, and sought medical treatment at a GP clinic on the same day, where she was tested for COVID-19. Her test result came back positive for COVID-19 infection on 22 May. Her serology test result is pending.<br></p><p><strong>McDonald’s delivery riders cluster</strong><br></p><p>Detected through surveillance:<br></p><p><u>Case </u><u>63603</u> is a 31 year-old male China national who works as a delivery rider for McDonald’s (Pasir Ris Elias Community Club). He is a workplace contact of Cases 63535[6] and&nbsp;63569[7], and&nbsp;was placed on Leave of Absence by his employer on 20 May. He was tested for COVID-19 on 21 May, and was placed on quarantine on the same day. He developed chills that night but did not report his symptom. On 22 May, he developed a cough and fatigue. His test result came back positive for COVID-19 infection on 22 May. His serology test result is negative.<br></p><p><u>Case </u><u>63624</u> is a 27 year-old male Malaysia national who works as a delivery rider for McDonald’s (Pasir Ris Elias Community Club). He is a workplace contact of Cases 63535 and 63569. He developed a headache and fatigue on 18 May. He was placed on Leave of Absence by his employer on 21 May and tested for COVID-19 on the same day. He was placed on quarantine on 21 May, but did not report his symptoms. He developed a cough on 22 May, and his test result came back positive for COVID-19 infection ton the same day. His serology test result is pending.<br></p><p><strong>Sms Infocomm cluster</strong><br></p><p>Already quarantined:<br></p><p><u>Case 63620</u> is a 27 year-old female Singaporean who works in an administrative role at St Luke’s Hospital, and was last at work on 12 May.&nbsp; She is a family member and household contact of Case 63462[8], and&nbsp;was placed on quarantine on 19 May. She developed a fever, sore throat, blocked nose and anosmia on 20 May, and was tested for COVID-19 on 21 May during quarantine. Her test result came back positive for COVID-19 infection on 22 May. Her serology test result is negative for the N antigen, which suggests the presence of early infection. Case 63620 received her first dose of COVID-19 vaccine on 29 January and the second dose on 25 February.<br></p><p><strong>Tan Tock Seng Hospital Ward 9D cluster</strong><br></p><p>Already quarantined:<br></p><p><u>Case </u><u>63617</u> is a 78 year-old female Singaporean who is a homemaker. She is a family member and household contact of Case 63007[9], and&nbsp;was placed on quarantine on 8 May. She was tested for COVID-19 on 9 May and her test result came back negative on the same day. She was tested again on 21 May even though she is asymptomatic and her test result came back positive for COVID-19 infection on 22 May. Her serology test result is negative.<br></p><p><strong>Case 63236 cluster[10]</strong><br></p><p>Already quarantined:<br></p><p><u>Case </u><u>63621</u> is a 4 year-old female Singaporean who is a student at Heart Field Kindergarten. As she had been identified as a close contact of Case 63236, she was placed on quarantine on 14 May. She developed a fever on 19 May but her symptom was not reported to MOH. She was detected when she was tested on 21 May during quarantine. Her test result came back positive for COVID-19 infection on 22 May. Her serology test result is pending.<br></p><p><strong>Case 63304 cluster[11]</strong><br></p><p>Already quarantined:<br></p><p><u>Case 63598</u> is a 41 year-old male Singaporean who works as a manager at Sure Clean Pte Ltd, and was last at work on 12 May. He is a family member and household contact of Case 63304, and was placed on quarantine on 16 May. He developed a fever and cough on 21 May, and was tested for COVID-19 when he reported his symptoms. His test result came back positive for COVID-19 infection on 22 May. His serology test result is negative.<br></p><p><strong>Case 63392 cluster[12]</strong><br></p><p>Already quarantined:<br></p><p><u>Case 63601</u> is a 48 year-old male Singaporean who is self-employed and works from home. He developed a cough on 14 May and sought treatment at a GP clinic, where he tested negative for COVID-19. As he had been identified as a family member and household contact of Case 63392, he was placed on quarantine on 17 May. He was tested for COVID-19 on 22 May during quarantine, and his test result came back positive for COVID-19 infection on the same day. His serology test result has come back positive but we have assessed that this is likely a current infection.<br></p><p><strong>Case 63479 cluster[13]</strong><br></p><p>Already quarantined:<br></p><p><u>Case </u><u>63627</u> is a 38 year-old male Myanmar national who works as an engineer at Asia Medical Enviro Services Pte Ltd and had last gone to work on 19 May. As he had been identified as a household contact of Case 63479, he was placed on quarantine on 19 May. He underwent both an ART and PCR test on 22 May, and both test results came back positive on the same day. He developed a runny nose on 22 May. His serology test result is pending. Case 63627 received his first dose of COVID-19 vaccine on 4 February and the second dose on 25 February.&nbsp;&nbsp;<br></p><p><strong>Other linked cases</strong><br></p><p>Already quarantined:<br></p><p><u>Case </u><u>63612</u> is a 29 year-old female Indonesia national who is a foreign domestic worker. She is a close contact of Case 63515[14], and was placed on quarantine on 20 May. She developed a fever and headache on 21 May evening, and reported her symptoms to MOH. She was tested for COVID-19 on 22 May during quarantine, and her test result came back positive for COVID-19 infection on the same day. Her serology test result is negative.<br></p><p><u>Case 63618</u> is an 84 year-old female Singaporean who is a homemaker. She is a family member and close contact of Case 63466[15], and&nbsp;was placed on quarantine on 19 May. She is asymptomatic and was detected when she was tested for COVID-19 on 21 May during quarantine. Her test result came back positive for COVID-19 infection on 22 May. Her serology test result is positive. Case 63618 received her first dose of COVID-19 vaccine on 6 March and the second dose on 27 March.<br></p><p><u>Case 63619</u> is a 52 year-old male Singaporean who works as a delivery driver at RichLand Logistics Services Pte Ltd. He is a family member and household contact of Case 63443[16], and&nbsp;was placed on quarantine on 18 May. He was tested for COVID-19 on 21 May during quarantine, and developed a cough on the same day. His test result came back positive for COVID-19 infection on 22 May. His serology test result is negative for the N antigen, which suggests the presence of early infection. Case 63619 received his first dose of COVID-19 vaccine on 9 May.<br></p><p><strong>b) Cases residing in dormitories: 1</strong><br></p><p>There is 1 case residing in a dormitory today who is currently unlinked.<br></p><p><u>Case 63622</u> is a 46 year-old male Malaysia national who works as a construction worker at H&amp;W Communications Pte Ltd. He resides at Harvest @ Woodlands (280 Woodlands Industrial Park E5). He is asymptomatic, and was detected when he was tested on 22 May as part of Rostered Routine Testing (RRT). His test result came back positive for COVID-19 on the same day and he was immediately isolated. His earlier tests from RRT – the last being on 8 May – were negative for COVID-19 infection. His serology test result is negative.<br></p><p><strong>c) Imported cases: 3</strong></p><p>Amongst the 3 imported cases,<br></p><ul><li>2 (Cases 63596 and 63604) are Singapore Permanent Residents who returned from India.</li><li>1 (Case 63628) is a Work Permit holder who arrived from Malaysia.</li></ul><p>They had all already been placed on SHN upon arrival in Singapore and were tested while serving SHN.</p><p>4.&nbsp; &nbsp; &nbsp;Please refer to the <a href=\"/docs/librariesprovider5/default-document-library/annexes9584cc7a87604891b08444a339e3771e.pdf?sfvrsn=56e484f5_0\" title=\"Annexes\">Annexes</a>&nbsp;and MOH’s daily Situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\">www.moh.gov.sg/covid-19/situation-report</a>) for details.</p><p>5.&nbsp; &nbsp; &nbsp;Epidemiological investigations are in progress. In the meantime, all the identified close contacts of the cases have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for the close contacts to determine if the cases could have been infected by them.</p><p><strong>Update on condition of confirmed cases</strong></p><p>6.&nbsp; &nbsp; &nbsp;17 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 61,294 have fully recovered from the infection and have been discharged from hospitals or community care facilities.<br><br>7.&nbsp; &nbsp; &nbsp;There are currently 242 confirmed cases who are still in hospital. Of these, most are stable or improving, and 3 are in critical condition in the intensive care unit. 256 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 32 have passed away from complications due to COVID-19 infection.</p></p><p><strong>MINISTRY OF HEALTH</strong><br></p><div> <p><strong>23 MAY 2021</strong></p> </div> <div><br clear=\"all\"> <hr align=\"left\" size=\"1\" width=\"33%\"> <div id=\"ftn1\"> <p>[1] Case 63139 is a 44 year-old female Singaporean who is a homemaker who visited Changi Airport Terminal 3 on numerous occasions. She was confirmed to have COVID-19 infection on 12 May.</p> </div> <div id=\"ftn2\"> <p>[2] Case 63447 is an 11 year-old male Singaporean who is a student at St Stephen’s School. He was confirmed to have COVID-19 infection on 18 May.</p> </div> <div id=\"ftn3\"> <p>[3] Case 63055 is a 59 year-old male Singaporean who is employed by Certis Cisco as an aviation security officer at Changi Airport Terminal 3. He was confirmed to have COVID-19 infection on 10 May.</p> </div> <div id=\"ftn4\"> <p>[4] Case 63382 is a 95 year-old female Singaporean who is a retiree. She was confirmed to have COVID-19 infection on 17 May.</p> </div> <div id=\"ftn5\"> <p>[5] Case 63458 is a 62 year-old male Singaporean who works at as an attendant at Changi Airport Terminal 3. He was confirmed to have COVID-19 infection on 19 May.</p> </div> <div id=\"ftn6\"> <p>[6] Case 63535 is a 27 year-old male Malaysia national who works as a delivery rider for IVIC Logistic Pte Ltd and McDonald’s (Pasir Ris Elias Community Club). He was confirmed to have COVID-19 infection on 20 May.</p> </div> <div id=\"ftn7\"> <p>[7] Case 63569 is a 24 year-old male Malaysia national who works as a delivery rider for IVIC Logistic Pte Ltd and McDonald’s (Pasir Ris Elias Community Club), and is a household contact of Cases 63534 and 63535. He was confirmed to have COVID-19 infection on 21 May.</p> </div> <div id=\"ftn8\"> <p>[8] Case 63462 is a 49 year-old female Singaporean who works as a factory operator at Sms Infocomm (Singapore) Pte Ltd, and a close contact of Case 63273. She was confirmed to have COVID-19 infection on 19 May.</p> </div> <div id=\"ftn9\"> <p>[9] Case 63007 is a 52 year-old male Singaporean who had been warded in Tan Tock Seng Hospital Ward 9D. He was confirmed to have COVID-19 infection on 8 May.</p> </div> <div id=\"ftn10\"> <p>[10] Case 63236 is a 53 year-old male Singaporean who works as a personal chauffeur. He was confirmed to have COVID-19 infection on 14 May.</p> </div> <div id=\"ftn11\"> <p>[11] Case 63304 is a 35 year-old female Portugal national who works as a sales personnel at Sanofi-Aventis. She was confirmed to have COVID-19 infection on 15 May.</p> </div> <div id=\"ftn12\"> <p>[12] Case 63392 is a 39 year-old female Singaporean who is a manager at Corner Stone Global Partners Pte Ltd. She was confirmed to have COVID-19 infection on 17 May.</p> </div> <div id=\"ftn13\"> <p>[13] Case 63479 is a 49 year-old female Singapore Permanent Resident who is a homemaker. She was confirmed to have COVID-19 infection on 19 May.</p> </div> <div id=\"ftn14\"> <p>[14] Case 63515 is a 34 year-old male Singaporean who works as a technician at Singapore Refining Company Pte Ltd. He was confirmed to have COVID-19 infection on 20 May.</p> </div> <div id=\"ftn15\"> <p>[15] Case 63466 is a 59 year-old female Singaporean who works at Mary Fashion and Trading. She was confirmed to have COVID-19 infection on 19 May.</p> </div> <div id=\"ftn16\"> <p>[16] Case 63443 is a 24 year-old female Singaporean who works as a basic care assistant at Alexandra Hospital. She was confirmed to have COVID-19 infection on 18 May.</p> </div> </div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "22-new-cases-of-locally-transmitted-covid-19-infection_23_May_2021", "CurrentPageUrl": null}, {"Title": "22 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1621757700000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "23 May 2021", "Summary": "", "MainContent": "<p><span style=\"font-size: 16px; font-family: Arial;\">1.&nbsp; &nbsp; &nbsp;As of 23 May 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 22 new cases of locally transmitted COVID-19 infection.&nbsp;19 are linked to previous cases, amongst which 12 have already been placed on quarantine. The remaining 3 are currently unlinked. Based on our investigations so far, 21 are in the community, and 1 resides in a dormitory.</span></p> <p><span style=\"font-size: 16px; font-family: Arial;\">2.&nbsp; &nbsp; &nbsp;In addition, there are 3 imported cases, who have already been placed on Stay-Home Notice upon arrival in Singapore. Of these, 2 are returning Singaporeans or Singapore Permanent Residents.</span></p><p><p><span style=\"font-size: 16px; font-family: Arial;\">3.&nbsp; &nbsp; &nbsp;In total, there are 25 new cases of COVID-19 infection in Singapore today.</span></p></p><p><p><span style=\"font-size: 16px; font-family: Arial;\">4.&nbsp; &nbsp; &nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.</span></p></p> <p><span style=\"font-size: 16px; font-family: Arial;\"><strong>MINISTRY OF HEALTH</strong><br></span></p><div> <p><span style=\"font-size: 16px; font-family: Arial;\"><strong>23 MAY 2021</strong></span></p> </div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "22-new-cases-of-locally-transmitted-covid-19-infection_23May2021", "CurrentPageUrl": null}, {"Title": "Joint Statement by MOH and Mnd On Testing Operations ", "PublishedDate": "/Date(1621742400000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "23 May 2021", "Summary": "", "MainContent": "<div class=\"page\" title=\"Page 1\"><div class=\"layoutArea\"><div class=\"column\"><p><span style=\"font-size: 12pt; font-family: Arial;\">&nbsp; &nbsp; &nbsp; &nbsp; The Ministry of Health (MOH) will be conducting polymerase chain reaction (PCR) testing at the housing blocks as stated below. These are blocks where infected cases have been located, and testing is done as a precaution to prevent any possible spread in the community. In the event that a positive case is detected, MOH will isolate the case, identify all close contacts, test and quarantine them to protect the community from further transmission. We will also report updates on any positive cases in our daily press releases.<br><br>2. &nbsp; &nbsp; &nbsp;</span><span style=\"font-size: 12pt; font-family: Arial;\">So far, there is only one Housing &amp; Development Board (HDB) block in Singapore with infected cases seen in more than two households. The tests are typically completed within 3 days.</span></p><p><span style=\"font-size: 12pt; font-weight: 700; font-family: Arial;\">BLOCK 506 HOUGANG AVENUE 8</span></p><p><span style=\"font-size: 12pt; font-family: Arial;\">3. &nbsp; &nbsp; &nbsp;MOH had identified 10 COVID-19 cases[1]</span><span style=\"font-size: 12pt; font-family: Arial;\">, from four different households, residing at 506 Hougang Avenue 8. They are largely Persons Under Quarantine who turned positive for COVID-19. This means that they have been isolated early and ring- fenced, and not likely to be moving around while being infectious. Nevertheless, MOH took all the necessary public health measures to prevent any further spread to the community.</span></p><p><span style=\"font-size: 12pt; font-family: Arial;\">4. &nbsp; &nbsp; &nbsp;We have established that four of the units with confirmed cases are in the same stack, and our initial assessment is that airborne transmission along the stack is highly unlikely. Epidemiological investigations are ongoing to determine linkages and the source of transmission.<br><br></span><span style=\"font-size: 12pt; font-family: Arial;\">5. &nbsp; &nbsp; &nbsp;We are therefore not taking any chances. The National Environment Agency (NEA) has worked with the town council (TC) to carry out stepped up cleaning measures to clean and disinfect the block. At the same time, we are casting our surveillance net as wide as possible, including administering PCR tests for the whole block.<br><br></span><span style=\"font-size: 12pt; font-family: Arial;\">6. &nbsp; &nbsp; &nbsp;MOH has just concluded mandatory PCR tests for 407 residents and visitors of the block. This was done from 21 to 22 May 2021. Thus far, one individual was found to be positive for COVID-19 with 126 more test results pending. More details on the positive case will be reported in upcoming press releases by MOH.<br><br></span><span style=\"font-size: 12pt; font-family: Arial;\">7. &nbsp; &nbsp; &nbsp;Those who are still awaiting their test results are advised to stay at home and seek immediate medical attention if they feel unwell. Individuals who missed their test can proceed to any of the clinics in the <a href=\"/docs/librariesprovider5/default-document-library/annex1a538c2f0424471ba54e414771906675.pdf?sfvrsn=5f77cb41_0\" title=\"Annex\">Annex</a>&nbsp;between 23 and 24 May 2021 for the mandatory free swab test. They are to bring along their NRIC and TraceTogether Tokens, for identification purposes.<br><br></span><span style=\"font-size: 12pt; font-weight: 700; font-family: Arial;\">BLOCK 559 PASIR RIS STREET 51<br><br></span><span style=\"font-size: 12pt; font-family: Arial;\">8. &nbsp; &nbsp; &nbsp;Adopting the same cautious approach, MOH will be conducting mandatory PCR tests on 23 May and 24 May 2021 for all 243 residents of Block 559 Pasir Ris Street 51, as four COVID-19 cases[2]</span><span style=\"font-size: 8pt; font-family: Arial;\">&nbsp;</span><span style=\"font-size: 12pt; font-family: Arial;\">have been detected in two different households living in the block.<br><br></span><span style=\"font-size: 12pt; font-family: Arial;\">9. &nbsp; &nbsp; &nbsp;Residents are advised to go to Coral Regional Screening Centre (Former Coral Primary School) between 23 May to 24 May, 9 am to 12 noon, and 1pm to 4 pm for their tests.<br><br></span><span style=\"font-size: 12pt; font-family: Arial;\">10. &nbsp; &nbsp; &nbsp;Residents can call MOH at 1800-333-9999 if they have queries.</span></p></div></div></div><div class=\"page\" title=\"Page 2\"><div class=\"layoutArea\"><div class=\"column\"><p><span style=\"font-size: 12pt; font-weight: 700; font-family: Arial;\">STEPPED UP MEASURES BY HDB and NEA<br><br></span><span style=\"font-size: 12pt; font-family: Arial;\">11. &nbsp; &nbsp; &nbsp;The HDB worked with MOH to contact residents living in the affected block to take the PCR test. HDB also deployed safe distancing ambassadors to ensure that safe management measures are in place in the swab ops centre set up at the void deck of the block.<br><br></span><span style=\"font-size: 12pt; font-family: Arial;\">12. &nbsp; &nbsp; &nbsp;Officers from NEA were deployed to closely monitor the cleaning and disinfection works carried out at Block 506 Hougang Avenue 8 and Block 559 Pasir Ris Street 51 by the TCs and their cleaning contractors, to ensure that they were&nbsp;</span><span style=\"font-size: 12pt; font-family: Arial;\">performed in accordance with NEA’s guidelines. Cleaning and disinfection works for&nbsp;</span><span style=\"font-size: 12pt; font-family: Arial;\">Block 506 Hougang Avenue 8 and Block 559 Pasir Ris Street 51 were completed on 21 May and 22 May respectively, with particular attention placed on frequently touched areas, such as lift surfaces, lift buttons, handrails, letterboxes, amongst others. As a precautionary measure, NEA had also worked with the TCs to expand the scope of disinfection to include amenities in the vicinity that could be used by residents, such as playground and central refuse chute.<br><br></span><span style=\"font-size: 12pt; font-family: Arial;\">13. &nbsp; &nbsp; &nbsp;In line with tighter precautionary measures to reduce the spread of COVID-19 in the community, NEA has reminded all TCs to step up their cleaning standards and implement measures to upkeep good public health hygiene such as increasing the frequency of cleaning of areas with high contact points and adhering to good practices&nbsp;</span><span style=\"font-size: 12pt; font-family: Arial;\">reflected in NEA’s advisory on sanitation and hygiene</span><span style=\"font-size: 12pt; font-family: Arial;\">.</span></p></div></div><span style=\"font-size: 12pt; font-weight: 700; font-family: Arial;\">ADVISORY ON PROVISION OF SERVICES<br><br></span><font face=\"Arial\" size=\"3\">14. &nbsp; &nbsp; We are testing the residents in these two blocks as a precaution. The residents are not under quarantine. They are allowed to leave their homes and continue with activities allowed under the prevailing Phase 2 (Heightened Alert) measures. Delivery of goods and services such as cylinder gas, food and general repair works to their premises can still carry on with the appropriate safe management measures and wearing of masks. We strongly urge service providers to continue to extend their services to the residents and support our fellow Singaporeans.<br><br><strong>MINISTRY OF HEALTH<br>MINISTRY OF NATIONAL DEVELOPMENT<br>23 MAY 2021<br></strong><br>----------------------------------------</font><br>[1] Cases 63055, 63074, 63150, 63286, 63292, 63392, 63455, 63456, 63517.&nbsp;The 10th case will be stated in a later press release.&nbsp;<br>[2] Cases 62873, 63120, 63444, 63445<br></div><div class=\"page\" title=\"Page 3\"><div class=\"layoutArea\"><div class=\"column\"><p><span style=\"font-size: 12pt; font-family: Arial; font-weight: 700;\"><br><br><br></span></p></div></div></div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "joint-statement-by-moh-and-mnd-on-testing-operations_23May2021", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}