{"pressItemDictionary": {"Press Releases": [{"Title": "2 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1610981280000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "18 Jan 2021", "Summary": "", "MainContent": "&nbsp; &nbsp; &nbsp; &nbsp;As of 18 January 2021, 12pm, the Ministry of Health (MOH) has confirmed and verified that there are 2 new cases of locally transmitted COVID-19 infection. The cases are in the community, and there are no new cases in the dormitories. There are 12 imported cases, who had already been placed on Stay-Home Notice (SHN) or isolated upon arrival in Singapore. Amongst the new cases today, 9 are asymptomatic, and were detected from our proactive screening and surveillance, while 5 were symptomatic.&nbsp;&nbsp;<br><br><strong>Summary of new cases</strong><br><div><br><br><div dir=\"ltr\" align=\"left\"><table><colgroup><col width=\"129\"><col width=\"60\"><col width=\"16\"><col width=\"96\"><col width=\"96\"><col width=\"16\"><col width=\"96\"><col width=\"96\"></colgroup><tbody><tr><td><strong><br></strong></td><td><strong><br></strong></td><td colspan=\"2\"><p dir=\"ltr\"><strong>Breakdown by</strong></p></td><td colspan=\"2\"><p dir=\"ltr\"><strong>Breakdown by</strong></p></td></tr><tr><td><strong><br></strong></td><td><p dir=\"ltr\"><strong>Number of cases</strong></p></td><td><p dir=\"ltr\"><strong>Already in quarantine/ isolation before detection</strong></p></td><td><p dir=\"ltr\"><strong>Detected from surveillance</strong></p></td><td><p dir=\"ltr\"><strong>Symptomatic</strong></p></td><td><p dir=\"ltr\"><strong>Asymptomatic</strong></p></td></tr><tr><td><p dir=\"ltr\"><strong>Cases in the community</strong></p></td><td><p dir=\"ltr\">2</p></td><td><p dir=\"ltr\">0</p></td><td><p dir=\"ltr\">2</p></td><td><p dir=\"ltr\">2</p></td><td><p dir=\"ltr\">0</p></td></tr><tr><td><p dir=\"ltr\"><strong>Cases residing in dormitories</strong></p></td><td><p dir=\"ltr\">0</p></td><td><p dir=\"ltr\">0</p></td><td><p dir=\"ltr\">0</p></td><td><p dir=\"ltr\">0</p></td><td><p dir=\"ltr\">0</p></td></tr><tr><td><p dir=\"ltr\"><strong>Imported cases</strong></p></td><td><p dir=\"ltr\">12</p></td><td><p dir=\"ltr\">12</p></td><td><p dir=\"ltr\">0</p></td><td><p dir=\"ltr\">3</p></td><td><p dir=\"ltr\">9</p></td></tr><tr><td><p dir=\"ltr\"><strong>Total</strong></p></td><td><p dir=\"ltr\">14</p></td><td><br></td><td><br></td><td><br></td><td><br></td></tr></tbody></table></div><br>2.&nbsp; &nbsp; &nbsp;Overall, the number of new cases in the community has increased from 8 cases in the week before to 10 cases in the past week. The number of unlinked cases in the community has decreased from 5 cases in the week before to 4 cases in the past week. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br><br><strong>Case Details</strong><br><br><strong>a) Cases in the community: 2</strong><br><br>There are 2 cases in the community today, both of whom are linked to previous cases.<br><br><em>Case 59393</em><br><br>Case 59393 is a 43 year-old female Singaporean who is the spouse of Case 59365<sup>1</sup>, and a homemaker. She developed a runny nose on 10 January, and subsequently loss of taste, sore throat and diarrhoea on 12 January, but had not sought medical treatment.&nbsp;&nbsp;<br><br>As part of our contact tracing efforts, she was contacted by MOH on 16 January following the confirmation of Case 59365, and was tested for COVID-19 when she reported these symptoms. Her test result came back positive for COVID-19 infection the next day, and she was conveyed to KK Women’s and Children’s Hospital in an ambulance. Her serological test result has come back negative, indicating that this is likely a current infection.<br><br><em>Case 59395</em><br><br>Case 59395 is a 66 year-old female Malaysian national who is a Long-Term Visit Pass holder, and has been residing in Singapore since January 2020. She is a retiree who is a family member of Case 59365. She developed acute respiratory infection (ARI) symptoms and diarrhoea on 9 January, and subsequently loss of taste on 14 January, but had not sought medical treatment.&nbsp;&nbsp;<br><br>As she had been identified as a close contact of Case 59365, she was contacted by MOH on 16 January and tested for COVID-19 when she reported these symptoms. Her test result came back positive for COVID-19 infection the next day, and she was conveyed to Tan Tock Seng Hospital in an ambulance. Her serological test result has come back positive. Together with her COVID-19 symptoms, this indicates a likely recent infection with onset on 9 January.<br><br>Epidemiological investigations are ongoing. In the meantime, all the identified close contacts of the cases, including their family members, have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for the close contacts to determine if the case could have been infected by them.&nbsp;<br><br>We strongly urge everyone to do their part to reduce the risk of transmission. Those who are unwell, including those showing early/mild symptoms, should be socially responsible and seek medical attention immediately.<br><br><strong>b) Cases residing in dormitories: 0</strong><br><br>There are no cases residing in dormitories today.<br><br><strong>c) Imported cases: 12</strong><br><br>Amongst the 12 imported cases,&nbsp;<br><br>- 2 (Cases 59394 and 59400) are Singaporeans and 4 (Cases 59388, 59389, 59397 and 59399) are Singapore Permanent Residents who returned from India, Mexico, Pakistan, Switzerland, UK and US.<br>- 1 (Case 59398) is a Dependant’s Pass holder who arrived from India.<br>- 1 (Case 59392) is a Student’s Pass holder who arrived from Czech Republic.&nbsp;<br>- 4 (Cases 59390, 59391, 59401 and 59402) are Work Permit holders who arrived from Bangladesh, India and Malaysia.&nbsp;<br><br>They had all already been placed on SHN or isolated upon arrival in Singapore and were tested while serving SHN or during isolation.&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp;Please refer to the <a href=\"/docs/librariesprovider5/default-document-library/annexesd294d3d374284cf7b4b3f335a9f03771.pdf?sfvrsn=dca2feed_0\" title=\"Annexes \">Annexes </a>and MOH’s daily Situation Report (<a href=\"https://www.moh.gov.sg/covid-19/situation-report\" title=\"\" class=\"\" target=\"\">www.moh.gov.sg/covid-19/situation-report</a>) for details.&nbsp;<br><br><strong>Update on condition of confirmed cases</strong><br><br>4.&nbsp; &nbsp; &nbsp;22 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 58,868 have fully recovered from the infection and have been discharged from hospitals or community care facilities.&nbsp;<br><br>5.&nbsp; &nbsp; &nbsp;There are currently 44 confirmed cases who are still in hospital. Of these, most are stable or improving, and none is in the intensive care unit. 186 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 29 have passed away from complications due to COVID-19 infection.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>18 JANUARY 2021<br>&nbsp;</strong><br><hr><sup>1&nbsp;</sup><span style=\"font-size: 11px;\">Case 59365 is a 44 year-old male Singaporean who works as an administrative officer at the Singapore Police Force (2 Mowbray Road), and is a colleague of Case 59280. He was confirmed to have COVID-19 infection on 16 January.&nbsp;</span><div><br></div><br></div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "2-new-cases-of-locally-transmitted-covid-19-infection-18Jan-updated", "CurrentPageUrl": null}, {"Title": "2 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1610955780000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "18 Jan 2021", "Summary": "", "MainContent": "&nbsp; &nbsp; &nbsp; As of 18 January 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 2 new cases of locally transmitted COVID-19 infection. Based on our investigations so far, the cases are in the community, and there are no new cases in the dormitories.&nbsp;<br><br>2.&nbsp; &nbsp; &nbsp;In addition, there are 12 imported cases, who had already been placed on Stay-Home Notice or isolated upon arrival in Singapore. In total, there are 14 new cases of COVID-19 infection in Singapore today.<br><br>3.&nbsp; &nbsp; &nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>18 JANUARY 2021<br></strong><div><br></div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "2-new-cases-of-locally-transmitted-covid-19-infection-18Jan", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}