{"pressItemDictionary": {"Press Releases": [{"Title": "No New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1613746620000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "19 Feb 2021", "Summary": "", "MainContent": "1.&nbsp; &nbsp; &nbsp; As of 19 February 2021, 12pm, the Ministry of Health (MOH) has confirmed and verified that there are no new cases of locally transmitted COVID-19 infection. There are 14 imported cases, who had already been placed on Stay-Home Notice (SHN) or isolated upon arrival in Singapore. Amongst the new cases today, 13 are asymptomatic, and were detected from our proactive screening and surveillance, while 1 was symptomatic.&nbsp;&nbsp;<br><br><strong>Summary of new cases</strong><div><br><div dir=\"ltr\" align=\"left\"><table><colgroup><col width=\"129\"><col width=\"60\"><col width=\"16\"><col width=\"96\"><col width=\"96\"><col width=\"16\"><col width=\"96\"><col width=\"96\"></colgroup><tbody><tr><td><strong><br></strong></td><td><strong><br></strong></td><td colspan=\"2\"><p dir=\"ltr\"><strong>Breakdown by</strong></p></td><td colspan=\"2\"><p dir=\"ltr\"><strong>Breakdown by</strong></p></td></tr><tr><td><strong><br></strong></td><td><p dir=\"ltr\"><strong>Number of cases</strong></p></td><td><p dir=\"ltr\"><strong>Already in quarantine/ isolation before detection</strong></p></td><td><p dir=\"ltr\"><strong>Detected from surveillance</strong></p></td><td><p dir=\"ltr\"><strong>Symptomatic</strong></p></td><td><p dir=\"ltr\"><strong>Asymptomatic</strong></p></td></tr><tr><td><p dir=\"ltr\"><strong>Cases in the community</strong></p></td><td><p dir=\"ltr\">0</p></td><td><p dir=\"ltr\">0</p></td><td><p dir=\"ltr\">0</p></td><td><p dir=\"ltr\">0</p></td><td><p dir=\"ltr\">0</p></td></tr><tr><td><p dir=\"ltr\"><strong>Cases residing in dormitories</strong></p></td><td><p dir=\"ltr\">0</p></td><td><p dir=\"ltr\">0</p></td><td><p dir=\"ltr\">0</p></td><td><p dir=\"ltr\">0</p></td><td><p dir=\"ltr\">0</p></td></tr><tr><td><p dir=\"ltr\"><strong>Imported cases</strong></p></td><td><p dir=\"ltr\">14</p></td><td><p dir=\"ltr\">13</p></td><td><p dir=\"ltr\">1</p></td><td><p dir=\"ltr\">1</p></td><td><p dir=\"ltr\">13</p></td></tr><tr><td><p dir=\"ltr\"><strong>Total</strong></p></td><td><p dir=\"ltr\">14</p></td><td><br></td><td><br></td><td><br></td><td><br></td></tr></tbody></table><br>2.&nbsp; &nbsp; &nbsp; Overall, the number of new cases in the community has decreased from 8 cases in the week before to 1 case in the past week. The number of unlinked cases in the community has also decreased from 5 cases in the week before to 1 case in the past week. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br><br>3.&nbsp; &nbsp; &nbsp; Amongst the 69 confirmed cases reported from 13 February to 19 February, 44 cases have tested positive for their serology tests, 10 have tested negative, and 15 serology test results are pending.<br><br><strong>Case Details</strong><br><br><strong>a) Cases in the community: 0</strong><br><br>There are no cases in the community today.&nbsp;<br><br><strong>b) Cases residing in dormitories: 0</strong><br><br>There are no cases residing in dormitories today.&nbsp;<br><br><strong>c) Imported cases: 14</strong><br><br>Amongst the 14 imported cases,&nbsp;<br><br>• 1 (Case 60324) is a Singapore Permanent Resident who returned from Indonesia.<br>• 3 (Cases 60318, 60323 and 60337) are Dependant’s Pass holders who arrived from India and Indonesia.<br>• 4 (Cases 60316, 60319, 60321 and 60325) are Work Pass holders who arrived from India, Nepal and the UAE.<br>• 3 are Work Permit holders who arrived from Indonesia and Malaysia, of whom 1 (Case 60322) is a foreign domestic worker.<br>• 3 (Cases 60328, 60329 and 60330) are Special Pass holders who are sea crew, and arrived from Malaysia and the UAE. They had not disembarked from their vessels and were tested onboard.&nbsp;<br><br>They had all already been placed on SHN or isolated upon arrival in Singapore and were tested while serving SHN or during isolation.&nbsp;<br><br>Of these, 13 are not required to undergo mandatory on-arrival serology tests upon arrival<span style=\"font-size: 10.8333px;\"><sup>1</sup></span>. The remaining case tested positive for her on-arrival serology test, but as we are unable to definitively conclude that she was no longer infectious when she arrived in Singapore, we will take all the necessary public health actions as a precautionary measure.<br><br>Case 60316 is a Work Pass holder who arrived from India on 30 December 2020 and served SHN at a dedicated facility until 3 January 2021. As he had been identified as a close contact of Case 58944, he was subsequently placed on quarantine from 3 January to 13 January. His swabs done on 4 January and 10 January during quarantine were negative for COVID-19. He is asymptomatic, and was detected when he took a COVID-19 pre-departure test on 17 February in preparation for his return to India. His test result came back positive for COVID-19 infection the next day, although the Ct value was very high, which is indicative of a low viral load. Another sample taken on 18 February tested negative for COVID-19. His serological test result has also come back positive. Given that these indicate likely past infection, we have classified the case as imported. He is likely to be shedding minute fragments of the virus RNA, which are no longer transmissible and infective to others.<br><br>4.&nbsp; &nbsp; &nbsp; Please refer to the <a href=\"/docs/librariesprovider5/pressroom/press-releases/annexes---19-feb-2021.pdf?sfvrsn=a7d52902_2\" title=\"Annexes\">Annexes</a>&nbsp;and MOH’s daily Situation Report (<a href=\"https://www.moh.gov.sg/covid-19/situation-report\" title=\"\" class=\"\" target=\"\">www.moh.gov.sg/covid-19/situation-report</a>) for details.&nbsp;<br><br>5.&nbsp; &nbsp; &nbsp; Epidemiological investigations are in progress. In the meantime, all the identified close contacts of the cases have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for the close contacts to determine if the cases could have been infected by them.<br><br><strong>Update on condition of confirmed cases</strong><br><br>6.&nbsp; &nbsp; &nbsp; 18 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 59,697 have fully recovered from the infection and have been discharged from hospitals or community care facilities.&nbsp;<br><br>7.&nbsp; &nbsp; &nbsp; There are currently 20 confirmed cases who are still in hospital. Of these, most are stable or improving, and 1 is in critical condition in the intensive care unit. 100 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 29 have passed away from complications due to COVID-19 infection.<br><br>[1]&nbsp;From 5 February, newly arrived Work Permit and S Pass holders in the Construction, Marine and Process sectors, foreign domestic workers and confinement nannies, who have recent travel history to higher-risk countries/ regions, are required to undergo mandatory on-arrival serology tests, in addition to polymerase chain reaction (PCR) tests.</div></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "no-new-cases-of-locally-transmitted-covid-19-infection-19feb2021-update", "CurrentPageUrl": null}, {"Title": "Start of Covid-19 Vaccination for Seniors ", "PublishedDate": "/Date(1613730600000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "19 Feb 2021", "Summary": "", "MainContent": "<p><span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp;We are making good progress in our vaccination efforts. As of 18 February 2021, about 250,000 individuals have received their first dose of the COVID-19 vaccine. Amongst them, more than 110,000 have also received their second dose of the vaccine, and completed the full vaccination regimen. Following the successful pilots in Ang Mo Kio and Tanjong Pagar, we will commence COVID-19 vaccinations for seniors in the community from 22 February.<br><br><strong>Vaccinations for Seniors<br></strong><br>2.&nbsp; &nbsp;<strong> </strong>Seniors are at higher risk of severe disease or complications from COVID-19 infection, and have been prioritised for vaccination. The pilot for vaccinations for seniors aged 70 years and above commenced on 27 January for seniors residing in Ang Mo Kio and Tanjong Pagar. Over 5,000 seniors from both towns have received their vaccinations as of 18 February. These seniors are scheduled to receive their second dose from 17 February onwards, and in two weeks, they will be adequately protected against COVID-19.<br><br>3.&nbsp; &nbsp;<strong>&nbsp;</strong>COVID-19 vaccination for seniors will commence island-wide from 22 February. Over the next three weeks, seniors aged 70 years and above can expect to receive personalised letters inviting them to sign up for vaccination. We will start by inviting seniors living near polyclinics or vaccination centres, so that they can be conveniently vaccinated at a vaccination site near their home. By mid-March when we have opened a vaccination centre in each town, all seniors will be able to receive their vaccination. We expect all the letters to reach our seniors aged 70 years and above by the first week of March.<br><br>4.&nbsp; &nbsp;<strong>&nbsp;</strong>Thereafter we will move to vaccinate the seniors aged 60 to 69 years. They will receive their invitation letters around the middle of March, and the vaccination will commence from around end-March onwards.<br><br>5.&nbsp; &nbsp;<strong>&nbsp;</strong>Upon receiving the invitation letter, seniors can register online for their vaccination at <a href=\"https://www.vaccine.gov.sg/\" title=\"\" class=\"\" target=\"\">vaccine.gov.sg</a>. Once registered, seniors will receive an SMS with a unique link for them to book their vaccination appointments. Seniors will be able to schedule their vaccinations at any of the vaccination centres, 20 polyclinics, or 22 Public Health Preparedness Clinics (PHPCs)[1]&nbsp;operating as vaccination sites.<br><br>6.&nbsp; &nbsp;<strong>&nbsp;</strong>Seniors who require assistance booking their vaccination appointments can bring their invitation letter to any community centre/club from 19 February, where staff members will be available to assist them. Community volunteers from People’s Association and Silver Generation Ambassadors will be conducting house visits and tapping on grassroots events to help seniors with their appointment booking and answer their queries. To reach out to seniors who may find it challenging to visit a vaccination site in person due to mobility issues, we will work with the relevant agencies to deploy mobile vaccination teams to carry out vaccinations for these individuals.<br><br>7.&nbsp; &nbsp;<strong>&nbsp;</strong>As the letters will be mailed based on official residential addresses, seniors are encouraged to update their residential address using the change of address e-service via the relevant government websites[2], so that letters will be delivered to their place of residence<br><br><strong>More Vaccination Centres for Seniors’ Convenience<br></strong><br>8.&nbsp; &nbsp;To ensure that seniors can conveniently receive their vaccinations, we will set up more vaccination centres in the coming weeks. Currently, there are 11 vaccination centres in operation[3]. Three more vaccination centres located at community centres/clubs will commence operations by 22 February, at Bukit Timah, Marine Parade and Taman Jurong, bringing the total to 14. By the middle of March, 31 vaccination centres will be in operation, with at least one vaccination centre in each town. In total, there will eventually be around 40 vaccination centres, with each vaccination centre planned for an estimated capacity of 2,000 vaccinations per day.<br><br>9.&nbsp; &nbsp;<strong>&nbsp;</strong>These centres, together with the polyclinics and selected PHPCs, will ensure that every Singaporean and long-term resident in Singapore who is medically eligible can receive their vaccinations conveniently.<br><br>10.&nbsp; &nbsp;<strong>&nbsp;</strong>Vaccination is critical to protect us and our loved ones against COVID-19. Vaccination also protects those in our community who cannot be vaccinated due to medical reasons. This collective protection will become more effective as more people are vaccinated and is a key enabler allowing us to return to normalcy. While COVID-19 vaccination will be voluntary, we strongly encourage Singaporeans and long-term residents who are medically eligible to come forward for vaccination when their turn comes, so that as a society, we can keep each other safe from the disease.<br><br><br><strong>MINISTRY OF HEALTH<br></strong><strong>19 FEBRUARY 2021</strong></span></p> <div><br clear=\"all\"> <hr align=\"left\" size=\"1\" width=\"33%\"> <div id=\"ftn1\"> <p>[1] Please visit <a href=\"https://www.vaccine.gov.sg/\">vaccine.gov.sg</a> for a list of operational vaccination sites.</p> </div> <div id=\"ftn2\"> <p>[2] Singaporean citizens, permanent residents (pink and blue IC holders) can use the “Online Change of Address” e-Service at <a href=\"https://go.gov.sg/ic-address\">https://go.gov.sg/ic-address</a>. For ICA-issued Long-Term Visit Pass holders, local sponsors can access the e-Update of Address eService at <a href=\"https://www.ica.gov.sg/\">https://www.ica.gov.sg</a>. MOM-issued Work Pass holders and their family on Dependant’s Pass or Long-Term Visit Pass can update their addresses online at <a href=\"https://www.mom.gov.sg/eservices/services/ep-online\">https://www.mom.gov.sg/eservices/services/ep-online</a>.</p> </div> <div id=\"ftn3\"> <p>[3] The 11 vaccination centres currently in operation are at Bishan Community Club, Canberra Community Club, Changi Airport Terminal 4, former Hong Kah Secondary School, Jalan Besar Community Club, Raffles City Convention Centre, Senja-Cashew Community Club, The Serangoon Community Club, Tanjong Pagar Community Club, Teck Ghee Community Club, and Woodlands Galaxy Community Club.</p> </div> </div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "start-of-covid-19-vaccination-for-seniors", "CurrentPageUrl": null}, {"Title": "No New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1613664000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "19 Feb 2021", "Summary": "", "MainContent": "1.&nbsp; &nbsp; &nbsp; As of 19 February 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed that there are no new cases of locally transmitted COVID-19 infection.&nbsp;<br><br>2.&nbsp; &nbsp; &nbsp; There are 14 imported cases, who had already been placed on Stay-Home Notice or isolated upon arrival in Singapore. Of these, 13 are not required to undergo mandatory on-arrival serology tests upon arrival<sup>1</sup>.<br><br>3.&nbsp; &nbsp; &nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.<br><br>[1]&nbsp;From 5 February, newly arrived Work Permit and S Pass holders in the Construction, Marine and Process sectors, foreign domestic workers and confinement nannies, who have recent travel history to higher-risk countries/ regions, are required to undergo mandatory on-arrival serology tests, in addition to polymerase chain reaction (PCR) tests.<br>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "no-new-cases-of-locally-transmitted-covid-19-infection-19feb2021", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}