{"pressItemDictionary": {"Press Releases": [{"Title": "6 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1622988840000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "06 Jun 2021", "Summary": "", "MainContent": "&nbsp; &nbsp; &nbsp; &nbsp;As of 6 June 2021, 12pm, the Ministry of Health (MOH) has confirmed and verified that there are 6 new cases of locally transmitted COVID-19 infection. 5 are linked to previous cases, all of whom have already been placed on quarantine. The remaining case is currently unlinked. The cases are in the community, and there are no new cases in the dormitories. There are 14 imported cases, who have already been placed on Stay-Home Notice (SHN) or isolated upon arrival in Singapore. Amongst the new cases today, 17 are asymptomatic, and were detected from our proactive screening and surveillance, while 3 were symptomatic.&nbsp;&nbsp;<br><br><strong>Summary of new cases</strong><br><div><br></div><div dir=\"ltr\" align=\"left\"><div dir=\"ltr\" align=\"left\"><table><colgroup><col width=\"129\"><col width=\"60\"><col width=\"16\"><col width=\"96\"><col width=\"96\"><col width=\"16\"><col width=\"96\"><col width=\"96\"></colgroup><tbody><tr><td><strong><br></strong></td><td><strong><br></strong></td><td><strong><br></strong></td><td colspan=\"2\"><p dir=\"ltr\"><strong>Breakdown by</strong></p></td><td><strong><br></strong></td><td colspan=\"2\"><p dir=\"ltr\"><strong>Breakdown by</strong></p></td></tr><tr><td><strong><br></strong></td><td><p dir=\"ltr\"><strong>Number of cases</strong></p></td><td><strong><br></strong></td><td><p dir=\"ltr\"><strong>Already in quarantine/ isolation before detection</strong></p></td><td><p dir=\"ltr\"><strong>Detected from surveillance</strong></p></td><td><strong><br></strong></td><td><p dir=\"ltr\"><strong>Symptomatic</strong></p></td><td><p dir=\"ltr\"><strong>Asymptomatic</strong></p></td></tr><tr><td><p dir=\"ltr\"><strong>Cases in the community</strong></p></td><td><p dir=\"ltr\">6</p></td><td><br></td><td><p dir=\"ltr\">5</p></td><td><p dir=\"ltr\">1</p></td><td><br></td><td><p dir=\"ltr\">3</p></td><td><p dir=\"ltr\">3</p></td></tr><tr><td><p dir=\"ltr\"><strong>Cases residing in dormitories</strong></p></td><td><p dir=\"ltr\">0</p></td><td><br></td><td><p dir=\"ltr\">0</p></td><td><p dir=\"ltr\">0</p></td><td><br></td><td><p dir=\"ltr\">0</p></td><td><p dir=\"ltr\">0</p></td></tr><tr><td><p dir=\"ltr\"><strong>Imported cases</strong></p></td><td><p dir=\"ltr\">14</p></td><td><br></td><td><p dir=\"ltr\">14</p></td><td><p dir=\"ltr\">0</p></td><td><br></td><td><p dir=\"ltr\">0</p></td><td><p dir=\"ltr\">14</p></td></tr><tr><td><p dir=\"ltr\"><strong>Total</strong></p></td><td><p dir=\"ltr\">20</p></td><td><br></td><td><br></td><td><br></td><td><br></td><td><br></td><td><br></td></tr></tbody></table></div><br>2.&nbsp; &nbsp; Overall, the number of new cases in the community has decreased from 136 cases in the week before to 116 cases in the past week. The number of unlinked cases in the community has also decreased from 23 cases in the week before to 17 cases in the past week. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br><br>3.&nbsp; &nbsp; Amongst the 168 confirmed cases reported from 31 May to 6 June, 59 cases have tested positive for their serology tests, 79 have tested negative, and 30 serology test results are pending.<br><br><br><strong>Case Details</strong><br><br><strong>a) Cases in the community: 6</strong><br><br>There are 6 cases in the community today, of whom 5 are linked to previous cases and 1 is currently unlinked.&nbsp;<br><br><strong>Currently unlinked case&nbsp;</strong><br><br><em>Detected through surveillance:</em><br><br>Case 64068 is a 13 year-old female Singaporean who is a student at Paya Lebar Methodist Girls’ School and was last in school on 18 May. She developed anosmia on 29 May and did not seek medical treatment until 4 June when she visited a General Practitioner (GP) clinic and was tested for COVID-19. Her test result came back positive for COVID-19 infection on 5 June. Her serology test result is pending.<br><br><strong>NTUC Foodfare (308 Anchorvale Road) cluster</strong><br><br><em>Already quarantined:</em><br><br>Case 64076 is a 50 year-old male China national who works as a machine operator at Xinghe Knife Sharpening Service. He is a family member and household contact of Case 64009<sup>1</sup>, and was placed on quarantine on 2 June. He is asymptomatic and was detected when he was tested for COVID-19 on 4 June during quarantine. His test result came back positive for COVID-19 infection the next day. His serology test result is pending.&nbsp;<br><br><strong>McDonald’s delivery riders cluster</strong><br><br><em>Already quarantined:</em><br><br>Case 64079 is a 29 year-old male Malaysia national who works as a delivery rider at Pizza Hut (Bukit Merah), and resides at Wanderloft Capsule Hostel. On 22 May, he underwent both an antigen rapid test (ART) and polymerase chain reaction (PCR) test at a GP clinic, and both results were negative. As he has been identified as a close contact of Cases 63629<sup>2</sup>, 63668<sup>3</sup>, 63694<sup>4</sup>, 63791<sup>5</sup>, 63796<sup>6</sup> and 63834<sup>7</sup>, he was subsequently placed on quarantine on the same day. He is asymptomatic and was detected when he was tested on 5 June during quarantine. His test result came back positive for COVID-19 infection on 5 June. His serology test result is pending.&nbsp;<br><br><strong>Tektronix cluster</strong><br><br><em>Already quarantined:</em><br><br>Case 64065 is a 13 year-old male Singaporean who is a student at Canberra Secondary School and was last in school on 18 May. He is a family member and household contact of Cases 63721<sup>8</sup>, 63933<sup>9</sup> and 64066, and a household contact of Case 64050<sup>10</sup>, and was placed on quarantine on 25 May. He was tested for COVID-19 on 4 June during quarantine, and his test result came back positive for COVID-19 infection on 5 June. He developed a sore throat on the same day. His serology test result is pending.<br><br>Case 64066 is a 10 year-old male Singaporean who is a student at Endeavour Primary School and was last in school on 18 May. He is a family member and household contact of Cases 63721, 63933 and 64065, and a household contact of Case 64050, and was placed on quarantine on 25 May. He was tested for COVID-19 on 4 June during quarantine, and developed a cough on the same day. His test result came back positive for COVID-19 infection on 5 June. His serology test result is pending.<br><br><strong>Case 63931 cluster<sup>11</sup></strong><br><br><em>Already quarantined:</em><br><br>Case 64077 is a 79 year-old female Singaporean who is a retiree. She is a family member and household contact of Case 63931 and a household contact of Case 64020<sup>12</sup>, and was placed on quarantine on 1 June. She was tested for COVID-19 on 2 June during quarantine, and her test result was negative. She is asymptomatic, and was detected when she was tested again for COVID-19 on 5 June. Her test result came back positive for COVID-19 infection on the same day. Her serology test result is pending.<br><br><strong>b) Cases residing in dormitories: 0</strong><br><br>There are no cases residing in dormitories today.&nbsp;<br><br><strong>c) Imported cases: 14<br></strong><br>Amongst the 14 imported cases,&nbsp;<br><br>-&nbsp; 6 (Cases 64071, 64072, 64073, 64074, 64075 and 64084) are Singaporeans and 6 (Cases 64067, 64070, 64078, 64083, 64085 and 64086) are Singapore Permanent Residents who returned from India.<br>-&nbsp; 1 (Case 64087) is a Work Pass holder who arrived from Myanmar.<br>-&nbsp; 1 (Case 64069) is a Short-Term Visit Pass holder who arrived from Indonesia to visit her family member who is a Singaporean.&nbsp;<br><br>They had all already been placed on SHN or isolated upon arrival in Singapore and were tested while serving SHN or during isolation.&nbsp;<br><br>4.&nbsp; &nbsp; Please refer to the <a href=\"/docs/librariesprovider5/default-document-library/annexes_6jun_updated6801ccff48c54d1e94ead9b5f4a1263e.pdf?sfvrsn=f9c481df_0\" title=\"Annexes\"></a><a href=\"/docs/librariesprovider5/default-document-library/annexes_6jun_full.pdf?sfvrsn=40bbd902_0\" title=\"Annexes\">Annexes</a>&nbsp;and MOH’s daily Situation Report (<a href=\"https://www.moh.gov.sg/covid-19/situation-report\" title=\"\" class=\"\" target=\"\">www.moh.gov.sg/covid-19/situation-report</a>) for details.&nbsp;<br><br>5.&nbsp; &nbsp; Epidemiological investigations are in progress. In the meantime, all the identified close contacts of the cases have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for the close contacts to determine if the cases could have been infected by them.<br><br>6.&nbsp; &nbsp; MOH has been monitoring existing clusters for any further transmission. As there have been no more cases linked to the Tan Tock Seng Hospital and Pasir Panjang Terminal clusters for the past two incubation periods (i.e. 28 days), the clusters have now been closed.<br><br><strong>Update on condition of confirmed cases</strong><br><br>7.&nbsp; &nbsp; 22 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 61,635 have fully recovered from the infection and have been discharged from hospitals or community care facilities.&nbsp;<br><br>8.&nbsp; &nbsp; There are currently 207 confirmed cases who are still in hospital. Of these, most are stable or improving, and 2 are in critical condition in the intensive care unit. 321 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 33 have passed away from complications due to COVID-19 infection.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>6 JUNE 2021</strong><br><div><br><hr><br></div><sup>1 </sup>Case 64009 is a 39 year-old female China national who works as a kitchen assistant at NTUC Foodfare (308 Anchorvale Road). She was confirmed to have COVID-19 infection on 2 June.<br><br><sup>2 </sup>Case 63629 is a 31 year-old male Malaysia national who works as a delivery rider for Pizza Hut (Punggol Plaza). He was confirmed to have COVID-19 infection on 23 May.<br><br><sup>3 </sup>Case 63668 is a 34 year-old male Malaysia national who works as a delivery rider for Pizza Hut (Havelock II). He was confirmed to have COVID-19 infection on 23 May.<br><br><sup>4 </sup>Case 63694 is a 25 year-old male Malaysia national who works as a delivery rider for Domino’s Pizza (Tanjong Katong). He was confirmed to have COVID-19 infection on 23 May.<br><br><sup>5</sup> Case 63791 is a 33 year-old male Malaysia national who works as a kitchen assistant at Pano Kato Grill, Pizza &amp; Deli. He was confirmed to have COVID-19 infection on 27 May.<br><br><sup>6 </sup>Case 63796 is a 21 year-old male Malaysia national who works as a packer at DM Wines Pte Ltd. He was confirmed to have COVID-19 infection on 27 May.<br><br><sup>7 </sup>Case 63834 is a 28 year-old male Malaysia national who works as a kitchen staff and service crew at Pizza Hut Express (Holland Village MRT). He was confirmed to have COVID-19 infection on 28 May.<br><br><sup>8</sup> Case 63721 is a 50 year-old male Singaporean who works as an engineer at Tektronix Southeast Asia Pte Ltd. He was confirmed to have COVID-19 infection on 24 May.<br><br><sup>9</sup> Case 63933 is a 39 year-old female Singaporean who is homemaker, and a family member and household contact of Case 63721. She was confirmed to have COVID-19 infection on 31 May.<br><br><sup>10 </sup>Case 64050 is a 25 year-old female Indonesia national who is a foreign domestic worker, and is a household contact of Cases 63721 and 63933. She was confirmed to have COVID-19 infection on 4 June.<br><br><sup>11</sup> Case 63931 is an 82 year-old male Singaporean who is a retiree. He was confirmed to have COVID-19 infection on 1 June.<br><br><sup>12</sup> Case 64020 is a 29 year-old female Indonesia national who is a foreign domestic worker. She was confirmed to have COVID-19 infection on 2 June.<br><br></div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "6-new-cases-of-locally-transmitted-covid-19-infection-6jun-updatedv2", "CurrentPageUrl": null}, {"Title": "6 New Cases of Locally Transmitted Covid-19 Infection ", "PublishedDate": "/Date(1622964600000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "06 Jun 2021", "Summary": "", "MainContent": "&nbsp; &nbsp; &nbsp; &nbsp;As of 6 June 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 6 new cases of locally transmitted COVID-19 infection. 5 are linked to previous cases, all of whom have already been placed on quarantine. The remaining case is currently unlinked. Based on our investigations so far, the cases are in the community, and there are no new cases in the dormitories.<br><br>2.&nbsp; &nbsp; In addition, there are 14 imported cases, who have already been placed on Stay-Home Notice or isolated upon arrival in Singapore. Of these, 12 are returning Singaporeans or Singapore Permanent Residents.<br><br>3.&nbsp; &nbsp; In total, there are 20 new cases of COVID-19 infection in Singapore today.<br><br>4.&nbsp; &nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>6 JUNE 2021&nbsp;<br><br></strong>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "6-new-cases-of-locally-transmitted-covid-19-infection-6Jun", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}