{"pressItemDictionary": {"Press Releases": [{"Title": "No New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1612879560000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "09 Feb 2021", "Summary": "", "MainContent": "<p>1.&nbsp; &nbsp; &nbsp; As of 9 February 2021, 12pm, the Ministry of Health (MOH) has confirmed and verified that there are no new cases of locally transmitted COVID-19 infection. There are 11 imported cases, of whom 10 had already been placed on Stay-Home Notice (SHN) upon arrival in Singapore. Amongst the new cases today, 10 are asymptomatic, and were detected from our proactive screening and surveillance, while 1 was symptomatic.&nbsp;&nbsp;</p><p><strong>Summary of new cases</strong></p><table border=\"1\" cellspacing=\"0\" cellpadding=\"0\" width=\"605\"><tbody><tr><td width=\"129\"><p align=\"right\">&nbsp;</p></td><td width=\"60\"><p>&nbsp;</p></td><td width=\"16\" valign=\"top\"><p>&nbsp;</p></td><td width=\"192\" colspan=\"2\"><p align=\"center\"><strong>Breakdown by</strong></p></td><td width=\"16\" valign=\"top\"><p>&nbsp;</p></td><td width=\"192\" colspan=\"2\"><p align=\"center\"><strong>Breakdown by</strong></p></td></tr><tr><td width=\"129\"><p align=\"right\">&nbsp;</p></td><td width=\"60\"><p><strong>Number of cases</strong></p></td><td width=\"16\" valign=\"top\"><p>&nbsp;</p></td><td width=\"96\"><p><strong>Already in quarantine/ isolation before detection</strong></p></td><td width=\"96\"><p><strong>Detected from surveillance</strong></p></td><td width=\"16\" valign=\"top\"><p>&nbsp;</p></td><td width=\"96\"><p><strong>Symptomatic</strong></p></td><td width=\"96\"><p><strong>Asymptomatic</strong></p></td></tr><tr><td width=\"129\"><p><strong>Cases in the community</strong></p></td><td width=\"60\"><p align=\"center\">0</p></td><td width=\"16\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">0</p></td><td width=\"96\"><p align=\"center\">0</p></td><td width=\"16\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">0</p></td><td width=\"96\"><p align=\"center\">0</p></td></tr><tr><td width=\"129\"><p><strong>Cases residing in dormitories</strong></p></td><td width=\"60\"><p align=\"center\">0</p></td><td width=\"16\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">0</p></td><td width=\"96\"><p align=\"center\">0</p></td><td width=\"16\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">0</p></td><td width=\"96\"><p align=\"center\">0</p></td></tr><tr><td width=\"129\"><p><strong>Imported cases</strong></p></td><td width=\"60\"><p align=\"center\">11</p></td><td width=\"16\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">10</p></td><td width=\"96\"><p align=\"center\">1</p></td><td width=\"16\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">1</p></td><td width=\"96\"><p align=\"center\">10</p></td></tr><tr><td width=\"129\"><p><strong>Total</strong></p></td><td width=\"60\"><p align=\"center\">11</p></td><td width=\"16\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">&nbsp;</p></td><td width=\"16\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">&nbsp;</p></td></tr></tbody></table><p><br>2.&nbsp; &nbsp; &nbsp; Overall, the number of new cases in the community has increased from 3 cases in the week before to 4 cases in the past week. The number of unlinked cases in the community has also increased from 2 cases in the week before to 4 cases in the past week. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br><br>3.&nbsp; &nbsp; &nbsp; Amongst the 148 confirmed cases reported from 3 February to 9 February, 86 cases have tested positive for their serology tests, 28 have tested negative, and 34 serology test results are pending.<br><br><strong>Case Details</strong><br><br><strong>a) Cases in the community: 0</strong><br><br>There are no cases in the community today.&nbsp;<br><br><strong>b) Cases residing in dormitories: 0</strong><br><br>There are no cases residing in dormitories today.&nbsp;<br><br><strong>c) Imported cases: 11</strong><br><br>Amongst the 11 imported cases,&nbsp;<br><br>• 2 (Cases 60080 and 60102) are Singaporeans who returned from the UAE.<br>• 1 (Case 60094) is a Dependant’s Pass holder who arrived from India.<br>• 3 (Cases 60081, 60087 and 60089) are Student's Pass holders who arrived from India, Indonesia and Russia.<br>• 3 (Cases 60095, 60097 and 60098) are Work Permit holders who arrived from Indonesia and the Philippines, all of whom are foreign domestic workers.<br>• 2 (Cases 60086 and 60088) are Short-Term Visit Pass holders. Case 60086 arrived from Indonesia to visit her Singaporean spouse. Case 60088 arrived from Bangladesh as a caregiver to her spouse who was already receiving medical care in Singapore.<br><br>Amongst them, 10 had already been placed on SHN upon arrival in Singapore and were tested while serving SHN.&nbsp;<br><br><span style=\"text-decoration: underline;\">Case 60102</span><br><br>Case 60102 is a 41 year-old female Singaporean who works as a cabin crew with Singapore Airlines. She departed Singapore on 30 January on a turnaround flight to the UAE, and returned on 1 February without disembarking from the aircraft at the overseas destination.&nbsp;<br><br>She developed anosmia on 4 February, but did not seek medical attention. On 7 February, she was tested for COVID-19 as part of the Civil Aviation Authority of Singapore’s requirement for air crew to be tested following their return from overseas. Her pooled test result came back positive for COVID-19 on 8 February, and she was conveyed to the National Centre for Infectious Diseases for an individual swab, and isolated. Her test result came back positive for COVID-19 infection the next day. Her previous test on 22 January following another turnaround flight was negative for COVID-19. Her serology test result has come back negative, indicating that this is likely a current infection. She has also tested preliminarily positive for the B117 strain, and is pending further confirmatory tests.&nbsp;<br><br>Case 60102 received her first dose of the Pfizer-BioNTech COVID-19 vaccine on 2 February. As the vaccine does not contain live virus, she could not have been infected due to vaccination. It is possible for one to be infected just before or just after vaccination as it typically takes a few weeks for an individual to build up immunity after completing vaccination.&nbsp;<br><br>Besides Case 60102, 4 passengers on the same flight (Cases 59885, 59893, 59901 and 59902) have tested positive for COVID-19 infection, and are also preliminarily positive for the B117 strain. In view of her recent travel history, and the possibility that she might have been infected onboard the flight, we have preliminarily classified this case as imported.&nbsp;<br><br>4.&nbsp; &nbsp; &nbsp; Epidemiological investigations are ongoing. In the meantime, all the identified close contacts of the case, including her family members and co-workers, have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for the close contacts to determine if the case could have been infected by them.&nbsp;<br><br>5.&nbsp; &nbsp; &nbsp; Please refer to the <a href=\"/docs/librariesprovider5/pressroom/press-releases/annexes---9-feb-2021.pdf?sfvrsn=5a6f8075_2\" title=\"Annexes\">Annexes</a>&nbsp;and MOH’s daily Situation Report (<a href=\"https://www.moh.gov.sg/covid-19/situation-report\" title=\"\" class=\"\" target=\"\">www.moh.gov.sg/covid-19/situation-report</a>) for details.&nbsp;<br><br><strong>Update on condition of confirmed cases</strong><br><br>6.&nbsp; &nbsp; &nbsp; 22 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 59,506 have fully recovered from the infection and have been discharged from hospitals or community care facilities.&nbsp;<br><br>7.&nbsp; &nbsp; &nbsp; There are currently 40 confirmed cases who are still in hospital. Of these, most are stable or improving, and 1 is in critical condition in the intensive care unit. 157 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 29 have passed away from complications due to COVID-19 infection.</p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "no-new-cases-of-locally-transmitted-covid-19-infection-9feb2021-update", "CurrentPageUrl": null}, {"Title": "Updates On Border Measures for Travellers From Vietnam, New South Wales (australia), and Business Travel Pass Scheme", "PublishedDate": "/Date(1612871940000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "09 Feb 2021", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; The Multi-Ministry Taskforce has been closely monitoring the global COVID-19 situation. We will tighten our border measures for travellers from Vietnam, given the increase in the number of COVID-19 cases in Vietnam. At the same time, with the improvement in the COVID-19 situation in New South Wales (NSW), Australia, we will adjust our border measures for travellers from NSW, Australia. In addition, to minimise the risk of potential incubating cases leaking into the community for travellers, we will tighten border measures for the Business Travel Pass scheme.</p> <p><strong>Travellers from Vietnam to serve 14-Day SHN at Suitable Place of Residence</strong></p> <p>2.&nbsp; &nbsp; We had earlier announced that travellers from Vietnam will be allowed to go about their activities in Singapore, without a need to serve Stay-Home Notice (SHN), if their on-arrival COVID-19 Polymerase Chain Reaction (PCR) test results are negative.</p><p><p>3.&nbsp; &nbsp; Given the increased cases observed in Vietnam, we will be tightening border control measures for travellers with travel history to Vietnam. From <strong>12 February 2021</strong><strong>, 2359 hours:</strong></p></p><p>a)&nbsp; &nbsp;Singapore Citizens (SCs), Permanent Residents (PRs) and Long-Term Pass holders entering Singapore with travel history to Vietnam within the last 14 days before departure for Singapore, will be subject to an on-arrival COVID-19 PCR test, 14-day SHN at dedicated SHN facilities, and a PCR test before the end of the SHN period. </p><p>b)&nbsp; &nbsp;Short-term travellers holding an Air Travel Pass (ATP) with travel history to Vietnam within the last 14 days before departure for Singapore, will <u>not</u> be allowed to enter Singapore.</p><p>c)&nbsp; &nbsp;All travellers who are not SCs or PRs will need to take a COVID-19 PCR test within 72 hours before departure. These travellers will still be required to undergo an On-Arrival Test (OAT) and serve their SHN upon arrival and be tested at the end of SHN. </p><p>4.&nbsp; &nbsp;Travellers from Vietnam are allowed to opt out of dedicated SHN facilities and serve their 14-day SHN at their place of residence, if they fulfil the following criteria:<br><br> a)&nbsp; &nbsp;Travelled to no other country/region than above-mentioned country/region [1], in the last consecutive 14 days prior to entry; and<br><br>b)&nbsp; Are occupying their place of residence (i.e. residential address) alone, or only with household members who are also persons serving SHN with the same travel history and duration of SHN.<br></p><p>The COVID-19 tests will continue to be administered before the end of the SHN.</p><p><strong>Travellers from NSW, Australia subject to an On-Arrival Test in lieu of 7D SHN</strong></p><p>5.&nbsp; &nbsp;Since 23 December 2020, 2359 hours, SCs, PRs and Long-Term Pass holders entering Singapore with travel history to NSW, Australia within the last 14 days before departure for Singapore, have been subjected to a 7-day SHN at their place of residence with a COVID-19 PCR test before the end of their SHN period. Short-term visitors holding an ATP with travel history to NSW, Australia within the last 14 days before departure for Singapore have not been allowed to enter Singapore.</p><p><p>6.&nbsp; &nbsp;The COVID-19 situation in NSW, Australia has since improved, with no local community cases recorded over the last 21 days. Given this, we will adjust our border control measures for travellers with travel history to NSW, Australia. From <strong>10 February 2021, 2359 hours</strong>, SCs, PRs and Long-Term Pass holders returning from NSW, Australia will undergo a COVID-19 PCR test upon arrival at the airport in lieu of a 7-day SHN, and if the result is negative, they will be allowed to go about their activities in Singapore.<br><br>7.&nbsp; &nbsp;Short-term visitors travelling from NSW, Australia can also apply for an ATP for entry into Singapore on or after <strong>16 February 2021 [2]</strong>. They will undergo a COVID-19 PCR test upon arrival at the airport in lieu of a 7-day SHN, and if the result is negative, they will be allowed to go about their activities in Singapore.</p></p><p><p><strong>Revised Border Measures for the BTP Scheme<br><br></strong>8.<strong>&nbsp; &nbsp;</strong>The Business Travel Pass (BTP) scheme was introduced in June 2020 to facilitate essential business travel for senior executives based in Singapore with regional or international responsibilities who need to travel regularly for work.</p></p><p><p>9.&nbsp; &nbsp; BTP travellers are required to abide by a strict controlled itinerary when travelling. Upon return, BTP travellers will undergo an on-arrival COVID-19 PCR test in lieu of the SHN and are required to be isolated in a single location until they obtain a negative result for their OAT. In addition, travellers are required to use TraceTogether, avoid all forms of public transport within 14 days of return, comply with safe management measures at their workplace and abide by all other prevailing measures applicable to local residents. <br><br>10.&nbsp; &nbsp;As an added precautionary measure, travellers on this scheme are now required to undergo COVID-19 PCR Tests on <strong>Day 3, Day 7 and Day 14</strong> of their return. An additional serology test will also be required on Day 3. These enhanced testing requirements serve to minimise the risk of potential incubating cases leaking into the community. Travellers are also to avoid events with more than 8 attendees within 14 days of returning to Singapore.</p></p><p><p>11.&nbsp; &nbsp;As compliance to the border measures in this scheme is crucial to safeguarding public health and helping to curb potential transmission of COVID-19 to the community, BTP holders must comply with the border measures in this scheme or risk having their BTPs revoked.</p></p><p><p>12.&nbsp; &nbsp;We will continue to carefully monitor the global situation and the public health outcomes from this scheme in order to strike a calibrated balance between the safety of the local community and resuming business travel in support of our overall economic recovery.</p></p><p><p><strong>Regular Review of Border Measures</strong></p><p>13.&nbsp; &nbsp;As the global situation evolves, we will continue to adjust our border measures to manage the risk of importation and transmission to the community. Any changes to border measures will be updated on the <a href=\"https://safetravel.ica.gov.sg\" title=\"\" class=\"\" target=\"\">SafeTravel website</a>. Travellers are advised to visit the website to check for the most updated border measures before entering Singapore and be prepared to be subjected to the prevailing border measures upon entry, including payment for their stay at dedicated SHN facilities, tests and treatment.</p></p><p><p>14.&nbsp; &nbsp;All travellers are reminded to accurately declare their travel history. Strict enforcement actions will be taken against false declarations.<br><br></p><div> </div></p><p><strong>MINISTRY OF HEALTH<br></strong><strong>9 FEBRUARY 2021</strong></p><div> <hr align=\"left\" size=\"1\" width=\"33%\"> <div id=\"ftn1\"> <p>[1] Including the following countries/regions: Australia, Brunei Darussalam, Fiji Hong Kong, Macao, Mainland China, New Zealand Sri Lanka, Taiwan and Thailand (correct as of 9 February 2021).</p> </div> <div id=\"ftn2\"> <p>[2] Visitors can apply for the single-entry ATP, at no charge, between seven and thirty calendar days prior to their intended date of entry into Singapore. </p> </div> </div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "updates-on-border-measures-for-travellers-from-vietnam-new-south-wales-(australia)-and-business-travel-pass-scheme", "CurrentPageUrl": null}, {"Title": "No New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1612800000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "09 Feb 2021", "Summary": "", "MainContent": "1.&nbsp; &nbsp; &nbsp; As of 9 February 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed that there are no new cases of locally transmitted COVID-19 infection.<br><br>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; There are 11 imported cases, of whom 10 had already been placed on Stay-Home Notice upon arrival in Singapore. The remaining case is a cabin crew with Singapore Airlines who was on a turnaround flight and had not disembarked from the aircraft at the overseas destination. She developed symptoms a few days after returning to Singapore.<br><br>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.<br>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "no-new-cases-of-locally-transmitted-covid-19-infection-9feb2021", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}