{"pressItemDictionary": {"Press Releases": [{"Title": "No New Cases of Locally Transmitted Covid-19 Infection ", "PublishedDate": "/Date(1614411060000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "27 Feb 2021", "Summary": "", "MainContent": "&nbsp; &nbsp; &nbsp; &nbsp;As of 27 February 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed that there are no new cases of locally transmitted COVID-19 infection.&nbsp;<br><br>2&nbsp; &nbsp; There are 12 imported cases, who had already been placed on Stay-Home Notice or isolated upon arrival in Singapore.&nbsp;<br><br>3&nbsp; &nbsp; &nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>27 FEBRUARY 2021</strong><br><div><br></div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "no-new-cases-of-locally-transmitted-covid-19-infection-27Feb", "CurrentPageUrl": null}, {"Title": "Suspension of Eng’s Heritage (930 Yishun Ave 2, #b1-51, Northpoint City) Lifted After Meeting Required Standards", "PublishedDate": "/Date(1614400800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "27 Feb 2021", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;The&nbsp;Singapore Food Agency (SFA) has lifted the suspension of Eng’s Heritage (930 Yishun Ave 2, #B1-51, Northpoint City). As the licensee has implemented the required measures as stipulated by SFA, operations can be resumed.<br>&nbsp;<br>2&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The Ministry of Health (MOH) and SFA had received reports of gastroenteritis involving 101 persons who had consumed food from Eng’s Heritage between 6 and 9 January 2021. 12 persons were hospitalised and have since been discharged. To protect consumers from further public health risks, the operating licence of Eng’s Heritage was suspended by SFA from 13 January to 26 February 2021.<br>&nbsp;<br>3&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Investigation into the cause of the gastroenteritis illness is ongoing.<br><br><strong>Measures Taken by Eng’s Heritage (930 Yishun Ave 2, #B1-51, Northpoint City)</strong><br><br>&nbsp;4&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; During the suspension period, Eng’s Heritage has complied with measures stipulated by SFA. The licensee has disposed all ready-to-eat food, thawed food, food ingredients and perishable food items, and also cleaned and sanitised their premises, including their equipment and utensils.<br>&nbsp;<br>5&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Food handlers involved in food preparation have since re-attended and passed the Basic Food Hygiene course. Eng’s Heritage has also assigned another trained Food Hygiene Officer<sup>[1]</sup> (FHO) to replace their previous FHO.<br>&nbsp;<br><strong>Continuing Surveillance</strong><br><br>&nbsp;6&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Following the lifting of suspension, SFA will continue to place Eng’s Heritage at Northpoint City under close surveillance to ensure that it adheres to food safety requirements.<br><br><strong>Public Advisory</strong><br><br>&nbsp;7&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Members of the public are advised to seek medical attention early if they experience any gastroenteritis symptoms (i.e., diarrhoea, vomiting, fever or abdominal pain).<br><br>&nbsp;8&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; To prevent the spread of disease and protect oneself from acquiring infections, individuals should practise good personal hygiene at all times. These include:<br><br>&nbsp; &nbsp;• Washing hands with soap and water before eating and after going to the toilet;<br>&nbsp; &nbsp;•&nbsp; Covering mouth and nose with a tissue when coughing or sneezing, and throwing the tissue away into a bin immediately; and<br>&nbsp; &nbsp;•&nbsp;Not sharing food/drinks, eating utensils, toothbrushes or towels with others.<br><br>&nbsp;9&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; In the interest of maintaining a high standard of food hygiene at all eating establishments, we would also like to advise members of the public who come across poor hygiene practices in food establishments not to patronise such outlets but to report to SFA via the online feedback form (<a href=\"http://www.sfa.gov.sg/feedback\" title=\"\" class=\"\" target=\"\">www.sfa.gov.sg/feedback</a>) with details for our follow-up investigations.<br><br>&nbsp;<br><strong>MINISTRY OF HEALTH<br>SINGAPORE FOOD AGENCY<br>27 FEBRUARY 2021</strong><br><br><sup>[1]&nbsp;</sup>Under the enhanced Food Hygiene Officer (FHO) scheme announced in December 2018, if the licence of a food establishment is suspended, all its Food Hygiene Officers are required to re-attend the WSQ Conduct Food and Beverage Hygiene Audit course, and the premises must have a trained FHO before it resumes operations.</p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "suspension-of-eng-s-heritage-(930-yishun-ave-2-b1-51-northpoint-city)-lifted-after-meeting-required-standards", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}