{"pressItemDictionary": {"Press Releases": [{"Title": "Updates On Vaccination Records", "PublishedDate": "/Date(1626340920000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "15 Jul 2021", "Summary": "", "MainContent": "<p style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 16px;\">1.&nbsp; &nbsp;We have made good progress in our national COVID-19 vaccination programme thus far. As of 14 July 2021, we have administered around 6.5 million doses of COVID-19 vaccine. Around 4 million individuals have received at least the first dose of the vaccine, of whom about 2.4 million have completed the full vaccination regimen.</span></p> <p style=\"text-align: justify;\"><strong style=\"font-family: Arial; font-size: 16px;\">Updates of Vaccination Records for Singapore Citizens, Permanent Residents or Long-Term Pass Holders Vaccinated Overseas</strong><br></p> <p style=\"margin-left: 0in; text-align: justify;\"><span style=\"font-size: 16px; font-family: Arial;\">2.&nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 16px; text-align: left;\">As vaccinations grow in availability worldwide, there are also many Singapore Citizens, Permanent Residents, and Long-Term Pass Holders who have returned from overseas with vaccinations done abroad and would like their vaccination records updated in Singapore.</span></p><p><p><span style=\"font-size: 16px; font-family: Arial;\">3.&nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">From 14 July 2021, such individuals who have received COVID-19 vaccinations overseas with COVID-19 vaccines </span><span style=\"font-family: Arial; font-size: 16px;\">authorised by the Heath Sciences Authority under the Pandemic Special Access Route (PSAR)[1] or&nbsp;listed on the World Health Organization’s Emergency Use Listing (WHO EUL) can have their vaccination records updated in the National Immunisation Registry when they return to Singapore. To do so, they should have documentation to show proof of their overseas vaccination and a positive serology test result in Singapore. The positive serology test provides an additional means to validate the vaccination status of an individual by detecting that antibodies have been mounted against the virus.</span></p></p><p><p><span style=\"font-size: 16px; font-family: Arial;\">4.&nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">To update their vaccination records in Singapore, individuals canvisit a private healthcare provider onboard this initiative[2] with</span><span style=\"font-family: Arial; font-size: 16px;\">&nbsp;their overseas COVID-19 vaccination documentation. Upon positive serology test result, the individual’s vaccination records will subsequently be reflected on HealthHub after a few days. For Singapore residents who received their COVID-19 vaccination in Singapore, serology testing is not required.</span></p></p><p><p><strong style=\"font-family: Arial; font-size: 16px;\">Keeping our Community Safe</strong><br></p><p><span style=\"font-size: 16px; font-family: Arial;\">5.&nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">Vaccination remains a key enabler in our fight against COVID-19 and its ability to help Singapore re-open safely can only be felt when we can collectively achieve a high level of population coverage for vaccination. We encourage those who still have not done so, to register their interest via vaccine.gov.sg and book their vaccinations and get vaccinated.</span></p></p> <p style=\"margin-left: 0in; text-align: justify;\">&nbsp;</p> <div style=\"padding: 0in 0in 1pt; border-top: none; border-right: none; border-bottom-width: 1pt; border-bottom-style: solid; border-left: none;\"> <p style=\"padding: 0in; border: none;\"><span style=\"font-size: 16px; font-family: Arial;\"><strong>MINISTRY OF HEALTH</strong></span></p> </div><span style=\"font-size: 16px; font-family: Arial;\"> <strong>15 JULY 2021</strong> </span><div><span style=\"font-size: 16px; font-family: Arial;\"><br clear=\"all\"> </span><hr align=\"left\" size=\"1\" width=\"33%\"> <div id=\"ftn1\"> <p><span style=\"font-size: 16px; font-family: Arial;\">[1] PSAR approved vaccines are Pfizer-BioNTech/Comirnaty and Moderna vaccines</span></p> </div> <div id=\"ftn2\"> <p style=\"text-align: justify;\"><span style=\"font-size: 16px; font-family: Arial;\">[2] Details on the providers can be found at: <a href=\"https://www.moh.gov.sg/covid-19/vaccination/faqs/faqs---post-vaccination-matters\"><span style=\"color: black;\">https://www.moh.gov.sg/covid-19/vaccination/faqs/faqs---post-vaccination-matters</span></a></span></p> </div> </div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "updates-on-vaccination-records", "CurrentPageUrl": null}, {"Title": "42 New Cases of Locally Transmitted  Covid-19 Infection ", "PublishedDate": "/Date(1626336000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "15 Jul 2021", "Summary": "", "MainContent": "<p style=\"text-align: left;\"><span style=\"font-family: Arial; font-size: 16px;\">&nbsp; &nbsp; &nbsp;As of 15 July 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 42 new&nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">cases of locally transmitted COVID-19 infection, of which 33 belong to the KTV cluster.&nbsp;Of the 42 cases today, 17 are&nbsp;<span class=\"bumpedfont15\">linked to previous cases, and have already been placed on quarantine. 20 are linked to previous cases and were detected through surveillance. 5 are currently unlinked.</span></span></p><p style=\"text-align: left;\"><span style=\"font-size: 16px;\"><span style=\"font-family: Arial; font-size: 16px;\">2. &nbsp; </span><span style=\"font-family: Arial; font-size: 16px;\">In addition, there are 6 imported cases, who have already been placed on Stay-Home Notice (SHN) or isolated&nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">upon arrival in Singapore</span><span style=\"font-family: Arial; font-size: 16px;\">. 4 were detected upon arrival in Singapore, while 2 developed the illness during SHN or isolation.<br><br>3. &nbsp;&nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">In total, there are 48 new cases of COVID-19 infection in Singapore today.<br><br></span><span style=\"font-family: Arial; font-size: 16px;\">4. &nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;<br><br></span><strong style=\"font-family: Arial;\">MINISTRY OF HEALTH<br></strong></span><strong><span style=\"font-size: 12pt; font-family: Arial;\">15 JULY 2021</span></strong></p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "42-new-cases-of-locally-transmitted-covid-19-infection_15July2021", "CurrentPageUrl": null}, {"Title": "Bringing Covid-19 Vaccination to the Heartlands for Seniors", "PublishedDate": "/Date(1626332400000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "15 Jul 2021", "Summary": "", "MainContent": "<span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The government will be intensifying our outreach to encourage the rest of our seniors to be vaccinated. This is critical as seniors are the most vulnerable group and at higher risk of becoming dangerously ill if infected with COVID-19. With age and possibly underlying health conditions, their immune system is weaker. Without vaccination, they may not be able to fight off the virus.&nbsp;<br><br>2.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp; Currently about 7 in 10 seniors aged 70 and above have completed at least their first vaccination dose.&nbsp; To enhance convenience for seniors, the Ministry of Health (MOH) will launch up to 10 mobile vaccination teams to the heartlands. These mobile vaccination teams will be deployed at locations near where many seniors live, such as at selected Community Clubs/Centres (CCs) that are not already being used as Vaccination Centres, or at the Residents’ Committee centres at residential blocks. The mobile vaccination team deployment will be done in phases, and has started with Anchorvale CC on 7 July 2021. It will be progressively deployed at Kallang, Whampoa, Changi Simei and Paya Lebar Kovan CCs in the coming weeks.&nbsp;<br><br>3. &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;The mobile vaccination teams will be deployed at each location for a few days to a week, before moving to other locations, and returning to the original location to administer the second vaccination dose. This is to ensure that those who had receive the first dose will get their second dose at the same location.&nbsp;<br><br>4.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp; The deployment location and schedule of the mobile vaccination teams in are as follows:<br><br></span><table><tbody><tr><td><span style=\"font-size: 16px;\">&nbsp;<strong>Date (for 1</strong><strong><sup>st</sup></strong><strong>&nbsp;dose)</strong></span></td><td><span style=\"font-size: 16px;\"><strong>Location</strong>&nbsp;</span></td></tr><tr><td><span style=\"font-size: 16px;\">&nbsp;7 July to 13 July</span></td><td><span style=\"font-size: 16px;\">&nbsp;Anchorvale CC</span></td></tr><tr><td><span style=\"font-size: 16px;\">&nbsp;14 July to 21 July</span><div><span style=\"font-size: 16px;\">(closed on 20 July for Hari Raya Haji)</span></div></td><td><span style=\"font-size: 16px;\">&nbsp;Kallang CC<br>&nbsp;Whampoa CC</span></td></tr><tr><td><span style=\"font-size: 16px;\">&nbsp;22 July to 28 July</span></td><td><span style=\"font-size: 16px;\">&nbsp;Changi Simei CC</span></td></tr><tr><td><span style=\"font-size: 16px;\">&nbsp;29 July to 4 August</span></td><td><span style=\"font-size: 16px;\">&nbsp;Paya Lebar Kovan CC</span></td></tr></tbody></table><span style=\"font-size: 16px;\"><br>5. &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;&nbsp;MOH will also call on our primary care providers, including private general practitioners and polyclinics, to help in this national effort. First, we will expand the number of Public Health Preparedness Clinics (PHPCs) providing COVID-19 vaccination as part of the national vaccination programme, starting with Bedok, Bukit Merah, Hougang and Tampines in the coming weeks. All primary care providers have also been called on to help persuade seniors who are their regular patients, to go for their COVID-19 vaccination if they have not done so yet.<br><br>6. &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;&nbsp;Staff and volunteers from the PA and AIC’s outreach arm, Silver Generation Office (SGO) will also intensify their ground outreach efforts. They will reach out to the unvaccinated seniors through house visits and engagement dialogues to address any queries or concerns they might have. They will also provide advice on the nearest vaccination locations and assist those who require help in getting to the vaccination centres, or arrange for them to be vaccinated at home if they are homebound.<br><br>7. &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;&nbsp;We strongly urge seniors to be vaccinated by these mobile vaccination teams as they are deployed to a location near to them, to protect themselves, their senior friends and their loved ones. Seniors aged 60 years old and above may also walk into any of the existing Vaccination Centres with their Identity Card to receive their first dose of vaccination, without any prior appointment needed, or visit their doctors at any of the participating PHPCs or polyclinics. Homebound persons can also directly request to receive their vaccination at home, by calling the SGO hotline at 1800-650-6060. To target this service to seniors who really need it, this service will be strictly reserved for those who are homebound.<br><br>8. &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;&nbsp;Vaccination remains a key enabler in our fight against COVID-19. Together, we can help Singapore to re-open safely if we each contribute to achieve a high level of population vaccination coverage. We encourage all who have yet to be vaccinated, to register your interest via&nbsp;<a href=\"http://vaccine.gov.sg/\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?q=http://vaccine.gov.sg&amp;source=gmail&amp;ust=1626419897222000&amp;usg=AFQjCNHIqjAWCNrnUXSjEZQcugVLO2aDBw\" title=\"\" class=\"\">vaccine.gov.sg</a>&nbsp;and book your appointment to get vaccinated. &nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>15 JULY 2021</strong></span>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "bringing-covid-19-vaccination-to-the-heartlands-for-seniors", "CurrentPageUrl": null}, {"Title": "Concord International Hospital to Resume Provision of Healthcare Services", "PublishedDate": "/Date(1626278400000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "15 Jul 2021", "Summary": "", "MainContent": "The Ministry of Health (MOH) has approved the resumption of healthcare services by Concord International Hospital (19 Adam Road) as a licensed acute hospital under the Private Hospitals and Medical Clinics (PHMC) Act.<br><br>2. Concord International Hospital was ordered to temporarily stop the provision of all healthcare services from 19 December 2020, following the detection of significant regulatory lapses. These included multiple life-saving/ patient use equipment and medications that were either not maintained or not available in the critical areas of the hospital such as the Intensive Care Unit and the Operating Theatre. There was also a lack of infection control processes generally in the hospital and quality control processes in the laboratory, which posed significant risks to patient safety and well-being.<br><br>3. Since 19 December 2020, MOH has worked closely with the hospital to review the lapses and processes. The hospital has since taken steps to address the lapses.<br><br>4. Subsequent inspections conducted by MOH showed that the hospital has met the licensing requirements under the PHMC Act. This includes having the necessary equipment and facilities (including critical emergency equipment and facilities) at all clinical areas, quality control checks for clinical laboratory facilities, preventive maintenance performed for all equipment and proper infection prevention and control practices in place. The hospital was also assessed to have put in place appropriate follow-up actions to ensure safe and proper provision of care to patients prior to resumption of operations.<br><br>5. As Concord International Hospital has fully addressed the regulatory lapses and met the licensing requirements, it has received approval to resume the provision of healthcare services, with effect from 16 June 2021. The licence for the hospital is for a period of two years. The hospital has informed MOH that it is planning for re-opening at the same premises under a new name.<br><br>6. Patient safety is of utmost priority. All private and public sector healthcare facilities, including hospitals, clinics, nursing homes and clinical laboratories currently licensed under the PHMC Act, are reminded to fully comply with the Act at all times, and ensure that safety and quality of clinical care are met at all times.<br><br>7. All licensed premises are subject to regular and adhoc inspections and audits to ensure compliance to the Act. MOH will not hesitate to take enforcement action against healthcare facilities that fail to comply with the relevant regulatory requirements, which may include a fine of up to $20,000 and/or a revocation of the licence.", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "concord-international-hospital-to-resume-provision-of-healthcare-services", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}