{"pressItemDictionary": {"Press Releases": [{"Title": "Community Surveillance Testing At Sims Avenue", "PublishedDate": "/Date(1626928200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "22 Jul 2021", "Summary": "", "MainContent": "<p align=\"center\" style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 16px; text-align: left;\">&nbsp; &nbsp; &nbsp; The Ministry of Health (MOH) is investigating likely COVID-19 transmission at 842, 844, 846 and 848 Sims Avenue,&nbsp;which are located near Geylang Serai Market. COVID-19 viral fragments have been detected in wastewater samples collected from the blocks.&nbsp;Epidemiological investigations are ongoing to determine linkages and the source of transmission.<br><br></span><span style=\"font-family: Arial; font-size: 16px;\">2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;In&nbsp;order to quickly uncover community infection cases, MOH&nbsp;will conduct mandatory&nbsp;COVID-19&nbsp;testing for all residents at 842, 844, 846 and 848 Sims Avenue; as well as owners and staff of commercial units at the same blocks.&nbsp;Testing is optional for those who have tested negative for COVID-19 infection from 17 July onwards.&nbsp;Mandatory testing will be conducted at the pavilion at 3 Geylang Serai from 22 July to 23 July 2021 between 9am and 4pm.&nbsp;In the event that a positive&nbsp;COVID-19&nbsp;case is detected, MOH will isolate the case, identify all close contacts, test and quarantine them to protect the community from further transmission.<br><br></span><span style=\"font-family: Arial; font-size: 16px;\">3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;To detect possible asymptomatic cases in the community, MOH will also conduct voluntary COVID-19 testing for visitors and those who have interacted with residents at&nbsp;842, 844, 846 and 848 Sims Avenuebetween 6 July and 20 July 2021. We encourage these individuals to come forward for testing.&nbsp;Testing will be conducted by appointment only at designated Regional Screening Centres from 22 July&nbsp;to 24 July 2021 and at the pavilion at 3 Geylang Serai from 23 July to 24 July 2021,&nbsp;between 9am and 4pm.&nbsp;To book an appointment and for information on the alternate test locations, please visit&nbsp;</span><a href=\"https://file.go.gov.sg/sims-ave-appt.pdf\" title=\"\" class=\"\" target=\"\" style=\"font-family: Arial; font-size: 16px;\"></a><a href=\"https://go.gov.sg/sims-ave-appt\" style=\"font-family: Arial; font-size: 16px;\">https://go.gov.sg/sims-ave-appt</a><span style=\"font-family: Arial; font-size: 16px;\">&nbsp;or call 1800 333 9999 if you have any queries.&nbsp;<br><br></span><span style=\"font-family: Arial; font-size: 16px;\">4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;All residents are to bring along their NRIC for identification purposes.</span><strong style=\"font-family: Arial; font-size: 16px;\">&nbsp;</strong><span style=\"font-family: Arial; font-size: 16px;\">Leaflets have been distributed and SMS notifications have been sent to the residents to provide them with more information. Residents are reminded to keep to their appointment time. Residents are also advised to monitor their health closely and consult a doctor immediately if they feel unwell. Those who are still awaiting their test results are advised to minimise social interactions as much as possible. They should continue to monitor their health and seek immediate medical attention if they feel unwell.<br><br></span><strong style=\"font-family: Arial; font-size: 16px;\">MINISTRY OF HEALTH&nbsp;<br></strong><strong><span style=\"font-family: Arial; font-size: 16px;\">22 JULY 2021</span></strong></p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "community-surveillance-testing-at-sims-avenue_22July2021", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}