{"pressItemDictionary": {"Press Releases": [{"Title": " Community Surveillance Testing At  695 Jurong West Central 1 ", "PublishedDate": "/Date(1629108900000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "16 Aug 2021", "Summary": "", "MainContent": "<p class=\"Default\" style=\"font-size: medium; text-align: justify;\"><span style=\"font-family: Arial;\">&nbsp; &nbsp; &nbsp; The Ministry of Health (MOH)&nbsp;is investigating likely COVID-19 transmission at 695 Jurong West Central 1. So far,&nbsp;14 cases of COVID-19 infection have been detected in six households at 695 Jurong West Central 1.<span>Epidemiological investigations are ongoing to determine linkages and the source of transmission.<br><br>2. &nbsp; &nbsp;</span></span><span style=\"text-align: left; font-size: 16px; font-family: Arial;\">In&nbsp;</span><span style=\"text-align: left; font-size: 16px; font-family: Arial;\">order to uncover community infection cases, MOH will conduct&nbsp;</span><span style=\"text-align: left; font-size: 16px; font-family: Arial;\">mandatory&nbsp;</span><span style=\"text-align: left; font-size: 16px; font-family: Arial;\">COVID-19&nbsp;</span><span style=\"text-align: left; font-size: 16px; font-family: Arial;\">testing for all residents of 695 Jurong West Central 1. Testing is optional for those who have tested negative for COVID-19 infection from 13 August onwards. Mandatory testing will be conducted on 17 August 2021 between 9am to 4pm at the void deck of 695 Jurong West Central 1.&nbsp;<br><br>3. &nbsp; &nbsp;&nbsp;</span><span style=\"font-family: Arial; font-size: 16px; text-align: left;\">All residents are to bring along their NRIC for identification purposes. Leaflets have been distributed and SMS notifications have been sent to the residents to provide them with more information. Residents are reminded to keep to their appointment time. Residents are also advised to monitor their health closely and consult a doctor immediately if they feel unwell. Those who are still awaiting their test results are advised to minimise social interactions as much as possible. They should continue to monitor their health and seek immediate medical attention if they feel unwell.<br><br></span><strong style=\"font-family: Arial; font-size: 16px; text-align: left;\">MINISTRY OF HEALTH&nbsp;<br></strong><strong style=\"font-size: 16px; text-align: left;\"><span style=\"font-family: Arial;\">16 AUGUST 2021</span></strong></p><p><strong><span style=\"font-size: 12pt; font-family: Arial, sans-serif;\">&nbsp;</span></strong></p><p>&nbsp;</p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "community-surveillance-testing-at-695-jurong-west-central-1_16August2021", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}, {"Title": "Vaccination-differentiated Approach for Visitors At All Hospitals", "PublishedDate": "/Date(1629105000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "16 Aug 2021", "Summary": "", "MainContent": "To protect hospital patients from COVID-19 infection, a vaccination-differentiated visitation approach for hospital wards will be implemented at all hospitals from 19 August 2021 to further reduce importation risk of COVID-19 into our hospitals. This would also help to safeguard hospital capacity as Singapore transitions into a COVID-19 resilient nation. The measures complement existing measures, namely routine testing for hospital staff and admitted patients, which had been implemented from May 2021, and the Vaccinate or Regular Test regime for hospital staff which will come into effect from 1 October 2021.<br><br>2. To reduce the risk of COVID-19 clusters in the hospitals, the current visitation duration of 30 minutes will be maintained for all visitors, regardless of vaccination status. Each patient can register up to two visitors for each admission. Each patient can receive up to two visits per day and only one visitor is allowed at the bedside.&nbsp; Patients who are very ill will be allowed five registered patients with two visitors allowed at the bedside. Exception will be given to visitors of the following patient groups to extend their visit beyond 30 minutes<sup>1</sup>, on a conditional, case-by-case basis, as assessed by the hospital:<br><br>a. Paediatric patients;<br>b. Birthing/post-partum mothers; and<br>c. Patients requiring additional care support from care givers.&nbsp; For example, assistance of inpatients who have mental incapacities, visitors involved in caregiver training, etc.<br><br>3. Fully vaccinated<sup>2</sup> visitors as well as persons who have recovered from COVID-19 and have a valid Pre-Event Test (PET) exemption notice<sup>3</sup> will be able to enter the hospital wards without the need for a pre-visit COVID-19 test from 19 August 2021. Vaccinated visitors will be required to show their vaccination status on HealthHub or the TraceTogether app as proof of vaccination. Screenshots will not be allowed.<br><br>4. Partially vaccinated individuals have not attained sufficient immune protection from COVID-19 vaccination and will be at risk for being infected, or may infect hospital patients when they visit their loved ones. From 1 October 2021, they will be required to show a negative pre-visit COVID-19 test result before being allowed to visit the hospital wards. Between now and 30 September 2021, they will be temporarily exempted from the testing requirement.&nbsp;<br><br>5. Unvaccinated visitors should ensure they obtain a self-paid pre-visit COVID-19 test prior to visiting the hospital wards. They will not be allowed to enter hospital wards unless they can show a valid negative antigen rapid test (ART) or polymerase chain reaction (PCR) test result obtained within the last 24 hours of the visit, as administered or supervised by Ministry of Health (MOH)-approved COVID-19 test providers<sup>4</sup> (including employer directed tests performed at the Quick Test Centres).<br><br>6. Pre-visit COVID-19 testing can be done at any MOH-approved ART provider<sup>5</sup>.&nbsp; From 1 September 2021, hospitals may also assist unvaccinated visitors to make advanced testing arrangement for pre-visit test at the Quick Test Centres (QTCs). The date and time of the appointment slot will be dependent on the daily availability of slots at the respective QTCs. Visitors will need to pay for the pre-visit tests.<br><br>7. Visitors who are unwell or symptomatic should not visit patients in hospital wards, regardless of their vaccination status.<br><br>8. Under exceptional and time-sensitive situations, such as visiting patients with sudden life-threatening conditions, unexpected child birth/delivery, individuals or elderly with severe physical limitations which restrict their access to pre-visit testing providers, hospitals may exercise discretion to assist unvaccinated visitors with ART testing on a case-by-case basis.<br><br>9. MOH will calibrate the visitor management measures regularly and we seek the understanding of all visitors, as the measures will protect the patients and reduce the risk of COVID-19 transmission in our hospitals.<br><div><br>[1] Visitors who are allowed to extend their visit beyond 30 minutes will be required to obtain a valid negative COVID-19 test result regardless of their vaccination status.<br><br>[2] An individual is considered fully vaccinated two weeks after he or she has received the full regimen of Pfizer-BioNTech/ Comirnaty, Moderna, Sinovac (if contraindicated for the PSAR vaccines) or WHO EUL vaccines. Unvaccinated individuals who have recovered from COVID-19 within the last 270 days will also be exempted from pre-visit test.<br><br>[3] Recovered individuals (within last 270 days) can obtain a PET Exemption Notice from any clinic offering ART or PCR testing services.<br><div><br></div>[4] Negative results obtained from self-administered ART test and self-administered ART test performed under supervision by parties other than MOH-approved COVID-19 test providers are not recognised for pre-visit testing.<br><br>[5] Please refer to go.gov.sg/swabproviders for the updated list of MOH-approved providers. Visitors should contact the clinic to confirm that they provide self-paid ART tests before visiting the clinic.<br></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "vaccination-differentiated-approach-for-visitors-at-all-hospitals", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}, {"Title": "  48 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1629103500000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "16 Aug 2021", "Summary": "<br>", "MainContent": "<span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp; As of 16 August 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 48 new cases of locally transmitted COVID-19 infection. 32 are linked to previous cases, and have already been placed on quarantine. 7 are linked to previous cases and were detected through surveillance. 9 are currently unlinked.&nbsp;<br><br>2.&nbsp; &nbsp; &nbsp;In addition, there are 5 imported cases, who have already been placed on Stay-Home Notice (SHN) or isolated upon arrival in Singapore. All were detected upon arrival in Singapore.<br><br>3.&nbsp; &nbsp; &nbsp; In total, there are 53 new cases of COVID-19 infection in Singapore today.<br><br>4.&nbsp; &nbsp; &nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>16 AUGUST 2021</strong></span>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "48-new-cases-of-locally-transmitted-covid-19-infection_16August2021", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}, {"Title": "Positive Progress for 16-year-old Who Had An Out-of-hospital Cardiac Arrest After Covid-19 Vaccination", "PublishedDate": "/Date(1629097200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "16 Aug 2021", "Summary": "", "MainContent": "<p style=\"color: rgb(34, 34, 34); margin: 0in; font-size: 11pt; font-family: Calibri, sans-serif;\"><span style=\"font-family: Arial; font-size: 16px;\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The 16-year-old male youth who had an out-of-hospital cardiac arrest six days after receiving his first dose of COVID-19 vaccine on 27 June 2021, and had required intensive care, is recovering steadily and currently undergoing inpatient rehabilitation. He is making good progress and can perform his activities of daily living without assistance. He will likely be discharged in the coming weeks, but will likely require outpatient rehabilitation for some time before he can return to school and resume other activities. The medical team will continue his treatment and monitor his condition.</span></p><p style=\"color: rgb(34, 34, 34); margin: 0in; font-size: 11pt; font-family: Calibri, sans-serif;\"><span style=\"font-size: 16px;\"><span style=\"font-family: Arial;\">&nbsp;</span></span></p><p style=\"color: rgb(34, 34, 34); margin: 0in; font-size: 11pt; font-family: Calibri, sans-serif;\"><span style=\"font-size: 16px;\"><span style=\"font-family: Arial;\">2.&nbsp; &nbsp; &nbsp;Medical investigations have found that the youth had developed acute severe myocarditis which led to the out-of-hospital cardiac arrest. The myocarditis was likely a serious adverse event arising from the COVID-19 vaccine he received, which might have been aggravated by his strenuous lifting of weights and his high consumption of caffeine through energy drinks and supplements.</span></span></p><p style=\"color: rgb(34, 34, 34); margin: 0in; font-size: 11pt; font-family: Calibri, sans-serif;\"><span style=\"font-size: 16px;\"><span style=\"font-family: Arial;\">&nbsp;</span></span></p><p style=\"color: rgb(34, 34, 34); margin: 0in; font-size: 11pt; font-family: Calibri, sans-serif;\"><span style=\"font-size: 16px;\"><span style=\"font-family: Arial;\">3.&nbsp; &nbsp; Under the Vaccine Injury Financial Assistance Programme (VIFAP) provided by the Ministry of Health (MOH), a one-time financial assistance of $225,000 has been extended to the youth and his family. The independent clinical panel appointed to assess and adjudicate the VIFAP application found that while he has made good improvement, because his condition was severe and critical, he will require treatment and rehabilitation for some time yet to continue his recovery.</span></span></p><p style=\"color: rgb(34, 34, 34); margin: 0in; font-size: 11pt; font-family: Calibri, sans-serif;\"><span style=\"font-size: 16px;\"><span style=\"font-family: Arial;\">&nbsp;</span></span></p><p style=\"color: rgb(34, 34, 34); margin: 0in; font-size: 11pt; font-family: Calibri, sans-serif;\"><span style=\"font-size: 16px;\"><span style=\"font-family: Arial;\"><span style=\"text-decoration: underline;\">Continue to avoid strenuous physical activity for one week after each dose</span></span></span></p><p style=\"color: rgb(34, 34, 34); margin: 0in; font-size: 11pt; font-family: Calibri, sans-serif;\"><span style=\"font-size: 16px;\"><span style=\"font-family: Arial;\">&nbsp;</span></span></p><p style=\"color: rgb(34, 34, 34); margin: 0in; font-size: 11pt; font-family: Calibri, sans-serif;\"><span style=\"font-size: 16px;\"><span style=\"font-family: Arial;\">4.&nbsp; &nbsp; &nbsp;While there is a small increased risk of myocarditis or pericarditis following the administration of the vaccines, the local incidence rate remains low at 0.48 per 100,000 doses administered, based on ongoing pharmacovigilance monitoring by the Health Sciences Authority (HSA). The majority have responded well to treatment and have recovered or been discharged well from the hospital.</span></span></p><p style=\"color: rgb(34, 34, 34); margin: 0in; font-size: 11pt; font-family: Calibri, sans-serif;\"><span style=\"font-size: 16px;\"><span style=\"font-family: Arial;\">&nbsp;</span></span></p><p style=\"color: rgb(34, 34, 34); margin: 0in; font-size: 11pt; font-family: Calibri, sans-serif;\"><span style=\"font-size: 16px;\"><span style=\"font-family: Arial;\">5.&nbsp; &nbsp; &nbsp;As a precaution, all vaccine recipients, especially adolescents and younger men, should avoid strenuous physical activity for one week following each of their first and second doses of the vaccine. Individuals should also seek medical attention promptly if they develop chest pain, shortness of breath or abnormal heartbeats. Individuals who developed myocarditis from their first dose of the mRNA COVID-19 vaccines should also not receive further doses of it.</span></span></p><p style=\"color: rgb(34, 34, 34); margin: 0in; font-size: 11pt; font-family: Calibri, sans-serif;\"><span style=\"font-size: 16px;\"><span style=\"font-family: Arial;\">&nbsp;</span></span></p><p style=\"color: rgb(34, 34, 34); margin: 0in; font-size: 11pt; font-family: Calibri, sans-serif;\"><span style=\"font-size: 16px;\"><span style=\"font-family: Arial;\">6.&nbsp; &nbsp; &nbsp;Vaccination using the Pandemic Special Access Route (PSAR)-authorised mRNA COVID-19 vaccines deployed in our National Vaccination Programme (NVP) thus continues to be recommended for all eligible persons, including adolescents and younger men, as the protective benefits from the mRNA COVID-19 vaccines continue to outweigh the risks of vaccination.</span></span></p><p style=\"color: rgb(34, 34, 34); margin: 0in; font-size: 11pt; font-family: Calibri, sans-serif;\"><span style=\"font-size: 16px;\"><span style=\"font-family: Arial;\">&nbsp;</span></span></p><p style=\"color: rgb(34, 34, 34); margin: 0in; font-size: 11pt; font-family: Calibri, sans-serif;\"><span style=\"font-size: 16px;\"><span style=\"font-family: Arial;\">7.&nbsp; &nbsp; &nbsp;MOH, the Expert Committee on COVID-19 Vaccination and HSA will continue to monitor vaccine-related serious adverse events closely.</span></span></p><p style=\"color: rgb(34, 34, 34); margin: 0in; font-size: 11pt; font-family: Calibri, sans-serif;\"><span style=\"font-size: 16px;\"><span style=\"font-family: Arial;\">&nbsp;</span></span></p><p style=\"color: rgb(34, 34, 34); margin: 0in; font-size: 11pt; font-family: Calibri, sans-serif;\"><span style=\"font-size: 16px;\"><span style=\"font-family: Arial;\">&nbsp;</span></span></p><p style=\"color: rgb(34, 34, 34); margin: 0in; font-size: 11pt; font-family: Calibri, sans-serif;\"><span style=\"font-size: 16px;\"><span style=\"font-family: Arial;\"><strong>MINISTRY OF HEALTH</strong></span></span></p><p style=\"color: rgb(34, 34, 34); margin: 0in; font-size: 11pt; font-family: Calibri, sans-serif;\"><span style=\"font-family: Arial; font-size: 16px;\"><strong>16 AUGUST 2021</strong></span></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "positive-progress-for-16-year-old-who-had-an-out-of-hospital-cardiac-arrest-after-covid-19-vaccination", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}