{"pressItemDictionary": {"Press Releases": [{"Title": "22 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1621698000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "22 May 2021", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As of 22 May 2021, 12pm, the Ministry of Health (MOH) has confirmed and verified that there are 22 new cases of locally transmitted COVID-19 infection. 15 are linked to previous cases<sup>[1]</sup>, amongst which 12 have already been placed on quarantine. The remaining 7 are currently unlinked. The cases are in the community, and there are no new cases in the dormitories. There are 7 imported cases, who had already been placed on Stay-Home Notice (SHN) or isolated upon arrival in Singapore. Amongst the new cases today, 9 are asymptomatic, and were detected from our proactive screening and surveillance, while 20 were symptomatic.&nbsp;</p><p><strong>Summary of new cases</strong><br></p> <table border=\"1\" cellspacing=\"0\" cellpadding=\"0\" width=\"605\"> <tbody><tr> <td width=\"129\"> <p align=\"right\">&nbsp;</p> </td> <td width=\"60\"> <p>&nbsp;</p> </td> <td width=\"16\" valign=\"top\"> <p>&nbsp;</p> </td> <td width=\"192\" colspan=\"2\"> <p align=\"center\"><strong>Breakdown by</strong></p> </td> <td width=\"16\" valign=\"top\"> <p>&nbsp;</p> </td> <td width=\"192\" colspan=\"2\"> <p align=\"center\"><strong>Breakdown by</strong></p> </td> </tr> <tr> <td width=\"129\"> <p align=\"right\">&nbsp;</p> </td> <td width=\"60\"> <p><strong>Number of cases</strong></p> </td> <td width=\"16\" valign=\"top\"> <p>&nbsp;</p> </td> <td width=\"96\"> <p><strong>Already in quarantine/ isolation before detection</strong></p> </td> <td width=\"96\"> <p><strong>Detected from surveillance</strong></p> </td> <td width=\"16\" valign=\"top\"> <p>&nbsp;</p> </td> <td width=\"96\"> <p><strong>Symptomatic</strong></p> </td> <td width=\"96\"> <p><strong>Asymptomatic</strong></p> </td> </tr> <tr> <td width=\"129\"> <p><strong>Cases in the community</strong></p> </td> <td width=\"60\"> <p align=\"center\">22</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">12</p> </td> <td width=\"96\"> <p align=\"center\">10</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">20</p> </td> <td width=\"96\"> <p align=\"center\">2</p> </td> </tr> <tr> <td width=\"129\"> <p><strong>Cases residing in dormitories</strong></p> </td> <td width=\"60\"> <p align=\"center\">0</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">0</p> </td> <td width=\"96\"> <p align=\"center\">0</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">0</p> </td> <td width=\"96\"> <p align=\"center\">0</p> </td> </tr> <tr> <td width=\"129\"> <p><strong>Imported cases</strong></p> </td> <td width=\"60\"> <p align=\"center\">7</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">7</p> </td> <td width=\"96\"> <p align=\"center\">0</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">0</p> </td> <td width=\"96\"> <p align=\"center\">7</p> </td> </tr> <tr> <td width=\"129\"> <p><strong>Total</strong></p> </td> <td width=\"60\"> <p align=\"center\">29</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">&nbsp;</p> </td> </tr> </tbody></table> <p><br>2.&nbsp; &nbsp; &nbsp; Overall, the number of new cases in the community has increased from 103 cases in the week before to 199 cases in the past week. The number of unlinked cases in the community has also increased from 14 cases in the week before to 61 cases in the past week. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br></p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Amongst the 263 confirmed cases reported from 16 May to 22 May, 35 cases have tested positive for their serology tests, 113 have tested negative, and 115 serology test results are pending.<br></p><p><strong>Case Details<br></strong></p><p><strong>a)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Cases in the community: 22</strong><br></p><p>There are 22 cases in the community today, of whom 15 are linked to previous cases and 7 are currently unlinked.<br></p><p><strong>Currently unlinked cases</strong><br></p><p>Detected through surveillance:<br></p><p><u>Case 63568</u>&nbsp;is a 47 year-old male Malaysia national who is currently unemployed. He was detected when he was tested on 19 May as part of our Rostered Routine Testing (RRT) of migrant workers. On 20 May, he developed a runny nose but did not seek medical attention. His RRT result came back positive for COVID-19 infection on 21 May. His earlier tests from RRT – the last being on 5 May – were all negative for COVID-19 infection. His serology test result is negative.<br></p><p><u>Case 63575</u>&nbsp;is a 58 year-old male Singaporean who works at Assalaamu’alaikum Enterprise Pte Ltd but has been working from home. He developed a fever and cough on 13 May, but did not seek medical treatment until 20 May when he went to Sengkang General Hospital for a medical consultation and was tested for COVID-19. His test result came back positive for COVID-19 infection on 21 May. His serology test result is pending.<br></p><p><u>Case 63580</u>&nbsp;is a 38 year-old male Singaporean who works as an online stocks trader. He developed a runny nose on 17 May, fever on 18 May, cough on 19 May and loss of taste on 20 May. He sought medical treatment at a polyclinic on 20 May, where he was tested for COVID-19. His test result came back positive for COVID-19 infection on 21 May. His serology test result is pending.<br></p><p><u>Case 63582</u>&nbsp;is a 41 year-old female China national who is a production worker at Baxter Healthcare SA Singapore Branch. She developed a fever, cough, sore throat, runny nose and headache on 14 May and sought medical treatment on 16 May. She was given 5 days of medical leave but was not tested for COVID-19. Her symptoms worsened, and she sought medical treatment at another General Practitioner (GP) clinic on 19 May, where she was tested for COVID-19. Her test result came back positive for COVID-19 infection on 21 May. Her serology test result is pending.<br></p><p><u>Case 63588</u>&nbsp;is a 30 year-old male Singaporean who works as an engineer at Sembcorp Marine. He is asymptomatic, and was detected when he went for a COVID-19 test on 21 May offered for those who had visited Westgate, as he had been at the mall recently. His test result came back positive for COVID-19 infection on 22 May. His serology test result is pending.<br></p><p><u>Case 63591</u>&nbsp;is a 54 year-old male Singaporean who works as a warehouse manager at Sony Electronics Pte Ltd. As he had visited Westgate recently, he went for a COVID-19 test on 21 May offered for those who had visited the mall. That night, he developed a fever. His test result came back positive for COVID-19 infection on 22 May. His serology test result is pending. Case 63591 received his first dose of COVID-19 vaccine on 30 April and the second dose on 21 May.<br></p><p><u>Case 63593</u>&nbsp;is a 24 year-old male Malaysia national who works as a kitchen assistant at Fun Toast (Westgate Tower). He developed anosmia on 19 May and sought medical treatment at a GP clinic on the same day, where he was tested for COVID-19. His test result came back positive for COVID-19 infection on 22 May. His serology test result is pending.<br></p><p><strong><br>Changi Airport Terminal 3 cluster</strong><br></p><p>Already quarantined:<br></p><p><u>Case 63586</u>&nbsp;is a 33 year-old female Philippines national who is a foreign domestic worker. She is a household contact of Case 62998<sup>[2]</sup>, and was placed on quarantine on 8 May. She was tested for COVID-19 on 14 May during quarantine and her test result was negative for COVID-19 infection. She was tested again on 21 May during quarantine, and her test result came back positive for COVID-19 infection on 22 May. On the same day, she developed a sore throat. Her serology test result is pending.<br></p><p>&nbsp;</p><p><strong>Sms Infocomm cluster</strong></p><p>Already quarantined:<br></p><p><u>Case 63571</u>&nbsp;is a 19 year-old male Singaporean who is a student at Singapore Polytechnic, and part-time food processor at SATS Food Services Pte Ltd. He had last gone to school on 14 May. He is a family member and household contact of Case 63462<sup>[3]</sup>. He developed a fever, cough, runny nose, headache and fatigue on 17 May and did not seek medical treatment. As he had been identified as a close contact of Case 63462, he was placed on quarantine on 19 May. He was detected when he was tested on 21 May during quarantine. His test result came back positive for COVID-19 infection on the same day. His serology test result is pending.<br></p><p><br>Detected through surveillance:<br></p><p><u>Case 63577</u>&nbsp;is a 35 year-old male Malaysia national who works as a factory operator at Sms Infocomm (Singapore) Pte Ltd and had last gone to work on 15 May. He is a family member and household contact of Case 63448<sup>[4]</sup> . He was tested for COVID-19 on 18 May and his ART came back positive on the same day. A PCR test administered on 19 May came back negative for COVID-19. He took a second PCR test on 20 May and his test result came back positive for COVID-19 infection on 21 May. He developed a fever the next day. His serology test result is pending.<br></p><p>&nbsp;</p><p><strong>Pacific Law Corporation cluster</strong></p><p>Already quarantined:<br></p><p><u>Case 63579</u>&nbsp;is a 50 year-old female Singaporean who works at Pacific Law Corporation. As she had been identified as a close contact of Case 63335<sup>[5]</sup>, she was placed on quarantine on 17 May. She developed a fever on 18 May but did not report her symptom. She was tested for COVID-19 on 20 May during quarantine and her test result came back positive for COVID-19 infection the next day. Her serology test result is negative for the N antigen, which suggests the presence of early infection. Case 63579 received her first dose of COVID-19 vaccine on 3 May.<br></p><p><strong><br>McDonald’s delivery riders cluster<sup> </sup></strong><sup>[6]</sup><br></p><p>Detected through surveillance:<br></p><p><u>Case 63569</u>&nbsp;is a 24 year-old male Malaysia national who works as a delivery rider for IVIC Logistic Pte Ltd and McDonald’s (Pasir Ris Elias Community Club). He is a household contact of Cases 63534 and 63535<sup>[7]</sup>. He felt fatigued on 17 May, and developed flu-like symptoms on 19 May but did not seek medical treatment. He was placed on leave of absence by his employer on 21 May and went for a COVID-19 test. He was detected when he tested positive for both his ART and PCR tests on 21 May. His serology test result is pending.<br></p><p><strong><br>Case 63357 cluster <sup>[8]</sup></strong><br></p><p>Already quarantined:<br></p><p><u>Case 63559</u>&nbsp;is a 30 year-old female Singaporean who is employed by Singapore General Hospital as a nurse deployed at the Tiong Bahru Community Nurse Post, and had last gone to work on 10 May. She is a family member of Case 63357, and was placed on quarantine on 16 May. She was tested for COVID-19 on 20 May during quarantine and her test result came back positive for COVID-19 infection on 21 May. On the same day, she developed a fever. Case 63559 received her first dose of COVID-19 vaccine on 11 March and the second dose on 1 April. Her serology test result is negative for the N antigen, which suggests the presence of early infection.<br></p><p><u>Case 63560</u>&nbsp;is a 2 year-old male Singaporean who is a student at My First Skool at 51 Fernvale Link. As he had been identified as a close contact of Case 63357, he was placed on quarantine on 16 May. He was tested for COVID-19 on 20 May during quarantine and his test result came back positive for COVID-19 the next day. On the same day, he developed a fever. His serology test result is negative.<br></p><p><u>Case 63578</u>&nbsp;is a 74 year-old female Singaporean who is a retiree. She is a family member and household contact of Case 63524<sup>[9]</sup>, and was placed on quarantine on 20 May. On the same evening, she developed a fever, sore throat and cough, and was tested for COVID-19 on 21 May. Her test result came back positive for COVID-19 infection on the same day. Her serology test result is negative.<br></p><p><u>Case 63570</u>&nbsp;is a 77 year-old male Singaporean who is a retiree. He is a family member of Case 63408<sup>[10]</sup>, and was placed on quarantine on 18 May. He developed a fever and cough on 20 May evening, and was tested for COVID-19 the next day. his test result came back positive for COVID-19 infection on 21 May. His serology test result is negative.<br></p><p><strong><br>Case 63414 cluster <sup>[11]</sup></strong><br></p><p>Already quarantined:<br></p><p><u>Case 63584</u>&nbsp;is a 9 year-old female Singaporean who is a student at Springdale Primary School, and was last in school on 17 May. She is a family member and household contact of Case 63414, and was placed on quarantine on 17 May. She was tested for COVID-19 on 21 May during quarantine, and developed anosmia the same evening. Her test result came back positive for COVID-19 infection the same day. Her serology test result is pending.<br></p><p><u>Case 63585</u>&nbsp;is a 5 year-old female Singaporean who is a student at M.Y. World Preschool (Anchorvale Parkview). She is a family member and household contact of Case 63414. She developed a fever, runny nose and abdominal pain on 11 May, and sought medical treatment at a GP clinic on 13 May but was not tested for COVID-19. As she had been identified as a close contact of Case 63414, she was placed on quarantine on 17 May. She was tested for COVID-19 on 21 May during quarantine and her test result came back positive for COVID-19 infection on the same day. Her serology test result is pending.&nbsp;<br></p><p><strong><br>Case 63479 cluster<sup>&nbsp;[12]</sup></strong><br></p><p>Already quarantined:<br></p><p><u>Case 63592</u>&nbsp;is a 41 year-old Myanmar national who works as a project manager at Compact Metal Industries Pte Ltd, and was last at work on 19 May. He is a household contact of Case 63479 and was placed on quarantine on 19 May. He is asymptomatic and was detected when he was tested for COVID-19 on 21 May during quarantine. His test result came back positive for COVID-19 infection on 22 May. His serology test result is pending.<br></p><p><strong><br>Case 63487 cluster <sup>[13]</sup></strong><br></p><p>Already quarantined:<br></p><p><u>Case 63581</u>&nbsp;is a 62 year-old male Singaporean who is a retiree. He is a household contact of Case 63574, and was placed on quarantine on 19 May. He developed a sore throat on 21 May and was tested for COVID-19 when he reported his symptom. His test result came back positive for COVID-19 on 22 May. His serology test result is pending. Case 63581 received his first dose of COVID-19 vaccine on 11 March, and the second dose on 15 April.<br></p><p><br>Detected through surveillance:<br></p><p><u>Case 63574</u>&nbsp;is a 19 year-old female Malaysia national who is a student at Singapore Polytechnic and had not gone to school since 15 May. She is a close contact of Case 63487. She developed a cough and sore throat on 16 May, and a fever the next day. She sought medical treatment at a GP clinic on 19 May, where she underwent both an ART and PCR test. She was immediately isolated when her ART came back positive on the same day. Her PCR test result came back positive for COVID-19 infection on 21 May. Her serology test result is pending.<br></p><p><strong><br>Case 63516 cluster <sup>[14]</sup></strong><br></p><p>Already quarantined:<br></p><p><u>Case 63572</u>&nbsp;is a 1 year-old male Singaporean and a family member of Cases 63513<sup>[15]&nbsp; </sup>and 63516. He developed a fever on 16 May. As he has been identified as a close contact of Case 63516, he was placed on quarantine on 19 May. He was tested for COVID-19 on 20 May during quarantine and his test result came back positive for COVID-19 infection the next day. His serology test result is negative.<br></p><p>&nbsp;</p><p><strong>b)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Cases residing in dormitories: 0</strong></p><p>There are no cases residing in dormitories today.<br></p><p>&nbsp;</p><p><strong>c)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Imported cases: 7</strong></p><p>Amongst the 7 imported cases,<br></p><p>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 2 (Cases 63583 and 63587) are Singaporeans and 1 (Case 63576) is a Singapore Permanent Resident who returned from India and the Philippines.<br>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 1 (Case 63595) is a Dependant’s Pass holder who arrived from Angola.<br>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 3 (Cases 63561, 63565 and 63567) are Work Permit holders who arrived from the Philippines.</p><p>They had all already been placed on SHN or isolated upon arrival in Singapore and were tested while serving SHN.<br></p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Please refer to the <a href=\"/docs/librariesprovider5/pressroom/press-releases/annexes-2.pdf?sfvrsn=354a9c62_0\" title=\"Annexes\">Annexes</a>&nbsp;and MOH’s daily Situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?q=http://www.moh.gov.sg/covid-19/situation-report&amp;source=gmail&amp;ust=1621784523147000&amp;usg=AFQjCNHUuZF5gYyGQwUbsz13SE5QC_Ks5Q\" title=\"\" class=\"\">www.moh.gov.sg/covid-19/<wbr>situation-report</a>) for details.<br></p><p>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Epidemiological investigations are in progress. In the meantime, all the identified close contacts of the cases have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for the close contacts to determine if the cases could have been infected by them.<br></p><p><strong><br>Closure of JEM and Westgate shopping malls from 23 May</strong><br></p><p>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; MOH is investigating cases of COVID-19 infection amongst individuals who worked in or visited JEM and Westgate. We have conducted special testing operations for staff who worked in JEM and Westgate, and are extending free COVID-19 testing to all visitors to JEM and Westgate from 10 May to 14 May. There are 10 recent cases linked to the malls, of whom 4 were detected from the testing operations, which are still in progress.<br></p><p>7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Our epidemiological investigations have found that there is likely ongoing transmission among individuals who visited these malls. To break any potential chain of transmission and enable deep cleaning of the premises, JEM and Westgate shopping malls will be closed to all members of the public starting from 23 May 2021 and re-open 14 days later, on 6 June 2021. Members of the public will still be able to access Ng Teng Fong General Hospital through Westgate, and the office towers at these premises will remain open. All visitors to JEM and Westgate since 10 May are advised to monitor their health closely for 14 days from their date of visit. They are encouraged to visit a Regional Screening Centre or “Swab and Send Home” (SASH) Public Health Preparedness Clinic for a free COVID-19 test if they feel unwell.<br></p><p><br><strong>Update on condition of confirmed cases</strong><br></p><p>8.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 35 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 61,277 have fully recovered from the infection and have been discharged from hospitals or community care facilities.<br></p><p>9.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; There are currently 255 confirmed cases who are still in hospital. Of these, most are stable or improving, and 5 are in critical condition in the intensive care unit. 235 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 32 have passed away from complications due to COVID-19 infection.<br></p><p><strong><br>MINISTRY OF HEALTH<br>22 MAY 2021</strong></p><hr><p>&nbsp;</p><p><sup>[1]&nbsp; </sup>This is updated from the afternoon press release as 1 more case has been linked to previous cases following our investigations.<br><sup>[2]&nbsp;</sup> Case 62998 is a 40 year-old female Singaporean who works as a risk assessment personnel at Lendlease Pte Ltd. She was confirmed to have COVID-19 infection on 8 May.<br><sup>[3]&nbsp; </sup>Case 63462 is a 49 year-old female Singaporean who works as a factory operator at Sms Infocomm (Singapore) Pte Ltd, and a close contact of Case 63273. She was confirmed to have COVID-19 infection on 19 May.<br><sup>[4]&nbsp; </sup>Case 63448 is a 29 year-old female Malaysia national who works at Sms Infocomm (Singapore) Pte Ltd, and a close contact of Case 63318. She was confirmed to have COVID-19 infection on 18 May.<br><sup>[5]&nbsp;</sup> Case 63335 is a 57 year-old female Singaporean who works as an administrative personnel at Pacific Law Corporation. She was confirmed to have COVID-19 infection on 16 May.<br><sup>[6]&nbsp; </sup>Case 63534 is a 27 year-old male Malaysia national who works as a delivery rider for IVIC Logistic Pte Ltd and McDonald’s (Bedok Reservoir). He was confirmed to have COVID-19 on 20 May.<br><sup>[7]&nbsp; </sup>Case 63535 is a 27 year-old male Malaysia national who works as a delivery rider for IVIC Logistic Pte Ltd and McDonald’s (Pasir Ris Elias Community Club). He was confirmed to have COVID-19 infection on 20 May.<br><sup>[8]&nbsp; </sup>Case 63357 is a 32 year-old male Singaporean who works as an IT engineer at AbbVie Operations Singapore Pte Ltd. He was confirmed to have COVID-19 infection on 16 May.<br><sup>[9]&nbsp; </sup>Case 63524 is a 41 year-old female Singaporean who is a homemaker, and a close contact of Case 63357. She was confirmed to have COVID-19 infection on 20 May.<br><sup>[10]&nbsp; </sup>Case 63408 is a 57 year-old female Singaporean who is a retiree, and a family member and household contact of Cases 63357 and 63363. She was confirmed to have COVID-19 infection on 17 May.<br><sup>[11]&nbsp; </sup>Case 63414 is a 40 year-old male Singaporean who works as a vending machine loader at Warburg Pte Ltd, and a food delivery rider for Deliveroo and Grab. He was confirmed to have COVID-19 infection on 18 May.<br><sup>[12]&nbsp;</sup> Case 63479 is a 49 year-old female Singapore Permanent Resident who is a homemaker. She was confirmed to have COVID-19 infection on 20 May.<br><sup>[13]&nbsp;</sup> Case 63487 is a 19 year-old female Malaysia national who is a student at Singapore Polytechnic. She was confirmed to have COVID-19 infection on 19 May.<br><sup>[14]&nbsp; </sup>Case 63516 is a 28 year-old female Singaporean who is a homemaker. She was confirmed to have COVID-19 infection on 20 May.<br><sup>[15]&nbsp; </sup>Case 63513 is a 29 year-old male Singaporean who works at Slide and Hide System Pte Ltd, and is a family member and household contact of Case 63516. He was confirmed to have COVID-19 on 20 May.</p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "22-new-cases-of-locally-transmitted-covid-19-infection_22MayUpdate", "CurrentPageUrl": null}, {"Title": "22 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1621669500000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "22 May 2021", "Summary": "", "MainContent": "&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As of 22 May 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 22 new cases of locally transmitted COVID-19 infection, of whom 14 are linked to previous cases, and 8 are currently unlinked. Amongst them, 12 had already been placed on quarantine earlier. Based on our investigations so far, the cases are in the community, and there are no new cases in the dormitories.<br><br>2.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;In addition, there are 7 imported cases, who had already been placed on Stay-Home Notice or isolated upon arrival in Singapore. Of these, 3 are returning Singaporeans or Singapore Permanent Residents.<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;In total, there are 29 new cases of COVID-19 infection in Singapore today.<br><br>4.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.<br><br><br><strong>MINISTRY OF HEALTH<br>22 MAY 2021</strong>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "22-new-cases-of-locally-transmitted-covid-19-infection_22May", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}