{"pressItemDictionary": {"Press Releases": [{"Title": "Expert Committee On Covid-19 Vaccination: Updated Recommendation On Use of Covid-19 Vaccines", "PublishedDate": "/Date(1634976000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "23 Oct 2021", "Summary": "", "MainContent": "<span style=\"font-family: Arial;\"><span style=\"font-size: 16px;\">1.&nbsp; &nbsp; &nbsp; The Expert Committee on COVID-19 Vaccination notes the interim authorisation of the Sinovac-CoronaVac COVID-19 vaccine by the Health Sciences Authority (HSA) under the Pandemic Special Access Route (PSAR), for use in Singapore in individuals aged 18 years and above to prevent COVID-19.<br><br>2.&nbsp; &nbsp; &nbsp; The Expert Committee has independently reviewed the Sinovac-CoronaVac (COVID-19) vaccine’s safety and efficacy data for different population segments in Singapore and has been briefed by HSA on its full range of considerations in granting interim authorisation.<br><br>3.&nbsp; &nbsp; &nbsp; The safety profile of the Sinovac-CoronaVac vaccine was observed to be consistent with other registered vaccines against other diseases.<br><br>4.&nbsp; &nbsp; &nbsp; In its key Phase III clinical trial study in Brazil, two doses of the Sinovac-CoronaVac vaccine demonstrated a vaccine efficacy of 51% against symptomatic infection by earlier SAR-CoV-2 strains prior to the Delta variant, with a higher rate of protection against severe disease. However, varying effectiveness was observed in a range of different studies. There is also no comprehensive data on its protection against the Delta variant. Furthermore, antibody levels after vaccination were low and declined rapidly within three to six months after completion the 2nd dose returning to pre-vaccination levels by six months.<br><br>5.&nbsp; &nbsp; &nbsp; While Sinovac did not apply to HSA for PSAR authorisation of a 3-dose regimen for its Sinovac-CoronaVac vaccine, there is evidence that a third dose of the vaccine is needed at three to six months after the second dose to raise antibody levels. This is consistent with the World Health Organisation Strategic Advisory Group of Experts (SAGE) recommendation of a third dose for those aged 60 and above for the primary vaccination series.<br><br>6.&nbsp; &nbsp; &nbsp; The Expert Committee also notes that as at 23 October 2021, more than 84% of our total population has received at least one dose of the PSAR-authorised mRNA vaccines which have been the mainstay of our National Vaccination Programme.<br><br>7.&nbsp; &nbsp; &nbsp; In view of the lower efficacy of the Sinovac-CoronaVac vaccine as compared to the PSAR-authorised mRNA vaccines and the lack of data on the efficacy of the Sinovac-CoronaVac vaccine against the Delta variant, the Expert Committee recommends that persons who are unable to complete the full two-dose regime of the PSAR-authorised mRNA vaccines, due to valid medical reasons, should receive the Sinovac-CoronaVac vaccine. This includes those who have taken their first dose of one of the PSAR-authorised mRNA vaccines and developed myocarditis or allergies to the mRNA vaccines, as well as those who have a past history of allergy to a component in the mRNA vaccines.<br><br>8.&nbsp; &nbsp; &nbsp; The PSAR-authorised mRNA vaccines remain the recommended COVID-19 vaccines for all persons who are eligible, given the higher vaccine effectiveness against infection and severe disease, including against the Delta variant. Taking the Sinovac-CoronaVac vaccine will allow those who are medically unable to complete their primary vaccination using mRNA vaccines, to be protected against COVID-19, and to be considered fully vaccinated.<br><br>9.&nbsp; &nbsp; &nbsp; Given the circumstances aforementioned, persons of all ages who are eligible to receive the Sinovac-CoronaVac vaccine are recommended to receive three doses of the vaccine as their primary vaccination series. The second dose should be taken 28 days after the first dose, while the third dose should be taken 90 days after the second dose. The recommended timing of the third dose corresponds to when antibody levels are known to have declined. Persons who have received two doses of the Sinovac-CoronaVac vaccine but are able to receive the PSAR mRNA vaccines, are strongly recommended to take one of the mRNA vaccines for the third dose of their primary vaccination series. Please refer to the <span style=\"text-decoration: underline;\"><a href=\"/docs/librariesprovider5/pressroom/press-releases/annexefcdaf7d46b54895bd881690e3481d62.pdf?sfvrsn=bf78e78a_0\" title=\"Annex\">Annex</a></span>&nbsp;for further details on the recommended use of the vaccine under different circumstances.<br><br>10.&nbsp; &nbsp; &nbsp;The Sinovac-CoronaVac vaccine is not recommended for use as a booster vaccination, except in persons who are unable – for medical reasons – to receive a third dose of the mRNA vaccine. Persons who have completed two doses of the mRNA vaccine without allergies or severe adverse events, are recommended to receive an mRNA vaccine instead of the Sinovac-Coronavac vaccine, if they are eligible for a booster.<br><br>11.&nbsp; &nbsp; &nbsp;There has been similar evidence that antibody levels from the Sinopharm BIBP vaccine also decline after two doses, and a third dose increases this substantially. The Expert Committee notes that some individuals have opted for Sinopharm BIBP under the Special Access Route (SAR) as their primary series vaccination despite the PSAR mRNA vaccines being strongly recommended for them. They are strongly recommended to take one of the PSAR mRNA vaccines for the third dose of their primary series vaccination. If they decline, a third dose of the Sinopharm BIBP vaccine, is recommended, to be given at three months after the second dose to complete their primary vaccination series.<br><br>12.&nbsp; &nbsp; &nbsp;Separately, local and international safety data now indicate more clearly that persons with severe allergies to non-COVID-19 vaccines can be safely vaccinated with mRNA vaccines. These persons were previously required to undergo a review by a specialist before vaccination. Given the greater assurance of safety that we now have, based on global and local data, persons with severe allergies to other non-COVID-19 vaccines can now receive the mRNA vaccine without being reviewed by a specialist. Persons with documented allergy to PEG, which is a component of mRNA vaccines, continue to be ineligible for the mRNA vaccines.<br><br>13.&nbsp; &nbsp; &nbsp;The Expert Committee will continue to monitor and review the use of COVID-19 vaccines in Singapore as more data becomes available over time, and update our recommendations as necessary. A high local vaccination coverage is key to protect ourselves from COVID-19, and we encourage all medically eligible persons to be vaccinated.<br><br><br><strong>EXPERT COMMITTEE ON COVID-19 VACCINATION<br>23 OCTOBER 2021<br></strong></span></span><div><span style=\"font-family: Arial; font-size: 16px;\"><br></span></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "expert-committee-on-covid-19-vaccination-updated-recommendation-on-use-of-covid-19-vaccines", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}, {"Title": "Preparing for Safe Resumption of Activities by Building Strong Foundations In Stabilisation Phase", "PublishedDate": "/Date(1634976000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "23 Oct 2021", "Summary": "", "MainContent": "<p><span style=\"font-family: Arial;\"><span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Earlier this week, the Multi-Ministry Taskforce (MTF) announced the extension of the Stabilisation Phase for four weeks, through to 21 November 2021, with a mid-point review. We will make full use of this extension to build the strong foundations that will enable the safe resumption of activities in Singapore.<br><br>2.&nbsp; &nbsp; &nbsp; &nbsp;First, we will consolidate our capabilities in safeguarding the health of anyone who might become infected in Singapore. This entails ensuring that everyone becomes familiar and comfortable with being placed on the Home Recovery Programme (HRP), and ensuring that our onboarding and medical support for those who enter HRP are primed optimally. This also entails beefing up hospital capacity, including augmenting intensive care unit (ICU) beds and expanding healthcare manpower to care for those who need more medical attention.&nbsp; Private hospitals have also been prepared to help ease the patient load on public hospitals and ensure timely delivery of care to all patients, COVID-19 and non-COVID.<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp;Second, we will continue to strengthen vaccination protection for our population in Singapore.&nbsp; This includes pressing ahead with our vaccination booster programme, and also bringing the recently Pandemic Special Access Route (PSAR)-authorised Sinovac-CoronaVac vaccine into the National Vaccination Programme (NVP), to allow the small minority of unvaccinated individuals, especially those who cannot take the mRNA vaccines due to medical conditions, to become fully vaccinated safely.&nbsp;<br><br>4.&nbsp; &nbsp; &nbsp; &nbsp;Third, we will expand the Vaccination-Differentiated Safe Management Measures (VDS) by requiring all onsite workers to be fully vaccinated, or minimally to be tested regularly. At the same time, recognising the importance of ensuring the well-being of our seniors, we will organise selected safe activities, which are in line with prevailing Safe Management Measures (SMMs), for our seniors, so that they can stay socially connected, active and healthy.<br><br>5.&nbsp; &nbsp; &nbsp; &nbsp;We will continue to proactively build these foundations and monitor the local situation and healthcare capacity in the next few weeks. If there is good progress in consolidating these foundations and the situation stabilises further, it will give us strong confidence to safely and progressively resume our social and economic activities.<br><br><br><strong>A. Consolidating our Healthcare Capacity and Capabilities</strong><br><br><span style=\"text-decoration: underline;\">Expanded Enrolment Criteria for Home Recovery Programme (HRP)</span><br><br>6.&nbsp; &nbsp; &nbsp; &nbsp;We previously announced the extension of HRP to more demographic groups. Home recovery is now the safe, default option for the majority of COVID-19 patients. As more of us become familiar and comfortable with HRP, and our onboarding processes and medical support structures become more established, we will now extend HRP to fully vaccinated pregnant COVID-19 patients who are below 35 years and are less than 26 weeks pregnant. These patients would be clinically assessed at selected hospitals to be suitable for home recovery before commencing HRP.<br><br>7.&nbsp; &nbsp; &nbsp; &nbsp;Meanwhile, we will continue to onboard more General Practitioners (GPs) to provide telemonitoring support for those on HRP, private sector hospitals to expand overall hospital bed capacity to manage COVID-19 and non-COVID patients, and stand up COVID-19 Treatment Facilities to augment the capacity of our public hospitals.<br><br><strong>B. Protecting our Population with Expanded Vaccination</strong><br><br><span style=\"text-decoration: underline;\">Pushing Ahead with our Vaccination Booster Programme</span><br><br>8.&nbsp; &nbsp; &nbsp; &nbsp;On 3 October 2021, we commenced the vaccination booster programme for persons aged 50 to 59 years, in addition to those aged 60 years and above who had started receiving their booster doses in September. As of 21 October 2021, 655,029 individuals have received their booster dose. 82% of individuals aged 50 to 59 years and 79% of seniors aged 60 years and above, who are eligible for their booster dose, have either booked an appointment or already received their booster dose.<br><br>9.&nbsp; &nbsp; &nbsp; &nbsp;Since 9 October 2021, we started booster vaccinations of healthcare workers, as well as frontline workers who completed their primary series vaccination regimen around six months ago. We have also started inviting persons aged 30 years and above who completed their primary series vaccination regimen around six months ago to make an appointment for their booster dose. As of 21 October 2021, we have invited about 190,000 persons aged 30 to 49 years to book an appointment for their booster dose, and about 138,000 (or 72% of those invited) have since booked an appointment.<br><br><span style=\"text-decoration: underline;\">Inclusion of Sinovac-CoronaVac under the National Vaccination Programme to Cater to Those Unable to be Vaccinated with mRNA Vaccines</span><br><br>10.&nbsp; &nbsp; &nbsp; &nbsp;The Sinovac-CoronaVac COVID-19 vaccine will be included in the National Vaccination Programme (NVP), following HSA’s interim authorisation of the vaccine under the PSAR.<br><br>11.&nbsp; &nbsp; &nbsp; &nbsp;As recommended by the Expert Committee on COVID-19 Vaccination (EC19V), given the relatively lower vaccine efficacy of Sinovac-CoronaVac compared with mRNA vaccines, the following guidance will apply:<br></span></span></p><p style=\"margin-left: 40px;\"><span style=\"font-family: Arial; font-size: 16px;\"><br>a.&nbsp; &nbsp; &nbsp; &nbsp;Persons who can take the mRNA vaccines should continue to take two doses of the mRNA vaccines to complete their primary series regime.<br><br>b.&nbsp; &nbsp; &nbsp; &nbsp;Persons who had received only one or two doses of the Sinovac-CoronaVac vaccine to-date, are strongly encouraged to complete a three-dose primary series regime with the mRNA vaccines as it offers more optimal protection .<br><br>c.&nbsp; &nbsp; &nbsp; &nbsp;Persons who are unable to take any dose of the mRNA vaccines due to medical reasons, should receive three doses of Sinovac-CoronaVac in total to complete their primary series regime.<br><br>d.&nbsp; &nbsp; &nbsp; &nbsp;Persons who started vaccination with mRNA vaccines but developed allergies or severe adverse reactions after the first dose of mRNA vaccine should complete a three-dose primary series regime with two more doses of Sinovac-CoronaVac. If the allergic reaction happens after the second dose of mRNA vaccine, then he/she should take one more dose of Sinovac-CoronaVac as their booster vaccination when they are eligible for a booster.<br></span></p><p><span style=\"font-family: Arial;\"><span style=\"font-size: 16px;\"><br>12.&nbsp; &nbsp; &nbsp; &nbsp;Locally, our vaccination rates are high – at more than 90% in eligible age groups. However, there are some who continue to choose not to take up mRNA vaccinations due to strong personal preferences. To ensure that everyone will have reasonably good protection against COVID-19, we will offer the three-dose primary series regime of Sinovac-CoronaVac under the NVP to those who have not completed their full course of vaccination, including persons who had only received one or two doses of Sinovac-CoronaVac previously. This will help improve protection for persons vaccinated with Sinovac-CoronaVac.<br><br>13.&nbsp; &nbsp; &nbsp; &nbsp;However, Sinovac-CoronaVac will not be offered as a booster for persons who had already completed two doses of mRNA vaccine and did not develop allergies or severe adverse reactions. For this group, a third dose of mRNA vaccine will be offered to them as the booster dose instead, under the NVP.<br><br>14.&nbsp; &nbsp; &nbsp; &nbsp;Finally, for clarity, Sinovac-CoronaVac has not been approved for general use for individuals aged 12 to 17 years. This is not in the application from Sinovac and is also consistent with the World Health Organization’s approved use under the Emergency Use Listing.&nbsp; However, for those in this age band who are medically ineligible to complete a full two-dose regime of the Pfizer-BioNTech/Comirnaty mRNA vaccines, we will offer a three-dose primary series using Sinovac-CoronaVac under a dedicated public health programme . They will be closely monitored by trained medical personnel under this public health programme, given that the use of Sinovac-CoronaVac in persons under the age of 18 years was not included in HSA’s PSAR interim authorisation. We will get in touch with eligible persons in this age group.<br><br>15.&nbsp; &nbsp; &nbsp; &nbsp;From 20 October 2021, we have invited persons aged 18 and above, who are medically ineligible to complete a two-dose regime of mRNA vaccines due to allergies or severe adverse reactions after their first dose, to receive their Sinovac-CoronaVac doses to complete their three-dose primary series regime. An SMS with a personalised booking link will be sent to the mobile number that they had registered with earlier for their first dose of mRNA vaccine, for them to book a new appointment on <a href=\"http://www.vaccine.gov.sg\" title=\"\" class=\"\" target=\"\">www.vaccine.gov.sg</a>.The Sinovac-CoronaVac vaccine provided under the NVP will be administered at the Raffles City Convention Centre, 11 selected Public Health Preparedness Clinics (PHPCs), and a list of private clinics that have been approved under Special Access Route to provide Sinovac-CoronaVac. More details on these clinics will be shared on MOH’s website from 24 October 2021.<br><br>16.&nbsp; &nbsp; &nbsp; &nbsp;As we move Sinovac-CoronaVac to a three-dose regime, we will need to make some adjustment to the vaccination status of those who have taken two doses of Sinovac-CoronaVac, especially considering that there is an interval of 90 days between the second and third doses.<strong> All individuals who have taken two doses of Sinovac-CoronaVac will be regarded as fully vaccinated for 4 months after the second dose, or until 31 December 2021, whichever is later.</strong> This arrangement will provide enough time for individuals to get their third doses and maintain their vaccination status. The same rule will apply to those who had received two doses of the Sinopharm vaccine. For travellers, we recognise that many may have taken only two doses of Sinovac-CoronaVac in their home country, and we will regard those with two doses as vaccinated, but only for a limited period of 30 days.<br><br><span style=\"text-decoration: underline;\">Concession for Medically Ineligible Individuals across Settings with VDS</span><br><br>17.&nbsp; &nbsp; &nbsp; &nbsp;We have implemented VDS across different settings to protect unvaccinated individuals and reduce the strain on our healthcare system. However, we recognise that there is a small group of people who are medically ineligible for both the mRNA and Sinovac-CoronaVac vaccines. A<strong>s a special concession, we will exempt such individuals from the VDS if they are certified to be medically ineligible for all vaccines under the NVP.</strong> More details on the medical criteria and timeline for the start of this concession will be issued by MOH later.<br><br><strong>C. Resuming Our Social and Economic Activities Safely</strong><br><br><span style=\"text-decoration: underline;\">Workforce Vaccination Measures to Keep the Workplace Safe</span><br><br>18.&nbsp; &nbsp; &nbsp; &nbsp;<strong>From 1 January 2022, only employees who are fully vaccinated , or have recovered from COVID-19 within the past 270 days, can return to the workplace.</strong> Unvaccinated employees will not be allowed to return to the workplace unless they have tested negative for COVID-19 before returning to the workplace, and they will need to pay for the costs of these tests. The test should be a Pre-Event Test at an <a href=\"https://www.moh.gov.sg/licensing-and-regulation/regulations-guidelines-and-circulars/details/list-of-covid-19-swab-providers\" title=\"\" class=\"\" target=\"\">MOH-approved COVID-19 test provider</a>, and must be valid&nbsp;for the duration that the employees are required to be present at the workplace. The testing requirements will apply to medically ineligible persons and pregnant women as well. Tripartite partners have agreed on special considerations that employers should grant to these groups, such as allowing work from home without affecting performance and coming to reasonable agreement on cost-sharing of the tests. More details will be shared via a separate press release jointly issued by MOH and MOM, as well as in the tripartite advisory on vaccination at the workplace.<br><br><span style=\"text-decoration: underline;\">Keeping Our Seniors Active Through Safe and Healthy Activities</span><br><br>19.&nbsp; &nbsp; &nbsp; &nbsp;Over the past months, the options for seniors to be socially engaged in wellness activities have been limited, as a result of SMMs which had to be imposed to curb transmission of COVID-19. Keeping active is important for our seniors to maintain good physical and mental health. Hence, the People’s Association will organise activities for fully vaccinated seniors according to prevailing SMMs. These activities for fully vaccinated seniors will be held in a safe manner at specific sites and dedicated timings. The People’s Association will release more details at a later date.<br><br><span style=\"text-decoration: underline;\">Key Indicators for Easing of Measures</span><br><br>20.&nbsp; &nbsp; &nbsp; &nbsp;The MTF had earlier highlighted that the stabilisation measures will not remain static throughout this coming month. We are monitoring several key indicators closely. In particular, the weekly infection rate (i.e. the ratio of community cases in the past week over the week before) is now slightly above 1, which means that infections are continuing to rise, and continuing to put pressure on our healthcare system.&nbsp; If this ratio drops below 1, and the hospital/ICU situation remains stable, we will consider some calibrated easing of measures. This will include allowing selected group sports and school activities to resume with appropriate safeguards, as well as allowing members from the same households to dine together at F&amp;B establishments.<br><br><strong>Updates to Border Measures</strong><br><br><span style=\"text-decoration: underline;\">Entry of Fully Vaccinated Domestic Workers</span><br><br>21.&nbsp; &nbsp; &nbsp; &nbsp;As announced previously, we will allow necessary workers and students to enter Singapore’s borders in a safe and calibrated manner from 1 November 2021, on the condition that they are fully vaccinated before arrival. As part of this move, we will facilitate the entry of more domestic workers, to meet urgent domestic and caregiving needs of local households, while regulating the numbers carefully as the global situation evolves.<br><br><span style=\"text-decoration: underline;\">Review of Countries/Regions Categories</span><br><br>22.&nbsp; &nbsp; &nbsp; &nbsp;As part of our regular review of the COVID-19 situation in countries/regions and our border measures, we have updated the list of countries in the various categories and adjusted the categories of some countries/ regions. Details of the updated country/ region classification and their corresponding border measures is in Annex A and would be effective for arrivals from <strong>26 October 2021, 2359 hours</strong>.<br><br><span style=\"text-decoration: underline;\">Resumption Travel from Bangladesh, India, Myanmar, Nepal, Pakistan and Sri Lanka<br></span><br>23.&nbsp; &nbsp; &nbsp; &nbsp;We had previously announced that all travellers with a 14-day travel history to Bangladesh, India, Myanmar, Nepal, Pakistan and Sri Lanka will not be allowed to enter or transit through Singapore. We have reviewed the COVID-19 situation in these countries, and all travellers with a 14-day travel history to Bangladesh, India, Myanmar, Nepal, Pakistan and Sri Lanka prior to departure to Singapore will be allowed to enter and transit through Singapore from <strong>26 October 2021, 2359 hours</strong>. These travellers will be subject to Category IV border measures.<br><br><span style=\"text-decoration: underline;\">Streamlining of Testing and SHN Protocols</span><br><br>24.&nbsp; &nbsp; &nbsp; &nbsp;We have further reviewed and streamlined our testing protocols and procedures for travellers arriving or transiting through Singapore, effective from <strong>26 October 2021, 2359 hours</strong>. All travellers from Category II (non-Vaccinated Travel Lane (VTL)), III and IV countries will no longer need to undergo an on-arrival Polymerase Chain Reaction (PCR) test, and will only undergo an end of Stay-Home Notice (SHN) exit PCR test.<br><br>25.&nbsp; &nbsp; &nbsp; &nbsp; All travellers from Category III countries/regions&nbsp; will serve their 10-day SHN at their declared place of residence/accommodation regardless of the travellers’ and their household members’ vaccination status and travel history. By default, they will not be allocated accommodation in any dedicated SHN facilities. Returning residents should ensure that alternative accommodation is secured prior to their return if their homes are unsuitable for their SHN. Travellers from Category IV countries/regions will still be required to serve their 10-day SHN at dedicated SHN facilities.<br><br>26.&nbsp; &nbsp; &nbsp; &nbsp;Details of the updated testing regime and border measures is in <span style=\"text-decoration: underline;\"><a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-a-(7).pdf?sfvrsn=cc901fd5_0\" title=\"Annex A \">Annex A </a></span>. We will continue to adjust our border measures as the global situation evolves, so that we will reconnect with the world and reinstate our economic position globally.<br><br><strong>Towards a COVID-19 Resilient Singapore</strong><br><br>27.&nbsp; &nbsp; &nbsp; &nbsp;We will actively build the foundations for our eventual safe resumption of social and economic activities, and monitor the local situation closely for the next few weeks. In the meantime, we seek everyone’s understanding and cooperation to continue to exercise social responsibility and cooperate with all the SMMs and VDS measures we have put in place. Test yourselves regularly and follow the simplified health protocols. This will ensure that those who test positive for COVID-19 will receive the optimal level of care while not overwhelming our healthcare system. If you are offered a vaccination or booster dose, please also come forward and get vaccinated.<br><br><br><strong>MINISTRY OF HEALTH<br>23 OCTOBER 2021</strong></span></span><br><br></p><hr><br>[1] Those who had taken one dose of Sinovac-CoronaVac to-date should complete their primary series vaccination with two more doses of mRNA vaccines; those who had taken two doses of Sinovac-CoronaVac to-date should compete their primary series vaccination with one more dose of mRNA vaccine.<br>[2] Those who had taken one dose of Pfizer-BioNTech/Comirnaty, will take two more doses of Sinovac-CoronaVac; those who had not taken any dose of Pfizer-BioNTech/Comirnaty, will take three doses of Sinovac-CoronaVac.<br>[3] An individual is considered vaccinated if he/she a) has been fully vaccinated, i.e. received the appropriate regimen of World Health Organisation Emergency Use Listing (WHO EUL) vaccines including their respective duration post-vaccination for the vaccine to be fully effective and b) had their vaccination records ingested in MOH’s IT systems.<br>[4] Negative ART results are valid for 24 hours.<br>[5] This includes travellers whose 14-day travel history include Category I and II countries/regions in addition to Category III countries/regions. Long-Term Pass Holders (LTPHs) with passes issued by the Ministry of Manpower (MOM) may have to comply with additional requirements and measures.<br><div><br></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "preparing-for-safe-resumption-of-activities-by-building-strong-foundations-in-stabilisation-phase", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}