{"pressItemDictionary": {"Press Releases": [{"Title": "4 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1618669200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "17 Apr 2021", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;As of 17 April 2021, 12pm, the Ministry of Health (MOH) has confirmed and verified that there are 4 new cases of locally transmitted COVID-19 infection. The cases are in the community, and there are no new cases in the dormitories. There are 35 imported cases, who had already been placed on Stay-Home Notice (SHN) upon arrival in Singapore. Amongst the new cases today, 34 are asymptomatic, and were detected from our proactive screening and surveillance, while 5 were symptomatic.&nbsp; </p> <p><strong>Summary of new cases</strong></p><table border=\"1\" cellspacing=\"0\" cellpadding=\"0\" width=\"605\"> <tbody><tr> <td width=\"129\"> <p align=\"right\">&nbsp;</p> </td> <td width=\"60\"> <p>&nbsp;</p> </td> <td width=\"16\" valign=\"top\"> <p>&nbsp;</p> </td> <td width=\"192\" colspan=\"2\"> <p align=\"center\"><strong>Breakdown by</strong></p> </td> <td width=\"16\" valign=\"top\"> <p>&nbsp;</p> </td> <td width=\"192\" colspan=\"2\"> <p align=\"center\"><strong>Breakdown by</strong></p> </td> </tr> <tr> <td width=\"129\"> <p align=\"right\">&nbsp;</p> </td> <td width=\"60\"> <p><strong>Number of cases</strong></p> </td> <td width=\"16\" valign=\"top\"> <p>&nbsp;</p> </td> <td width=\"96\"> <p><strong>Already in quarantine/ isolation before detection</strong></p> </td> <td width=\"96\"> <p><strong>Detected from surveillance</strong></p> </td> <td width=\"16\" valign=\"top\"> <p>&nbsp;</p> </td> <td width=\"96\"> <p><strong>Symptomatic</strong></p> </td> <td width=\"96\"> <p><strong>Asymptomatic</strong></p> </td> </tr> <tr> <td width=\"129\"> <p><strong>Cases in the community</strong></p> </td> <td width=\"60\"> <p align=\"center\">4</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">2</p> </td> <td width=\"96\"> <p align=\"center\">2</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">4</p> </td> <td width=\"96\"> <p align=\"center\">0</p> </td> </tr> <tr> <td width=\"129\"> <p><strong>Cases residing in dormitories</strong></p> </td> <td width=\"60\"> <p align=\"center\">0</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">0</p> </td> <td width=\"96\"> <p align=\"center\">0</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">0</p> </td> <td width=\"96\"> <p align=\"center\">0</p> </td> </tr> <tr> <td width=\"129\"> <p><strong>Imported cases</strong></p> </td> <td width=\"60\"> <p align=\"center\">35</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">35</p> </td> <td width=\"96\"> <p align=\"center\">0</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">1</p> </td> <td width=\"96\"> <p align=\"center\">34</p> </td> </tr> <tr> <td width=\"129\"> <p><strong>Total</strong></p> </td> <td width=\"60\"> <p align=\"center\">39</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">&nbsp;</p> </td> </tr> </tbody></table> <p><br>2.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Overall, the number of new cases in the community has increased from 2 cases in the week before to 7 cases in the past week. The number of unlinked cases in the community has also increased from 2 cases in the week before to 4 cases in the past week.&nbsp;We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.</p><p><p>3.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Amongst the 175 confirmed cases reported from 11 April to 17 April, 51 cases have tested positive for their serology tests, 84 have tested negative, and 40 serology test results are pending.</p></p><p><p><strong>Case Details<br></strong></p><p><strong>a) Cases in the community: 4</strong></p><p>There are 4 cases in the community today, of whom 2 are linked to a previous case and 2 are currently unlinked.</p><p><u>Case 62032</u></p><p>Case 62032 is a 35 year-old male Singaporean who works as a freelance photographer.</p><p>He was detected when he was tested on 15 April for COVID-19 as part of the Singapore Armed Force’s protocol to test national servicemen at the start of their in-camp training. His pooled test on 15 April came back positive for COVID-19, and an individual swab done on 16 April was also positive for COVID-19 infection. He was conveyed in an ambulance to the National Centre for Infectious Diseases (NCID), and developed a fever on the same day.</p><p>Another test conducted by the National Public Health Laboratory (NPHL) on 16 April was negative for COVID-19 infection but a subsequent test on 17 April by NPHL was again positive for COVID-19. His serological test result has come back positive, which is indicative of a past infection. He could be shedding minute fragments of the virus RNA from a past infection, but given that we are not able to definitively conclude when he had been infected, we will take all the necessary public health actions as a precautionary measure.</p><p><u>Case 62045</u></p><p>Case 62045 is a 41 year-old female Singapore Permanent Resident. She works as an accountant at OM Universal Pte Ltd (11 Kaki Bukit Road 1) but had not gone to work since onset of symptoms.</p><p>She developed a cough in the evening of 14 April after work, and sought medical treatment at a General Practitioner clinic the next day, where she was tested for COVID-19. Her test result came back positive for COVID-19 infection on 16 April and she was conveyed to NCID in an ambulance. Her serology test result is pending.</p><p>One of her household contacts is Case 61536, a Work Pass holder who arrived from India on 2 April. He tested positive for COVID-19 infection on 2 April but was subsequently assessed to be a recovered case based on his positive serology result on 4 April.</p><p><u>Case 62057</u></p><p>Case 62057 is a 31 year-old female Swiss national who is a Work Pass holder. She is a senior research fellow at the National University of Singapore and colleague of Case 61993[1], and had interacted with him on 12 April.</p><p>She developed a sore throat on 15 April but did not seek medical treatment. As she had been identified as a close contact of Case 61993, she was contacted by MOH on 16 April and placed on quarantine. She reported her symptom and was conveyed in an ambulance to Ng Teng Fong General Hospital where she was tested for COVID-19. Her test came back positive for COVID-19 infection on 16 April. Her serology test result is pending.</p><p><u>Case 62063</u></p><p>Case 62063 is a 35 year-old male Indian national who is a Work Pass holder. He is the brother of Case 61993 [1], and his household contact. He works at DBS Bank (2 Changi Business Park Crescent) but has largely been working from home. He last went back to his workplace between 6 April and 9 April.</p><p>As he had been identified as a close contact of Case 61993, he was placed on home quarantine on 15 April. He developed a fever on 16 April and was conveyed in an ambulance to NCID after he informed MOH of his symptom. He was tested for COVID-19 and his test came back positive on 17 April. His serology test result is pending.</p><p>Epidemiological investigations are ongoing. In the meantime, all the identified close contacts of the cases, including their family members and co-workers, have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for the close contacts to determine if the cases could have been infected by them.</p><p><strong>b) Cases residing in dormitories: 0<br></strong><br>There are no cases residing in dormitories today.</p><p><strong>c) Imported cases: 35</strong></p><p>Amongst the 35 imported cases,</p><ul><li>5 (Cases 62054, 62058, 62077, 62078 and 62097) are Singaporeans and 5 (Cases 62055, 62060, 62061, 62073 and 62075) are Singapore Permanent Residents who returned from Brazil, Egypt, India, Indonesia and Liberia.</li><li>4 (Cases 62033, 62034, 62052 and 62053) are Dependant’s Pass holders who arrived from Nepal.</li><li>1 (Case 62050) is a Student’s Pass holder who arrived from India.</li><li>1 (Case 62051) is a Work Pass holder who arrived from India.</li><li>17 are Work Permit holders who arrived from Bangladesh, India, Indonesia and the Philippines, of whom 8 (Cases 62038, 62039, 62040, 62041, 62081, 62082, 62086 and 62095) are foreign domestic workers.</li><li>2 (Cases 62048 and 62049) are Short-Term Visit Pass holders. Case 62048 arrived from Bahrain for a work project in Singapore and Case 62049 arrived from India to visit his family member who is a Singapore Permanent Resident.<br></li></ul><p>They had all already been placed on SHN upon arrival in Singapore and were tested while serving SHN.<br><br>4.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Please refer to the <a href=\"/docs/librariesprovider5/default-document-library/annexes-(17-apr).pdf?sfvrsn=1372f916_0\" title=\"Annexes \">Annexes </a>&nbsp;and MOH’s daily Situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\">www.moh.gov.sg/covid-19/situation-report</a>) for details.</p></p><p><p><strong></strong><strong>Update on condition of confirmed cases</strong></p><p>5.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;17 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 60,463 have fully recovered from the infection and have been discharged from hospitals or community care facilities.</p></p><p><p>6.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;There are currently 62 confirmed cases who are still in hospital. Of these, most are stable or improving, and 2 are in critical condition in the intensive care unit. 253 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 30 have passed away from complications due to COVID-19 infection.</p></p> <p>7.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;The recent locally transmitted cases are a stark reminder that the virus has not been eradicated and new cases and clusters can easily emerge in our community, if we let our guard down. We urge everyone, including those who have been vaccinated against COVID-19, to continue to exercise social responsibility, and keep up our discipline in adhering to the safe management measures. This is even more critical as we resume and scale up more activities in Phase Three of re-opening, and interactions in the community increase. Together we must work to avoid an uncontrolled resurgence of cases that may necessitate a tightening of</p><div> <hr align=\"left\" size=\"1\" width=\"33%\"> <div id=\"ftn1\"> <p>[1] Case 61993 is a 34 year-old male Indian national who is a senior research fellow at the National University of Singapore. He was confirmed to have COVID-19 infection on 15 April.</p> </div> </div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "4-new-cases-of-locally-transmitted-covid-19-infection-17-Apr-update", "CurrentPageUrl": null}, {"Title": "4 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1618645800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "17 Apr 2021", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;As of 17 April 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 4 new cases of locally transmitted COVID-19 infection. Based on our investigations so far, the cases are in the community, and there are no new cases in the dormitories.</p> <p>2.&nbsp; &nbsp; &nbsp; &nbsp;In addition, there are 35 imported cases, who had already been placed on Stay-Home Notice upon arrival in Singapore. Amongst them, 10 are Singaporeans or Singapore Permanent Residents, and 8 are foreign domestic workers.</p><p><p>3.&nbsp; &nbsp; &nbsp; &nbsp; In total, there are 39 new cases of COVID-19 infection in Singapore today.</p></p><p><p>4.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.</p></p><p><p>5.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The recent locally transmitted cases are a stark reminder that the virus has not been eradicated and new cases and clusters can easily emerge in our community, if we let our guard down. We urge everyone, including those who have been vaccinated against COVID-19, to continue to exercise social responsibility, and keep up our discipline in adhering to the safe management measures. This is even more critical as we resume and scale up more activities in Phase Three of re-opening, and interactions in the community increase. Together we must work to avoid an uncontrolled resurgence of cases that may necessitate a tightening of measures.</p></p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "4-new-cases-of-locally-transmitted-covid-19-infection-17-Apr", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}