{"pressItemDictionary": {"Press Releases": [{"Title": "24 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1621869900000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "24 May 2021", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As of 24 May 2021, 12pm, the Ministry of Health (MOH) has confirmed and verified that there are 24 new cases of locally transmitted COVID-19 infection. 22 are linked to previous cases, amongst which 12 have already been placed on quarantine, and 10 were detected through surveillance. The remaining 2 are currently unlinked. The cases are in the community, and there are no new cases in the dormitories. There are 12 imported cases, who had already been placed on Stay-Home Notice (SHN) or isolated upon arrival in Singapore. Amongst the new cases today, 16 are asymptomatic, and were detected from our proactive screening and surveillance, while 20 were symptomatic.&nbsp;</p><p><strong>Summary of new cases</strong></p> <table border=\"1\" cellspacing=\"0\" cellpadding=\"0\" width=\"605\"> <tbody><tr> <td width=\"129\"> <p align=\"right\">&nbsp;</p> </td> <td width=\"60\"> <p>&nbsp;</p> </td> <td width=\"16\" valign=\"top\"> <p>&nbsp;</p> </td> <td width=\"192\" colspan=\"2\"> <p align=\"center\"><strong>Breakdown by</strong></p> </td> <td width=\"16\" valign=\"top\"> <p>&nbsp;</p> </td> <td width=\"192\" colspan=\"2\"> <p align=\"center\"><strong>Breakdown by</strong></p> </td> </tr> <tr> <td width=\"129\"> <p align=\"right\">&nbsp;</p> </td> <td width=\"60\"> <p><strong>Number of cases</strong></p> </td> <td width=\"16\" valign=\"top\"> <p>&nbsp;</p> </td> <td width=\"96\"> <p><strong>Already in quarantine/ isolation before detection</strong></p> </td> <td width=\"96\"> <p><strong>Detected from surveillance</strong></p> </td> <td width=\"16\" valign=\"top\"> <p>&nbsp;</p> </td> <td width=\"96\"> <p><strong>Symptomatic</strong></p> </td> <td width=\"96\"> <p><strong>Asymptomatic</strong></p> </td> </tr> <tr> <td width=\"129\"> <p><strong>Cases in the community</strong></p> </td> <td width=\"60\"> <p align=\"center\">24</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">12</p> </td> <td width=\"96\"> <p align=\"center\">12</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">18</p> </td> <td width=\"96\"> <p align=\"center\">6</p> </td> </tr> <tr> <td width=\"129\"> <p><strong>Cases residing in dormitories</strong></p> </td> <td width=\"60\"> <p align=\"center\">0</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">0</p> </td> <td width=\"96\"> <p align=\"center\">0</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">0</p> </td> <td width=\"96\"> <p align=\"center\">0</p> </td> </tr> <tr> <td width=\"129\"> <p><strong>Imported cases</strong></p> </td> <td width=\"60\"> <p align=\"center\">12</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">12</p> </td> <td width=\"96\"> <p align=\"center\">0</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">2</p> </td> <td width=\"96\"> <p align=\"center\">10</p> </td> </tr> <tr> <td width=\"129\"> <p><strong>Total</strong></p> </td> <td width=\"60\"> <p align=\"center\">36</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">&nbsp;</p> </td> </tr> </tbody></table> <p><br>2.&nbsp; &nbsp; &nbsp;Overall, the number of new cases in the community has increased from 149 cases in the week before to 185 cases in the past week. The number of unlinked cases in the community has remained stable at 32 cases per week in the past 2 weeks. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.</p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Amongst the 247 confirmed cases reported from 18 May to 24 May, 46 cases have tested positive for their serology tests, 140 have tested negative, and 61 serology test results are pending.<br></p><p>&nbsp;</p><p><strong>Case Details</strong></p><p><strong>a)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Cases in the community: 24</strong><br></p><p>There are 24 cases in the community today, of whom 22 are linked to previous cases and 2 are currently unlinked.<br></p><p><strong>Currently unlinked cases</strong><br></p><p>Detected through surveillance:<br></p><p><u>Case 63651</u>&nbsp;is a 31 year-old male India national who works as an engineer at Hiap Seng Engineering Ltd. He developed body aches on 17 May, and sought treatment at a General Practitioner (GP) clinic on 17 May and 18 May, but was not tested for COVID-19 as he did not report any acute respiratory infection (ARI) symptoms. On 19 May, he developed a runny nose and loss of smell and taste in the evening. He sought treatment at another GP clinic the next day, and was tested for COVID-19. His test result came back positive for COVID-19 infection on 23 May. His earlier tests from Rostered Routine Testing (RRT) – the last being on 10 May – were all negative for COVID-19 infection. His serology test result is negative.<br></p><p><u>Case 63660</u>&nbsp;is a 31 year-old male Singaporean who works as a property agent with ERA Realty Network Pte Ltd. He developed a cough on 22 May, and sought medical treatment at a GP clinic on the same day, where he was tested for COVID-19. His test result came back positive for COVID-19 infection on 23 May, and he developed a sore throat on the same day. His serology test result is negative.<br></p><p>&nbsp;</p><p><strong>Changi Prison Complex cluster</strong></p><p>Already quarantined:<br></p><p><u>Case 63680</u>&nbsp;is a 51 year-old male Singaporean who is a prison inmate at Changi Prison. As he had been identified as a close contact of Case 63160<sup>[1]</sup>, he was placed on quarantine on 13 May. He was tested for COVID-19 on 13 May, 17 May, 20 May and 21 May, and his test results were all negative for COVID-19 infection. He is asymptomatic, and was detected when he was tested for COVID-19 on 23 May during his quarantine, and his test result came back positive for COVID-19 infection on 24 May. His serology test result is pending. Case 63680 received his first dose of COVID-19 vaccine on 6 May.<br></p><p>&nbsp;</p><p><strong>JEM/ Westgate cluster</strong></p><p>Already quarantined:<br></p><p><u>Case 63665</u>&nbsp;is a 19 year-old female Malaysia national who is a student at Singapore Polytechnic, and had visited Westgate on 8 May, 10 May and 11 May. She is a family member and household contact of Case 63664. She developed a fever on 18 May but did not seek medical treatment until 19 May when she went to a GP clinic and was tested for COVID-19. As she had been identified as a close contact of a case who was under investigation<sup>[2]</sup>, she was placed on quarantine on 22 May. She was tested for COVID-19 on 23 May during quarantine, and her test result came back positive for COVID-19 infection on 23 May. Her serology test result is pending.<br></p><p><u>Case 63664</u>&nbsp;is a 20 year-old female Malaysia national who is a student at Singapore Polytechnic, and had visited Westgate on 10 May. She is a family member and household contact of Case 63665. She developed a fever on 14 May but did not seek medical treatment until 19 May when she went to a GP clinic and was tested for COVID-19. As she had been identified as a close contact of a case who was under investigation, she was placed on quarantine on 22 May. She was tested for COVID-19 on 23 May during quarantine, and her test result came back positive for COVID-19 infection on 23 May. Her serology test result is pending.<br></p><p>&nbsp;</p><p>Detected through surveillance:</p><p><u>Case 63652</u>&nbsp;is a 44 year-old female Singaporean who works as an administrative staff at ST Electronics (Jurong East). She developed a fever on 13 May which resolved with self-medication. She subsequently developed a cough on 20 May but did not seek medical attention. She was tested for COVID-19 on 22 May as part of our testing operations for those who worked in or visited JEM and Westgate, and reported her symptom. She underwent both an antigen rapid test (ART) and polymerase chain reaction (PCR) test on 22 May, and was immediately isolated when her ART result came back positive on the same day. Her PCR test result came back positive on 23 May. Her serology test result is pending.<br></p><p><u>Case 63653</u>&nbsp;is a 49 year-old male Malaysia national who works as a delivery personnel at AST Logistics Pte Ltd, and frequently delivered goods at Westgate. He developed a fever and shortness of breath on 22 May and sought medical treatment at a GP clinic on the same day, and was tested for COVID-19. His test result came back positive for COVID-19 infection on 23 May. His serology test result is pending. Case 63653 received his first dose of COVID-19 vaccine on 21 May.<br></p><p><u>Case 63675</u>&nbsp;is a 24 year-old female Singaporean who is currently unemployed, and is a family member and household contact of Case 63678. She developed a fever, cough and blocked nose on 22 May and sought medical treatment at a GP clinic the next day, where she underwent both an ART and PCR test, and was immediately isolated when her ART result came back positive on the same day. Her PCR test result came back positive on 24 May. Her serology test result is pending.<br></p><p><u>Case 63678</u>&nbsp;is a 21 year-old male Singaporean who works a waiter at Pizza Hut at Westgate, and is a family member and household contact of Case 63675. He developed a fever and sore throat on 20 May and sought medical treatment at a GP clinic on 23 May, where he underwent both an ART and PCR test, and was immediately isolated when his ART result came back positive on the same day. His PCR test result came back positive on 24 May. His serology test result is pending.<br></p><p>&nbsp;</p><p><u>Additional Precautionary Measures at JEM and Westgate</u></p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; MOH is investigating cases of COVID-19 infection amongst individuals who worked in or visited JEM and Westgate. Our epidemiological investigations have found that there is likely ongoing transmission among individuals who visited these malls. Our findings suggest that Case 62933<sup>[3]</sup>, a cleaner who works at Park Avenue Rochester, an SHN dedicated facility, may have been the source of infection of the JEM/ Westgate cluster as she had been at Westgate on 6 May 2021. Whole genome sequencing and phylogenetic analysis conducted by the National Public Health Laboratory have revealed that some of the visitors to JEM and Westgate have similar sequences to that of Case 62933. Further investigations into the mode of transmission are ongoing.<br></p><p>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; To break any potential chain of transmission and enable deep cleaning of the premises, JEM and Westgate shopping malls have been closed to all members of the public starting from 23 May 2021 and will re-open 14 days later, on 6 June 2021. MOH has conducted special testing operations for staff who work at both premises. We have also offered free COVID-19 testing for members of the public who had visited JEM and Westgate from 10 May to 14 May. In view of the additional cases detected, free COVID-19 testing will be extended to all individuals who had visited JEM and Westgate from 10 May to 22 May. All visitors to JEM and Westgate since 10 May are also advised to monitor their health closely for 14 days from their date of visit. They are encouraged to visit a Regional Screening Centre or “Swab and Send Home” (SASH) Public Health Preparedness Clinic for a free COVID-19 test if they feel unwell.<br></p><p>&nbsp;</p><p><strong>Learning Point cluster</strong></p><p>Already quarantined:<br></p><p><u>Case 63663</u>&nbsp;is a 38 year-old female Singaporean who works as a teacher at Maha Bodhi School. She is a family member and household contact of Case 63184<sup>[4] </sup>and was placed on quarantine on 13 May. She was tested for COVID-19 on 15 May during quarantine and her test result was negative. She developed a runny nose on 21 May, and reported her symptom. She was tested for COVID-19 the next day and her test result came back positive for COVID-19 on 23 May. Her serology test result is negative for the N antigen, which suggests the presence of early infection. Case 63663 received her first dose of COVID-19 vaccine on 21 March, and the second dose on 11 April.<br></p><p><u>Case 63667</u><br></p><p>Case 63667 is a 8 year-old female Singaporean who is a student at Yu Neng Primary School. She is a classmate of Case 63282<sup>[5]</sup>, and was placed on quarantine on 16 May. She was tested for COVID-19 on 18 May during quarantine and her test result was negative. She developed a fever and sore throat on 23 May, and reported her symptoms. She was tested for COVID-19 on the same day and her test result came back positive for COVID-19 on 23 May. Her serology test result is negative.<br></p><p>&nbsp;</p><p><strong>Marina Bay Sands Casino dealer cluster</strong></p><p>Already quarantined:<br></p><p><u>Case 63679</u>&nbsp;is a 32 year-old male Singaporean who works as a dealer at the Marina Bay Sands Casino. As he had been identified as a close contact of Case 63320<sup>[6]</sup>, he was placed on quarantine on 17 May. He was tested on 22 May during quarantine, and developed a cough on the same day. His ART came back positive on the same day. A PCR test administered on the same day came back positive for COVID-19 infection on 24 May. His serology test result is negative.<br></p><p>&nbsp;</p><p><strong>McDonald’s delivery riders cluster</strong></p><p>Detected through surveillance:<br></p><p><u>Case 63629</u>&nbsp;is a 31 year-old male Malaysia national who works as a delivery rider for Pizza Hut (Punggol Plaza). He is a close contact of Cases 63534<sup>[7] </sup>and 63535<sup>[8]</sup>. He developed flu-like symptoms on 21 May and sought medical treatment at a GP clinic on 21 May, where he was tested for COVID-19. His ART came back positive on 22 May, and he was immediately isolated. His PCR test came back positive for COVID-19 infection on 23 May, and he developed a cough on the same day. His serology test result is pending<br></p><p><u>Case 63668</u>&nbsp;is a 34 year-old male Malaysia national who works as a delivery rider for Pizza Hut (Havelock II). As he had been identified as a close contact of Case 63629, he was placed on quarantine on 22 May. He was tested for COVID-19 on 23 May during quarantine and his test result was positive for COVID-19 infection. His serology test result is pending.<br></p><p><u>Case 63669</u>&nbsp;is a 15 year-old male Singaporean who is a student at Peicai Secondary School and had last gone to school on 4 May. He works part-time at Pizza Hut (Punggol Plaza) as a kitchen staff. He developed a cough on 20 May but did not seek medical treatment. He underwent both an ART and PCR test on 23 May, and both test results came back positive on the same day. He developed a fever on the same day. His serology test result is pending.<br></p><p><u>Case 63676</u>&nbsp;is an 18 year-old male Singaporean who works part-time at Pizza Hut (Punggol Plaza) as a kitchen staff. He is also a part-time delivery personnel with Grab and Deliveroo. He developed a sore throat and loss of taste on 23 May and sought medical treatment at a GP clinic where he was tested for COVID-19. His ART came back positive on the same day, and he was immediately isolated. His PCR test came back positive for COVID-19 infection on 24 May. His serology test result is pending. Case 63676 received his first dose of COVID-19 vaccine on 11 May.<br></p><p><u>Case 63682</u>&nbsp;is a 16 year-old male Singaporean who is a student at Greendale Secondary School and works part-time at Pizza Hut (Punggol Plaza). He had last gone to school on 17 May. He is asymptomatic, and was detected when he went to a GP clinic for a COVID-19 test on 23 May after he was encouraged to do so by his employer. He was given 4 days of medical leave. As he had been identified as a close contact of Case 63669, he was placed on quarantine on 23 May evening. His test result came back positive for COVID-19 infection on 24 May. His serology test result is pending.<br></p><p>&nbsp;</p><p><strong>Tan Tock Seng Hospital Ward 9D cluster</strong></p><p>Already quarantined:<br></p><p><u>Case 63630</u>&nbsp;is a 40 year-old female Indonesia national who is a foreign domestic worker. She had been identified as a visitor to Ward 9D of Tan Tock Seng Hospital, and was placed on quarantine on 30 April. She was tested for COVID-19 on 3 May during quarantine and her test result was negative for COVID-19 infection. As she had been identified as a household contact of Case 63009<sup>[9]</sup>, her quarantine was extended on 8 May. She is asymptomatic, and was detected when she was tested for COVID-19 on 22 May. Her test result came back positive for COVID-19 infection on 23 May. Her serology test result is pending.<br></p><p>&nbsp;</p><p><strong>Case 63236 cluster <sup>[10]</sup></strong></p><p>Already quarantined:<br></p><p><u>Case 63641</u>&nbsp;is a 2 year-old male Hong Kong citizen who is a student at Heart Field Kindergarten and had last gone to school on 14 May. He is a family member of Case 63621<sup>[11] </sup>and household contact of Cases 63349<sup>[12]</sup> and 63421<sup>[13] </sup>. As he had been identified as a close contact of Case 63236, he was placed on quarantine on 14 May. He developed a runny nose on 21 May and tested positive for his ART on the same day. He underwent a PCR test on 22 May and his test result came back positive for COVID-19 infection on 23 May. His serology test result is pending.<br></p><p>&nbsp;</p><p><strong>Case 63376 cluster <sup>[14]</sup></strong></p><p>Already quarantined:<br></p><p><u>Case 63681</u>&nbsp;is a 47 year-old male Singaporean who is unemployed. He is a family member and household contact of Case 63376, and was placed on quarantine on 17 May. He developed a fever and cough on 23 May, and was tested for COVID-19 on the same day. His test result came back positive for COVID-19 infection on 24 May. His serology test result is negative for the N antigen, which suggests the presence of early infection. Case 63681 received his first dose of COVID-19 vaccine on 20 April.<br></p><p>&nbsp;</p><p><strong>Case 63515 cluster<sup> [15]</sup></strong></p><p>Already quarantined:<br></p><p><u>Case 63654</u>&nbsp;is a 57 year-old male Singaporean who works as a cleaner at Mencast Marine Pte Ltd. He is a family member and household contact of Case 63515, and was placed on quarantine on 20 May. He is asymptomatic, and was detected when he was tested for COVID-19 on 22 May during quarantine. His test result came back positive for COVID-19 infection on 23 May. His serology test result is positive. Case 63654 received his first dose of COVID-19 vaccine on 25 April and the second dose on 16 May.&nbsp; &nbsp; &nbsp;&nbsp;<br></p><p>&nbsp;</p><p><strong>Other linked cases</strong></p><p>Already quarantined:<br></p><p><u>Case 63656</u>&nbsp;is a 54 year-old female Singaporean who is a homemaker. She is a family member and close contact of Case 63446<sup>[16]</sup>, and was placed on quarantine on 18 May. She is asymptomatic and was detected when she was tested for COVID-19 on 22 May during quarantine. Her test result came back positive for COVID-19 infection on 23 May. Her serology test result is negative.<br></p><p><u>Case 63677</u>&nbsp;is a 30 year-old male Singaporean who is employed by Hong Ye Group Pte Ltd as a cleaning supervisor at Changi Business Park. As he had been identified as a workplace contact of Case 63507<sup>[17]</sup>, he was placed on quarantine on 22 May. He developed a cough and sore throat on 23 May but did not report his symptoms. He was tested for COVID-19 on 23 May during quarantine and his test result came back positive for COVID-19 infection on the same day. His serology test result is pending.<br></p><p>&nbsp;</p><p> </p><p>Detected through surveillance:</p><p><u>Case 63661</u>&nbsp;is a 28 year-old female Singaporean who works as an engineer at Takenaka Corporation. She developed a fever and vomiting on 20 May, and sought medical treatment at a GP clinic on 22 May, where she was tested for COVID-19. Her test result came back positive for COVID-19 infection on 23 May. Her serology test result is negative.<br></p><p>&nbsp;</p><p><strong>b)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Cases residing in dormitories: 0</strong></p><p>There are no cases residing in dormitories today.<br></p><p>&nbsp;</p><p><strong>c)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Imported cases: 12</strong></p><p>Amongst the 12 imported cases,<br></p><p>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 3 (Cases 63631, 63671 and 63672) are Singaporeans and 2 (Cases 63673 and 63674) are Singapore Permanent Residents who returned from India and the US.<br>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 1 (Case 63670) is a Dependant’s Pass holder who arrived from Russia.<br>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 2 (Cases 63638 and 63648) are Work Permit holders who arrived from Indonesia, both of whom are foreign domestic workers.<br>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 3 (Case 63657, 63658 and 63659) are Short-Term Visit Pass holders. Case 63657 arrived from the Philippines to visit her family member who is a Singapore Permanent Resident, and Case 63658 arrived from Malaysia for matters related to her Singapore Permanent Resident status. Case 63659 was already receiving medical care in Singapore and had arrived from Indonesia for further treatment.<br>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 1 (Case 63662) is a Special Pass holder who is a sea crew. He arrived from Vietnam on a vessel and was tested onboard without disembarking.</p><p>They had all already been placed on SHN or isolated upon arrival in Singapore and were tested while serving SHN or during isolation.<br></p><p>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Please refer to the <a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-24-may.pdf?sfvrsn=cb124548_2\" title=\"Annexes\">Annexes</a>&nbsp;and MOH’s daily Situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?q=http://www.moh.gov.sg/covid-19/situation-report&amp;source=gmail&amp;ust=1621956331557000&amp;usg=AFQjCNG41st_5596zqnJCCrD5nTQ44mCSw\" title=\"\" class=\"\">www.moh.gov.sg/covid-19/<wbr>situation-report</a>) for details.</p><p>7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Epidemiological investigations are in progress. In the meantime, all the identified close contacts of the cases have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for the close contacts to determine if the cases could have been infected by them.<br></p><p><strong>&nbsp;</strong></p><p><strong>Update on condition of confirmed cases</strong></p><p>8.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 22 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 61,316 have fully recovered from the infection and have been discharged from hospitals or community care facilities.<br></p><p>9.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; There are currently 244 confirmed cases who are still in hospital. Of these, most are stable or improving, and 3 are in critical condition in the intensive care unit. 268 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 32 have passed away from complications due to COVID-19 infection.<br></p><p><br><strong>MINISTRY OF HEALTH<br>24 MAY 2021</strong></p><hr><p>[1]&nbsp; Case 63160 is a 39 year-old male China national who is employed by SATS Food Services Pte Ltd as a chef at Changi Prison Complex. He was confirmed to have COVID-19 infection on 13 May.<br>[2]&nbsp; The case under investigation was later determined to be negative for COVID-19 following repeat tests, but we took all necessary public health actions following the initial confirmation.<br>[3]&nbsp; Case 62933 is a 53 year-old female Singaporean who works as a cleaner at Park Avenue Rochester, an SHN dedicated facility. She was confirmed to have COVID-19 infection on 7 May.<br>[4]&nbsp; Case 63184 is a 9 year-old male Singaporean who is a student at St Stephen’s School and attended Case 63131’s classes at Learning Point located at Parkway Centre. He was confirmed to have COVID-19 infection on 13 May.<br>[5]&nbsp; Case 63282 is an 8 year-old male Singapore Permanent Resident who is a student at Yu Neng Primary School and attended Case 63131’s classes at Learning Point located at Parkway Centre. He was confirmed to have COVID-19 infection on 15 May.<br>[6]&nbsp; Case 63320 is a 35 year-old male Singaporean who works as a dealer at Marina Bay Sands Casino. He was confirmed to have COVID-19 infection on 16 May.<br>[7]&nbsp; Case 63534 is a 27 year-old male Malaysia national who works as a delivery rider for IVIC Logistic Pte Ltd and McDonald’s (Bedok Reservoir). He was confirmed to have COVID-19 on 20 May.<br>[8]&nbsp; Case 63535 is a 27 year-old male Malaysia national who works as a delivery rider for IVIC Logistic Pte Ltd and McDonald’s (Pasir Ris Elias Community Club). He was confirmed to have COVID-19 infection on 20 May.<br>[9]&nbsp; Case 63009 is a 78 year-old female Singaporean who had been warded in TTSH Ward 9D from 20 April, and was discharged on 25 April. She was confirmed to have COVID-19 infection on 8 May.<br>[10]&nbsp; Case 63236 is a 53 year-old male Singaporean who works as a personal chauffeur. He was confirmed to have COVID-19 infection on 14 May.<br>[11]&nbsp; Case 63621 is a 4 year-old female Singaporean who is a student at Heart Field Kindergarten. She was confirmed to have COVID-19 infection on 22 May.<br>[12]&nbsp; Case 63349 is a 36 year-old female Philippines national who is a foreign domestic worker and a close contact of Case 63236. She was confirmed to have COVID-19 infection on 16 May.<br>[13]&nbsp; Case 63421 is a 39 year-old female Philippines national who is a foreign domestic worker and a household contact of Case 63349. She was confirmed to have COVID-19 infection on 18 May.<br>[14]&nbsp; Case 63376 is a 46 year-old female Singaporean who is an investment banker at DBS. She was confirmed to have COVID-19 infection on 17 May.<br>[15]&nbsp; Case 63515 is a 34 year-old male Singaporean who works as a technician at Singapore Refining Company Pte Ltd. He was confirmed to have COVID-19 infection on 20 May.<br>[16]&nbsp; Case 63446 is a 28 year-old male Singaporean who works as an engineer at Patec Ptd Ltd. She was confirmed to have COVID-19 infection on 18 May.<br>[17]&nbsp; Case 63507 is a 31 year-old male Singaporean who is employed by Hong Ye Group Pte Ltd as a cleaner at Changi Business Park. He was confirmed to have COVID-19 infection on 19 May.</p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "24-new-cases-of-locally-transmitted-covid-19-infection_24MayUpdate", "CurrentPageUrl": null}, {"Title": "24 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1621843500000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "24 May 2021", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As of 24 May 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 24 new cases of locally transmitted COVID-19 infection. 22 are linked to previous cases, amongst which 12 have already been placed on quarantine, and 10 were detected through surveillance. The remaining 2 are currently unlinked. Based on our investigations so far, the cases are in the community, and there are no new cases in the dormitories.</p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In addition, there are 12 imported cases, who have already been placed on Stay-Home Notice or isolated upon arrival in Singapore. Of these, 5 are returning Singaporeans or Singapore Permanent Residents.<br></p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In total, there are 36 new cases of COVID-19 infection in Singapore today.<br></p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.<br></p><p><strong><br>MINISTRY OF HEALTH<br>24 MAY 2021</strong></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "24-new-cases-of-locally-transmitted-covid-19-infection_24May", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}