{"pressItemDictionary": {"Press Releases": [{"Title": "No Prior Appointment Needed At Moderna Vaccination Centres ", "PublishedDate": "/Date(1627887120000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "02 Aug 2021", "Summary": "", "MainContent": "<p>We have made good progress in our national COVID-19 vaccination programme thus far. As of 31 July 2021, we have administered around 7.5 million doses of COVID-19 vaccine. Around 4.3 million individuals have received at least the first dose of the vaccine, of whom about 3.3 million have completed the full vaccination regimen. This means about 61% of Singapore residents have completed the full vaccination regimen.<br><br>2.&nbsp; &nbsp; &nbsp; &nbsp;Thus far, 83% of those aged 60 and above, 88% of those aged 45 to 59, 87% of those aged 40 to 44, and 83% of those aged 12 to 39 years of age, have received at least one dose of COVID-19 vaccine or booked their appointments.<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp;Since mid-July, seniors aged 60 and above have been allowed to walk into any vaccination centre, polyclinic or participating Public Health Preparedness Clinic to receive their vaccination without an appointment. To further increase the convenience for all to get vaccinated, from 2 August 2021, all Singaporeans, Permanent Residents, and Long-Term Pass holders aged 18 years old and above who have not yet come forward for their first dose will be able to walk-in to any of our 11 community vaccination centres offering the Moderna COVID-19 vaccine without a prior appointment. These vaccination centres are at:</p><ul><li>Buona Vista Community Club</li><li>Hong Kah North Community Club</li><li>Kebun Baru Community Club</li><li>Kolam Ayer Community Club</li><li>Marsiling Community Club</li><li>Potong Pasir Community Club</li><li>Punggol 21 Community Club</li><li>Radin Mas Community Club</li><li>Tampines East Community Club</li><li>Woodlands Community Club</li><li>Tew Tee Community Club</li></ul><p>4.&nbsp; &nbsp; &nbsp;Vaccination remains a key enabler in our fight against COVID-19. Its ability to help Singapore reopen safely can only be felt when we can collectively achieve a high level of population coverage for vaccination. We urge all who are eligible to be vaccinated. Individuals can also book appointments at www.vaccine.gov.sg to get vaccinated.<br><br><strong>MINISTRY OF HEALTH<br>2 AUGUST 2021</strong><br></p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "no-prior-appointment-needed-at-moderna-vaccination-centres", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}