{"pressItemDictionary": {"Press Releases": [{"Title": "Suspension of Hooi Kee Eating House’s Food Business Operations", "PublishedDate": "/Date(1613052000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "11 Feb 2021", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The Ministry of Health (MOH) and the Singapore Food Agency (SFA) are investigating a cluster of two typhoid fever cases who were reported to have symptoms including fever, headache, diarrhoea and cough, after consuming food prepared by Hooi Kee Eating House (located at 190 Clemenceau Avenue, #01-19/20, Singapore Shopping Centre) on several occasions from 2 January to 18 January 2021. Both cases were hospitalised. One has since been discharged and the other is in stable condition in hospital.</p><p>2 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In view of the suspected ongoing transmission, SFA has issued a direction to suspend Hooi Kee Eating House’s food business operations with effect from 11 February 2021 until further notice. Members of the public who have consumed food from Hooi Kee Eating House and subsequently develop prolonged fever, should consult their general practitioner immediately and inform the doctor of their food history.<br></p><p>3 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; All food handlers working in the premises are required to re-attend and pass the Food Safety Course Level 1 and test negative for foodborne pathogens, before they can resume work as food handlers. The appointed Food Hygiene Officer(s) working at the premises are also required to re-attend and pass the WSQ Conduct Food and Beverage Hygiene Audit course before he/she can resume work as a Food Hygiene Officer. The licensee is also required to clean and sanitise the premises, including equipment and utensils.<br></p><p>4 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Food safety is a joint responsibility. SFA would like to remind food operators to observe good food and personal hygiene practices at all times. SFA will not hesitate to take firm action against anyone found to be in violation of the Environmental Public Health Act. In the interest of maintaining a high standard of food hygiene at all eating establishments, we would also like to advise members of the public who come across&nbsp;poor hygiene practices in food establishments not to patronise such outlets but to report to SFA via the online feedback form (<a href=\"http://www.sfa.gov.sg/feedback\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?q=http://www.sfa.gov.sg/feedback&amp;source=gmail&amp;ust=1613139663605000&amp;usg=AFQjCNHGA23VZdzRhUcqT0mXoIuewJrlXw\" title=\"\" class=\"\">http://www.sfa.gov.sg/<wbr>feedback</a>) with details for our follow-up investigations.<br></p><p>&nbsp;</p><p><strong>Health Advisory</strong></p><p>5 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Typhoid fever is a bacterial infection caused by Salmonella typhi. Food items which could be contaminated by the bacteria include raw or ready-to-eat foods, such as raw (unpasteurised) milk or their products, seafood, and fresh produce including fruits and vegetables.<br></p><p>6 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; A person with typhoid fever usually has prolonged fever which may be accompanied by other symptoms common to many diseases, such as headache, body aches, vomiting, diarrhoea or constipation. Typhoid fever is treatable with antibiotics.<br></p><p>7 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The key to prevention of typhoid fever lies in hand hygiene, safe handling, cooking and consumption of food. Individuals can reduce their risk of getting typhoid fever by:<br></p><ul><li>Washing and peeling raw fruit or vegetables that can be peeled before consumption;</li><li>Thoroughly cooking food;</li><li>Avoiding raw (unpasteurised) milk or foods made from raw milk;</li><li>Washing hands and kitchen utensils such as knives and cutting boards thoroughly before handling food; and</li><li>Using separate sets of knives and cutting board for raw and cooked food.</li></ul><p><strong><br>Ministry of Health<br>Singapore Food Agency<br>11 February 2021</strong></p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "suspension-of-hooi-kee-eating-house-s-food-business-operations", "CurrentPageUrl": null}, {"Title": "3 New Cases of Locally Transmitted  Covid-19 Infection", "PublishedDate": "/Date(1613028780000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "11 Feb 2021", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; As of 11 February 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 3 new cases of locally transmitted COVID-19 infection. Based on our investigations so far, the cases are in the community, and there are no new cases in the dormitories. <br><br>2.&nbsp; &nbsp; &nbsp; &nbsp;In addition, there are 9 imported cases, who had already been placed on Stay-Home Notice upon arrival in Singapore. In total, there are 12 new cases of COVID-19 infection in Singapore today. <br><br>3.&nbsp; &nbsp; &nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight. <br><br>4.&nbsp; &nbsp; &nbsp;With increased interactions over the Chinese New Year period, there will be higher transmission risks in the community. It is important that everyone remain vigilant and adhere to the safe management measures. The number of visitors per household per day is limited to 8 distinct persons. We encourage everyone to connect digitally with their family and friends instead of going on physical visits. For those who plan to do house visits, they should limit their visits to family members and to not more than 2 other households a day. Face masks must be worn during <em>lohei</em>, and there should not be any verbalisation of the usual auspicious phrases. If we all play our part, we can continue to keep the number of cases in our community low.</p> <p><strong>MINISTRY OF HEALTH<br></strong><strong>11 FEBRUARY 2021</strong></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "3-new-cases-of-locally-transmitted-covid-19-infection-11feb", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}