{"pressItemDictionary": {"Press Releases": [{"Title": "7 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1620485400000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "08 May 2021", "Summary": "", "MainContent": "<span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp; As of 8 May 2021, 12pm, the Ministry of Health (MOH) has confirmed and verified that there are 7 new cases of locally transmitted COVID-19 infection, of whom 2 are linked to previous cases and had already been placed on quarantine. The cases are in the community, and there are no new cases in the dormitories. There are 13 imported cases, who had already been placed on Stay-Home Notice (SHN) or isolated upon arrival in Singapore. Amongst the new cases today, 14 are asymptomatic, and were detected from our proactive screening and surveillance, while 6 were symptomatic.&nbsp;&nbsp;<br><br><strong>Summary of new cases<br><br></strong></span><div dir=\"ltr\" align=\"left\"><span style=\"font-size: 16px;\"></span><table><colgroup><col width=\"129\"><col width=\"60\"><col width=\"16\"><col width=\"96\"><col width=\"96\"><col width=\"16\"><col width=\"96\"><col width=\"96\"></colgroup><tbody><tr><td><span style=\"font-size: 16px;\"><br></span></td><td><span style=\"font-size: 16px;\"><strong><br></strong></span></td><td><span style=\"font-size: 16px;\"><strong><br></strong></span></td><td colspan=\"2\"><p dir=\"ltr\"><span style=\"font-size: 16px;\"><strong>Breakdown by</strong></span></p></td><td><span style=\"font-size: 16px;\"><strong><br></strong></span></td><td colspan=\"2\"><p dir=\"ltr\"><span style=\"font-size: 16px;\"><strong>Breakdown by</strong></span></p></td></tr><tr><td><span style=\"font-size: 16px;\"><strong><br></strong></span></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\"><strong>Number of cases</strong></span></p></td><td><span style=\"font-size: 16px;\"><strong><br></strong></span></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\"><strong>Already in quarantine/ isolation before detection</strong></span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\"><strong>Detected from surveillance</strong></span></p></td><td><span style=\"font-size: 16px;\"><strong><br></strong></span></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\"><strong>Symptomatic</strong></span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\"><strong>Asymptomatic</strong></span></p></td></tr><tr><td><p dir=\"ltr\"><span style=\"font-size: 16px;\"><strong>Cases in the community</strong></span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">7</span></p></td><td><span style=\"font-size: 16px;\"><br></span></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">2</span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">5</span></p></td><td><span style=\"font-size: 16px;\"><br></span></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">3</span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">4</span></p></td></tr><tr><td><p dir=\"ltr\"><span style=\"font-size: 16px;\"><strong>Cases residing in dormitories</strong></span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">0</span></p></td><td><span style=\"font-size: 16px;\"><br></span></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">0</span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">0</span></p></td><td><span style=\"font-size: 16px;\"><br></span></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">0</span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">0</span></p></td></tr><tr><td><p dir=\"ltr\"><span style=\"font-size: 16px;\"><strong>Imported cases</strong></span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">13</span></p></td><td><span style=\"font-size: 16px;\"><br></span></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">13</span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">0</span></p></td><td><span style=\"font-size: 16px;\"><br></span></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">3</span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">10</span></p></td></tr><tr><td><p dir=\"ltr\"><span style=\"font-size: 16px;\"><strong>Total</strong></span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">20</span></p></td><td><span style=\"font-size: 16px;\"><strong><br></strong></span></td><td><span style=\"font-size: 16px;\"><strong><br></strong></span></td><td><span style=\"font-size: 16px;\"><strong><br></strong></span></td><td><span style=\"font-size: 16px;\"><strong><br></strong></span></td><td><span style=\"font-size: 16px;\"><strong><br></strong></span></td><td><span style=\"font-size: 16px;\"><strong><br></strong></span></td></tr></tbody></table></div><span style=\"font-size: 16px;\"><strong><br></strong><br>2.&nbsp; &nbsp; &nbsp; Overall, the number of new cases in the community has increased from 37 cases in the week before to 43 cases in the past week. The number of unlinked cases in the community has remained stable at 10 cases per week in the past 2 weeks. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br><br>3.&nbsp; &nbsp; &nbsp;&nbsp;Amongst the 152 confirmed cases reported from 2 May to 8 May, 49 cases have tested positive for their serology tests, 77 have tested negative, and 26 serology test results are pending.<br></span><div><span style=\"font-size: 16px;\"><br></span></div><span style=\"font-size: 16px;\"><strong><br>Case Details<br><br>a) Cases in the community: 7<br></strong></span><div><span style=\"font-size: 16px;\"><strong><br></strong></span></div><span style=\"font-size: 16px;\">There are 7 cases in the community today, of whom 2 are linked to previous cases and 5 are currently unlinked.&nbsp;<strong><br><br></strong><span style=\"text-decoration: underline;\">Case 62937</span><strong><br><br></strong>Case 62937 is a 40 year-old male Singaporean who is employed by Batamindo Shipping &amp; Warehousing Pte Ltd and deployed as an operations assistant at Keppel Distripark. He had not been at Pasir Panjang Terminal. He also works part-time as a GrabFood delivery personnel.&nbsp;<br><br>He is asymptomatic, and was detected when he was tested on 4 May as part of Rostered Routine Testing (RRT). His pooled test result came back positive for COVID-19 the next day. He was conveyed to the National Centre for Infectious Diseases (NCID) on 6 May, and an individual test was done. His test result came back positive for COVID-19 infection. His earlier tests from RRT – the last being on 14 March – were all negative for COVID-19 infection. His serology test result has come back positive but we have assessed that this is likely a recent infection.<strong><br><br></strong><span style=\"text-decoration: underline;\">Case 62940</span><strong><br><br></strong>Case 62940 is a 47 year-old male Work Permit holder who is employed by Ramky Cleantech Services Pte Ltd as a cleaner deployed at Changi Airport Terminal 3.&nbsp; &nbsp;&nbsp;<br><br>He is asymptomatic, and was detected when he was tested on 5 May as part of RRT. His pooled test result came back positive for COVID-19 on the same day. He was conveyed to NCID on 6 May, and an individual test was done. His test result came back positive for COVID-19 infection on 7 May. His earlier tests from RRT – the last being on 21 April – were all negative for COVID-19 infection. His serology test result has come back positive but we have assessed that this is likely a recent infection. Case 62940 received his first dose of COVID-19 vaccine on 29 January, and the second dose on 19 February.<strong><br><br></strong><span style=\"text-decoration: underline;\">Case 62941</span><strong><br><br></strong>Case 62941 is a 18 year-old female Singaporean who is a student at Victoria Junior College (20 Marine Vista), and was last in school on 5 May.&nbsp;<br><br>She developed flu-like symptoms after school on 5 May, and a fever the next day. She sought medical treatment at a General Practitioner clinic on 6 May, where she was tested for COVID-19. Her test result came back positive the next day. Her serological test result is pending.&nbsp;<br><br>As a precautionary measure, MOH will commence a testing operations to test all students, staff, vendors and visitors of Victoria Junior College for COVID-19.<strong><br><br><span style=\"text-decoration: underline;\"></span></strong><span style=\"text-decoration: underline;\"><br>Case 62942</span><strong><span style=\"text-decoration: underline;\"></span><br><br></strong>Case 62942 is a 33 year-old male Singaporean who works as a safety coordinator employed by Shimizu Corporation and deployed at Changi Airport Terminal 3. His work does not entail interaction with passengers.&nbsp;<br><br>He was tested for COVID-19 as part of RRT on 4 May. He developed a fever after work on 5 May, and sought medical treatment at a General Practitioner clinic the next day, where he was tested for COVID-19. His test result came back positive on 7 May, as did his RRT pooled test result, and he was conveyed to NCID. His serology test result has come back negative.&nbsp;<br><span style=\"text-decoration: underline;\"><br>Case 62945</span><strong><br><br></strong>Case 62945 is a 57 year-old male Singaporean who works as an aviation officer at&nbsp; Changi Airport Terminal 1 and Terminal 3. His work entails screen departing and transiting passengers.<br><br>He was tested for COVID-19 as part of RRT on 5 May, and developed a sore throat in the evening but did not seek medical treatment. He went to work the next day, and his sore throat worsened. On 7 May, his pooled test result came back positive for COVID-19, and an individual swab was taken. His individual test result came back positive on the same day and he was conveyed to NCID in an ambulance. His earlier tests from RRT – the last being on 23 April – were all negative for COVID-19 infection. His serology test result is pending. Case 62945 received his first dose of COVID-19 vaccine on 14 January, and the second dose on 4 February.&nbsp;<br><br>Given the recent cases who work at Changi Airport, as a precautionary measure MOH will commence a special testing operations for all staff working at Changi Airport Terminal 1 and Terminal 3, and Jewel.&nbsp;&nbsp;<strong><br><br>Case 61822 cluster<br><br></strong><span style=\"text-decoration: underline;\">Case 62938</span><strong><br><br></strong>Case 62938 is a 27 year-old male Work Permit holder who works as a car groomer at BlackNano Pte Ltd (1 Bukit Batok Crescent), but he does not typically interact with customers. He is a family member and household contact of Cases 62824[1], 62877[2], 62906[3] and 62939.<br><br>As he had been identified as a close contact of Case 62824, he was placed on quarantine on 5 May. He is asymptomatic, but was tested for COVID-19 on 6 May during quarantine. His test result came back positive the next day. His serology test result is negative.<strong><br><br></strong><span style=\"text-decoration: underline;\">Case 62939</span><strong><br><br></strong>Case 62939 is a 54 year-old male Singapore Permanent Resident who works as a car mechanic at Jag Technical Services Pte Ltd (209 New Upper Changi Road). His work entails occasionally going to Singapore Armed Forces (SAF) camps for servicing and repair of vehicles but he did not interact with any SAF personnel. He is a family member and household contact of Cases 62824, 62877, 62906 and 62938.<br><br>As he had been identified as a close contact of Case 62824, he was placed on quarantine on 5 May. He is asymptomatic, but was tested for COVID-19 on 6 May during quarantine. His test result came back positive the next day. His serology test result was negative for the N antigen, which suggests the presence of early infection. Case 62939 received his first dose of COVID-19 vaccine on 6 March, and the second dose on 27 March.&nbsp;<strong><br></strong></span><div><span style=\"font-size: 16px;\"><br><strong>b) Cases residing in dormitories: 0</strong><br><br>There are no cases residing in dormitories today.&nbsp;<br><br><strong>c) Imported cases: 13<br></strong></span><div><span style=\"font-size: 16px;\"><br></span></div><span style=\"font-size: 16px;\">Amongst the 13 imported cases,&nbsp;<br><br></span><ul><li dir=\"ltr\" aria-level=\"1\"><p dir=\"ltr\" role=\"presentation\"><span style=\"font-size: 16px;\">6 (Cases 62946, 62949, 62951, 62952, 62953, 62954) are Singaporeans and 3 (Cases 62943, 62947 and 62962) are Singapore Permanent Residents who returned from Canada, India and Indonesia.</span></p></li><li dir=\"ltr\" aria-level=\"1\"><p dir=\"ltr\" role=\"presentation\"><span style=\"font-size: 16px;\">1 (Case 62935) is a Dependant’s Pass holder who arrived from Canada.&nbsp;</span></p></li><li dir=\"ltr\" aria-level=\"1\"><p dir=\"ltr\" role=\"presentation\"><span style=\"font-size: 16px;\">2 are Work Permit holders who arrived from Bangladesh and Indonesia, of whom 1 (Case 62968) is a foreign domestic worker.</span></p></li><li dir=\"ltr\" aria-level=\"1\"><p dir=\"ltr\" role=\"presentation\"><span style=\"font-size: 16px;\">1 (Case 62944) is a Short-Term Visit Pass holder who is a sea crew. He arrived onboard a vessel from Malaysia and was tested for COVID-19. He had not disembarked except to go for COVID-19 testing, and was conveyed to the hospital when his result came back positive.</span></p></li></ul><p dir=\"ltr\" aria-level=\"1\"><span style=\"font-size: 16px;\">They had all already been placed on SHN or isolated upon arrival in Singapore and were tested while serving SHN or during isolation. The arrivals from the Indian sub-continent had already come into Singapore before the restrictions on travel were imposed [4].<br><br>Please refer to the <a href=\"/docs/librariesprovider5/pressroom/press-releases/annexes-(7).pdf?sfvrsn=e9dd732f_0\" title=\"Annexes\">Annexes</a>&nbsp;and MOH’s daily Situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\" title=\"\" class=\"\" target=\"\">www.moh.gov.sg/covid-19/situation-report</a>) for details.&nbsp;</span></p><span style=\"font-size: 16px;\"><br>5.&nbsp; &nbsp; &nbsp; Epidemiological investigations are in progress. In the meantime, all the identified close contacts of the cases have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for the close contacts to determine if the cases could have been infected by them.<br><br><strong>Update on condition of confirmed cases</strong><br><br>6.&nbsp; &nbsp; &nbsp;&nbsp;6 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 60,912 have fully recovered from the infection and have been discharged from hospitals or community care facilities.&nbsp;<br><br>7.&nbsp; &nbsp; &nbsp;&nbsp;There are currently 133 confirmed cases who are still in hospital. Of these, most are stable or improving, and 2 are in critical condition in the intensive care unit. 255 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 31 have passed away from complications due to COVID-19 infection.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>8 MAY 2021</strong></span><br><div><br><br><br><br>[1] Case 62824 is a 59 year-old male Singaporean who is works as a trailer truck driver at Brani Terminal and Pasir Panjang Terminal. He was confirmed to have COVID-19 infection on 4 May.<br><div>[2]&nbsp;Case 62877 is a 22 year-old male Singapore Permanent Resident who is a full-time National Serviceman with the Singapore Armed Forces and household contact of Case 62824. He was confirmed to have COVID-19 infection on 6 May.<br>[3]&nbsp;Case 62906 is a 58 year-old male Singaporean who is currently unemployed. He is a family member and household contact of Cases 62824 and 62877. He was confirmed to have COVID-19 infection on 6 May.<br>[4]&nbsp;&nbsp;From 23 April 2021, 2359 hours, all long-term pass holders and short-term visitors with recent travel history (including transit) to India within the last 14 days will not be allowed entry into Singapore, or transit through Singapore. From 1 May 2021, 2359 hours, all long-term pass holders and short-term visitors with recent travel history (including transit) to Bangladesh, Nepal, Pakistan and Sri Lanka within the last 14 days will not be allowed entry into Singapore, or transit through Singapore.<br><div><br></div></div></div><br></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "7-new-cases-of-locally-transmitted-covid-19-infection-8-may-2021-update", "CurrentPageUrl": null}, {"Title": "7 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1620459300000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "08 May 2021", "Summary": "", "MainContent": "<span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp; As of 8 May 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 7 new cases of locally transmitted COVID-19 infection, of whom 2 are linked to previous cases and had already been placed on quarantine. Based on our investigations so far, the cases are in the community, and there are no new cases in the dormitories.<br><br>2.&nbsp; &nbsp; &nbsp; In addition, there are 13 imported cases, who had already been placed on Stay-Home Notice or isolated upon arrival in Singapore. Amongst them, 9 are Singaporeans or Singapore Permanent Residents.<br><br>3.&nbsp; &nbsp; &nbsp;&nbsp;In total, there are 20 new cases of COVID-19 infection in Singapore today.<br><br>4.&nbsp; &nbsp; &nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;<br></span><div><span style=\"font-size: 16px;\"><br><br><strong>MINISTRY OF HEALTH<br>8 MAY 2021</strong></span></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "7-new-cases-of-locally-transmitted-covid-19-infection-8-may-2021", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}