{"pressItemDictionary": {"Press Releases": [{"Title": "Expert Committee On Covid-19 Vaccination Statement On Skin Reactions After Vaccination and Refraining From Strenuous Physical Activity After Vaccination", "PublishedDate": "/Date(1631775600000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "16 Sep 2021", "Summary": "", "MainContent": "<p><span style=\"font-family: Arial; font-size: 16px;\">&nbsp; &nbsp; &nbsp; The Expert Committee on COVID-19 Vaccination (EC19V), having reviewed further vaccine safety data, has recommended the following:<br></span></p><p style=\"margin-left: 40px;\"><span style=\"font-family: Arial; font-size: 16px;\"><br>a.&nbsp; &nbsp; Persons who developed delayed non-severe skin reactions and persons who had non-specific skin symptoms after receiving a mRNA COVID-19 vaccine may be suitable to receive subsequent doses of the same vaccine&nbsp;<br><br>b.&nbsp; &nbsp; Vaccinated persons, particularly adolescents and those of younger age, should avoid strenuous physical activity for two weeks after any dose of the mRNA COVID-19 vaccines</span></p><p style=\"\"><span style=\"font-family: Arial; font-size: 16px;\"><br><strong>Skin Reactions that Develop After Vaccination</strong><br><br>2.&nbsp; &nbsp; Persons with mild or non-specific skin reactions following the first dose of a mRNA COVID-19 vaccine were previously deemed ineligible for further vaccine doses of the vaccine. This has resulted in such persons being declined further doses.<br><br>3.&nbsp; &nbsp; In view of international evidence and accrued local experience around the safety of the COVID-19 mRNA vaccines, this has been reviewed. Persons who developed the following skin reactions to a previous dose of mRNA-based vaccine may now be able to receive a subsequent dose of the same vaccine:<br></span></p><p style=\"margin-left: 40px;\"><span style=\"font-family: Arial; font-size: 16px;\"><br>a.&nbsp; &nbsp; Non-severe skin reactions occurring more than four hours after vaccination without other symptoms<br><br>b.&nbsp; &nbsp; Non-specific skin symptoms such as itching without a rash, a red patch beyond the injection site or eczema<br><br>c.&nbsp; &nbsp; Flares of underlying skin condition such as psoriasis and eczema<br></span></p><p style=\"\"><span style=\"font-family: Arial; font-size: 16px;\"><br>4.&nbsp; &nbsp; This will allow more persons, particularly those with minor or non-specific past reactions, to safely complete vaccination. Persons with the above conditions are encouraged to return to their previous vaccination sites in order to be reassessed for eligibility to complete their vaccination.<br><br><strong>Refraining from Strenuous Physical Activity for Two Weeks After Vaccination&nbsp;<br></strong><br>5.&nbsp; &nbsp; Local and overseas data continue to show a small risk of developing myocarditis or pericarditis after mRNA COVID-19 vaccination, occurring predominantly in younger persons and after dose 2. As per the fifth COVID-19 vaccine safety update released on 16 September 2021 by Health Sciences Authority (HSA), the overall local incidence after dose 2 was 1.06 per 100,000 doses administered, and the incidence rate in males below 30 years old after dose 2 was 4.84 per 100,000 doses administered.&nbsp;<br><br>6.&nbsp; &nbsp; While most of the cases reported previously had occurred within one week of vaccination, HSA had also started to receive reports of some cases that occurred within the second week of vaccination. Myocarditis and pericarditis after vaccination are rare, but occurrence tends to be higher in young males aged 30 years and below. As a further precaution, vaccinated persons, in particular adolescents and younger persons, who have received any dose of the mRNA COVID19 vaccines, should be advised to avoid strenuous exercise or physical activity for <strong>two weeks</strong> after the vaccination, instead of one week which was previously recommended. During this time, they should seek medical attention promptly if they develop chest pain, shortness of breath or palpitations. Vaccination providers should advise this to individuals receiving the vaccine.&nbsp;<br><br>7.&nbsp; &nbsp; Thus far, most local cases of vaccine-related myocarditis in the younger age group have been mild, responded well to treatment and are recovering or were discharged well from the hospital. This is consistent with what has been observed internationally.&nbsp;<br><br><strong>Conclusion</strong><br><br>8.&nbsp; &nbsp; EC19V will continue to monitor the data and developments around COVID-19 vaccination and will update its recommendations as needed.<br><br><br><strong>EXPERT COMMITTEE ON COVID-19 VACCINATION<br>16 SEPTEMBER 2021</strong></span></p><p style=\"\"><span style=\"font-family: Arial;\"><span style=\"font-size: 16px;\">&nbsp;</span></span></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "expert-committee-on-covid-19-vaccination-statement-on-skin-reactions-after-vaccination-and-refraining-from-strenuous-physical-activity-after-vaccination", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}