{"pressItemDictionary": {"Press Releases": [{"Title": "Expansion of Vaccination Programme; Further Easing of Community Measures", "PublishedDate": "/Date(1616581800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "24 Mar 2021", "Summary": "", "MainContent": "<div><p><span style=\"font-size: 16px;\"><strong>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;</strong>It has been three months since we transited to Phase Three. With everyone’s efforts and cooperation, we have kept COVID-19 under control with local community cases remaining low at around two per week in the past month. While community transmission remains low, the risk of spread remains as the world continues to battle the virus. Vaccination is a key enabler to reducing this risk, together with other enablers such as safe management measures, testing and contact tracing. Singapore will be expanding our vaccination programme, and as we vaccinate more of our population, we will allow more economic and community activities to resume.<br><br><strong>Good Progress and Expansion of Vaccination Programme<br><br></strong>2.&nbsp; &nbsp; &nbsp; Our vaccination programme has progressed steadily thus far. As of 23 March 2021, around 1,109,000 COVID-19 vaccine doses have been administered. More than 799,000 individuals have received at least one dose of the vaccine. Amongst them, around 310,000 individuals have received their second doses and completed the full vaccination regimen.<br><br>3.&nbsp; &nbsp; &nbsp;&nbsp;In particular, we have made good progress since 22 February in vaccinating our seniors, starting first with those aged 70 years and above. With more regular deliveries of vaccine supplies, we had brought forward the vaccination of seniors aged 60 to 69 years-old by two weeks to mid-March 2021. More than 55% of our seniors have received their vaccination or made appointments to do so. We encourage seniors who have not yet done so to come forward to register for their vaccination as soon as possible. Seniors can also book their appointments for vaccination at any of the People’s Association’s community clubs and centres island-wide.<br><br>4.&nbsp; &nbsp; &nbsp;&nbsp;We will now roll out the vaccination programme to younger age groups. As they are more familiar with the use of digital technology, we will no longer be sending personalised letters of invitation to them. Instead we will adopt a two-step process. First, all who are eligible can register directly at the&nbsp;<a href=\"https://www.vaccine.gov.sg/\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?q=https://www.vaccine.gov.sg&amp;source=gmail&amp;ust=1616667338521000&amp;usg=AFQjCNGp4iz94dCdF4YZ9t6p7rJDWQZAEg\">vaccine.gov.sg</a>&nbsp;website. Second, the registrants will receive an SMS with a personalised URL enabling them to book their vaccination appointments online.[1]<br><br>5.&nbsp; &nbsp; &nbsp;&nbsp;We will start with persons aged 45 to 59 years old. With immediate effect, everyone in this age group can register their interest for the vaccination at&nbsp;<a href=\"https://www.vaccine.gov.sg/\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?q=https://www.vaccine.gov.sg&amp;source=gmail&amp;ust=1616667338521000&amp;usg=AFQjCNGp4iz94dCdF4YZ9t6p7rJDWQZAEg\">vaccine.gov.sg</a>. We will send out the SMSes to the registrants as soon as there are vacant slots available for booking. This should happen within a few days of registration, but we seek everyone’s understanding that the timing may vary and it may take longer in particular if there is a delay in the vaccine delivery schedule.<br><br>6.&nbsp; &nbsp; &nbsp;&nbsp;We encourage everyone in this age group who is medically eligible to take up this offer, so that we can protect ourselves and fellow Singaporeans from COVID-19. Please also encourage your family members and friends to go for their vaccination when they are offered the chance to book their slots.<br><br><strong>Remaining Vigilant as More Employees Return to Workplace<br><br></strong>7.&nbsp; &nbsp; &nbsp;&nbsp;The tripartite partners[2]&nbsp;have reviewed the safe management measures at our workplaces to allow greater flexibility for businesses and employees, while limiting the risks of COVID-19 transmission. The following updated requirements will take effect from 5 April 2021.&nbsp;<br><br><u>More employees may return to the workplace<br><br></u>8.&nbsp; &nbsp; &nbsp;&nbsp;We will shift from working-from-home as a default to a more flexible and hybrid way of working. Employers are encouraged to continue with work-from-home arrangements, but more employees will be allowed to return to the workplace to better support work and business operations. In particular up to 75% of the employees (who are presently able to work from home) can now be at the workplace at any one time, up from the current 50%. The current cap on the time an employee spends at the workplace will also be lifted.<br><br>9.&nbsp; &nbsp; &nbsp; Employers should continue to stagger start times and implement flexible working hours where possible. These measures help to lower transmission risks by reducing interactions at the workplace and reducing crowding at common spaces at or near the workplace and in public places, including public transport. Split team arrangements are no longer mandatory, although companies may continue to adopt such arrangements for business continuity purposes if they so choose. Restrictions against cross-deployment across workplaces remain in place.</span><span style=\"font-size: 16px; color: rgb(0, 0, 0);\"><br><br></span><u style=\"font-size: 16px;\">Limit social gatherings to 8 persons<br><br></u><span style=\"font-size: 16px;\">10.&nbsp; &nbsp; &nbsp;&nbsp;Social and recreational gatherings, such as team bonding events organised by the employer, will be allowed but must be limited to a total size of no more than 8 persons.&nbsp;<br><br></span><u style=\"font-size: 16px;\">Remaining vigilant to keep workplaces safe<br><br></u><span style=\"font-size: 16px;\">11.&nbsp; &nbsp; &nbsp;&nbsp;</span><strong style=\"font-size: 16px;\"></strong><span style=\"font-size: 16px;\">The tripartite partners urge companies to remain vigilant as more employees return to the workplace. Employers must continue to implement the prevailing safe management measures such as regular cleaning of common spaces, demarcating safe physical distancing and mask wearing at all times. In organising work-related events, companies are reminded to adhere to the necessary safe distancing and capacity limits to keep employees and stakeholders safe. Due to the higher risk of transmission when people are unmasked, meals should not be the main feature of the event, and companies should avoid holding events over mealtimes as far as possible.&nbsp; Enforcement actions will be taken against employers who fail to comply with the safe management measures, and that will include the possibility of workplace closures. Employers also have to be prepared that the situation is a dynamic one. If there is increased risk of COVID-19 resurgence, we will have to adjust our posture and more stringent measures at workplaces will have to be re-introduced.<br><br></span><strong style=\"font-size: 16px;\">Scaling Up of Activities with Pre-Event Testing<br><br></strong><span style=\"font-size: 16px;\">12.&nbsp; &nbsp; &nbsp;&nbsp;Since October 2020, to enable more activities to resume in a safe manner, the Ministry of Health (MOH) has been piloting the use of pre-event testing to reduce the risk of undetected COVID-19 cases being involved in an event. Pre-event testing requires participants of an event or activity to be tested before attending the event and no more than 24 hours before the end of their participation at the event, either at the event venue or at a dedicated testing facility or clinic. Only participants who have a valid negative COVID-19 test result will be allowed to participate in the event. This helps to prevent individuals infected with COVID-19 from transmitting it to other people at the event. We have since conducted pilots of such pre-event testing at selected events across different settings such as business-to-business events, wedding receptions, and live performances. These experiences have helped MOH and the private sector providers to assess the feasibility and operational workflows for implementing pre-event testing in these settings.<br><br></span><span style=\"font-size: 16px;\">13.&nbsp; &nbsp; &nbsp;&nbsp;From 24 April 2021, the following selected activities will be allowed to scale up further if they implement pre-event testing for their attendees. The respective safe management measures for each activity or sector[3], as well as the safe capacities for each venue, continue to apply (see summary in&nbsp;</span><strong style=\"font-size: 16px;\"><u><a href=\"/docs/librariesprovider5/pressroom/press-releases/mtf-press-con-annex-24-mar.pdf?sfvrsn=b70650de_0\" title=\"Annex\">Annex</a></u></strong><span style=\"font-size: 16px;\">):<br></span></p><p style=\"margin-left: 40px;\"><span style=\"font-size: 16px;\">a.&nbsp;&nbsp;&nbsp;&nbsp;<u>Marriage solemnisations</u>. To facilitate more people coming together to celebrate this key life event, the limit for marriage solemnisations[4]&nbsp;will be increased from 100 to 250 attendees in total (including the wedding couple, excluding the Licensed Solemniser and vendors) for the entire event, in zones of up to 50 attendees each. For solemnisation-only events involving more than 100 attendees, pre-event testing will be required&nbsp;<u>for the wedding couple</u>. If there are 100 or fewer attendees, pre-event testing will not be required.</span></p><p style=\"margin-left: 40px;\"><span style=\"font-size: 16px;\">&nbsp;</span></p><p style=\"margin-left: 40px;\"><span style=\"font-size: 16px;\">b.&nbsp;&nbsp;&nbsp;&nbsp;<u>Wedding receptions</u>. Similarly, the limit for wedding receptions[5]&nbsp;will be increased from 100 attendees to 250 attendees in total (including the wedding couple, excluding vendors) for the entire event, in zones or timeslots of up to 50 attendees each. Due to the higher risk of receptions where people are unmasked while enjoying their meals and come into close and prolonged contact with one another in celebration, pre-event testing for&nbsp;<u>all</u>&nbsp;attendees (including the wedding couple) will be required for wedding receptions involving more than 100 attendees.<br><br>c.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<u>Live performances</u>. Live performances at designated venues will be allowed to have up to 750 attendees if they implement pre-event testing, or to have up to 250 attendees if they do not implement pre-event testing. The National Arts Council will release updated guidelines on audience management at live performances subsequently.<br><br>d.&nbsp;&nbsp;&nbsp;&nbsp;<u>Pilot business-to-business events </u>[6]. Currently, business-to-business events being piloted and approved by Singapore Tourism Board (STB) may have up to 250 attendees, in zones of no more than 50 attendees each. If pre-event testing is implemented, these events will be allowed to have up to 750 attendees, in zones of no more than 50 attendees each. STB will release the updated Safe Business Events framework and application details subsequently.<br><br>e.&nbsp;&nbsp;&nbsp;&nbsp;<u>Pilot spectator sports events (seated)</u>. Currently, sport events being piloted and approved by SportSG have been allowed to take place.&nbsp;Under this pilot, sport events will be allowed to have up to 750 spectators if they implement pre-event testing, or to have up to 250 spectators without testing. SportSG will release further details on the pilot subsequently.</span></p><p><span style=\"font-size: 16px;\">&nbsp;</span></p><p><span style=\"font-size: 16px;\">14.&nbsp; &nbsp; &nbsp;&nbsp;In addition to the above, from 24 April 2021, to allow more people to bid farewell to loved ones, we will increase the cap for wakes and funerals&nbsp;<u>on the day of the burial/cremation only, from 30 to 50 persons at any one time</u>. The cap for other days of the wake remains at 30 attendees at any one time. Because pre-event testing is&nbsp;<strong><u>not</u></strong>&nbsp;required and there could be a large number of persons visiting over the course of the wake and funeral to pay their last respects, attendees are reminded to maintain safe distancing and keep masks on at all times to reduce the risk of spread.<br><br>15.&nbsp; &nbsp; &nbsp;&nbsp;From 24 April 2021, individuals who have completed the full vaccination regimen and have had time to develop sufficient protection (i.e. two weeks after the second dose of the Pfizer or Moderna COVID-19 vaccination) can gain entry to events that implement pre-event testing without the need to undergo pre-event testing. MOH will be releasing further information and tools to support the implementation of pre-event testing, which will be made available at&nbsp;<a href=\"https://go.gov.sg/pet\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?q=https://go.gov.sg/pet&amp;source=gmail&amp;ust=1616667338522000&amp;usg=AFQjCNGsc7bedONERnshfnAZx2KyL--SPw\">https://go.gov.sg/pet</a>&nbsp;when ready.<br><br><strong>Remaining Vigilant and Keeping Safe as More Activities Resume<br><br></strong>16.&nbsp; &nbsp; &nbsp;&nbsp;Even as we resume and scale up more activities, we must remain vigilant and not get complacent, so as to keep community transmission under control. Each of us should observe all the safe management measures, see a doctor and get tested when sick, and be vaccinated when it is offered to us. Even after we are vaccinated, we should continue to observe all safe management measures and practise good hygiene so as to protect those who are unvaccinated. As a larger proportion of our population becomes vaccinated, we can look forward to further reopening and gradually emerging stronger from this crisis together.<br><br><br><b>MINISTRY OF HEALTH<br>24 MARCH 2021</b></span></p><p><span style=\"font-size: 16px;\"><br></span></p></div><div><hr align=\"left\" size=\"1\" width=\"33%\"><div id=\"m_-2938504141478011754ftn1\"><p><span style=\"font-size: 16px;\">[1]&nbsp;The link that is provided in the official SMS will refer to “<a href=\"http://vaccine.gov.sg/\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?q=http://vaccine.gov.sg&amp;source=gmail&amp;ust=1616667338522000&amp;usg=AFQjCNFqPv8QB38AUUZcWqJxd0tjbRCWbQ\">vaccine.gov.sg</a>”. Do not trust any other URLs that are not from a&nbsp;<a href=\"http://gov.sg/\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?q=http://gov.sg&amp;source=gmail&amp;ust=1616667338522000&amp;usg=AFQjCNGfRz66rR4rt_UrIFdc_74eyjaECQ\">gov.sg</a>&nbsp;domain. The COVID-19 vaccination is free for all Singaporeans and long-term residents in Singapore and no one should ask you for payment to register for appointment. From receipt of the SMS, individuals will be given 14 days to schedule an appointment.</span></p></div><div id=\"m_-2938504141478011754ftn2\"><p><span style=\"font-size: 16px;\">[2]&nbsp;The tripartite partners comprise Ministry of Manpower (MOM), National Trades Union Congress (NTUC) and Singapore National Employers Federation (SNEF).</span></p></div><div id=\"m_-2938504141478011754ftn3\"><p><span style=\"font-size: 16px;\">[3]&nbsp;Please refer to&nbsp;<a href=\"https://covid.gobusiness.gov.sg/permittedlist/\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?q=https://covid.gobusiness.gov.sg/permittedlist/&amp;source=gmail&amp;ust=1616667338522000&amp;usg=AFQjCNEqFX7DW9flv0SYXYQnzAXFq9StQg\">https://covid.gobusiness.gov.<wbr>sg/permittedlist/</a>&nbsp;for details of the sector-specific safe management measures.</span></p></div><div id=\"m_-2938504141478011754ftn4\"><p><span style=\"font-size: 16px;\">[4]&nbsp;Excluding solemnisations at home and the Registry of Civil and Muslim Marriages (ROM/M) Building, as these venues tend to be smaller.</span></p></div><div id=\"m_-2938504141478011754ftn5\"><p><span style=\"font-size: 16px;\">[5]&nbsp;Not allowed to take place at home and the Registry of Civil and Muslim Marriages (ROM/M) Building. Allowed to take place at external venues such as hotels, restaurants, function rooms, community centres/ clubs, and HDB common areas.</span></p></div><div id=\"m_-2938504141478011754ftn6\"><p><span style=\"font-size: 16px;\">[6]&nbsp;Business-to-business events such as meetings, conferences and exhibitions.</span></p></div></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "expansion-of-vaccination-programme-further-easing-of-community-measures", "CurrentPageUrl": null}, {"Title": "No New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1616570940000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "24 Mar 2021", "Summary": "", "MainContent": "<p align=\"center\" style=\"text-align: left;\"><span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;</span><span style=\"text-align: left;\"><span style=\"font-size: 16px;\">As of 24 March 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed that there are no new cases of locally transmitted COVID-19 infection.<br><br>2.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; There are 15 imported cases, who had already been placed on Stay-Home Notice upon arrival in Singapore.<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.<br><strong><br><br>MINISTRY OF HEALTH<br>24 MARCH 2021</strong></span></span><br></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "no-new-cases-of-locally-transmitted-covid-19-infection_24-Mar", "CurrentPageUrl": null}, {"Title": "Update On Tuberculosis Situation In Singapore", "PublishedDate": "/Date(1616558400000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "24 Mar 2021", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;On World Tuberculosis (TB) Day on 24 March, Singapore joins the global community in reiterating its commitment to continue the fight against TB. The World Health Organization’s (WHO) theme for 2021’s World TB Day is “The Clock is Ticking”, which appeals for global action on the commitments made by global leaders to end TB.</p> <p>2.&nbsp; &nbsp; &nbsp; &nbsp; TB remains a global public health threat. In 2019, there were more than 10 million cases of active TB globally, with 1.4 million deaths. In addition, there were almost half a million cases of multi-drug resistant TB (MDRTB). MDRTB is more difficult to treat and has lower cure rates, with death rates as high as 30 to 40 percent.</p><p><p>3.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;TB is endemic in Singapore and latent TB infection is not uncommon in our population, with rates of up to 30 per cent in the older age groups. In 2020, there were 1,370 new cases of active TB among Singapore residents. This is lower than the 1,398 cases in 2019. The incidence rate was 33.9 cases per 100,000 population in 2020, compared to 34.7 cases per 100,000 in 2019. Older age groups and males continue to make up a significant proportion of the new active TB cases. Please refer to the <u><a href=\"/docs/librariesprovider5/default-document-library/tb-annex-(1)807d564471834d1fa62b51965f9570aa.pdf?sfvrsn=a0fe1bf1_0\" title=\"Annex \">Annex </a></u> for details.</p></p><p><p><strong>TB Screening and Treatment in Singapore </strong></p><p>4.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; TB is an air-borne disease, and is transmitted through close and prolonged exposure to an infectious individual with untreated, active pulmonary (lung) TB. Not all individuals who are exposed to an infectious individual will get TB.</p></p><p><p>5.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; TB is curable and the spread of TB is preventable. To ensure early detection and treatment, and to curtail the spread of TB, the National TB Programme (STEP) carries out contact tracing and screening of close contacts to ensure that those at risk of infection are tested and receive appropriate treatment.</p></p><p><p>6.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Persons diagnosed with active TB will be started on treatment immediately and placed on medical leave. Once treatment starts, the person will rapidly become non-infectious and no longer pose as a source for infection. There is no further risk of exposure in the workplace or school, and there is therefore no need to for workplaces or places where a recently diagnosed active TB case has visited to be closed. Close contacts found to have latent TB infection are not infectious and can continue their activities as usual.</p></p><p><p>7.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;While there are national control measures in place to reduce the risk of TB transmission in Singapore, everyone plays an important role in preventing the spread of TB. Individuals who are unwell and display symptoms, such as cough, should seek medical attention early to ensure prompt diagnosis and treatment.</p></p><p><p><strong>Importance of Treatment Adherence</strong></p><p>8.&nbsp;<b> &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;</b>The full course of active TB treatment takes six to nine months (up to 24 months for drug-resistant TB). If patients do not adhere strictly to the treatment programme (e.g. taking their medication on time), there is a higher chance of disease relapse and developing MDRTB.</p></p><p><p>9.&nbsp; &nbsp; <strong>&nbsp; &nbsp; &nbsp; &nbsp;</strong> &nbsp;Directly Observed Treatment (DOT) remains a pillar of STEP. It comprises the administration of TB medicines by a trained healthcare worker to the patient, and is available at all the polyclinics. STEP manages an outreach DOT programme for patients who are unable to commute to clinics for their medications due to age or infirmity.</p></p><p><p>10.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;<b> &nbsp;</b>Support and encouragement from patients’ family members, friends and co-workers are vital in ensuring that TB patients successfully complete their treatment. Employers can also play their part, by granting their employees flexibility during the day to access DOT. Treatment adherence and completion will not only benefit the patient, but also protect his family, workplace and community from infection.</p></p><p><p>11.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;With everyone playing their part, we can ensure TB patients are treated effectively and reduce community transmission of TB in Singapore. More information on TB is available at the <a href=\"https://www.moh.gov.sg/content/moh_web/home/diseases_and_conditions/t/tuberculosis.html\">MOH website</a> or the <a href=\"https://www.healthhub.sg/a-z/diseases-and-conditions/91/tuberculosis\">HealthHub website</a>.<br><br></p></p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "update-on-tuberculosis-situation-in-singapore-2021", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}