{"pressItemDictionary": {"Press Releases": [{"Title": "125 Nurses Recognised With Nurses' Merit Award", "PublishedDate": "/Date(1625644800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "07 Jul 2021", "Summary": "", "MainContent": "<span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp;125 nurses were presented with the Nurses’ Merit Award (NMA) on 7 July 2021. The award recipients come from various care settings, spanning the community care sector, private hospitals and public healthcare institutions.&nbsp;<br><br>2.&nbsp; &nbsp; The NMA started in 1976 and is awarded to nurses who have displayed noteworthy and exceptional performance, participated in professional development, and contributed to raising the nursing profession. Nurses are nominated for the award by their healthcare institutions and selected by a panel set up by the Ministry of Health (MOH).&nbsp;<br><br>3.&nbsp; &nbsp; The award comes with a collar badge to be worn as part of the nurse’s uniform and a cash prize of $1,000. See <span style=\"text-decoration: underline;\"><a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-nma.pdf?sfvrsn=8e06096a_0\" title=\"Annex A\">Annex A</a></span> for the list of award recipients.<br><br><strong>Strengthening continued learning and professional development for nurses<br></strong><br>4.&nbsp; &nbsp; As we continue to expand our healthcare sector, our nursing workforce continues to grow. As at end 2020, more than 42,000 nurses are registered with the Singapore Nursing Board (SNB). Over the years, MOH has put in place various initiatives and programmes to enhance the professional development opportunities and career advancement of our nurses. At the virtual award ceremony, Minister for Health Ong Ye Kung elaborated further on these initiatives.&nbsp;<br><br><span style=\"text-decoration: underline;\">Developing Competency Frameworks<br></span><br>5.&nbsp; &nbsp; Following the launch of the Community Nursing Competency Framework (CNCF) last year, two other competency frameworks will be developed to meet the growing needs of the ageing population in Singapore – one for geriatric nursing, and another for palliative care nursing. The competency frameworks will serve as a guide for nurses and employers to identify skills gaps and pursue development opportunities.&nbsp;<br><br><span style=\"text-decoration: underline;\">National Nursing Academy</span><br><br>6.&nbsp; &nbsp; We are expanding the opportunities for continuous professional development, for our nurses. The National Nursing Academy (NNA) launched last year allows nurses to explore and attend training courses from other institutions, and facilitate portability of workplace-based training of nurses across institutions and settings. This would encourage collaboration amongst healthcare institutions, synergise efforts and reduce duplication.&nbsp;<br><br>7.&nbsp; &nbsp; As of April 2021, a total of 58 workplace-based and academic nursing Continuous Education and Training (CET) courses have been listed on the NNA website. Nurses can discuss with their supervisors to explore learning opportunities if they are keen to learn certain clinical skills and expand knowledge in areas they want to develop further.&nbsp;&nbsp;<br><br>8.&nbsp; &nbsp; The NNA also seeks to standardise curriculum requirements to share best practices and harmonise existing curricula at various institutions through the establishment of curricula blueprints. Currently, the blueprint for two core skills required of nurses working across different healthcare settings have been developed in consultation with healthcare institutions: 1) Intravenous Administration of Medications (IVAM), and 2) Venepuncture and Peripheral Intravenous Cannulation (VPIC). The curricula blueprints are accessible at <a href=\"https://www.nna.gov.sg/resources-tools/downloads\" title=\"\" class=\"\" target=\"\">https://www.nna.gov.sg/resources-tools/downloads</a>.&nbsp;<br><br>9.&nbsp; &nbsp; In May 2021, the NNA completed its inaugural course accreditation, where JurongHealth Campus’s IVAM and VPIC courses were accredited. Courses that meet the NNA’s accreditation standards support the portability of acquired competencies across healthcare institutions. More courses will be accredited over time. To find out more about the course listings including the NNA-accredited courses, please visit <a href=\"https://www.nna.gov.sg/learning-nna\" title=\"\" class=\"\" target=\"\">https://www.nna.gov.sg/learning-nna</a>.&nbsp;<br><br><span style=\"text-decoration: underline;\">Integrated Advanced Practice Nurse (APN) Internship Programme and APN faculty development</span><br><br>10.&nbsp; &nbsp; MOH will continue to strengthen training for Advanced Practice Nurses (APNs). The APN internship programme, which forms part of the training for APNs, undergoes regular reviews to ensure its training methods and curriculum delivery encourage optimal learning. This year, we will introduce a new Integrated APN Internship Programme (IAI), which will begin with the graduating cohort in August, to facilitate an early integration of Master of Nursing graduates to their respective areas of clinical practice.&nbsp;<br><br>11.&nbsp; &nbsp; In the new programme, the APN interns will be trained in a systematic and progressive method based on a blueprint and the use of Entrustable Professional Activities. These are key tasks that the APN intern can be trusted to perform once sufficient competence has been demonstrated at the workplace. Work-based assessments will then form the requirement towards the APN certification.&nbsp;<br><br>12.&nbsp; &nbsp; Interns who are progressing well will also have the option to enroll into the National Collaborative Prescribing Programme and graduate from the programme as a full-fledged APN with prescribing rights, to prescribe medication to patients within their scope of practice.&nbsp;<br><br>13.&nbsp; &nbsp; Traditionally, much of the APN teaching and training have been largely dependent on doctors. In preparation for the Integrated APN Internship programme, MOH has facilitated the progressive training and development of a faculty of APN Leads and Preceptors across healthcare institutions. As of May this year, 180 APNs have been trained as preceptors to provide clinical preceptorship and supervision to APN interns and students from the Master of Nursing programme. These APN Leads and Preceptors will co-precept with the doctors and be more involved in the teaching, supervision and assessment of the APN interns.&nbsp;<br><br>14.&nbsp; &nbsp; MOH will continue to develop the nursing profession by creating opportunities for nurses to upskill and enhance their professional development throughout their nursing careers.<br><br><br><strong>MINISTRY OF HEALTH<br>7 JULY 2021</strong></span><br>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "125-nurses-recognised-with-nurses'-merit-award", "CurrentPageUrl": null}, {"Title": "Speech by Minister for Health, Mr Ong Ye Kung, At the Nurses’ Merit Award 2021, 7 July 2021", "PublishedDate": "/Date(1625644800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "07 Jul 2021", "Summary": "", "MainContent": "<p><span style=\"font-size: 16px;\">Ms Paulin Koh, Chief Nursing Officer,<br>Nurses,<br>Distinguished Guests,<br>Ladies and Gentlemen&nbsp;<br><br>&nbsp; &nbsp; &nbsp; &nbsp;It gives me great pleasure today to join you for the 2021 Nurses’ Merit Award.&nbsp; This is a noble profession because every day, you touch the lives of many people through your dedication, care and compassion.&nbsp; While this is the first time I am officiating this ceremony, it is not the first time I worked with nurses.&nbsp;&nbsp;<br></span></p><p><span style=\"font-size: 16px;\">2.&nbsp; &nbsp; In 2005, I was leading the new Statutory Board called Workforce Development Agency (WDA).&nbsp; It was around that time that we recognised that the economy is evolving rapidly, and we need to retrain mid-career workers to switch into new professions and industry sectors.&nbsp; So we started a new scheme. It has a big name, called Strategic Manpower Conversion Programme (SMCP). Today we just call it Professional Conversion Programme.&nbsp;<br></span></p><p style=\"\"><span style=\"font-size: 16px;\">3.&nbsp; &nbsp;&nbsp;We needed a successful pilot programme, and so we asked ourselves: which profession should these mid-career workers convert into?&nbsp; It should be a sector that offers a good career and in great need for manpower.&nbsp; And therefore, SCMP (Nursing) got started, and that was also how Nanyang Polytechnic started its mid-career nursing programme.&nbsp;<br><br>4.&nbsp; &nbsp;&nbsp;Training duration was long, and quite expensive, but Government provided the budget nevertheless.&nbsp;<br><br>5.&nbsp; &nbsp;&nbsp;As it turned out, it was really difficult to recruit trainees. Despite the heightened interest in a nursing career due to your heroic contributions during SARS, many mid-career jobseekers let pass the opportunity.&nbsp;&nbsp;<br><br>6.&nbsp; &nbsp;&nbsp;I left WDA for my next assignment at NTUC without making a lot of headway. But my successors did. They kept working at it with MOH, and with the participating hospitals, and enrolment grew. Career paths and remuneration improved. Nanyang Polytechnic integrated its nursing programmes for young students and mid-career individuals into one, and also expanded its intake over the years. Ngee Ann Polytechnic jumped into the fray. National University of Singapore got into the space and offered an undergraduate programme which is very popular today. So there are now expanded offerings from Nitec, diploma, to degree level training for nurses. Nursing intakes have also grown. The Nursing Board reviewed the entry criteria for Registered Nurses to focus less on academic results achieved when young and upgrading from Enrolled Nurses to Registered Nurses became common and widely aspired by ITE graduates.&nbsp;&nbsp;<br><br>7.&nbsp; &nbsp;&nbsp;More importantly, the prestige of being a nurse grew and enhanced.&nbsp; A milestone was reached in 2015 when Dr Pauline Tan became the first nurse to be appointed the CEO of a hospital – the Yishun Community Hospital. I was on the Board of Khoo Teck Puat Hospital then, and everyone in the Board, and I’m sure every medical worker and, healthcare worker in the hospital was so happy and so proud of her. Adjunct Associate Professor Selina Seah is another nurse who was appointed as the assistant CEO of Changi General Hospital.<br><br>8.&nbsp; &nbsp;&nbsp;While the nursing profession has come a long way, we are committed to continue to develop the nursing profession.&nbsp;<br><br>9.&nbsp; &nbsp;&nbsp;Pay is of course important. Senior Minister of State Koh Poh Koon announced in March that nurses from public healthcare institutions and publicly-funded community care organisations can look forward to pay increases in the next two years.&nbsp; But more importantly, we need to develop your skills, and your careers. Let me cite a few important initiatives.&nbsp;<br><br>10.&nbsp; &nbsp;&nbsp;First, in January last year, we launched the Community Nursing Competency Framework which provides a roadmap for skills development for community nurses. Two other competency frameworks are now in the pipeline to meet the growing needs of our ageing population – one is for geriatric nursing, and the other, for palliative care nursing.&nbsp;<br><br>11.&nbsp; &nbsp;&nbsp;Second important initiative, is the National Nursing Academy, or NNA, which was launched in March 2020. It is a one stop portal to meet the learning needs of nurses. The courses listed on the portal are delivered by various healthcare institutions and Institutes of Higher Learning.&nbsp; To date, a total of 58 short courses are available on the portal.&nbsp;&nbsp;<br><br>12.&nbsp; &nbsp;&nbsp;But beyond a good listing of courses, the NNA encourages collaboration amongst the healthcare institutions, to synergise their efforts, reduce duplication, and recognise each other’s training credentials.&nbsp; As NNA also accredits the courses across healthcare institutions, this means that skills learnt are recognised and portable across hospitals and settings.&nbsp;<br><br>13.&nbsp; &nbsp;&nbsp;Third initiative, we will continue to strengthen the training for Advanced Practice Nurses (APNs).&nbsp; These are nurses who have met advanced clinical requirements, through the Master of Nursing programme and also completion of an APN internship.&nbsp;<br><br>14.&nbsp; &nbsp;&nbsp;This year, we will launch a new integrated APN internship or IAI programme to facilitate an early integration of Master of Nursing graduates to their respective areas of clinical practice. A key feature of the IAI programme will be the Entrustable Professional Activities. These are the tasks that an APN can be trusted to perform once sufficient competence has been demonstrated at the workplace, through workplace assessments. Certified competency to perform these tasks then form the requirement towards the APN certification.&nbsp;<br><br>15.&nbsp; &nbsp;&nbsp;Interns who are progressing well also have the option to enroll into the National Collaborative Prescribing Programme to attain prescribing rights. As of May this year, there are a total of 294 APNs, amongst whom 57 have prescribing rights. By 2030, we aim to have trained up to 700 APNs with prescribing rights.&nbsp;<br><br>16.&nbsp; &nbsp;&nbsp;To further grow the APN pipeline, we cannot just rely on medical colleagues for teaching and training. We have started to progressively develop a faculty of APN Leads and Preceptors across institutions. As of May this year, 180 APNs have been trained as preceptors to provide clinical preceptorship and supervision to APN interns and students from the Master of Nursing programme.&nbsp;<br><br>17.&nbsp; &nbsp;&nbsp;In closing, amid the backdrop of the COVID-19 pandemic, my sincere thanks go to all nurses for playing a crucial role in the fight against this pandemic. I believe there is renewed respect for nurses because of the crisis our nation is going through.&nbsp;&nbsp;<br><br>18.&nbsp; &nbsp;&nbsp;Many of you have been going through a lot of stress over the past 16 months, including when TTSH has been down with many nurses on quarantine. But nurses are resilient, and you forge on as always.&nbsp;<br><br>19.&nbsp; &nbsp;&nbsp;Vaccinations is a major prong of our strategy against COVID-19, and nurses again, you are on the ground executing the strategy in all our vaccination centres.&nbsp; Many of you are involved in vaccination operations, one way or another, be it in hospitals, polyclinics or vaccination centres. You have been working hard at the frontlines and I want to thank all of you for the vital role you play in keeping our loved ones and Singaporeans safe. With all your hard work, we will once again prevail over this wave of transmission.<br><br>20.&nbsp; &nbsp;&nbsp;This year, we have a total of 125 award recipients, our biggest cohort to date. All the recipients have consistently shown outstanding performance and contribution to the nursing profession, some with more than twenty years of experience.&nbsp;<br><br>21.&nbsp; &nbsp;&nbsp;Once again, my warmest congratulations to our 2021 Nurses’ Merit Award recipients. Thank you for your selfless contributions to our healthcare system. I wish all of you a Happy Nurses Day!<br></span></p><div><span style=\"font-size: 16px;\"><br></span></div><div><span style=\"font-size: 16px;\"><br></span></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "speech-by-minister-for-health-mr-ong-ye-kung-at-the-nurses-merit-award-2021-7-july-2021", "CurrentPageUrl": null}, {"Title": "5 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1625643000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "07 Jul 2021", "Summary": "", "MainContent": "<span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp;As of 7 July 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 5 new cases of locally transmitted COVID-19 infection. 3 are linked to previous cases, and have already been placed on quarantine. 2 are currently unlinked.<br><br>2.&nbsp; &nbsp; In addition, there are 7 imported cases, who have already been placed on Stay-Home Notice (SHN) or isolated upon arrival in Singapore. 5 were detected upon arrival in Singapore, while 2 developed the illness during SHN or isolation.<br><br>3.&nbsp; &nbsp; In total, there are 12 new cases of COVID-19 infection in Singapore today.<br><br>4.&nbsp; &nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.<br><br><strong><br>MINISTRY OF HEALTH<br>7 JULY 2021</strong></span>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "5-new-cases-of-locally-transmitted-covid-19-infection-7-jul-2021", "CurrentPageUrl": null}, {"Title": " Updates On Phase 3 (heightened Alert) Measures", "PublishedDate": "/Date(1625641200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "07 Jul 2021", "Summary": "", "MainContent": "&nbsp; &nbsp; &nbsp; &nbsp; It has been about two months since Singapore entered a state of Heightened Alert. Through the cooperation and efforts of everyone, we have managed to stabilise community infections and contain the spread of local clusters. Following the two stages of gradual reopening to Phase 3 (Heightened Alert) on 14 June and 21 June 2021, we will continue to calibrate the resumption of more economic and community activities.&nbsp;<br><br><strong>Updates on Local Situation<br></strong><br>2.&nbsp; &nbsp; &nbsp; As at 5 July 2021, the number of new cases in the community has decreased from 86 cases in the week before to 28 cases in the past week. The number of unlinked cases in the community has also decreased from 14 cases in the week before to 4 cases in the past week.&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp; Although we have seen a small number of cases that have surfaced, such as the ones around 105 Henderson Crescent and 115 Bukit Merah View Market and Food Centre, we have managed to identify and ringfence the spread through aggressive COVID testing operations and active surveillance in the community. We have slowed down the chains of transmission and are now in a position to ease some community measures further.<br><br><strong>Updates to Safe Management Measures in Phase 3 (Heightened Alert) from 12 July 2021</strong><br><br>4.&nbsp; &nbsp; &nbsp; &nbsp;The following updated measures will take effect from <strong>12 July 2021</strong> (please refer to <a href=\"/docs/librariesprovider5/default-document-library/annex-a_communitymeasures.pdf?sfvrsn=798141a6_0\" title=\"Annex A\">Annex A</a>&nbsp;for full details on the updated safe management measures (SMMs), including for other activities where applicable):<br><br>5.&nbsp; &nbsp; &nbsp; &nbsp;<em>Group sizes at Food &amp; Beverage (F&amp;B) establishments.</em> <strong>Groups of up to 5 persons</strong> will be able to dine-in at F&amp;B establishments. This is aligned with the social gathering group size allowed today. Dining-in remains a higher-risk activity because many people are unmasked and in close proximity with one another. Hence entertainment at F&amp;B establishments, e.g. live entertainment, recorded music, and videos/TV screening, will continue to be prohibited in order to reduce the expulsion of droplets from individuals having to raise their voices over the entertainment. Patrons are reminded to adhere to all other SMMs, e.g. social distancing and keeping masks on at all times except when eating or drinking.<br><br>6.&nbsp; &nbsp; &nbsp; <em>Resumption of wedding receptions. </em>Wedding receptions may resume from 12 July 2021, with <strong>no more than 250 persons allowed with Pre-Event Testing (PET)</strong>. For wedding receptions with 50 persons or less, PET will be required for the wedding party only. As wedding receptions are higher-risk activities where attendees tend to socialise more and over a longer period of time, attendees must adhere to all other SMMs to reduce the risk of transmission. Refer to MSF’s advisory for further details.&nbsp;<br><br>7.&nbsp; &nbsp; &nbsp; <em>Indoor high-intensity/ mask-off sports/ exercise activities</em>. Gyms and fitness studios may conduct indoor mask-off sports/ exercise activities in <strong>group sizes of up to 5 persons</strong>, similar to indoor mask-on and outdoor activities. Sports and exercise classes can continue in groups of no more than 5 persons, in classes of u<strong>p to 50 persons including the instructor, or the capacity limit of the venue, whichever is lower.</strong> SportSG will release more details on this.<br><br>8.&nbsp; &nbsp; &nbsp; <em>Social gatherings at the workplace. </em>Work-from-home will continue to remain the default arrangement so as to reduce overall interaction within workplaces and on public transport. Employers are reminded to ensure the practice continues, and for employees that need to come to the workplace, to stagger their start times and implement flexible working hours. Social and recreational gatherings at the workplace will be <strong>allowed but must be limited to a total size of no more than 5 persons </strong>in line with the broader community rules.<br><br><strong>Targeted Support Measures</strong><br><br>9.&nbsp; &nbsp; &nbsp; As announced earlier, the Government enhanced the Jobs Support Scheme (JSS) for affected sectors from 16 May to 11 July. With the gradual resumption of more economic and community activities, JSS support for these affected sectors will be tapered to 10% for two weeks from 12 to 25 July. Please refer to <a href=\"/docs/librariesprovider5/default-document-library/annex-b_supportmeasures.pdf?sfvrsn=cba4ab81_0\" title=\"Annex B\">Annex B</a>&nbsp;for the JSS levels of support for affected sectors.&nbsp;&nbsp;<br><br><strong>Updates to Regular Fast and Easy Tests for Staff Involved in Higher-Risk Activities</strong><br><br>10.&nbsp; &nbsp; &nbsp; We had earlier announced a progressive roll-out of Fast and Easy Tests (FETs) for staff in higher-risk settings. Since then, we have been working with the businesses to commence FET Rostered Routine Testing (RRT) via Employer-Supervised Self Swab or at Quick Test Centres. Many of the systems are now in place and therefore, from 15 July 2021, FET RRT will be made mandatory for all staff in the following higher-risk settings:&nbsp;&nbsp;<br><br>a.&nbsp; Dine-in F&amp;B establishments;<br>b.&nbsp; Personal care services (e.g. facial and nail services, spas/ saunas, massage establishments, hairdressing, and make-up services); and<br>c.&nbsp; Gyms and fitness studios where clients are unmasked.&nbsp;<br><br><strong>Increasing Access to ART Test Kits&nbsp;</strong><br><br>11.&nbsp; &nbsp; &nbsp;We had earlier announced that Over-the-Counter Antigen Rapid Tests (OTC ARTs) would be made available at designated local retail pharmacies from 16 June 2021. From 16 July 2021, we will extend the sale of these ART self-test kits to more general retailers like supermarkets and convenience stores. We will also lift the restriction that caps OTC ART sales at 10 kits per individual. With this, more individuals, particularly those who do not have acute respiratory infection symptoms, can test themselves if they are concerned about potential exposure to COVID-19.<br><br><strong>Deployment of SafeEntry and SafeEntry Gateway for all Supermarkets</strong><br><br>12.&nbsp; &nbsp; &nbsp;We have observed that there is a high volume of patrons in supermarkets, which increases the risk of transmission. To facilitate more targeted contact tracing for individuals who have overlapping visits with infected persons in indoor buildings, TraceTogether-only SafeEntry (TT-only SE) and SafeEntry Gateway (SEGW) check-in requirements will be re-introduced at supermarkets located within TT-only SE buildings with the same operating hours. This will take effect from 21 July 2021. Other supermarkets, e.g. standalone supermarkets, that have been implementing TT-only SE and SEGW check-in facilities will continue to do so. Customers of all supermarkets must check in with their TraceTogether (TT) App or Token using the SEGW, or by scanning the SafeEntry (SE) QR code with the TT App. We encourage all members of public to comply with SE check-in requirements and to carry their TT Token or keep their TT App active to facilitate contact tracing, and help protect themselves and their loved ones.<br><br><strong>Further Changes to be Made Upon 50% of the Population Completing the Full Vaccination Regimen</strong><br><br>13.&nbsp; &nbsp; &nbsp;As Singapore’s vaccination coverage continues to increase, we will introduce differentiated SMMs for vaccinated persons. This will allow individuals who have been fully vaccinated under the national vaccination programme to participate in more community and economic activities. When more people are vaccinated, it reduces the risk of spread from an infected person to another, in particular a non-vaccinated person who is more vulnerable to the disease.&nbsp;<br><br>14.&nbsp; &nbsp; &nbsp;In particular, we are considering the following measures if the situation continues to be stable and when at least half of the population has completed the full vaccination regimen, which is expected to be around end-July 2021:<br><br>a.&nbsp; Social gathering group sizes may increase to <strong>8 persons</strong>;<br><br>b.&nbsp; For activities/venues such as cinemas, congregational worship, MICE events, live performances, spectator sports and wedding solemnizations, we could allow a doubling in the group size if they are attended by <strong>fully vaccinated persons<sup>1</sup>, i.e. up to 500 persons may be allowed</strong>;<br><br>c.&nbsp; For higher-risk, indoor mask-off activities (e.g. F&amp;B dine-in), we could differentiate the guidelines such that <strong>a group size of up to 8 persons may be allowed only for fully vaccinated persons. Otherwise, the group size will remain at 5 persons</strong>;&nbsp;&nbsp;<br><br>d. Work-from-home will continue to remain the default, but more may be allowed to return to the workplace based on the percentage of total employees who are fully vaccinated.<br><br>Further details on the above measures and other changes will be announced nearer the implementation date.&nbsp;<br><br><strong>Towards a COVID-19 Endemic Singapore</strong><br><br>15.&nbsp; &nbsp; &nbsp;We have made significant progress in vaccinating the Singapore population since the start of this year and we must not lose our momentum. Even as we plan our transition and public health measures around vaccination milestones, we urge everyone who is eligible to step forward and get vaccinated as soon as possible. We also encourage those who have their second dose appointments scheduled 6 to 8 weeks from their first dose, to bring forward their second dose appointments to 4 weeks. Any further steps towards reopening and a Singapore with endemic COVID-19 will only be possible when more of our population is protected through vaccination.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>7 JULY 2021<br><br></strong><hr><div><br><sup>1 </sup>Fully vaccinated individuals would have received both doses of Pfizer-BioNTech/Comirnaty or Moderna vaccine, with an additional two weeks after the second dose for optimal protection. Recovered individuals would also qualify as they would have developed immunity against the virus. We are mindful about those who are still unvaccinated or are medically ineligible for the two mRNA vaccines, including children 12 years and below. We are considering separate provisions for this group, e.g. allow them to qualify based on a pre-event test, or allow children to qualify, but up to a limit.<br></div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "updates-on-phase-3-(heightened-alert)-measures-7Jul", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}