{"pressItemDictionary": {"Press Releases": [{"Title": "Enhanced Measures for Residential Care Homes", "PublishedDate": "/Date(1631432700000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "12 Sep 2021", "Summary": "", "MainContent": "&nbsp; &nbsp; &nbsp; &nbsp; The Ministry of Health (MOH) has detected an increase in the number COVID-19 cases recently amongst staff, clients and residents of aged care facilities, and will enhance measures to protect seniors residing at residential care homes who are typically frail and more vulnerable to complications of COVID-19.&nbsp;<br><br>2.&nbsp; &nbsp; &nbsp;In the last two weeks, there were 42 cases across 18 aged care facilities/providers. With the number of cases expected to continue to rise in the coming weeks, we need to take further action to protect the vulnerable seniors in these settings.&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp;As an enhanced measure to reduce the spread of COVID-19 in residential care homes, <strong>all in-person visits to residential care homes will be suspended from 13 September 2021 to 11 October 2021 (both dates inclusive)</strong>. This temporary suspension of visitation will give us time to encourage more unvaccinated seniors to get vaccinated, and roll out the vaccine booster programme for residents of aged care facilities, details of which were announced by MOH on 10 September 2021.&nbsp;<br><br>4.&nbsp; &nbsp; &nbsp;We will also be strengthening the testing regime for both staff and residents/clients of aged care facilities, and will use Antigen Rapid Tests (ART) more frequently, to complement the current surveillance testing in these settings.&nbsp;&nbsp;<br><br>5.&nbsp; &nbsp; &nbsp;We urge the next-of-kin of unvaccinated seniors in the aged care facilities to support and encourage their loved ones to be vaccinated. Unvaccinated seniors may suffer severe illness if infected. It is also important for vaccinated seniors to receive the booster vaccination when it is made available, to ensure a continued high level of immunity and protection from severe disease.&nbsp;<br><br>6. We will observe the situation in the coming weeks and will review the suspension of visitation accordingly. We seek the understanding and cooperation of all Singaporeans as we make adjustments to protect our seniors.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>12 SEPTEMBER 2021</strong>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "enhanced-measures-for-residential-care-homes", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}