{"pressItemDictionary": {"Press Releases": [{"Title": "5 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1620114240000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "04 May 2021", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As of 4 May 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 5 new cases of locally transmitted COVID-19 infection, all of whom were detected from our proactive testing of patients, visitors and staff at Tan Tock Seng Hospital or their close contacts, and had already been placed on quarantine. Based on our investigations so far, the cases are in the community, and there are no new cases in the dormitories.</p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In addition, there are 12 imported cases, who had already been placed on Stay-Home Notice upon arrival in Singapore.<br></p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In total, there are 17 new cases of COVID-19 infection in Singapore today.<br></p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.<br></p><p><strong><br>MINISTRY OF HEALTH<br>4 MAY 2021</strong></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "5-new-cases-of-locally-transmitted-covid-19-infection_4May", "CurrentPageUrl": null}, {"Title": "Introduction of Pre-implantation Genetic Testing for Monogenic/ Single Gene Defects and Chromosomal Structural Rearrangements As Clinical Services", "PublishedDate": "/Date(1620057600000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "04 May 2021", "Summary": "", "MainContent": "To continue safeguarding patient safety and ensuring appropriate standards of care, the Ministry of Health (MOH) will transit pre-implantation genetic testing for monogenic/ single gene defects (PGT-M) and pre-implantation genetic testing for chromosomal structural rearrangements (PGT-SR) from a pilot programme to regulated clinical services. The introduction of PGT-M and PGT-SR as clinical services allows patients who require these services to potentially access a larger selection of providers, beyond those in the pilot programme.<br><br>2.&nbsp; &nbsp; &nbsp; For couples undergoing Assisted Reproduction (AR) treatment, PGT-M and PGT-SR services will continue to be provided by the existing providers that meet the regulatory requirements, as well as new providers when they receive approval. There is no change to the criteria for couples who wish to undergo PGT-M and PGT-SR as these services should only be carried out for couples at risk of passing on serious genetic disorders.<br><br>3.&nbsp; &nbsp; &nbsp; Hospitals and clinics offering AR services, and clinical laboratories that currently offer or wish to offer PGT-M and PGT-SR will require approval from the MOH to offer these services and comply with the relevant regulatory terms and conditions under the Private Hospitals and Medical Clinics Regulations (PHMCR). As of 1 May 2021, MOH has received nine applications from hospitals, and clinics offering AR services and one clinical laboratory offering PGT-M and PGT-SR. The list of approved AR centres that eligible patients can approach for the PGT-M and PGT-SR services will be available on the MOH website.<br><br>4.&nbsp; &nbsp; &nbsp; PGT-M and PGT-SR, previously known as pre-implantation genetic diagnosis, have been available in Singapore since 2005, under a pilot programme by MOH. PGT-M and PGT-SR are offered to patients at risk of transmitting serious inheritable diseases that are due to single gene mutations or chromosomal structural rearrangements to their children. Based on findings from the pilot programme, PGT-M and PGT-SR were found to be safe and able to reduce the likelihood of liveborn offspring being affected by these serious inheritable diseases. The live birth rate per embryo transfer from PGT-M and PGT-SR under the local programme is also in line with overseas&nbsp; centres<sup>1</sup>. In view of this, PGT-M and PGT-SR will transit from the pilot programme to regulated mainstream clinical services.<br><br>5.&nbsp; &nbsp; &nbsp; MOH has introduced amendments to the PHMCR to regulate the provision of PGT-M and PGT-SR as specialised procedures, special care services, and&nbsp; specialised tests under the Second, Third and Fifth Schedules of the PHMCR respectively. The PHMC (Amendment No. 2) Regulations 2021 were published on 30 April 2021 and take effect on 1 May 2021.<br><br>6.&nbsp; &nbsp; &nbsp; The controls that were in place under the pilot programme will be formalised and enhanced through the regulatory terms and conditions that approved providers have to comply with. These include the clinical conditions for which PGT-M and PGT-SR are allowed to be carried out, types of information permitted to be provided to patients, and the requirements on personnel training and competency. Providers who offer the PGT-M and PGT-SR services without the necessary licence and approval from MOH to provide these service may be prosecuted under Regulation 60 of the PHMCR, and liable to a fine not exceeding $2,000, imprisonment for a term not exceeding 12 months, or both. Hospitals and clinics offering AR services, and clinical laboratories may also have their approval to provide PGT-M and PGT-SR services, and/or their existing hospital or clinic licences suspended or revoked.<br><br>[1]&nbsp;Medical Services Advisory Committee (MSAC) – Assessment of Preimplantation Genetic Diagnosis, 2015. Tan Y, Yin X, Zhang S, Jiang H, Tan K, Li J, et al. Clinical outcome of preimplantation genetic diagnosis and screening using next generation sequencing. GigaScience. 2014; 3(1).", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "introduction-of-pre-implantation-genetic-testing-for-monogenic-single-gene-defects-and-chromosomal-structural-rearrangements-as-clinical-services", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}