{"pressItemDictionary": {"Press Releases": [{"Title": "Progress of and Adjustments to Vaccination Programme and Updated Guidance On Use of Masks ", "PublishedDate": "/Date(1621332780000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "18 May 2021", "Summary": "", "MainContent": "&nbsp; &nbsp; &nbsp; We continue to make steady progress with our vaccination programme. As of 17 May, we have administered more than 3.4 million doses of the COVID-19 vaccine. Close to 2 million individuals have received at least the first dose of the vaccine, of whom over 1.4 million individuals have received their second dose and completed the full vaccination regimen.<br><br>2.&nbsp; &nbsp;The overall take-up rate has been encouraging. To date, about 71% of eligible seniors aged 60 and above, and close to 66% of eligible persons aged 45 to 59 have received the COVID-19 vaccination or booked their vaccination appointments.&nbsp;<br><br>3.&nbsp; &nbsp;We will be inviting the next age band of those aged 40 to 44 years to register for their vaccination. The Health Sciences Authority (HSA) has also authorised the use of the Pfizer-BioNTech COVID-19 vaccine for those aged 12 to 15 years. In addition, to expedite access to more of our population, we will also be extending the interval between the two vaccine doses from 3 to 4 weeks today, to 6 to 8 weeks going forward.&nbsp;<br><br>4.&nbsp; &nbsp;Even as we vaccinate more in the population, mask-wearing is still critical. We are also updating our recommendations for all members of the public to use masks with good filtration capability, such as those having at least a 95% bacterial filtration efficiency – including both single-use or reusable masks.&nbsp;<br><br>5.&nbsp; &nbsp;During this period, we strongly encourage everyone to remain at home, and leave the house only for essential activities for the next 4 weeks.<br><br><strong>Start of vaccination for those aged 40 to 44 years old</strong><br><br>6.&nbsp; &nbsp;We will be inviting the next band of those aged 40 to 44 years to register for their vaccinations from <strong>Wednesday, 19 May 2021.</strong> Our supply of vaccines has been steadily coming in, but remains limited given high global demand. We will continue to roll out our vaccination programme, but now in five-year age bands, starting with those aged 40 to 44 years, and progressively moving to younger age bands.<br><br>7.&nbsp; &nbsp;Individuals can only register online via <a href=\"https://www.vaccine.gov.sg/\" title=\"\" class=\"\" target=\"\">vaccine.gov.sg</a>. Upon their registration, they will receive an acknowledgement SMS. A separate SMS with a personalised booking link to book a vaccination appointment will then be progressively sent to invite eligible individuals on a first-come-first-served basis, based on their time of registration. Individuals should expect to receive this booking SMS within 1 to 2 weeks from registration, with appointment slots available up to mid-June. Those who have registered their interest previously will not need to re-register. More appointment slots for vaccination will be made available as more supplies arrive.<br><br>8.&nbsp; &nbsp;We remain on track with our COVID-19 vaccination programme. If our supplies arrive as scheduled, we expect to be able to complete the vaccination programme by the end of the year. We strongly encourage everyone who is medically eligible to register their interest and get vaccinated when they are offered.<br><strong><br>Extension of the Vaccine Dosing Interval to Between Six to Eight Weeks</strong><br><br>9.&nbsp; &nbsp;We will be prioritising first doses of the vaccines for more people, and speeding up our vaccination programme in order to protect more Singaporeans. Given our finite vaccine supplies, we have decided to extend the interval between the first and second vaccine doses, from three or four weeks, to six to eight weeks. This will apply to vaccination registrations that occur from <strong>Wednesday, 19 May 2021.</strong>&nbsp;<br><br>10.&nbsp; &nbsp;Those who already have appointments for their second doses will not be affected.&nbsp;<br><br>11.&nbsp; &nbsp;This approach is adopted in consultation with the Expert Committee on COVID-19 Vaccination which had studied scientific evidence globally in clinical trials and real-world roll-out of these vaccines. The Committee is of the view that the maximum interval between mRNA COVID-19 vaccines could be extended to up to eight weeks to maximise vaccine coverage, without materially impacting the eventual overall immune response, as long as the second dose is eventually administered. This conclusion is based on the data from the original mRNA trials, which has been bolstered recently by emerging information from real-world observations, laboratory studies and simulations. The approach of prioritising first dose vaccinations has also been adopted by countries such as the United Kingdom and Germany.&nbsp;&nbsp;<br><br>12.&nbsp; &nbsp;Lengthening the interval to between six to eight weeks will enable us to cover more people with the first dose of the vaccine more quickly, who will then have some protection. This will help protect more Singaporeans and optimise our vaccine supply.&nbsp;<br><strong><br>HSA approval of Pfizer-BioNTech vaccine for those aged 12 to 15 years&nbsp;</strong><br><br>12.&nbsp; &nbsp;As for individuals aged 12 to 15 years old, the Health Sciences Authority (HSA) has authorised the use of the Pfizer-BioNTech COVID-19 vaccine under PSAR. EC19V has also endorsed this extension of the interim authorisation of the vaccine by HSA to this age group.&nbsp;<br><br>13.&nbsp; &nbsp;This will be the first COVID-19 vaccine authorised for use in Singapore among this age group. In its assessment, the Committee considered the safety, efficacy and tolerability of the vaccine, and the study design of clinical trials for this age group. The data showed that the Pfizer-BioNTech COVID-19 vaccine demonstrated high efficacy consistent with that observed in the adult population. Its safety profile is also consistent with the known safety profile in the adult population and the standards set for other registered vaccines used in the immunisation against other diseases.<br><br>14.&nbsp; &nbsp;The Ministry of Health (MOH) will work with the Ministry of Education (MOE) on vaccination for this school-going age group and provide further updates in due course.<br><br><strong>Improving Access to COVID-19 Vaccination for Homebound Persons<br></strong><br>15.&nbsp; &nbsp;To facilitate the vaccination of homebound persons who are unable to travel to a vaccination site, we have worked with the Health Promotion Board and Agency for Integrated Care to deploy home vaccination teams, comprising a doctor and a nurse, to vaccinate these persons at their homes.&nbsp;<br><br>16.&nbsp; &nbsp;Eligible homebound persons receiving home medical, nursing or personal care services will be approached by their current home care service provider to ascertain their interest in getting vaccinated through this service. If they have not been contacted, they can register their interest directly with their current home care service provider. Homebound persons currently not receiving these home care services can appeal for this service by calling the MOH hotline 1800-333-9999. We seek the understanding of the public that this service is strictly meant for persons who are homebound. Persons who are not homebound are strongly encouraged to make an appointment to get vaccinated at any of the vaccination sites, when vaccination is offered to them.<br><br>17.&nbsp; &nbsp;We have expanded now to a total of 40 vaccination centres located island-wide, in addition to 20 polyclinics and the 22 Public Health Preparedness Clinics (PHPCs). All vaccination centres are wheelchair-friendly to provide easy access to individuals who have mobility concerns. Together, these ensure that every Singaporean and long-term resident in Singapore who is medically eligible can receive their vaccinations conveniently.&nbsp;<br><br><strong>Updated Guidance for Use of Masks</strong><br><br>18.&nbsp; &nbsp;Mask use continues to be one of the key public health strategies in preventing disease by reducing the expulsion and transmission of droplets. The recent clusters suggest a higher level of transmission, likely attributed to new virus variants. A mask with better protection, such as those with better filtration efficiency, will help to mitigate the increased risks of transmission and infection. All members of the public are therefore recommended to use masks with good filtration capability. These would include reusable masks that are made of at least 2 layers of fabric, and surgical masks.<br><br>19.&nbsp; &nbsp;Single-use masks would typically report their filtration efficiency as part of their product specifications. Reusable masks such as masks issued by the People’s Association and Temasek Foundation also have good filtration efficiency. MOH and HSA will put up guidelines to aid the public in choosing good masks.&nbsp;<br><br><strong>Staying Home to Keep our Community Safe</strong> <br><br>20.&nbsp; &nbsp;We had earlier reduced the permissible group size from 5 persons to 2 persons, and the cap of distinct visitors per household per day from 5 to 2.&nbsp;<br><br>21.&nbsp; &nbsp;Given the continued rise in community cases, we must exercise extra caution during this period of heightened alert to minimise potential transmission within the community. Hence, we <strong>strongly encourage everyone to remain at home, and leave the house only for essential activities.</strong> All prevailing safe management measures should be adhered to.<br><br><br><strong>MINISTRY OF HEALTH<br>18 MAY 2021</strong><br><div><br></div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "progress-of-and-adjustments-to-vaccination-programme-and-updated-guidance-on-use-of-masks", "CurrentPageUrl": null}, {"Title": "27 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1621324620000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "18 May 2021", "Summary": "", "MainContent": "<p><span style=\"font-size: 16px; font-family: Arial;\">1.&nbsp; &nbsp; &nbsp;As of 18 May 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 27 new cases of locally transmitted COVID-19 infection, of whom 16 are linked to previous cases, and 11 are currently unlinked. Amongst them, 14 had already been placed on quarantine earlier. Based on our investigations so far, the cases are in the community, and there are no new cases in the dormitories.</span></p> <p><span style=\"font-size: 16px; font-family: Arial;\">2.&nbsp; &nbsp; &nbsp;In addition, there are 11 imported cases, who had already been placed on Stay-Home Notice upon arrival in Singapore. Of these, 6 are returning Singaporeans or Singapore Permanent Residents.</span></p><p><p><span style=\"font-size: 16px; font-family: Arial;\">3.&nbsp; &nbsp; &nbsp;In total, there are 38 new cases of COVID-19 infection in Singapore today.</span></p></p><p><p><span style=\"font-size: 16px; font-family: Arial;\">4.&nbsp; &nbsp; &nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.</span></p></p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "27-new-cases-of-locally-transmitted-covid-19-infection_18May2021", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}