{"pressItemDictionary": {"Press Releases": [{"Title": "27 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1621498320000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "20 May 2021", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As of 20 May 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 27 new cases of locally transmitted COVID-19 infection, of whom 21 are linked to previous cases, and 6 are currently unlinked. Amongst them, 15 had already been placed on quarantine earlier. Based on our investigations so far, the cases are in the community, and there are no new cases in the dormitories.</p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In addition, there are 14 imported cases, who had already been placed on Stay-Home Notice upon arrival in Singapore. Of these, 10 are returning Singaporeans or Singapore Permanent Residents.<br></p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In total, there are 41 new cases of COVID-19 infection in Singapore today.<br></p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.<br></p><p><br><strong>MINISTRY OF HEALTH<br>20 MAY 2021</strong></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "27-new-cases-of-locally-transmitted-covid-19-infection_20May", "CurrentPageUrl": null}, {"Title": "Issuance of General Correction Directions Under the Protection From Online Falsehoods and Manipulation Act On Falsehoods On “singapore” Strain", "PublishedDate": "/Date(1621444200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "20 May 2021", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The Ministry of Health (MOH) is aware of a false statement circulating online by multiple media outlets and social media platforms, which implies that a new, previously unknown variant of COVID-19 originated in Singapore and/or risks spreading to India from Singapore.</p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The Minister for Health has instructed the POFMA Office to issue General Correction Directions<sup>[1] </sup>to Facebook, Twitter and SPH Magazines Pte Ltd (HardwareZone forum). Facebook, Twitter and SPH Magazines are required to carry the Correction Notice to all end-users in Singapore who use Facebook, Twitter and HardwareZone.com.<br></p><p><strong>Corrections and clarifications regarding falsehoods on “Singapore” strain</strong></p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; There is no new “Singapore” variant of COVID 19. Neither is there evidence of any COVID-19 variant that is ‘extremely dangerous for kids’. The strain that is prevalent in many of the COVID-19 cases detected in Singapore in recent weeks is the B.1.617.2 variant, which originated from India. The existence and spread of the B.1.617.2 variant within India predates the detection of the variant in Singapore, and this has been publicly known and reported by various media sources from as early as 5 May 2021.<br></p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; For facts of the case, please refer to the Factually article “Corrections and Clarifications Regarding Falsehoods on “Singapore” Strain” at&nbsp;<a href=\"https://www.gov.sg/article/factually200521\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?q=https://www.gov.sg/article/factually200521&amp;source=gmail&amp;ust=1621530733428000&amp;usg=AFQjCNGro6azrZwyTZisX_apo2PV6qu7Dw\" title=\"\" class=\"\">https://www.gov.sg/article/<wbr>factually200521</a>.<br></p><p>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We advise members of the public not to speculate and/or spread unfounded rumors. Please visit&nbsp;<a href=\"http://www.moh.gov.sg/\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?q=http://www.moh.gov.sg&amp;source=gmail&amp;ust=1621530733428000&amp;usg=AFQjCNHs7kkBlVlr5OdtuKWFGm5FQnZrWw\" title=\"\" class=\"\">www.moh.gov.sg</a>&nbsp;for latest information on COVID-19.<br></p><p><br><strong>MINISTRY OF HEALTH<br>20 MAY 2021</strong></p><hr><p><sup>[1]&nbsp;</sup> A General Correction Direction is a Direction issued to prescribed Internet Intermediaries, prescribed telecom and broadcast licensees, and/or prescribed permit holders of the Newspaper and Printing Presses Act that would require them to communicate, publish, broadcast or transmit a correction notice to their users in Singapore.</p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "issuance-of-general-correction-directions-under-the-protection-from-online-falsehoods-and-manipulation-act-on-falsehoods-on-singapore-strain", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}