{"pressItemDictionary": {"Press Releases": [{"Title": "35 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1622706300000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "03 Jun 2021", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As of 3 June 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 35 new cases of locally transmitted COVID-19 infection. Of these, 22 cases are linked to MINDSville@Napiri, which were announced yesterday evening. They have all been quarantined prior to detection.</p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Amongst the remaining 13 cases, 11 are linked to previous cases, of whom 6 have already been placed on quarantine, and 5 were detected through surveillance. The remaining 2 are currently unlinked. Based on our investigations so far, the cases are in the community, and there are no new cases in the dormitories.<br></p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In addition, there are 10 imported cases, who have already been placed on Stay-Home Notice upon arrival in Singapore. Of these, 5 are returning Singaporeans or Singapore Permanent Residents.<br></p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In total, there are 45 new cases of COVID-19 infection in Singapore today.<br></p><p>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.<br></p><p><strong><br>MINISTRY OF HEALTH<br>3 JUNE 2021</strong></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "35-new-cases-of-locally-transmitted-covid-19-infection_3Jun", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}