{"pressItemDictionary": {"Press Releases": [{"Title": "No New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1615906200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "16 Mar 2021", "Summary": "", "MainContent": "<p style=\"text-align: justify;\"><span style=\"font-family: Arial;\"><span style=\"font-size: 14px;\">&nbsp; &nbsp; &nbsp; &nbsp; As of 16 March 2021, 12pm, the Ministry of Health (MOH) has confirmed and verified that there are no new cases of locally transmitted COVID-19 infection. There are 11 imported cases, who had already been placed on Stay-Home Notice (SHN) or isolated upon arrival in Singapore. All new cases today are asymptomatic, and were detected from our proactive screening and surveillance.&nbsp;&nbsp;<br><br><strong>Summary of new cases<br></strong><br></span></span></p><table border=\"1\" cellspacing=\"0\" cellpadding=\"0\" width=\"605\"> <tbody><tr> <td width=\"129\"> <p align=\"right\"><span style=\"font-family: Arial; font-size: 14px;\">&nbsp;</span></p> </td> <td width=\"60\"> <p><span style=\"font-family: Arial; font-size: 14px;\">&nbsp;</span></p> </td> <td width=\"16\" valign=\"top\"> <p><span style=\"font-family: Arial; font-size: 14px;\">&nbsp;</span></p> </td> <td width=\"192\" colspan=\"2\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 14px;\"><strong>Breakdown by</strong></span></p> </td> <td width=\"16\" valign=\"top\"> <p><span style=\"font-family: Arial; font-size: 14px;\">&nbsp;</span></p> </td> <td width=\"192\" colspan=\"2\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 14px;\"><strong>Breakdown by</strong></span></p> </td> </tr> <tr> <td width=\"129\"> <p align=\"right\"><span style=\"font-family: Arial; font-size: 14px;\">&nbsp;</span></p> </td> <td width=\"60\"> <p><span style=\"font-family: Arial; font-size: 14px;\"><strong>Number of cases</strong></span></p> </td> <td width=\"16\" valign=\"top\"> <p><span style=\"font-family: Arial; font-size: 14px;\">&nbsp;</span></p> </td> <td width=\"96\"> <p><span style=\"font-family: Arial; font-size: 14px;\"><strong>Already in quarantine/ isolation before detection</strong></span></p> </td> <td width=\"96\"> <p><span style=\"font-family: Arial; font-size: 14px;\"><strong>Detected from surveillance</strong></span></p> </td> <td width=\"16\" valign=\"top\"> <p><span style=\"font-family: Arial; font-size: 14px;\">&nbsp;</span></p> </td> <td width=\"96\"> <p><span style=\"font-family: Arial; font-size: 14px;\"><strong>Symptomatic</strong></span></p> </td> <td width=\"96\"> <p><span style=\"font-family: Arial; font-size: 14px;\"><strong>Asymptomatic</strong></span></p> </td> </tr> <tr> <td width=\"129\"> <p><span style=\"font-family: Arial; font-size: 14px;\"><strong>Cases in the community</strong></span></p> </td> <td width=\"60\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 14px;\">0</span></p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 14px;\">&nbsp;</span></p> </td> <td width=\"96\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 14px;\">0</span></p> </td> <td width=\"96\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 14px;\">0</span></p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 14px;\">&nbsp;</span></p> </td> <td width=\"96\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 14px;\">0</span></p> </td> <td width=\"96\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 14px;\">0</span></p> </td> </tr> <tr> <td width=\"129\"> <p><span style=\"font-family: Arial; font-size: 14px;\"><strong>Cases residing in dormitories</strong></span></p> </td> <td width=\"60\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 14px;\">0</span></p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 14px;\">&nbsp;</span></p> </td> <td width=\"96\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 14px;\">0</span></p> </td> <td width=\"96\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 14px;\">0</span></p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 14px;\">&nbsp;</span></p> </td> <td width=\"96\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 14px;\">0</span></p> </td> <td width=\"96\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 14px;\">0</span></p> </td> </tr> <tr> <td width=\"129\"> <p><span style=\"font-family: Arial; font-size: 14px;\"><strong>Imported cases</strong></span></p> </td> <td width=\"60\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 14px;\">11</span></p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 14px;\">&nbsp;</span></p> </td> <td width=\"96\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 14px;\">11</span></p> </td> <td width=\"96\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 14px;\">0</span></p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 14px;\">&nbsp;</span></p> </td> <td width=\"96\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 14px;\">0</span></p> </td> <td width=\"96\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 14px;\">11</span></p> </td> </tr> <tr> <td width=\"129\"> <p><span style=\"font-family: Arial; font-size: 14px;\"><strong>Total</strong></span></p> </td> <td width=\"60\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 14px;\">11</span></p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 14px;\">&nbsp;</span></p> </td> <td width=\"96\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 14px;\">&nbsp;</span></p> </td> <td width=\"96\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 14px;\">&nbsp;</span></p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 14px;\">&nbsp;</span></p> </td> <td width=\"96\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 14px;\">&nbsp;</span></p> </td> <td width=\"96\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 14px;\">&nbsp;</span></p> </td> </tr> </tbody></table><p style=\"text-align: justify;\"><span style=\"font-family: Arial;\"><span style=\"font-size: 14px;\"><br>2.&nbsp; &nbsp; &nbsp; &nbsp;Overall, the number of new cases in the community has decreased from 4 cases in the week before to 2 cases in the past week. The number of unlinked cases in the community has also decreased from 3 cases in the week before to 2 cases in the past week. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp;Amongst the 76 confirmed cases reported from 10 March to 16 March, 35 cases have tested positive for their serology tests, 25 have tested negative, and 16 serology test results are pending.<br><br><strong>Case Details<br></strong><br><strong>a) Cases in the community: 0<br></strong><br>There are no cases in the community today.&nbsp;<br><br><strong>b) Cases residing in dormitories: 0<br></strong><br>There are no cases residing in dormitories today.&nbsp;<br><br><strong>c) Imported cases: 11<br></strong><br>Amongst the 11 imported cases,&nbsp;<br><br>• 5 (Cases 60953, 60958, 60961, 60962 and 60963) are Dependant’s Pass holders who arrived from India and Nepal.<br>• 1 (Case 60952) is a Student’s Pass holder who arrived from India.<br>• 1 (Case 60945) is a Work Pass holder who arrived from Turkey.<br>• 3 are Work Permit holders who arrived from Bangladesh, Indonesia and Malaysia, of whom 1 (Case 60947) is a foreign domestic worker.<br>• 1 (Case 60956) is a Special Pass holder who is a sea crew. She arrived from the Philippines on a vessel, and had remained onboard until she was conveyed to a hospital for abdominal pain.&nbsp;<br><br>They had all already been placed on SHN or isolated upon arrival in Singapore and were tested while serving SHN or during isolation.&nbsp;<br><br>4.&nbsp; &nbsp; &nbsp; &nbsp;Please refer to the <a href=\"/docs/librariesprovider5/pressroom/press-releases/moh-press-release---annex-a-and-b-(16-mar-2021).pdf?sfvrsn=1022e88c_0\" title=\"Annexes\">Annexes</a>&nbsp;and MOH’s daily Situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report/\" title=\"\" class=\"\" target=\"\">www.moh.gov.sg/covid-19/situation-report</a>) for details.&nbsp;<br><br>5.&nbsp; &nbsp; &nbsp; &nbsp;Epidemiological investigations are in progress. In the meantime, all the identified close contacts of the cases have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for the close contacts to determine if the cases could have been infected by them.<br><br><strong>Update on condition of confirmed cases<br></strong><br>6.&nbsp; &nbsp; &nbsp; &nbsp;10 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 59,984 have fully recovered from the infection and have been discharged from hospitals or community care facilities.&nbsp;<br><br>7.&nbsp; &nbsp; &nbsp; &nbsp;There are currently 21 confirmed cases who are still in hospital. Of these, most are stable or improving, and none is in the intensive care unit. 93 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 30 have passed away from complications due to COVID-19 infection.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>16 MARCH 2021</strong><br></span></span></p><div><br></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "no-new-cases-of-locally-transmitted-covid-19-infection-16-Mar-2021-Updated", "CurrentPageUrl": null}, {"Title": "More Vaccination Centres Nationwide With the Roll-out of the Moderna Vaccine", "PublishedDate": "/Date(1615881540000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "16 Mar 2021", "Summary": "", "MainContent": "&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As of 15 March 2021, we have administered more than 792,000 doses of the COVID-19 vaccine. In total, more than 549,000 individuals have received at least the first dose of the COVID-19 vaccine, of whom about 243,000 have also received their second dose, and hence completed the full vaccination regimen. Since vaccination for seniors commenced island-wide on 22 February, more than 175,000 seniors have received their first dose, and about 230,000 seniors have made appointments to receive their first dose in the next few weeks.<br><br><br><strong>More Vaccination Centres to be Set Up</strong><br><br>2.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The Ministry of Health (MOH) is ramping up the setting up of more COVID-19 vaccination centres island-wide, to accelerate the pace of vaccination and provide greater convenience for Singaporeans and long-term residents to receive their vaccination. All vaccination centres are well-equipped to handle medical exigencies, with trained doctors and nurses on-site to provide medical advice and treatment.<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As of 16 March 2021, a total of 24 vaccination centres are in operation, on top of the 20 polyclinics and 22 Public Health Preparedness Clinics (PHPCs) that are also in operation. Seven more vaccination centres, located at Bukit Batok, Bukit Merah, Jurong West, Punggol, Sengkang, Tampines and Woodlands, will progressively commence their operations from 17 March. By mid-April, there will be a total of 40 vaccination centres island-wide. All vaccination centres are wheelchair-friendly to provide easy access to seniors who have mobility concerns. Please refer to <a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-a-vcs-16-mar.pdf?sfvrsn=e49162c4_0\" title=\"Annex A\">Annex A</a>&nbsp;for a list of the current and upcoming vaccination centres.<br><br>4.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Four of the seven upcoming vaccination centres will administer the Moderna COVID-19 vaccine. These four vaccination centres are at Hong Kah North Community Club, Marsiling Community Club, Punggol 21 Community Club and Radin Mas Community Club. The other vaccination centres, polyclinics and selected PHPCs will continue to offer the Pfizer-BioNTech COVID-19 vaccine. As more supplies of the Moderna COVID-19 vaccine arrive, more vaccination centres will offer the Moderna COVID-19 vaccine.<br><br>5.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Each vaccination centre will only stock and administer one type of vaccine. Individuals must select the same vaccination centre for both their first and second appointments, when booking via the national appointment system. As the vaccination capacity of each vaccination centre is not the same, the waiting times for first dose vaccination will differ between the vaccination centres. Do check for the availability of appointment slots in other centres if you are unable to secure your desired vaccination appointment dates at the nearest centre. We encourage individuals to book your appointments at vaccination centres, which have higher capacity than polyclinics.<br><br>&nbsp;<br><strong>Appeals for Early Vaccination</strong><br><br>6.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; We will offer vaccination to more segments of the population from April onwards, so that all Singaporeans and long-term residents in Singapore will have the chance to be vaccinated by end-2021. In the meantime, we have received appeals from members of the public who wish to receive their vaccination early for a variety of personal reasons. While our focus has been to vaccinate identified priority groups on public health considerations, as more vaccine supplies arrive, we will consider allowing Singapore Citizens and Permanent Residents with very exceptional circumstances to receive their vaccination earlier, such as:&nbsp;<br><br>&nbsp; &nbsp;a)&nbsp; Those who have an urgent need to travel overseas to take up or complete a formal education or vocational programme, or to be based overseas for work, where remote learning or working is not an option.<br><br>&nbsp; &nbsp;b)&nbsp; Those who wish to travel overseas to visit or care for a critically ill immediate family member, or to seek medically necessary treatment that cannot be reasonably received in Singapore.<br>&nbsp;<br>7.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Individuals who plan to appeal for early vaccination should cater for the time needed to complete the full course of vaccination in Singapore in their plans. For the current vaccines available, two doses are required three to four weeks apart, and the vaccines will be fully effective a further two weeks after the second dose. Individuals should thus aim to complete the application form at <a href=\"http://vaccine.gov.sg/appeal\" title=\"\" class=\"\" target=\"\">https://vaccine.gov.sg/appeal</a>&nbsp;around eight weeks in advance, and successful applicants will be notified via email. We will do our best to accommodate all appeals that meet the stated criteria. But as vaccine supplies are limited, priority will be given to those travelling to higher risk countries or regions.&nbsp;<br><br>8.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; We are also working with hospitals and clinics to provide earlier vaccination for their patients with complex chronic medical conditions who would be more vulnerable to severe complications if they were to fall ill with Covid-19. For such patients, their doctors will discuss with them whether they are eligible for vaccination, based on their individual circumstances.<br><br>&nbsp;<strong><br>Vaccine Injury Financial Assistance Programme open for applications</strong><br><br>9.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The Vaccine Injury Financial Assistance Programme for COVID-19 vaccination (VIFAP) will be open for applications from 17 March 2021. VIFAP will provide financial assistance to Singapore Citizens, Permanent Residents and Long-Term Pass holders vaccinated under the national vaccination programme, in the rare event that a person suffers from serious side effects that are assessed to be related to their COVID-19 vaccination. This is to give greater peace of mind for those deciding on taking up the vaccination.<br><br>10.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The quantum of the one-time goodwill pay-out under the VIFAP is based on the severity of the serious side effects attributed to the COVID-19 vaccines. Persons may qualify for one of the following tiers of pay-out:<br><br>&nbsp; &nbsp;a)&nbsp; One-time pay-out of $2,000 for individuals who required inpatient hospitalisation and medical intervention, and subsequently recovers;<br><br>&nbsp; &nbsp;b)&nbsp; One-time pay-out of $10,000 for individuals who required admission to High Dependency or Intensive Care, and subsequently recovers; and<br><br>&nbsp; &nbsp;c)&nbsp; One-time pay-out of $225,000 for individuals who die or suffer permanent severe disability as a result of COVID-19 vaccination.<br>&nbsp;<br>11.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The inclusion of the $2,000 pay-out, in addition to the other two tiers which were earlier announced, is meant to strengthen support provided to individuals who suffer from serious side effects due to COVID-19 vaccination. The VIFAP is not meant to reimburse medical costs. It provides an additional layer of financial support, on top of the existing government healthcare financing schemes for medical costs incurred, which include government subsidies, MediShield Life, MediSave and MediFund.<br><br>12.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; To apply for VIFAP, individuals will need to submit an application accompanied by medical information on the serious side effect from their treating doctor. All applications will be reviewed by an independent clinical panel for the relatedness and severity of the side effect(s) to the COVID-19 vaccine received. More information on how to apply can be found at <a href=\"http://moh.gov.sg/covid-19/vaccination/vifap\" title=\"\" class=\"\" target=\"\">www.moh.gov.sg/covid-19/vaccination/vifap</a>.<br><br>13.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Vaccination is critical to keep us and our loved ones safe from COVID-19, and it is a key enabler for us to return to normalcy. While COVID-19 vaccination is voluntary, we strongly encourage Singaporeans and long-term residents who are medically eligible to come forward for vaccination when their turn comes.<br><strong><br><br>MINISTRY OF HEALTH<br>16 MARCH 2021</strong>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "more-vaccination-centres-nationwide-with-the-roll-out-of-the-moderna-vaccine", "CurrentPageUrl": null}, {"Title": "No New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1615879800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "16 Mar 2021", "Summary": "", "MainContent": "<p style=\"text-align: justify;\"><span style=\"font-family: Arial;\"><span style=\"font-size: 14px;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As of 16 March 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed that there are no new cases of locally transmitted COVID-19 infection.&nbsp;<br><br>2.&nbsp; &nbsp; &nbsp; &nbsp;There are 11 imported cases, who had already been placed on Stay-Home Notice or isolated upon arrival in Singapore.&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>16 MARCH 2021</strong></span></span></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "no-new-cases-of-locally-transmitted-covid-19-infection-16-Mar-2021", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}