{"pressItemDictionary": {"Press Releases": [{"Title": "Community Surveillance Testing At Eng Watt Street", "PublishedDate": "/Date(1624632300000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "25 Jun 2021", "Summary": "", "MainContent": "<p class=\"Default\" style=\"margin: 0cm; font-family: Arial, sans-serif; text-align: justify;\"><span style=\"font-family: Arial;\"><span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp;The Ministry of Health (MOH) is investigating likely COVID-19 transmission at Eng Watt Street. So far, 13 cases [1]&nbsp;of COVID-19 infection have been detected in three households at 66 Eng Watt Street.&nbsp;<span>Epidemiological investigations are ongoing to determine linkages and the source of transmission.<br><br></span></span></span><span style=\"font-family: Arial; font-size: 16px;\">2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;In&nbsp;order to disrupt any wider, undetected community transmission, MOH&nbsp;will conduct mandatory&nbsp;COVID-19&nbsp;testing for all residents of 66 Eng Watt Street.&nbsp;Testing is optional for those who have tested negative for COVID-19 infection from 22 June onwards. In the event that a positive&nbsp;COVID-19&nbsp;case is detected, MOH will isolate the case, identify all close contacts, test and quarantine them to protect the community from further transmission.&nbsp;Mandatory testing will be conducted at the pavilion at 2D Boon Tiong Road from 26 to 27 June 2021 between 9am and 4pm.<br><br></span><span style=\"font-family: Arial; font-size: 16px;\">3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;To detect possible asymptomatic cases in the community, MOH will also conduct voluntary COVID-19 testing for visitors and those who have interacted with residents of&nbsp;66 Eng Watt Street&nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">between 8 June and 22 June 2021. We encourage these individuals to come forward for testing.&nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">Testing will be conducted by appointment only at designated Regional Screening Centres from&nbsp;26 to 27 June 2021&nbsp;between 9am and 4pm.To book an appointment and for information on the alternate test locations, please visit&nbsp;</span><a href=\"https://go.gov.sg/66-ew-covid-19-testing\" style=\"font-family: Arial; font-size: 16px; color: rgb(149, 79, 114);\" title=\"\" class=\"\" target=\"\"><span style=\"color: rgb(47, 96, 206);\">https://go.gov.sg/66-ew-covid-19-testing</span></a><span style=\"font-family: Arial; font-size: 16px;\">,&nbsp;or call 1800 333 9999 if you have any queries.<br><br></span><span style=\"font-family: Arial; font-size: 16px;\">4. &nbsp; &nbsp; &nbsp;All residents are to bring along their NRIC for identification purposes.</span><strong style=\"font-family: Arial; font-size: 16px;\"><span style=\"color: rgb(0, 112, 192);\">&nbsp;</span></strong><span style=\"font-family: Arial; font-size: 16px;\">Leaflets have been distributed and SMS notifications have been sent to the residents to provide them with more information. Residents are also advised to monitor their health closely and consult a doctor immediately if they feel unwell. Those who are still awaiting their test results are advised to minimise social interactions as much as possible. They should continue to monitor their health and seek immediate medical attention if they feel unwell.</span></p><div><span style=\"font-family: Arial; font-size: 16px;\"><br clear=\"all\"></span><hr align=\"left\" size=\"1\" width=\"33%\"><div id=\"ftn1\"><p style=\"margin: 0cm; font-size: 10pt; font-family: &quot;Times New Roman&quot;, serif; text-align: justify;\"><span style=\"font-family: Arial;\"><span style=\"font-size: 13px;\">[1] Cases 64159, 64184, 64186, 64197, 64198, 64199, 64206, 64207, 64208, 64209, 64251, 64419 and 64191</span></span></p></div></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "community-surveillance-testing-at-eng-watt-street_25June2021", "CurrentPageUrl": null}, {"Title": "15 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1624630500000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "25 Jun 2021", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As of 25 June 2021, 12pm, the Ministry of Health (MOH) has confirmed and verified that there are 15 new cases of locally transmitted COVID-19 infection. The cases are in the community, and there are no new cases in the dormitories. Of the 15 cases, 4 are linked to previous cases and have already been placed on quarantine. 11 were detected through surveillance, amongst whom 8 are linked to previous cases and 3 are currently unlinked. There are 5 imported cases, who have already been placed on Stay-Home Notice (SHN) or isolated upon arrival in Singapore. Amongst the new cases today, 7 are asymptomatic, and were detected from our proactive screening and surveillance, while 13 were symptomatic.&nbsp;</p><p><strong>Summary of new cases</strong><br></p><table border=\"1\" cellspacing=\"0\" cellpadding=\"0\" width=\"605\"><tbody><tr><td width=\"129\"><p align=\"right\">&nbsp;</p></td><td width=\"60\"><p>&nbsp;</p></td><td width=\"16\" valign=\"top\"><p>&nbsp;</p></td><td width=\"192\" colspan=\"2\"><p align=\"center\"><strong>Breakdown by</strong></p></td><td width=\"16\" valign=\"top\"><p>&nbsp;</p></td><td width=\"192\" colspan=\"2\"><p align=\"center\"><strong>Breakdown by</strong></p></td></tr><tr><td width=\"129\"><p align=\"right\">&nbsp;</p></td><td width=\"60\"><p><strong>Number of cases</strong></p></td><td width=\"16\" valign=\"top\"><p>&nbsp;</p></td><td width=\"96\"><p><strong>Already in quarantine/ isolation before detection</strong></p></td><td width=\"96\"><p><strong>Detected from surveillance</strong></p></td><td width=\"16\" valign=\"top\"><p>&nbsp;</p></td><td width=\"96\"><p><strong>Symptomatic</strong></p></td><td width=\"96\"><p><strong>Asymptomatic</strong></p></td></tr><tr><td width=\"129\"><p><strong>Cases in the community</strong></p></td><td width=\"60\"><p align=\"center\">15</p></td><td width=\"16\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">4</p></td><td width=\"96\"><p align=\"center\">11</p></td><td width=\"16\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">12</p></td><td width=\"96\"><p align=\"center\">3</p></td></tr><tr><td width=\"129\"><p><strong>Cases residing in dormitories</strong></p></td><td width=\"60\"><p align=\"center\">0</p></td><td width=\"16\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">0</p></td><td width=\"96\"><p align=\"center\">0</p></td><td width=\"16\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">0</p></td><td width=\"96\"><p align=\"center\">0</p></td></tr><tr><td width=\"129\"><p><strong>Imported cases</strong></p></td><td width=\"60\"><p align=\"center\">5</p></td><td width=\"16\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">5</p></td><td width=\"96\"><p align=\"center\">0</p></td><td width=\"16\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">1</p></td><td width=\"96\"><p align=\"center\">4</p></td></tr><tr><td width=\"129\"><p><strong>Total</strong></p></td><td width=\"60\"><p align=\"center\">20</p></td><td width=\"16\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">&nbsp;</p></td><td width=\"16\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">&nbsp;</p></td><td width=\"96\"><p align=\"center\">&nbsp;</p></td></tr></tbody></table><p>&nbsp;</p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Overall, the number of new cases in the community has decreased from 104 cases in the week before to 93 cases in the past week. The number of unlinked cases in the community has increased from 14 cases in the week before to 18 cases in the past week. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.</p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Amongst the 131 confirmed cases reported from 19 June to 25 June, 40 cases have tested positive for their serology tests, 77 have tested negative, and 14 serology test results are pending.<br></p><p>&nbsp;</p><p> </p><p><strong>Case Details</strong></p><p><strong>a)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Cases in the community: 15</strong><br></p><p>There are 15 cases in the community today, of whom 12 are linked to previous cases and 3 are currently unlinked.<br></p><p>&nbsp;</p><p><strong>Currently unlinked cases</strong></p><p>Detected through surveillance:<br></p><p><u>Case 64444</u>&nbsp;is a 32 year-old male Singaporean who works as an equipment specialist at Singapore General Hospital. He developed a sore throat and cough on 23 June and sought medical treatment at his workplace on 24 June. His test result came positive for COVID-19 infection on the same day. His serology test result is pending. Case 64444 received his first dose of COVID-19 vaccine on 13 January, and his second dose on 3 February.<br></p><p><u>Case 64450</u>&nbsp;is a 31 year-old male Malaysia national who is employed by Fourways Pte Ltd as a cleaner at National University of Singapore’s Prince George’s Park Residence. He developed a fever on 22 June and sought medical treatment at a General Practitioner (GP) clinic the next day, where he underwent both an antigen rapid test (ART) and polymerase chain reaction (PCR) test. His ART result was negative for COVID-19. His PCR test result came positive for COVID-19 infection on 24 June. His serology test result is pending. Case 64450 received his first dose of COVID-19 vaccine on 15 January, and his second dose on 5 February.<br></p><p><u>Case 64454</u>&nbsp;is an 84 year-old female Singaporean who is a retiree. She developed a cough on 16 June but did not seek medical attention. She was detected when she was conveyed to Singapore General Hospital for an unrelated medical condition on 24 June, and was tested for COVID-19. Her test result came positive for COVID-19 infection on the same day. Her serology test result is pending.<br></p><p><strong><br>115 Bukit Merah View Market &amp; Food Centre cluster</strong><br></p><p>Already quarantined:<br></p><p><u>Case 64445</u>&nbsp;is a 2 year-old male Singapore Permanent Resident who is a student at Hope Child Care Centre (3501 Jalan Bukit Merah), and was last in school on 7 May. He is a family member and household contact of Case 64421<sup>[1]</sup>, and was placed on quarantine on 23 June. He developed a fever on 23 June and was tested for COVID-19 on the same day during quarantine. His test result came back positive for COVID-19 on 24 June. His serology test result is pending.<br></p><p><u>Case 64461</u>&nbsp;is an 11 year-old male Singaporean who is a student at Alexandra Primary School and was last in school on 28 May. As he had been identified as a close contact of Case 64435<sup>[2]</sup>, he was placed on quarantine on 23 June. He developed a fever and cough on 23 June but did not report his symptoms. He was detected when he was tested for COVID-19 on 24 June, and his test result came back positive for COVID-19 infection on 25 June. His serology test result is pending.<br></p><p><strong><br>105 Henderson Crescent cluster</strong><br></p><p>Detected through surveillance:<br></p><p><u>Case 64446</u>&nbsp;is a 70 year-old female Singaporean who is a retiree. She is a family member and household contact of Case 64447. She developed a runny nose on 24 June but did not seek medical attention. She was detected when she was tested for COVID-19 on the same day as part of our community surveillance testing for residents of 105 Henderson Crescent. Her test result came back positive for COVID-19 infection on 24 June. Her serology test result is pending. Case 64446 received her first dose of COVID-19 vaccine on 10 June.<br></p><p><u>Case 64447</u>&nbsp;is a 40 year-old female Singaporean who works as a finance executive at ST Engineering. She is a family member and household contact of Case 64446. She was detected when she was tested for COVID-19 on 24 June as part of our community surveillance testing for residents of 105 Henderson Crescent. Her test result came back positive for COVID-19 infection on the same day. She developed a fever later on the same day. Her serology test result is pending.<br></p><p><u>Case 64448</u>&nbsp;is a 45 year-old male Philippines national who works as a maintenance specialist at Air Liquide and was last at work on 21 June. He is asymptomatic and was detected when he was tested for COVID-19 on 24 June as part of our community surveillance testing for residents of 105 Henderson Crescent. His test result came back positive for COVID-19 infection on the same day. His serology test result is pending. Case 64448 received his first dose of COVID-19 vaccine on 2 April, and the second dose on 30 April.<br></p><p><u>Case 64455</u>&nbsp;is a 32 year-old male Singapore Permanent Resident who works as a part-time delivery rider with Grab and Foodpanda, and was last at work on 20 June. He is a family member of Case 64456. He developed a runny nose and sore throat on 21 June, and a fever on 24 June, but did not seek medical attention. He was detected when he was tested for COVID-19 on 24 June as part of our community surveillance testing for residents of 105 Henderson Crescent. He was immediately isolated when his ART result came back positive for COVID-19 on the same day. His PCR test result also came back positive for COVID-19 infection on 24 June. His serology test result is pending. Case 64455 received his first dose of the COVID-19 vaccine on 26 March, and the second dose on 19 April.<br></p><p><u>Case 64456</u>&nbsp;is a 32 year-old female Singapore Permanent Resident who works as an operation manager at Green Mart SG. She is a family member of Case 64455. She developed a fever on 24 June, but did not seek medical attention. She was detected when she was tested for COVID-19 on the same day as part of our community surveillance testing for residents of 105 Henderson Crescent. She was immediately isolated when her ART result came back positive for COVID-19 on the same day. Her PCR test result also came back positive for COVID-19 infection on 24 June. Her serology test result is pending.&nbsp;<br></p><p><u>Case 64457</u>&nbsp;is a 45 year-old male Singaporean who works as a manager at Meinhardt Group and was last at work on 15 June. He developed a fever and headache on 22 June, but did not seek medical attention. He was detected when he was tested for COVID-19 on 24 June as part of community surveillance testing for residents of 105 Henderson Crescent. His ART result came&nbsp; back was positive for COVID-19 on 24 June and he was immediately isolated. His PCR test result came back positive for COVID-19 on 25 June. His serology test result is pending. Case 64457 received his first dose of the COVID-19 vaccine on 22 June.&nbsp;<br></p><p><strong><br>Changi General Hospital cluster</strong><br></p><p>Detected through surveillance:<br></p><p><u>Case 64442</u>&nbsp;is a 67 year-old male Singaporean who works as a porter at Changi General Hospital. He is a workplace contact of Cases 64413<sup>[3] </sup>and 64443. He is asymptomatic, and was detected when he was tested for COVID-19 on 23 June as part of the Hospital’s surveillance testing. His test result came positive for COVID-19 infection on 24 June. His earlier tests from Rostered Routine Testing (RRT) – the last being on 15 June – were all negative for COVID-19 infection. His serology test result is negative for the N antigen, which suggests the presence of early infection. Case 64442 received his first dose of COVID-19 vaccine on 11 June.<br></p><p><u>Case 64443</u>&nbsp;is a 72 year-old male Singaporean who works as a porter at Changi General Hospital. He is a workplace contact of Cases 64413 and 64442. He developed a runny nose on 16 June but did not seek medical attention. He was detected when he was tested for COVID-19 on 23 June as part of the Hospital’s surveillance testing. His test result came positive for COVID-19 infection on 24 June. His earlier tests from RRT – the last being on 10 June – were all negative for COVID-19 infection. His serology test result is negative for the N antigen, which suggests the presence of early infection. Case 64442 received his first dose of COVID-19 vaccine on 18 March and the second dose on 8 April.<br></p><p><strong><br>Case 64264 cluster <sup>[4]</sup></strong><br></p><p>Already quarantined:<br></p><p><u>Case 64449</u>&nbsp;is a 30 year-old female Indonesia national who is a foreign domestic worker. As she had been identified as a contact of Case 64264, she was placed on phone surveillance on 16 June. On 23 June, she was placed on quarantine as she is a household contact of Case 64420<sup>[5]</sup>. She is asymptomatic, and was detected when she was tested for COVID-19 on 24 June during quarantine. Her test result came positive for COVID-19 infection on the same day. Her serology test result is positive.<br></p><p>&nbsp;</p><p><strong>Other linked cases</strong></p><p>Already quarantined:<br></p><p><u>Case 64451</u>&nbsp;is a 31 year-old male China national who works as a driver with MW Impex Pte Ltd. He is a workplace contact of Case 64388<sup>[6]</sup>, and was placed on quarantine on 22 June. He was tested for COVID-19 on 22 June during quarantine, and his test result was negative. He developed a fever, cough and sore throat on 24 June, and reported his symptoms, and was tested for COVID-19 on the same day. His test result came back positive for COVID-19 infection on 24 June. His serology test result is pending.<br></p><p>&nbsp;</p><p><strong>b)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Cases residing in dormitories: 0</strong></p><p>There are no cases residing in dormitories today.<br></p><p>&nbsp;</p><p><strong>c)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Imported cases: 5</strong></p><p>Amongst the 5 imported cases,<br></p><p>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 2 (Cases 64441 and 64459) are Singaporeans and 2 (Cases 64440 and 64460) are Singapore Permanent Residents who returned from India, Indonesia and the UK.<br>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 1 (Case 64458) is a Work Permit holder who arrived from the Philippines.</p><p>They have all already been placed on SHN or isolated upon arrival in Singapore and were tested while serving SHN or during isolation.<br></p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Please refer to the <a href=\"/docs/librariesprovider5/pressroom/annexes-25-jun.pdf?sfvrsn=b0c3657d_2\" title=\"Annexes\">Annexes</a>&nbsp;and MOH’s daily Situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?q=http://www.moh.gov.sg/covid-19/situation-report&amp;source=gmail&amp;ust=1624716941457000&amp;usg=AFQjCNF00-ueaJDu5I5LzrERa3k0RMVybg\" title=\"\" class=\"\">www.moh.gov.sg/covid-19/<wbr>situation-report</a>) for details.<br></p><p>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Epidemiological investigations are in progress. In the meantime, all the identified close contacts of the cases have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for the close contacts to determine if the cases could have been infected by them.<br></p><p><u>Collection of ART self-test kits for residents in Bukit Merah/ Redhill region</u><br></p><p>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; MOH is investigating multiple cases of COVID-19 infection amongst individuals who reside, work in or visited the Bukit Merah/ Redhill area. In order to disrupt any wider, undetected community transmission, we have been conducting special testing operations for these individuals, as well as deploying wastewater testing in the area.<br></p><p>7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; As an added layer of ringfencing to help to identify cases and prevent further transmission, MOH is working with the People’s Association for residents of specific blocks within the region to collect ART kits, from 26 to 27 June 2021, at their nearest Residents’ Committee Centre. Eligible residents are strongly encouraged to collect and perform self-testing using these ART kits. Residents should refer to&nbsp;<a href=\"https://www.gowhere.gov.sg/art\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?q=https://www.gowhere.gov.sg/art&amp;source=gmail&amp;ust=1624716941457000&amp;usg=AFQjCNFjwoQoxmT94RMYL_nBlvYE6FjGXQ\" title=\"\" class=\"\">https://www.gowhere.gov.sg/art</a>&nbsp;to check on their eligibility and the nearest Residents’ Committee Centre for self-collection.<br></p><p><strong><br>Update on condition of confirmed cases</strong><br></p><p>8.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 21 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 62,161 have fully recovered from the infection and have been discharged from hospitals or community care facilities.<br></p><p>9.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; There are currently 139 confirmed cases who are still in hospital. Of these, most are stable or improving, and 4 are in critical condition in the intensive care unit. 178 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 35 have passed away from complications due to COVID-19 infection.<br></p><p><br>MINISTRY OF HEALTH<br>25 JUNE 2021</p><hr><p>&nbsp;</p><p>[1]&nbsp; Case 64421 is a 34 year-old female Singapore Permanent Resident who is a homemaker. She was confirmed to have COVID-19 infection on 23 June.<br>[2]&nbsp; Case 64435 is a 33 year-old female Singaporean who works part-time at J&amp;T Express Singapore. She was confirmed to have COVID-19 infection on 23 June.<br>[3]&nbsp; Case 64413 is a 35 year-old male Singaporean who works as a porter at Changi General Hospital. He was confirmed to have COVID-19 infection on 23 June.<br>[4]&nbsp; Case 64264 is a 32 year-old female Indonesia national who is a foreign domestic worker. She was confirmed to have COVID-19 infection on 16 June.<br>[5]&nbsp; Case 64420 is a 78 year-old female Singaporean who is a retiree. She was confirmed to have COVID-19 infection on 23 June.<br>[6]&nbsp; Case 64388 is a 36 year-old male Malaysia national who works as a driver at Omni Aquatic Supplies Pte Ltd. He was confirmed to have COVID-19 infection on 22 June.</p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "15-new-cases-of-locally-transmitted-covid-19-infection_25JunUpdate", "CurrentPageUrl": null}, {"Title": "Appointment of New Chairmen for Singapore Health Services and National Healthcare Group ", "PublishedDate": "/Date(1624615200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "25 Jun 2021", "Summary": "", "MainContent": "<p style=\"margin-bottom: 0cm; text-align: justify;\"><span style=\"font-size: 12pt; font-family: Arial;\">&nbsp; &nbsp; &nbsp; &nbsp;The Minister for Health has appointed Mr Cheng Wai Keung as the Chairman of the Board of Singapore Health Services (SingHealth) from 1 July 2021 to 30 June 2024, and Mr Tan Tee How as the Chairman of the Board of National Healthcare Group (NHG) from 15 April 2021 to 14 April 2024.&nbsp;</span></p><p style=\"margin-bottom: 0cm; margin-left: 0cm; text-align: justify;\"><span style=\"font-size: 12pt; font-family: Arial;\">&nbsp;</span></p><p style=\"margin-bottom: 0cm; text-align: justify;\"><span style=\"font-family: Arial;\"><strong><span style=\"font-size: 12pt;\">New Chairman, Mr Cheng Wai Keung, SingHealth</span></strong></span></p><p style=\"margin-bottom: 0cm; text-align: justify;\"><span style=\"font-family: Arial;\"><strong><span style=\"font-size: 12pt;\"><br></span></strong><span style=\"font-size: 12pt;\">2. </span><strong><span style=\"font-size: 12pt;\">&nbsp; &nbsp;&nbsp;</span></strong></span><span style=\"font-family: Arial; font-size: 12pt;\">Mr Cheng Wai Keung is the Chairman and Managing Director of Wing Tai Holdings Ltd and has been a member of the SingHealth Board since 1 August 2013. Mr Cheng is an accomplished business leader with vast experience across various sectors. He also serves on various private and public sector Boards including as Deputy Chairman of Temasek Holdings (Pte) Ltd and the Vice-Chairman of the Singapore-Suzhou Township Development Pte Ltd, amongst others. &nbsp;<br><br>3. &nbsp; &nbsp; &nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 12pt;\">As Chairman of SingHealth, Mr Cheng will helm the cluster’s drive to enhance&nbsp;&nbsp;&nbsp;clinical outcomes through research, innovation and education and to provide value-driven care to patients. He will lead SingHealth in its continued focus on providing a continuum of care that is holistic and integrated, while advancing new models of care that are patient-centric, with an emphasis on population health. He will play a pivotal role in leading SingHealth through key infrastructure projects such as the redevelopment of the SGH Campus, and the new Eastern General and Community Hospitals, to ensure their timely completion. With his wealth of expertise in business and management, SingHealth is set to deepen strategic partnerships and collaborations to advance key priority areas, anchored by a robust corporate governance framework.&nbsp;<br><br></span><strong style=\"font-family: Arial;\"><span style=\"font-size: 12pt;\">New Chairman, Mr Tan Tee How, NHG<br><br></span></strong><span style=\"font-family: Arial;\"><span style=\"font-size: 12pt;\">4.</span></span><strong style=\"font-family: Arial;\"><span style=\"font-size: 12pt;\">&nbsp; &nbsp; &nbsp;&nbsp;</span></strong><span style=\"font-family: Arial; font-size: 12pt;\">Mr Tan Tee How has been Deputy Chairman of the NHG Board since 1 April 2019, and was NHG’s founding Group Chief Executive Officer from 2000 to 2003. With 34 years in the Singapore Administrative Service, Mr Tan will be bringing his extensive expertise in leading public entities to NHG, having held several key appointments during his career, including the Commissioner of Inland Revenue and CEO of the Inland Revenue Authority of Singapore, Permanent Secretary at the Ministry of National Development, and Permanent Secretary at the Ministry of Home Affairs. &nbsp;<br><br>5. &nbsp; &nbsp; &nbsp;&nbsp;</span><span style=\"font-family: Arial; font-size: 12pt;\">As Chairman of NHG, Mr Tan will be advancing NHG’s population health efforts for over two million residents in the central region and scaling up NHG’s integrated ecosystem of care. He will accelerate transformational collaborations with local and global partners to achieve NHG’s vision of&nbsp;</span><em style=\"font-family: Arial; font-size: 12pt;\">“Adding Years of Healthy Life”</em><span style=\"font-family: Arial; font-size: 12pt;\">. Furthermore, he will drive the Institute of Mental Health’s rollout of mental health initiatives to increase capabilities and capacities in psychological and social cohesion, and resilience in Singapore. Mr Tan will also encourage translational growth in innovation, research and education with the Lee Kong Chian School of Medicine with NHG as its primary clinical training partner. In addition, Mr Tan will lead NHG through its critical role in partnering the Ministry of Health to strengthen Singapore’s pandemic preparedness and resilience, with the National Centre for Infectious Diseases (NCID) at the forefront of our COVID-19 response.&nbsp;</span></p><p style=\"text-align: justify;\"><p><span style=\"font-size: 12pt; font-family: Arial;\"><br></span><strong style=\"font-family: Arial;\"><span style=\"font-size: 12pt;\">Outgoing Chairmen<br><br></span></strong><span style=\"font-family: Arial;\"><span style=\"font-size: 12pt;\">6. &nbsp; &nbsp; &nbsp; &nbsp;</span></span><span style=\"font-family: Arial; font-size: 12pt;\">MOH wishes to express its appreciation to Mr Peter Seah Lim Huat and Mdm Kay Kuok Oon Kwong who led SingHealth and NHG, respectively, with distinction between 2009 and 2021. Both of them oversaw major transformations in their clusters, including the public healthcare reorganisation exercise in 2017 and the development of their respective Regional Health Systems to integrate care with the primary and community care partners in their respective regions.&nbsp;<br><br>7. &nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 12pt;\">During his time as Chairman of SingHealth, Mr Seah was instrumental in overseeing SingHealth’s development as an Academic Medical Centre. Mr Seah oversaw the opening of SingHealth’s Academia, a purpose-built facility that catalyses research and education. He also led SingHealth in fostering a close partnership with Duke-NUS Medical School to nurture a rich eco-system that harnesses synergies in clinical care, research and education. To date, 15 SingHealth-Duke NUS Academic Clinical Programmes, 13 SingHealth Duke-NUS Disease Centres and academic institutes such as the Academic Medicine Education Institute, the Academic Medicine Research Institute and the Academic Medicine Innovation Institute, have been established. &nbsp;<br><br>8. &nbsp; &nbsp; &nbsp;&nbsp;</span><span style=\"font-family: Arial; font-size: 12pt;\">In addition, Mr Seah also led the cluster through a major expansion, including the transfer of Bright Vision Hospital and Changi General Hospital to SingHealth, and the opening of the Sengkang General and Community Hospitals, Outram Community Hospital, Punggol Polyclinic, and the new National Heart Centre Singapore.&nbsp;<br><br>9. &nbsp; &nbsp; &nbsp; </span><span style=\"font-family: Arial; font-size: 12pt;\">During her tenure, Mdm Kuok played an integral role in NHG’s Care Transformation journey towards population health through its&nbsp;</span><em style=\"font-family: Arial; font-size: 12pt;\">River of Life</em><span style=\"font-family: Arial; font-size: 12pt;\">&nbsp;framework. She oversaw NHG’s efforts in strengthening its primary care and mental health infrastructure and capabilities, including the initiation of the National Mental Health Blueprint in 2006. Under her stewardship, NHG implemented numerous successful care innovations, including the development of three Family Medicine Clinics, NHG Polyclinics’ patient empanelment and the Teamlet care model, tele-health initiatives for chronic disease management, as well as mental health programmes in the community. &nbsp;<br><br>10. &nbsp; &nbsp; &nbsp;&nbsp;</span><span style=\"font-family: Arial; font-size: 12pt;\">Mdm Kuok also oversaw the expansion of institutions managed by NHG, including Khoo Teck Puat Hospital and Yishun Community Hospital following the amalgamation of the former Alexandra Health System with NHG, as well as new developments such as HealthCity Novena, NCID, the Ng Teng Fong Centre for Healthcare Innovation, Woodlands Health Campus, and the new National Skin Centre Campus.&nbsp;<br></span></p></p><p><span style=\"font-size: 16px;\"><span style=\"font-family: Arial;\"><strong><br>MINISTRY OF HEALTH<br></strong><strong>25&nbsp;</strong><strong>JUNE 2021</strong></span></span></p><p style=\"margin-bottom: 0cm; text-align: justify;\"><span style=\"font-size: 12pt; font-family: Arial;\">&nbsp;</span></p><p style=\"margin-bottom: 0cm; text-align: justify;\"><span style=\"font-size: 12pt; font-family: Arial;\">&nbsp;</span></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "appointment-of-new-chairmen-for-singapore-health-services-and-national-healthcare-group_25June2021", "CurrentPageUrl": null}, {"Title": "15 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1624606800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "25 Jun 2021", "Summary": "", "MainContent": "<p><span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As of 25 June 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 15 new cases of locally transmitted COVID-19 infection. 12 are linked to previous cases, amongst whom 4 have already been placed on quarantine, and 8 were detected through surveillance. The remaining 3 cases are currently unlinked. Based on our investigations so far, the cases are in the community, and there are no new cases in the dormitories.</span></p><p><span style=\"font-size: 16px;\">2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In addition, there are 5 imported cases, who have already been placed on Stay-Home Notice or isolated upon arrival in Singapore. Of these, 4 are returning Singaporeans or Singapore Permanent Residents.</span></p><p><span style=\"font-size: 16px;\">3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In total, there are 20 new cases of COVID-19 infection in Singapore today.</span></p><p><span style=\"font-size: 16px;\">4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.</span></p><p><span style=\"font-size: 16px;\"><strong><br>MINISTRY OF HEALTH<br>25 JUNE 2021</strong></span></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "15-new-cases-of-locally-transmitted-covid-19-infection_25Jun", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}