{"pressItemDictionary": {"Press Releases": [{"Title": "Maintaining Heightened Alert to Minimise Risk of Transmission As We Re-open Safely", "PublishedDate": "/Date(1623311760000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "10 Jun 2021", "Summary": "", "MainContent": "The Multi-Ministry Taskforce (MTF) had earlier announced that the tightened community measures under Phase 2 (Heightened Alert) would be in place until 13 June 2021. The MTF would like to thank all Singaporeans and residents for their efforts and cooperation in adhering to the tightened measures. We have slowed down the chains of transmission and reduced the number of community cases, and are now in a position to ease the tightened measures. As we still see a small number of unlinked cases from time to time, we continue to encourage the public to stay vigilant and to see a doctor if they are unwell.<br><br>2. Our COVID-19 vaccination efforts continue to make good progress. We will be extending our vaccination programme to Singapore Citizens aged 12–39 years old, and to individuals who have previously recovered from a COVID-19 infection. Eligible individuals will be able to register and book their appointments from 11 June 2021 onwards.<br><br><strong>Gradual Re-opening to Phase 3 (Heightened Alert)</strong><br><br>3. As part of a calibrated reopening, from <strong>Monday, 14 June 2021</strong>, we will move back to Phase 3 (Heightened Alert) in two steps, as follows (see <strong><a href=\"/docs/librariesprovider5/pressroom/press-releases/annex---mtf-press-release-10-jun-2021.pdf?sfvrsn=d856dc50_2\"><strong>Annex</strong></a>&nbsp;</strong>for details):<br><br><strong><span style=\"text-decoration: underline;\">Re-opening from Monday 14 June 2021</span></strong><br><br><span style=\"text-decoration: underline;\">(A) Increase in Social Gathering Group Size</span><br><br>4. We will increase the current social gathering group size limit from 2 persons to <strong>5 persons</strong>, and increase the cap of 2 distinct visitors per household per day to <strong>5 distinct visitors per household per day</strong>. To reduce the likelihood of transmission, we should continue to limit our social circle to a small group of regular contacts. We can do so by limiting the number of social gatherings to no more than two a day.<br><br><span style=\"text-decoration: underline;\">(B) Increase in Event Size and Capacity Limits</span><br><br>5. <span style=\"text-decoration: underline;\">Attractions, cruises, museums and public libraries</span>. The operating capacity of attractions, including the two cruise pilots, that have received MTI’s prior approval will be increased from the current capacity of 25% to 50%. Museums and public libraries will also be allowed to operate at an increased operating capacity of 50%.<br><br>6. The following event size limits will also be increased. However, to minimise the likelihood of large infection clusters, pre-event testing (PET) remains an essential measure to ensure that events can proceed safely for attendees. More details on PET can be found on the <a href=\"https://www.moh.gov.sg/covid-19/pet\" title=\"\" class=\"\" target=\"\">Ministry of Health</a>&nbsp;website.<br><br>a. <span style=\"text-decoration: underline;\">Cinemas, MICE, live performances, spectator sport events</span>. Live performances and spectator sports events may resume. Audience sizes for these events will be increased to 250 attendees with PET. PET will not be required for events with 50 or fewer attendees. Further details for each event type will be released by the respective sector agencies. Unmasking and singing or playing of wind instruments at live performances remain prohibited and may only resume from 21 June 2021.<br><br>b. <span style=\"text-decoration: underline;\">Congregational and other worship activities</span>. Congregational and other worship services may take place with up to 250 attendees with PET. PET will not be required for worship activities with 50 or fewer attendees. Unmasking and singing or playing of wind instruments at live performances during worship services remain prohibited and may only resume from 21 June 2021. Further details on religious activities will be released by MCCY.<br><br>c. <span style=\"text-decoration: underline;\">Marriage solemnisations</span>. Marriage solemnisations in external venues (i.e. not in a place of residence or in the Registry of Marriages/Registry of Muslim Marriages building) may take place with up to 250 attendees (including the wedding couple but excluding solemnisers and vendors) with PET required for all attendees include the wedding couple. For solemnisations involving 50 or fewer attendees, PET is not required. For marriage solemnisations held in the home, the hosting household will be able to invite up to 5 visitors (excluding members of the hosting household, the solemniser and vendors), or have up to 10 attendees in total (as per the current cap, including all attendees but excluding the solemniser and vendors), whichever is higher. Wedding receptions remain prohibited and may only resume from 21 June 2021.<br><br><span style=\"text-decoration: underline;\">(C) Resumption of Personal Services Without Masks</span><br><br>7. Personal care and appearance services which require masks to be removed (e.g. facials, saunas) will be allowed to resume.<br><br><strong>Further Re-opening from 21 June 2021</strong><br><br>8. If the situation remains under control in the coming weeks, the following activities may resume from 21 June 2021:<br><br>a. <span style=\"text-decoration: underline;\">Resumption of dining in at F&amp;B</span>. Dining in at F&amp;B establishments will be allowed to resume. As these are higher-risk settings, F&amp;B establishments are reminded to strictly observe at least 1 metre safe distancing between groups of diners (of no more than five persons) so as to mitigate the risk of transmission between unmasked persons. We will be significantly stepping up enforcement and will take firmer enforcement action for any breaches. Patrons are reminded to keep their masks on at all times, except when eating or drinking.<br><br>b. <span style=\"text-decoration: underline;\">Wedding receptions</span>. Wedding receptions will be allowed to resume with up to 100 attendees (including the wedding couple but excluding vendors), with PET required for all attendees. For wedding receptions up to 50 attendees, PET is required only for all members of the wedding party (of up to 20 attendees including the wedding couple).<br><br>c. <span style=\"text-decoration: underline;\">Live performances</span>. Unmasking and singing/playing of wind instruments for live performances will be allowed, subject to relevant safe management measures which will be released by NAC. Singing and playing of wind instruments may also resume for live performances at congregational and worship services.<br><br>d. <span style=\"text-decoration: underline;\">Gyms, fitness studios, and mask-off sports activities</span>. Gyms and fitness studios may resume indoor mask-off sports activities, with safe distancing of at least 2 metres between persons and at least 3 metres between groups of up to 5 persons. Sports classes (both indoors and outdoors) will be capped at 30 persons (including the instructor) comprised of groups of no more than 5 persons. Class participants may unmask if they are engaging in strenuous activities, although they are strongly encouraged to remain masked where possible to reduce the risk of transmission. SportSG will release further details on this.<br><br>e. <span style=\"text-decoration: underline;\">In-person tuition and enrichment classes</span>. In-person tuition and enrichment classes for those aged 18 and below will be allowed to resume with enhanced safe management measures, which will be announced by MOE subsequently. Higher-risk arts and culture classes such as singing, and wind instruments will also be allowed to resume. Further details on these classes will be released by NAC.<br><br><strong>Work-from-home Remains the Default to Keep Risks Down</strong><br><br>9. As we transition out of Phase 2 (Heightened Alert) in the coming weeks, it remains essential that we continue to keep transmission risks in check by reducing overall footfall and interactions at common spaces at or near the workplace, and in public places, including public transport. Therefore, work-from-home will continue to remain the default arrangement. Employers must ensure that employees who are able to work-from-home do so, continue to stagger start times of employees who need to return to the workplace, and implement flexible working hours. There should continue to be no cross-deployment of workers to multiple worksites.<br><br><strong>Targeted Support Measures</strong><br><br>10. In view of the continued closure of various activities until 20 June, the Government will extend the current enhancements to the Jobs Support Scheme (JSS) for affected sectors until 20 June. From 21 to 30 June, the affected sectors will receive 10% JSS support. The Government has also been cushioning the impact of lower taxi and private hire car ridership arising from COVID-19. For taxi and private hire car drivers, the Government will extend the COVID-19 Driver Relief Fund for three more months at $300 per month per vehicle for two months, and $150 per month per vehicle for the next one month.<br><br><strong>Regular Fast and Easy Testing (FET) Regime for Staff Involved in Higher-Risk Mask-Off Activities</strong><br><br>11. As part of the suite of measures to reduce transmission for mask-off activities as we resume more activities, we will be requiring all staff who work at settings with unmasked clients/patrons to be placed on a FET regime, using tests such as antigen rapid test (ART), regardless of their vaccination status. These include staff of:<br><br>a. Dine-in F&amp;B establishments&nbsp;<br>b. Personal care and appearance services that require removal of masks (e.g. facial services, saunas, make-up services)<br>c. Gyms and fitness studios where clients are unmasked&nbsp;<br><br>12. We will be aggressively ramping up FET capacity in the coming months. Mandatory FET testing will be progressively rolled out to larger establishments first and extended to smaller businesses thereafter. For dine-in F&amp;B establishments, we will roll out mandatory FET testing progressively, starting from next month. Details of the roll-out will be announced when ready.<br><br><strong>Sale of Antigen Rapid Test (ART) Self-Test Kit at Retail Pharmacies</strong><br><br>13. The Health Sciences Authority (HSA) has granted interim authorisation for four ART self-test kits, ‘Abbott PanBio<sup>TM</sup> COVID-19 Antigen Self-test’, ‘QuickVue At-Home OTC COVID-19 Test’, ‘SD Biosensor SARS-CoV-2 Antigen Self-Test Nasal’, and ‘SD Biosensor Standard Q COVID-19 Ag Home Test’ for sale to the general public. These tests produce results in less than 20 minutes, are simple to use and can be self-administered. These kits will be sold by pharmacists in the Guardian, Unity, and Watsons retail pharmacies from 16 June 2021, and will be made available at more retail locations progressively. More information on ART will be made available through various media channels and the MOH website from 16 June onwards. To ensure that there are adequate supplies for all, sales will be initially limited to 10 ART kits per person.<br><br>14. The ART self-test kits complement our overall surveillance system. These FETs will allow us to detect cases more quickly, in particular among individuals who do not have acute respiratory infection (ARI) symptoms but are concerned that they may have been exposed to COVID-19 (e.g. if they had been to a place that a confirmed case had visited). Individuals who have a positive result for their ART self-test should immediately approach a Swab and Send Home Public Health Preparedness Clinic (SASH PHPC) for a confirmatory Polymerase Chain Reaction (PCR) test. They are then required to self-isolate until they receive a negative PCR test result. Those who test negative on their self-test ART should continue to stay vigilant and adhere to prevailing safe management measures. <span style=\"text-decoration: underline;\">Individuals who have ARI symptoms should continue to visit a doctor for a full diagnosis and PCR test instead of relying on an ART self-test kit.</span><br><br><strong>Continued Acceleration of Vaccination Programme to Protect More People</strong><br><br>15. We continue to make steady progress with our overall vaccination programme. As of 9 June, we have administered more than 4.4 million doses of the COVID-19 vaccine. Around 2.5 million individuals have received at least the first dose of the vaccine, of whom about 1.9 million individuals have received their second dose and completed the full vaccination regimen.<br><br>16. The overall take-up rate has been increasing. To date, about 74% of eligible seniors aged 60 and above, close to 74% of eligible persons aged 45 to 59, and 65% of eligible persons aged 40 to 44 have received the COVID-19 vaccination or booked their vaccination appointments.<br><br><strong>Commencing Vaccinations for New Groups</strong><br><br><span style=\"text-decoration: underline;\">Singapore Citizens Aged 12 to 39 Years Old</span><br><br>17. We will be extending the vaccination programme to Singapore Citizens (SCs) aged 12 to 39 years, and they will be able to register online via vaccine.gov.sg and book an appointment from 11 June 2021 onwards. Children who turn 12 in 2021 must have crossed their birthday before they are eligible to book a vaccination appointment. After registration, registrants will be progressively invited to book their vaccination appointments via an SMS with a personalised booking link sent to the mobile number they registered with. Registrants can expect to receive this SMS a few days after registration. However, we seek your patience and understanding that the SMS may take up to two weeks for some, as more appointment slots for vaccination will be made available as more supplies arrive. Those who had registered their interest earlier on vaccine.gov.sg will not need to re-register. The invitation to register will be eventually extended to the rest of the population over the coming months.<br><br><span style=\"text-decoration: underline;\">Recovered Persons</span><br><br>18. Individuals who have had an earlier COVID-19 infection, and have recovered, are recommended to receive a single dose of vaccine as there is evidence indicating that a single dose would further boost their immunity against COVID-19. As recovered individuals within the first six months after their infection are likely to still have a strong immune response that has not faded, we will prioritise only those who had an earlier COVID-19 infection from over six months ago for the one-dose vaccination at this point. Such recovered persons will be able to register from 11 June 2021 onwards, if they are part of a population group that is already eligible for vaccination.<br><br><span style=\"text-decoration: underline;\">Parental Consent for Persons Below 18 Years Old</span><br><br>19. Under the national vaccination programme, children/wards below the age of 18 will require the consent of their parent/guardian to book a vaccination appointment. Parents/guardians can register interest for their child/ward to receive the vaccination on vaccine.gov.sg. They will be required to give consent for their child/ward to receive the COVID-19 vaccination as part of the booking process. Parents/guardians are reminded to ensure that their child/ward bring along documentary proof of their consent to the vaccination site for verification.<br><br>20. Parents/guardians of their child/ward aged 13 and above are not required to accompany their child/ward to the vaccination site on the day of vaccination. Children/wards aged 12 will need to be accompanied by a parent or guardian.<br><br><strong>Keeping Our Community Safe</strong><br><br>21. Vaccination remains a key enabler and its ability to help Singapore re-open safely can only be felt when we can collectively achieve a high level of population coverage for vaccination. Hence, we urge everyone who is eligible to be vaccinated when it is offered to you. Further relaxations such as for group and event sizes, capacity limits, distancing requirements, mask-wearing and travel will be introduced when a sufficient proportion of the population has been fully vaccinated, especially for those who are vaccinated.<br><br>22. In addition, all prevailing safe management measures must be adhered to, and individuals should see a doctor and get tested if they feel unwell. It is only by working together, that we can emerge stronger and safer.<br>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "maintaining-heightened-alert-to-minimise-risk-of-transmission-as-we-re-open-safely", "CurrentPageUrl": null}, {"Title": " 4 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1623310200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "10 Jun 2021", "Summary": "", "MainContent": "<p style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 16px;\">&nbsp; &nbsp; &nbsp;As of 10 June 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 4 new&nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">cases of locally transmitted COVID-19 infection.&nbsp;2</span><span class=\"bumpedfont15\" style=\"font-family: Arial; font-size: 16px;\">&nbsp;are linked to previous cases, amongst whom 1 has already been placed on quarantine, and 1 was detected through surveillance.</span><span class=\"bumpedfont15\" style=\"font-family: Arial; font-size: 16px;\"></span><span style=\"font-family: Arial; font-size: 16px;\">The remaining 2 cases are currently unlinked.&nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">Based on our investigations so far, the cases are in the community, and there are no new cases in the dormitories</span><span style=\"font-family: Arial; font-size: 16px;\">.<br></span><span style=\"text-align: left; font-family: Arial; font-size: 16px;\"><br>2.&nbsp; &nbsp; &nbsp;In addition, there are 9 imported cases, who have already been placed on Stay-Home Notice upon arrival in Singapore</span><span style=\"text-align: left; font-family: Arial; font-size: 16px;\">. Of these, 7 are returning Singaporeans or Singapore Permanent Residents.<br><br>3. &nbsp; &nbsp; &nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 16px; text-align: left;\">In total, there are 13 new cases of COVID-19 infection in Singapore today.<br><br>4. &nbsp; &nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 16px; text-align: left;\">We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;<br><br></span><strong style=\"text-align: left; font-family: Arial; font-size: 16px;\">MINISTRY OF HEALTH<br></strong><strong style=\"font-family: Arial; text-align: left;\"><span style=\"font-size: 12pt;\">10 JUNE 2021</span></strong></p><br>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "4-new-cases-of-locally-transmitted-covid-19-infection_10June2021", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}