{"pressItemDictionary": {"Press Releases": [{"Title": "1 New Case of Locally Transmitted Covid-19 Infection ", "PublishedDate": "/Date(1612341000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "03 Feb 2021", "Summary": "", "MainContent": "<span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp;As of 3 February 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 1 new case of locally transmitted COVID-19 infection. Based on our investigations so far, the case is in the community, and there are no new cases in the dormitories.&nbsp;<br><br>2.&nbsp; &nbsp; In addition, there are 17 imported cases, who had already been placed on Stay-Home Notice or isolated upon arrival in Singapore. In total, there are 18 new cases of COVID-19 infection in Singapore today.<br><br>3.&nbsp; &nbsp;&nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;<br></span><div><span style=\"font-size: 16px;\"><br><br><strong></strong></span><div> <p><span style=\"font-size: 16px;\"><strong>MINISTRY OF HEALTH<br></strong><strong>3 FEBRUARY 2021</strong></span></p> </div><div><span style=\"font-size: 16px;\"><br></span></div><span style=\"font-size: 16px;\"><br></span></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "1-new-case-of-locally-transmitted-covid-19-infection-3-feb-2020", "CurrentPageUrl": null}, {"Title": "Second Covid-19 Vaccine Authorised for Use In Singapore", "PublishedDate": "/Date(1612339320000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "03 Feb 2021", "Summary": "", "MainContent": "<p style=\"text-align: justify;\"><span style=\"font-family: Arial;\"><span style=\"font-size: 14px;\">&nbsp; &nbsp; &nbsp; &nbsp;The government welcomes the Expert Committee on COVID-19 Vaccination’s endorsement of the Moderna COVID-19 vaccine for use in Singapore in individuals aged 18 years and above. This follows the Health Sciences Authority’s (HSA) authorisation of the vaccine under the Pandemic Special Access Route (PSAR). The&nbsp; Moderna COVID-19 vaccine is the second COVID-19 vaccine to be authorised for pandemic use by HSA, after the Pfizer-BioNTech COVID-19 vaccine.<br><br>2.&nbsp; &nbsp;We will progressively roll out the Moderna COVID-19 vaccine for individuals aged 18 years and above when shipments of the vaccine arrive. We expect the first shipment to arrive around March 2021, if there are no disruptions to the shipment schedule.&nbsp;<br><br>3.&nbsp; &nbsp;More vaccines from both Moderna and Pfizer-BioNTech will arrive over the course of the year. We will continue to monitor our supplies closely to ensure that we will have enough vaccines for all Singaporeans and long-term residents in Singapore by the third quarter of 2021.&nbsp;<br><br>4.&nbsp; &nbsp; As of 2 February 2021, more than 175,000 individuals have received their first dose of the COVID-19 vaccine. About 6,000 of them have also received their second dose of the vaccine, and completed the full vaccination regimen. In two weeks’ time, they will be adequately protected against COVID-19.&nbsp;<br><br>5.&nbsp; &nbsp;Vaccination is critical to protect us and our loved ones against COVID-19. Vaccination also protects those in our community who cannot be vaccinated due to medical reasons. While COVID-19 vaccination will be voluntary, we strongly encourage everyone who is medically eligible for vaccination to get vaccinated when the vaccine is offered, to better protect ourselves and our loved ones.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>3 FEBRUARY 2021</strong><br></span></span></p><div><br></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "second-covid-19-vaccine-authorised-for-use-in-singapore", "CurrentPageUrl": null}, {"Title": "Expert Committee On Covid-19 Vaccination Endorses Use of Moderna Covid-19 Vaccine", "PublishedDate": "/Date(1612339200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "03 Feb 2021", "Summary": "", "MainContent": "<p style=\"text-align: justify;\"><span style=\"font-family: Arial;\"><span style=\"font-size: 14px;\"><strong>Press Release by the Expert Committee on COVID-19 Vaccination<br></strong><br>&nbsp; &nbsp; &nbsp; &nbsp; The Expert Committee on COVID-19 Vaccination welcomes the interim authorisation of the Moderna COVID-19 vaccine by the Health Sciences Authority (HSA), for use in Singapore in individuals aged 18 years and above to prevent COVID-19 disease.&nbsp;<br><br>2.&nbsp; &nbsp; &nbsp; &nbsp; The Expert Committee has independently reviewed the Moderna COVID-19 vaccine’s safety and efficacy data for different population segments in Singapore, and has been briefed by HSA on its full range of considerations in granting interim authorisation, and is satisfied with its safety and efficacy.&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp; In assessing the suitability of vaccine candidates for specific population groups, the Expert Committee took into consideration the safety, efficacy and tolerability of the vaccine and data adequacy of clinical trials. The Moderna COVID-19 vaccine demonstrated a high vaccine efficacy of 94%, and its safety profile is consistent with the standards set for other registered vaccines used in the immunisation against other diseases.&nbsp;<br><br>4.&nbsp; &nbsp; &nbsp; &nbsp;We endorse HSA’s recommendation of the suitability of use in individuals aged 18 years and above in Singapore. However, pregnant women, severely immuno-compromised persons and those under the age of 18 should not receive the vaccine yet, until more safety and efficacy data become available. Persons with a history of anaphylaxis or severe allergies should also not be given the vaccine at this time.&nbsp;<br><br>5.&nbsp; &nbsp; &nbsp; The Expert Committee will continue to monitor and review the use of COVID-19 vaccines in Singapore as more data becomes available over time. While Singapore currently has a low rate of local transmission of COVID-19, we remain at risk of a surge in cases. Therefore it is important that we achieve as comprehensive a coverage of COVID-19 vaccination as possible across the entire population. We strongly encourage all persons who are medically eligible to be vaccinated when the vaccine is made available to them.<br><br><br><strong>EXPERT COMMITTEE ON COVID-19 VACCINATION&nbsp;<br>3 FEBRUARY 2021</strong></span></span></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "expert-committee-on-covid-19-vaccination-endorses-use-of-moderna-covid-19-vaccine", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}