{"pressItemDictionary": {"Press Releases": [{"Title": "Prudent Use of Scdf Emergency Medical Services and Emergency Department Services", "PublishedDate": "/Date(1635141600000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "25 Oct 2021", "Summary": "", "MainContent": "1. The Ministry of Health (MOH) and Singapore Civil Defence Force (SCDF) advise members of the public to activate 995 Emergency Medical Services (EMS) only for life-threatening emergencies.<br><br>2. Between 15 and 21 October 2021, SCDF 995 Operations Centre received about 5,500 calls for medical assistance. Approximately 20% of the calls were from COVID-19 patients. They were conveyed to the nearest Emergency Department (ED). Of these COVID-19 patients conveyed to the ED, about 47% received only day treatment at the ED and did not need to be hospitalised. Additionally, 15% were warded for 2 days or less, and mainly for observation.<br><br>3. SCDF 995 EMS caters to the conveyance of both COVID-19 and non-COVID patients who suffer from life threatening and emergency conditions.<sup>1&nbsp;&nbsp;</sup><br><br>4. To ensure that the 995 EMS is able to provide responsive conveyance for those with emergency conditions, we advise individuals who are not experiencing life-threatening emergencies to refrain from calling 995.<br><br>5. Individuals who have tested positive in their polymerase chain reaction (PCR) test and are recovering at home under the Home Recovery Programme or awaiting conveyance to a care or isolation facility, but who are experiencing only mild symptoms, are advised to seek medical help via the following channels:<br><br>a. A telemedicine provider (<a href=\"https://go.gov.sg/telemedicineproviders\" title=\"\" class=\"\" target=\"\">go.gov.sg/telemedicineproviders</a>);&nbsp;<br>b. Their regular primary care provider; or<br>c. The HR Buddy hotline (6874 4939).<br><br>6. Those who have tested positive in their Antigen Rapid Test (ART) and are feeling unwell or experiencing symptoms such as fever or persistent cough should visit a Public Health Preparedness Clinic (PHPC) (<a href=\"https://flu.gowhere.gov.sg/\" title=\"\" class=\"\" target=\"\">https://flu.gowhere.gov.sg</a>) via private transport for medical attention.<br><br>7. As we learn to live with COVID-19, appropriate activation of 995 EMS and use of ED services is important. It will ensure that patients requiring emergency care are able to receive it in a timely and prompt manner.<br><br>[1]&nbsp;These conditions include sudden onset of chest pain, breathlessness, drowsiness or confusion, sudden onset of limb or body weakness, difficulty in speech, or drooping of the face, severe bleeding from injuries, loss of consciousness, and unexplained jerking of the body or fits.<br><br><strong>MINISTRY OF HEALTH<br>SINGAPORE CIVIL DEFENCE FORCE<br><br>25 OCTOBER 2021</strong>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "prudent-use-of-scdf-emergency-medical-services-and-emergency-department-services", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}