{"pressItemDictionary": {"Press Releases": [{"Title": "13 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1624458480000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "23 Jun 2021", "Summary": "", "MainContent": "As of 23 June 2021, 12pm, the Ministry of Health (MOH) has confirmed and verified that there are 13 new cases of locally transmitted COVID-19 infection. The cases are in the community, and there are no new cases in the dormitories. Of the 13 cases, 8 are linked to previous cases and have already been placed on quarantine. 5 were detected through surveillance, amongst whom 2 are linked to previous cases and 3 are currently unlinked. There are 9 imported cases, who have already been placed on Stay-Home Notice (SHN) upon arrival in Singapore. Amongst the new cases today, 10 are asymptomatic, and were detected from our proactive screening and surveillance, while 12 were symptomatic.<br><br><p><strong>Summary of new cases</strong></p> <p>&nbsp;</p> <table border=\"1\" cellspacing=\"0\" cellpadding=\"0\" width=\"907\"> <tbody><tr> <td width=\"194\"> <p align=\"right\">&nbsp;</p> </td> <td width=\"90\"> <p>&nbsp;</p> </td> <td width=\"24\" valign=\"top\"> <p>&nbsp;</p> </td> <td width=\"288\" colspan=\"2\"> <p align=\"center\"><strong>Breakdown by</strong></p> </td> <td width=\"24\" valign=\"top\"> <p>&nbsp;</p> </td> <td width=\"288\" colspan=\"2\"> <p align=\"center\"><strong>Breakdown by</strong></p> </td> </tr> <tr> <td width=\"194\"> <p align=\"right\">&nbsp;</p> </td> <td width=\"90\"> <p><strong>Number of cases</strong></p> </td> <td width=\"24\" valign=\"top\"> <p>&nbsp;</p> </td> <td width=\"144\"> <p><strong>Already in quarantine/ isolation before detection</strong></p> </td> <td width=\"144\"> <p><strong>Detected from surveillance</strong></p> </td> <td width=\"24\" valign=\"top\"> <p>&nbsp;</p> </td> <td width=\"144\"> <p><strong>Symptomatic</strong></p> </td> <td width=\"144\"> <p><strong>Asymptomatic</strong></p> </td> </tr> <tr> <td width=\"194\"> <p><strong>Cases in the community</strong></p> </td> <td width=\"90\"> <p align=\"center\">13</p> </td> <td width=\"24\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"144\"> <p align=\"center\">8</p> </td> <td width=\"144\"> <p align=\"center\">5</p> </td> <td width=\"24\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"144\"> <p align=\"center\">11</p> </td> <td width=\"144\"> <p align=\"center\">2</p> </td> </tr> <tr> <td width=\"194\"> <p><strong>Cases residing in dormitories</strong></p> </td> <td width=\"90\"> <p align=\"center\">0</p> </td> <td width=\"24\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"144\"> <p align=\"center\">0</p> </td> <td width=\"144\"> <p align=\"center\">0</p> </td> <td width=\"24\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"144\"> <p align=\"center\">0</p> </td> <td width=\"144\"> <p align=\"center\">0</p> </td> </tr> <tr> <td width=\"194\"> <p><strong>Imported cases</strong></p> </td> <td width=\"90\"> <p align=\"center\">9</p> </td> <td width=\"24\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"144\"> <p align=\"center\">9</p> </td> <td width=\"144\"> <p align=\"center\">0</p> </td> <td width=\"24\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"144\"> <p align=\"center\">1</p> </td> <td width=\"144\"> <p align=\"center\">8</p> </td> </tr> <tr> <td width=\"194\"> <p><strong>Total</strong></p> </td> <td width=\"90\"> <p align=\"center\">22</p> </td> <td width=\"24\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"144\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"144\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"24\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"144\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"144\"> <p align=\"center\">&nbsp;</p> </td> </tr> </tbody></table><br>2. Overall, the number of new cases in the community has increased from 77 cases in the week before to 98 cases in the past week. The number of unlinked cases in the community has also increased from 19 cases in the week before to 21 cases in the past week. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br><br>3. Amongst the 131 confirmed cases reported from 17 June to 23 June, 42 cases have tested positive for their serology tests, 74 have tested negative, and 15 serology test results are pending.<br><br><strong>Case Details<br><br>a) Cases in the community: 13<br></strong><br>There are 13 cases in the community today, of whom 10 are linked to previous cases and 3 are currently unlinked.&nbsp;<br><br><strong>Currently unlinked cases&nbsp;</strong><br><br>Detected through surveillance:<br><br><span style=\"text-decoration: underline;\">Case 64394</span> is an 81 year-old male Singaporean who is a retiree. He developed a cough on 20 June, and was conveyed to Singapore General Hospital in an ambulance when his condition worsened on 21 June. He was tested for COVID-19 on the same day, and his test result came back positive for COVID-19 infection on 22 June. His serology test result is pending. Case 64394 received his first dose of COVID-19 vaccine on 10 June.&nbsp;<br><br><span style=\"text-decoration: underline;\">Case 64399</span> is a 34 year-old female Singaporean who works as a nurse at the National Centre for Infectious Diseases, and had interacted with COVID-19 patients. At work, she dons full personal protective equipment (PPE), including N95 mask, face shield, goggles, gown and gloves. She developed a runny nose and sore throat on 21 June night, and sought medical treatment at a General Practitioner (GP) clinic on 22 June, where she underwent both an antigen rapid test (ART) and polymerase chain reaction (PCR) test. Her ART result came back positive for COVID-19 on the same day, and she developed a fever later that day. Her PCR test result also came positive for COVID-19 infection on 22 June. Her earlier tests from Rostered Routine Testing (RRT) – the last being on 10 June – were all negative for COVID-19 infection. Her serology test result is negative for the N antigen, which suggests the presence of early infection. Case 64399 received her first dose of COVID-19 vaccine on 29 January, and her second dose on 20 February.&nbsp;<br><br><span style=\"text-decoration: underline;\">Case 64405</span> is a 69 year-old female Singaporean who is a retiree. She developed a cough and runny nose on 21 June but did not seek medical attention. She was detected when she was tested for COVID-19 on 22 June as part of our community surveillance testing for residents of the Redhill Close area. Her test result came back positive for COVID-19 infection on 23 June. Her serology test result is pending. Case 64405 received her first dose of COVID-19 vaccination on 18 April and the second dose on 16 May.<br><br><strong>115 Bukit Merah View Market &amp; Food Centre cluster</strong><br><br>Already quarantined:<br><br><span style=\"text-decoration: underline;\">Case 64403</span> is a 34 year-old female India national who works as a cashier at Mustafa Shopping Centre. She is a family member and household contact of Cases 64231<sup>1</sup>, 64269<sup>2</sup>, 64278<sup>3</sup>&nbsp;and 64355<sup>4</sup>, and was placed on quarantine on 14 June. She was tested for COVID-19 on 16 June and 18 June during quarantine, and her test results were negative. She was tested for COVID-19 again on 21 June. The next day, she developed body aches and reported her symptom. Her test result came back positive for COVID-19 infection on 22 June. She subsequently developed a fever on 23 June. Her serology test result is pending.&nbsp;<br><br><strong>119 Bukit Merah View cluster</strong><br><br>Already quarantined:<br><br><span style=\"text-decoration: underline;\">Case 64407</span> is a 50 year-old female Singaporean who is employed by CSP Maintenance Pte Ltd as a cleaner at Enabling Village (20 Lengkok Bahru). As she had been identified as a close contact of Case 64361<sup>5</sup>, she was placed on quarantine on 21 June. She is asymptomatic, and was detected when she was tested for COVID-19 on 22 June during quarantine. Her test result came back positive for COVID-19 infection on 23 June. Her serology test result is pending.<br><br><strong>90 Redhill Close cluster</strong><br><br>Detected through surveillance:<br><br><span style=\"text-decoration: underline;\">Case 64392</span> is a 31 year-old male Singaporean who works as a nurse at National Heart Centre Singapore. He was detected when he was tested for COVID-19 on 21 June as part of our community surveillance testing for residents of the Redhill Close area. As he had been identified as a family member and household contact of Cases 64377<sup>6</sup>&nbsp;and 64379<sup>7</sup>, he was placed on quarantine on 21 June. He subsequently developed a cough on the same day. His test result came back positive for COVID-19 infection on 22 June. His earlier tests from RRT – the last being on 16 June – were all negative for COVID-19 infection. His serology test result is negative for the N antigen, which suggests the presence of early infection. Case 64392 received his first dose of COVID-19 vaccine on 26 February, and the second dose on 19 March.&nbsp;<br><br><strong>Case 64135 cluster<sup>8</sup></strong><br><br>Already quarantined:<br><br><span style=\"text-decoration: underline;\">Case 64402 </span>is a 62 year-old male Singaporean who works as an electrical building contractor at Seng Tat Enterprises. As he had been identified as a family member and household contact of Case 64194<sup>9</sup>, he was placed on quarantine on 13 June. He developed a fever and shortness of breath on 22 June and reported his symptoms. He was tested for COVID-19 on 22 June during quarantine, and his test result came back positive for COVID-19 infection on the same day. His serology test result is pending.&nbsp;<br><br><strong>Case 64349 cluster<sup>10</sup></strong><br><br>Already quarantined:<br><br><span style=\"text-decoration: underline;\">Case 64408</span> is a 46 year-old female Singaporean who works as a part-time cleaner at Nihon Premium Clinic (Novena Medical Centre). As she had been identified as a close contact of Cases 64349, 64387<sup>11</sup> and 64397, she was placed on quarantine on 21 June. She is asymptomatic, and was detected when she was tested for COVID-19 on 22 June during quarantine. Her test result came back positive for COVID-19 infection the next day. Her serology test result is pending.<br><br>Detected through surveillance:<br><br><span style=\"text-decoration: underline;\">Case 64397</span> is a 26 year-old male Singaporean who works as a kitchen staff at Monster Curry (ION Orchard). He was tested for COVID-19 on 13 June as part of our community surveillance testing for workers in ION Orchard, and his test result came back negative for COVID-19 infection on 14 June. He developed a sore throat on 19 June but did not seek medical attention. He subsequently developed a fever on 21 June and sought medical treatment at a GP clinic, where he underwent both an ART and PCR test. His ART result came back negative for COVID-19. On the same day, as he had been identified as a close contact of Case 64349, he was placed on quarantine. His PCR test result came back positive for COVID-19 infection on 22 June. His serology test result is pending.<br><br><strong>Case 64359<sup>12</sup> cluster</strong><br><br>Already quarantined:<br><br><span style=\"text-decoration: underline;\">Case 64390</span> is an 8 year-old male Singaporean who is a student at Alexandra Primary School, and was last in school on 18 May. He is a household contact of Case 64359, and a family member of Case 64391, and was placed on quarantine on 20 June. He underwent both an ART and PCR test on 21 June during quarantine, and developed a fever and runny nose later that day. His ART result was negative, and his PCR test result came back positive for COVID-19 on 22 June. His serology test result is negative.&nbsp;<br><br><span style=\"text-decoration: underline;\">Case 64391</span> is a 4 year-old male Singaporean who is a student at My First Skool (Tanjong Pagar Plaza), and was last in school on 28 May. He is a household contact of Case 64359, and a family member of Case 64390, and was placed on quarantine on 20 June. He developed a fever and sore throat on 20 June, and underwent both an ART and PCR test on 21 June during quarantine. His ART result came back positive on 21 June, and his PCR test came back positive for COVID-19 on 22 June. His serology test result is negative.<br><br><strong>Case 64374 cluster<sup>13</sup></strong><br><br>Already quarantined:<br><br><span style=\"text-decoration: underline;\">Case 64406</span> is a 29 year-old male Singaporean who works as an analyst at CrimsonLogic Pte Ltd and has been working from home since 16 May. As he had been identified as a close contact of Case 64373<sup>14</sup>, he was placed on quarantine on 21 June. He was tested for COVID-19 on 22 June during quarantine, and developed a sore throat later that day. His test result came back positive for COVID-19 infection the next day. His serology test result is pending.<br><br><strong>Other linked cases</strong><br><br>Already quarantined:<br><br><span style=\"text-decoration: underline;\">Case 64404</span> is an 86 year-old male Singaporean who is a retiree. He developed a sore throat on 22 June. On the same day, as he had been identified as a family member and household contact of Case 64386<sup>15</sup>, he was placed on quarantine and reported his symptom. He was tested for COVID-19 and his test result came back positive for COVID-19 infection on 22 June. His serology test result is pending. Case 64404 received his first dose of COVID-19 vaccine on 11 June.<br><strong></strong><br><strong>b) Cases residing in dormitories: 0</strong><br><br>There are no cases residing in dormitories today.&nbsp;<br><br><strong>c) Imported cases: 9</strong><br><br>Amongst the 9 imported cases,&nbsp;<br><br>• 4 (Cases 64395, 64396, 64398 and 64410) are Singapore Permanent Residents who returned from India, Indonesia, Malaysia and the UK.<br>• 1 (Case 64411) is a Student’s Pass holder who arrived from Myanmar.<br>• 2 (Cases 64401 and 64409) are Work Pass holders who arrived from France and Malaysia.<br>• 1 (Case 64400) is a Work Permit holder who arrived from Indonesia, and is a foreign domestic worker.<br>• 1 (Case 64393) is a Short-Term Visit Pass holder who arrived from Indonesia for her upcoming marriage to her Singaporean fiancé.<br><br>They have all already been placed on SHN upon arrival in Singapore and were tested while serving SHN.<br><br>4. Please refer to the <a href=\"/docs/librariesprovider5/pressroom/press-releases/annexes---23-june-2021.pdf?sfvrsn=ebd71cdc_2\" title=\"Annexes\">Annexes</a>&nbsp;and MOH’s daily Situation Report (<a href=\"https://www.moh.gov.sg/covid-19/situation-report\" title=\"\" class=\"\" target=\"\">www.moh.gov.sg/covid-19/situation-report</a>) for details.&nbsp;<br><br>5. Epidemiological investigations are in progress. In the meantime, all the identified close contacts of the cases have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for the close contacts to determine if the cases could have been infected by them.<br><br>6. MOH has been monitoring existing clusters for any further transmission. As there have been no more cases linked to the Marina Bay Sands Casino dealer, McDonald’s delivery riders and Case 63543 clusters for the past two incubation periods (i.e. 28 days), the clusters have now been closed.<br><br><strong>Update on condition of confirmed cases</strong><br><br>7. 15 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 62,113 have fully recovered from the infection and have been discharged from hospitals or community care facilities.<br><br>8. There are currently 141 confirmed cases who are still in hospital. Of these, most are stable or improving, and 5 are in critical condition in the intensive care unit. 181 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 35 have passed away from complications due to COVID-19 infection.<br><br>[1]&nbsp;Case 64231 is a 35 year-old male India national who works as a sales executive at Halnaz Frozen Goods Pte Ltd at 115 Bukit Merah View Market and Food Centre. He was confirmed to have COVID-19 infection on 14 June.<br><br>[2] Case 64269 is a 32 year-old female Singapore Permanent Resident who works as an administrative staff at MSIG Insurance. She was confirmed to have COVID-19 infection on 16 June.<br><br>[3] Case 64278 is a 3 year-old female Singaporean who does not attend any childcare facility. She was confirmed to have COVID-19 infection on 16 June.<br><br>[4] Case 64355 is a 37 year-old male Singapore Permanent Resident who works as a chef at Holiday Inn Atrium and a part-time delivery driver for Lalamove Singapore. He was confirmed to have COVID-19 infection on 20 June.<br><br>[5] Case 64361 is a 63 year-old male Singaporean who is employed by CSP Maintenance Pte Ltd as a cleaner at Enabling Village. He was confirmed to have COVID-19 infection on 20 June.<br><br>[6] Case 64377 is a 69 year-old female Singaporean who is a retiree. She was confirmed to have COVID-19 infection on 21 June.<br><br>[7] Case 64379 is a 79 year-old male Singaporean who is a retiree. He was confirmed to have COVID-19 infection on 21 June.<br><div><br>[8] Case 64135 is a 57 year-old female Singaporean who works as a promoter at Guardian (ION Orchard). She was confirmed to have COVID-19 infection on 10 June.<br><br>[9] Case 64194 is a 59 year-old female Singaporean who works as a part-time cleaner at Crystal Lodge. She was confirmed to have COVID-19 infection on 13 June.<br><br>[10] Case 64349 is a 24 year-old male Singaporean who works as a financial consultant with Prudential. He was confirmed to have COVID-19 infection on 19 June.<br><br>[11] Case 64387 is a 23 year-old male Singaporean who is a student at Singapore Institute of Management. He was confirmed to have COVID-19 infection on 22 June.<br><br>[12] Case 64359 is a 38 year-old female Philippines national who is a foreign domestic worker. She was confirmed to have COVID-19 infection on 20 June.<br><div><br>[13] Case 64374 is a 26 year-old female Singapore Permanent Resident who works as an analyst at Deutsche Bank. She was confirmed to have COVID-19 infection on 21 June.<br><br>[14] Case 64373 is a 24 year-old female China national who works as an analyst at Axis Specialty Limited. She was confirmed to have COVID-19 infection on 21 June.<br><br>[15] Case 64386 is an 82 year-old female Singaporean who is a retiree. She was confirmed to have COVID-19 infection on 22 June.</div></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "13-new-cases-of-locally-transmitted-covid-19-infection-23jun2021-update", "CurrentPageUrl": null}, {"Title": "13 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1624433580000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "23 Jun 2021", "Summary": "", "MainContent": "As of 23 June 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 13 new cases of locally transmitted COVID-19 infection. 10 are linked to previous cases, amongst whom 8 have already been placed on quarantine, and 2 were detected through surveillance. The remaining 3 cases are currently unlinked. Based on our investigations so far, the cases are in the community, and there are no new cases in the dormitories.<br><br>2.&nbsp; &nbsp; &nbsp; In addition, there are 9 imported cases, who have already been placed on Stay-Home Notice upon arrival in Singapore. Of these, 4 are returning Singaporeans or Singapore Permanent Residents.<br><br>3.&nbsp; &nbsp; &nbsp; In total, there are 22 new cases of COVID-19 infection in Singapore today.<br><br>4.&nbsp; &nbsp; &nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "13-new-cases-of-locally-transmitted-covid-19-infection-23jun2021", "CurrentPageUrl": null}, {"Title": "Updates On Border Measures for Travellers From Higher Risk Countries/ Regions ", "PublishedDate": "/Date(1624422000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "23 Jun 2021", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp;The Multi-Ministry Taskforce (MTF) has been closely monitoring the local and global COVID-19 situation, and will be reducing the duration of the Stay-Home Notice (SHN) based on updated evidence gathered over the past month. From <strong>23 June 2021, 2359 hours</strong>, all new travellers arriving from higher risk countries/regions will be subject to a 14-day SHN, instead of 21 days at dedicated SHN facilities.</p> <p><strong>Reviewing Border Measures to Manage Risks</strong></p> <p>2.&nbsp; &nbsp;In late-April 2021, little was known about the emerging variant of concern, including its incubation period. As a precaution, we had required travellers with recent travel history to higher risk countries/regions [1]&nbsp;to serve a 21-day SHN. We have since reviewed the international evidence and local case data.</p><p><p>3.&nbsp; &nbsp;While there is increased transmissibility with the new variants of concern, we have found no evidence – from both overseas and local data – that these variants come with longer incubation periods. Since we introduced the 21-day SHN for all travellers with recent travel history to higher risk countries/regions from 8 May 2021, we have had 270 imported cases among such travellers (as of 22 June 2021). All of them had incubation periods well within the 14-day window. As such, we will reduce the SHN period from 21 days back to 14 days.</p></p><p><p>4.&nbsp; &nbsp;However, given the higher transmissibility of new variants of concern, and to identify potential infection cases early and provide infected travellers with appropriate medical care as soon as possible, travellers will be required to test themselves regularly with antigen rapid test (ART) self-test kits on Days 3, 7 and 11 of their arrival in Singapore, while serving their SHN [2]. This is on top of the COVID-19 polymerase chain reaction (PCR) tests they have to take on arrival in Singapore, and on Day 14 of their arrival, before they exit SHN.</p></p><p><p>5.&nbsp; &nbsp;In summary, we will implement the following changes to the SHN regime:</p></p><p><p>a)&nbsp; &nbsp;From <strong>23 June 2021, 2359 hours</strong>, all travellers with recent travel history in the past 21 days to higher risk countries/regions immediately prior to arrival in Singapore, will only be required to complete 14 days of their SHN at dedicated SHN facilities [3]. They will undergo COVID-19 PCR tests on-arrival [4]&nbsp;and on Day 14 of their arrival. They will be allowed to end their SHN as long as they have a negative result for their PCR test on Day 14 of their arrival [5].</p></p><p><p>b)&nbsp; &nbsp;Travellers who had stayed in <strong>Taiwan and Israel</strong> in the 21 days immediately prior to arrival in Singapore were previously subjected to a 14-day SHN at dedicated SHN facilities, and an additional 7-day SHN at their place of residence. From<strong> 23 June 2021, 2359 hours, </strong>travellers who had stayed in these countries/regions in the 21 days immediately prior to their arrival in Singapore will be allowed to apply to opt out of dedicated SHN facilities before arrival and serve their 14-day SHN at their place of residence, if they fulfil the following criteria:</p></p><p>i) Travelled to no other country/region other than the above-mentioned countries/regions [6], in the last consecutive 21 days immediately prior to entry into Singapore; and <p><br>ii) Are occupying their place of residence (i.e. residential address) alone, or only with household members who are also persons serving SHN with the same travel history and duration of SHN.<br></p></p><p>c)&nbsp; &nbsp; Refund details are being worked out for travellers who are affected by these changes, and will be shared with them separately.<p><br>d)&nbsp; &nbsp; Besides the on-arrival PCR test and PCR test on Day 14 of arrival, all travellers [7]&nbsp;serving the SHN in dedicated SHN facilities will also undergo ART self-administered tests on Days 3, 7 and 11 of their arrival. This new requirement will be implemented for new arrivals from <strong>27 Jun 2021, 2359 hours</strong>.<br></p></p><p>6.&nbsp; &nbsp; Newly arrived migrant workers from higher-risk countries/regions [8]&nbsp;and staying in dormitories or working in the Construction, Marine and Process (CMP) sector will continue to go through an additional 7-day stay at the Migrant Worker Onboarding Centre (MWOC) or a dedicated facility after they are cleared from their 14-day SHN at dedicated SHN facilities. This additional 7-day stay that has been in place since early this year, will include an additional testing regime, medical examination and Settling-In-Programme (SIP), where required. This precautionary measure will further minimise any small risk of imported COVID-19 positive cases transmitting the virus into the dormitories or at the worksites which can result in large clusters, and will be regularly reviewed as the COVID-19 situation evolves.<p><br>7.&nbsp; &nbsp; New crew from higher risk countries/regions who are entering Singapore on a long-term permit to work onboard harbour craft operating in the Port of Singapore will undergo an additional 7-day stay and testing regime at a dedicated facility after they are cleared from their 14-day SHN in Singapore before commencing work onboard the harbour craft. This will serve as a precaution in view of the essential marine services that the harbour craft provide to support our supply chain.</p></p><p>8.&nbsp; &nbsp; As the global situation evolves, we will continue to adjust our border measures to manage the risk of importation and transmission to the community. Any changes to border measures will be updated on the <a href=\"https://safetravel.ica.gov.sg/\">SafeTravel website</a>. </p> <div><br clear=\"all\"> <hr align=\"left\" size=\"1\" width=\"33%\"> <div id=\"ftn1\"> <p>[1] As of 23 June 2021, this refers to all countries/regions except Australia, Brunei Darussalam, Hong Kong, Macao, Mainland China, and New Zealand. Please refer to the <a href=\"https://safetravel.ica.gov.sg\" title=\"\" class=\"\" target=\"\"></a><a href=\"https://safetravel.ica.gov.sg\" title=\"\" class=\"\" target=\"_blank\">Safe Travel Office</a>&nbsp;Website for updates to the countries/regions identified.</p> </div> <div id=\"ftn2\"> <p>[2] Travellers serving their SHN in dedicated SHN facilities will collect their ART self-test kits from the facilities after arrival in Singapore.</p> </div> <div id=\"ftn3\"> <p>[3] Affected travellers who are currently serving SHN will have their SHN reviewed and be informed of check-out arrangements separately. </p> </div> <div id=\"ftn4\"> <p>[4] To expedite the COVID-19 PCR test at the airport, travellers are strongly encouraged to register and pre-pay for their on-arrival COVID-19 PCR test prior to departing for Singapore at <a href=\"https://safetravel.changiairport.com\" title=\"\" class=\"\" target=\"_blank\">https://safetravel.changiairport.com</a>.</p> </div> <div id=\"ftn5\"> <p>[5] Actual check-out time will vary, subject to check-out volume on the ground at each specific dedicated facility. Travellers on SHN will be informed by the SDFs (SHN Dedicated Facility) on the time of check-out.</p> </div> <div id=\"ftn6\"> <p>[6] Including the following countries/regions: Australia, Brunei Darussalam, Hong Kong, Macao, Mainland China, and New Zealand. &nbsp;(correct as of 23 June 2021).</p> </div> <div id=\"ftn7\"> <p>[7] Travellers (aged 3 and above) will be required to present a valid negative COVID-19 PCR test taken within 72 hours before departure to Singapore, and be subjected to all tests required of travellers under the prevailing border measures.</p> </div> <div id=\"ftn8\"> <p>[8] This refers to Work Permit and S Pass holders (including those with in-principle approval letters) from CMP sectors who are issued with an entry approval by MOM and are subject to a 14-day SHN at dedicated SHN facilities on arrival. </p> </div> </div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "updates-on-border-measures-for-travellers-from-higher-risk-countries-regions", "CurrentPageUrl": null}, {"Title": "Update On Vaccine Category Name", "PublishedDate": "/Date(1624415400000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "23 Jun 2021", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The Pfizer-BioNTech vaccine currently used in our national vaccination programme is manufactured at various sites across Europe and labelled according to the regulatory approval in various markets.</p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; As we accelerate our vaccine supplies, we will be receiving a batch of vaccines called “Comirnaty<sup>TM</sup>”. These vaccines are the same as the Pfizer-BioNTech vaccines that we have been using in our national vaccination programme, with the same research name BNT162b2. They are manufactured according to the same processes and procedures, and meet the same finished product specifications as the Pfizer-BioNTech vaccines. They are similarly manufactured in Europe and shipped directly to Singapore. The only difference is in their label.<br></p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The Ministry of Health will be adjusting the HealthHub records of individuals who have received or will be receiving the Pfizer-BioNTech or Comirnaty<sup>TM</sup> vaccine to administratively reflect the vaccine received under a category called “Pfizer-BioNTech/ Comirnaty”.<br></p><p><br><strong>MINISTRY OF HEALTH<br>23 JUNE 2021</strong></p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "update-on-vaccine-category-name", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}