{"pressItemDictionary": {"Press Releases": [{"Title": "No New Cases of Locally Transmitted Covid-19 Infection ", "PublishedDate": "/Date(1615796400000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "15 Mar 2021", "Summary": "", "MainContent": "<span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;As of 15 March 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed that there are no new cases of locally transmitted COVID-19 infection.<br><br>2.&nbsp; &nbsp; &nbsp; &nbsp; There are 12 imported cases, who had already been placed on Stay-Home Notice upon arrival in Singapore.<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.<br><br><br><strong>MINISTRY OF HEALTH<br>15 MARCH 2021</strong></span>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "no-new-cases-of-locally-transmitted-covid-19-infection-15-mar-2021", "CurrentPageUrl": null}, {"Title": " Five Charged for Covid-19 Related Offences", "PublishedDate": "/Date(1615737600000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "15 Mar 2021", "Summary": "", "MainContent": "<p align=\"center\" style=\"text-align: left;\"><strong>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;</strong><span style=\"text-align: left;\">Five individuals have been charged in court for allegedly committing COVID-19 related offences. One had allegedly failed to self-isolate while awaiting the result of his COVID-19 test, thus exposing others to the risk of COVID-19 infection. The remaining four had allegedly gone to public places despite being issued with medical certificates (MC) for acute respiratory symptoms, thus exposing others to the risk of COVID-19 infection.[1]<br><br></span><strong>Namasivayam Sundar</strong></p> <p>2.&nbsp; &nbsp; &nbsp; &nbsp;On 20 March 2020, Namasivayam Sundar, a 57-year-old male Singapore Permanent Resident, returned to Singapore following a business trip to India, Paris and Dubai.He developed a fever on 21 March, and self-medicated. As his condition did not improve, Sundar consulted a doctor on 24 March, and was referred to the National Centre for Infectious Diseases, where he underwent a COVID-19 test. Instead of returning home to self-isolate while waiting for his test result, Sundar allegedly travelled to Textile Centre located at 200 Jalan Sultan for a one-and-a-half-hour body massage. Sundar was found to be positive for COVID-19 infection on 25 March.</p><p><p>3.&nbsp; &nbsp; &nbsp; &nbsp; Sundar was charged in court on 29 January 2021 for one count under Section 21A(1) of the Infectious Diseases Act. His case is scheduled for further mention on 12 March.</p></p><p><p><strong>Bawani D/O Murugaiah</strong></p><p>4.&nbsp; &nbsp; &nbsp; &nbsp; Between 22 July and 29 August 2020, Bawani D/O Murugaiah, a 37-year-old female Singaporean, was issued with five-day MCs on three occasions by different general practitioner clinics, all of which stated that she was required by law to stay at home throughout the duration of her MC. The respective periods of her three MCs were as follows:</p></p> <ul><li>22 July to 26 July (diagnosed with upper respiratory tract infection); </li><li>18 August to 22 August (diagnosed with prolonged upper respiratory tract infection); and</li><li>25 August to 29 August (diagnosed with upper respiratory tract infection, borderline high blood pressure and swollen lymph node in her neck).</li></ul><p>5.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;While she was on MC on the aforementioned dates, Bawani had allegedly left her home on six days on 23 July, 24 July, 19 August, 20 August, 21 August and 27 August, to work as a private hire car driver when she ferried passengers in her vehicle.</p><p>6.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; On 28 December, Bawani was charged in court for five counts under Section 21A(1) of the Infectious Diseases Act and one count under&nbsp; Regulation 3(2) read with Regulation 3(3) of the Infectious Diseases (COVID-19-Stay Orders) Regulations 2020. She appeared in court again on 22 February 2021, and her case has been scheduled for further mention in court on 22 March.</p><p><p><strong>Abdul Rashid Bin Sugianto</strong></p><p>7.&nbsp; &nbsp; &nbsp;<b> &nbsp; &nbsp;&nbsp;</b>On 2 June 2020, Abdul Rashid Bin Sugianto, a 30-year-old male Singaporean, visited a clinic and was given a five-day MC from 2 June to 6 June for displaying symptoms of acute upper respiratory tract infection. The following day, Rashid visited another clinic where he was again diagnosed with acute respiratory infection and was issued with another five-day MC from 3 June to 7 June.</p></p><p><p>8.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Rashid allegedly left his home on three separate occasions on 3 June, 4 June and 5 June during his period of MC to visit Tampines West Community Centre and Geylang.</p></p><p><p>9.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Rashid was charged in court on 6 January 2021 for three counts under Section 21A(1) of the Infectious Diseases Act.He appeared in court again on 17 February, and his case has been scheduled for further Pre-Trial Conference in court on 11 March.</p></p><p><p><strong>Ang Siu Yen</strong></p><p>10.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;On 24 October 2020, Ang Siu Yen, a 22-year-old female Singapore Permanent Resident, visited a clinic and was diagnosed with upper respiratory tract infection. She was given a four-day MC from 24 October to 27 October. Ang’s MC stated that she had acute respiratory infection symptoms and was required by law to stay at home for the duration of the MC.</p></p><p><p>11.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;While she was on MC, Ang had allegedly left home on 24 October and 25 October to go to a supermarket in Junction Nine Shopping Mall; Bugis Junction and the Yew Tee area.</p></p><p><p>12.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Ang is scheduled to be charged in court on 15 March 2021 for two counts under Regulation 3(2) read with Regulation 3(3) of the Infectious Diseases (COVID-19-Stay Orders) Regulations 2020.</p></p><p><p><strong>Foo Suan Rong, Nick</strong></p><p>13.&nbsp; &nbsp; &nbsp; &nbsp; On 16 September 2020, Foo Suan Rong, Nick, a 20-year-old male Singaporean, visited a polyclinic and was diagnosed with acute respiratory infection. He was given a three-day MC from 16 September to 18 September. Foo’s MC stated that he had acute respiratory tract infection and he was required by law to stay at home for the duration of the MC.</p></p><p><p>14.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;After his visit to the polyclinic, Foo allegedly went to ION Orchard, Orchard Central, Bugis MRT station and Admiralty MRT station instead of returning home. On 17 September, Foo had allegedly left home to go to Woodlands and Somerset area.</p></p><p><p>15.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Foo is scheduled to be charged in court on 15 March 2021 for one count under Section 21A(1) of the Infectious Diseases Act and one count under Regulation 3(2) read with Regulation 3(3) of the Infectious Diseases (COVID-19 Stay Orders) Regulations 2020.</p></p> <p><strong>Exercising social responsibility</strong></p> <p>16.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Any person convicted of an offence under the Infectious Diseases Act, &nbsp;or Stay Orders Regulations is liable on conviction to a fine not exceeding $10,000 or up to six months’ imprisonment, or both.</p> <p>17.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We urge individuals to adhere to the prevailing measures, and to stay at home for the duration of MC issued for the episode of illness, to prevent putting our loved ones and others in the community at risk of infection. The Ministry of Health will not hesitate to take strict enforcement action against those who place the public at risk of COVID-19 infection by failing to comply with the Infectious Diseases Act, &nbsp;or the Stay Orders Regulations.</p> <div><br clear=\"all\"> <hr align=\"left\" size=\"1\" width=\"33%\"> <div id=\"ftn1\"> <p>[1] The information in this press release is based on investigations. None of the accused persons has admitted to either the relevant information or charge against him/her.</p> </div> </div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "five-charged-for-covid-19-related-offences", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}