{"pressItemDictionary": {"Press Releases": [{"Title": "No New Cases of Locally Transmitted Covid-19 Infection ", "PublishedDate": "/Date(1611845760000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "28 Jan 2021", "Summary": "", "MainContent": "&nbsp; &nbsp; &nbsp; As of 28 January 2021, 12pm, the Ministry of Health (MOH) has confirmed and verified that there are no new cases of locally transmitted COVID-19 infection. There are 34 imported cases, who had already been placed on Stay-Home Notice (SHN) or isolated upon arrival in Singapore. Amongst the new cases today, 32 are asymptomatic, and were detected from our proactive screening and surveillance, while 2 were symptomatic.&nbsp;&nbsp;<br><br><strong>Summary of new cases</strong><br><div><br><div dir=\"ltr\" align=\"left\"><table><colgroup><col width=\"129\"><col width=\"60\"><col width=\"16\"><col width=\"96\"><col width=\"96\"><col width=\"16\"><col width=\"96\"><col width=\"96\"></colgroup><tbody><tr><td><strong><br></strong></td><td><strong><br></strong></td><td colspan=\"2\"><p dir=\"ltr\"><strong>Breakdown by</strong></p></td><td colspan=\"2\"><p dir=\"ltr\"><strong>Breakdown by</strong></p></td></tr><tr><td><strong><br></strong></td><td><p dir=\"ltr\"><strong>Number of cases</strong></p></td><td><p dir=\"ltr\"><strong>Already in quarantine/ isolation before detection</strong></p></td><td><p dir=\"ltr\"><strong>Detected from surveillance</strong></p></td><td><p dir=\"ltr\"><strong>Symptomatic</strong></p></td><td><p dir=\"ltr\"><strong>Asymptomatic</strong></p></td></tr><tr><td><p dir=\"ltr\"><strong>Cases in the community</strong></p></td><td><p dir=\"ltr\">0</p></td><td><p dir=\"ltr\">0</p></td><td><p dir=\"ltr\">0</p></td><td><p dir=\"ltr\">0</p></td><td><p dir=\"ltr\">0</p></td></tr><tr><td><p dir=\"ltr\"><strong>Cases residing in dormitories</strong></p></td><td><p dir=\"ltr\">0</p></td><td><p dir=\"ltr\">0</p></td><td><p dir=\"ltr\">0</p></td><td><p dir=\"ltr\">0</p></td><td><p dir=\"ltr\">0</p></td></tr><tr><td><p dir=\"ltr\"><strong>Imported cases</strong></p></td><td><p dir=\"ltr\">34</p></td><td><p dir=\"ltr\">32</p></td><td><p dir=\"ltr\">2</p></td><td><p dir=\"ltr\">2</p></td><td><p dir=\"ltr\">32</p></td></tr><tr><td><p dir=\"ltr\"><strong>Total</strong></p></td><td><p dir=\"ltr\">34</p></td><td><br></td><td><br></td><td><br></td><td><br></td></tr></tbody></table></div><br>2.&nbsp; &nbsp; &nbsp;Overall, the number of new cases in the community has decreased from 21 cases in the week before to 1 case in the past week. The number of unlinked cases in the community has also decreased from 6 cases in the week before to none in the past week. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br><br>3.&nbsp; &nbsp; &nbsp;Amongst the 190 confirmed cases reported from 22 January to 28 January, 105 cases have tested positive for their serology tests, 38 have tested negative, and 47 serology test results are pending.<br><br><strong>Case Details</strong><br><br><strong>a) Cases in the community: 0</strong><br><br>There are no cases in the community today.&nbsp;<br><br><strong>b) Cases residing in dormitories: 0</strong><br><br>There are no cases residing in dormitories today.<br><br><strong>c) Imported cases: 34</strong><br><br>Amongst the 34 imported cases,&nbsp;<br><br>- 3 (Cases 59709, 59711 and 59722) are Singaporeans and 5 (Cases 59695, 59696, 59698, 59716 and 59723) are Singapore Permanent Residents who returned from Indonesia, Malaysia, Oman, Sri Lanka, the UAE and US.<br>- 2 (Cases 59694 and 59719) are Dependant’s Pass holders who arrived from Bangladesh and the UAE.&nbsp;<br>- 1 (Case 59714) is a Long-Term Visit Pass holder who arrived from India.&nbsp;<br>- 4 (Cases 59701, 59703, 59706 and 59710) are Work Pass holders who arrived from India, Pakistan and Romania.<br>- 16 are Work Permit holders who arrived from Bangladesh, India, Indonesia and Malaysia, of whom 9 (Cases 59699, 59704, 59705, 59708, 59715, 59717, 59718, 59724 and 59725) are foreign domestic workers.<br>- 3 (Cases 59700, 59712 and 59713) are Short-Term Visit Pass holders. Cases 59700 and 59712 arrived from Indonesia and the US respectively for work projects in Singapore. Case 59713 arrived from Indonesia to visit her child who is a Singaporean.&nbsp;<br><br>They had all already been placed on SHN or isolated upon arrival in Singapore and were tested while serving SHN or during isolation.&nbsp;<br><br>Case 59697 is a Work Permit holder who has not started work since his arrival in Singapore. He arrived from Bangladesh on 6 January, and served SHN at a dedicated facility. His swab done on 17 January during SHN was negative for COVID-19.&nbsp; But on 18 January, he was placed on quarantine and isolation as he had been identified as a flight contact of Case 59423.&nbsp; He was tested on 26 January even though he is asymptomatic, and his result came back positive for COVID-19 infection. His serology test result has come back negative, and he has also tested preliminarily positive for the B117 strain, and is pending further confirmatory tests.&nbsp;<br><br>Case 59703 is a Work Pass holder who works as a software engineer at Pacific International Lines Pte Ltd. He arrived from India on 27 December 2020 and served SHN at a dedicated facility until 10 January 2021. His swab done on 7 January during SHN was negative for COVID-19. He subsequently worked from home from 11 January to 21 January. He developed nausea on 25 January, and sought medical treatment at a general practitioner clinic on 26 January. As he also reported intermittent cough and a sore throat, he was tested for COVID-19 and his test came back positive on 27 January. He has also tested preliminarily positive for the B117 strain. His serological test result has come back positive, which indicates a likely past infection.&nbsp;<br><br>Given their recent travel history, we have classified both cases as imported.<br><br>4.&nbsp; &nbsp; &nbsp;Epidemiological investigations are ongoing. In the meantime, all the identified close contacts of the cases, including their household members and co-workers, have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for the close contacts to determine if the case could have been infected by them.<br><br>5.&nbsp; &nbsp; &nbsp;Please refer to the&nbsp;<a href=\"/docs/librariesprovider5/default-document-library/annexesd4215af0df1045f0b027f49f7bb0d3da.pdf?sfvrsn=129ea45d_0\" title=\"Annexes \">Annexes </a> and MOH’s daily Situation Report (<a href=\"https://www.moh.gov.sg/covid-19/situation-report\" title=\"\" class=\"\" target=\"\">www.moh.gov.sg/covid-19/situation-report</a>) for details.&nbsp;<br><br><strong>Update on condition of confirmed cases<br></strong><br>6.&nbsp; &nbsp; &nbsp;44 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 59,148 have fully recovered from the infection and have been discharged from hospitals or community care facilities.&nbsp;<br><br>7.&nbsp; &nbsp; &nbsp;There are currently 40 confirmed cases who are still in hospital. Of these, most are stable or improving, and none is in the intensive care unit. 208 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 29 have passed away from complications due to COVID-19 infection.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>28 JANUARY 2021<br></strong><br></div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "no-new-cases-of-locally-transmitted-covid-19-infection-28jan-updated", "CurrentPageUrl": null}, {"Title": "Update On Covid-19 Vaccination Programme ", "PublishedDate": "/Date(1611844200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "28 Jan 2021", "Summary": "", "MainContent": "<p style=\"text-align: justify;\"><span style=\"font-family: Arial;\"><span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; We have made good progress in our COVID-19 vaccination programme. As of 27 January 2021, more than 113,000 individuals have received their first dose of the COVID-19 vaccine. Over 50 individuals have also received their second dose of the vaccine and completed the full vaccination regimen. These numbers are expected to rise substantially in the coming weeks as we continue to ramp up our vaccination operations safely.<br><br><strong>Rolling out of COVID-19 vaccinations to seniors in the community</strong><br><br>2.&nbsp; &nbsp; &nbsp; The first day of COVID-19 vaccination for our seniors aged 70 years old and above commenced on 27 January with two pilots at the Ang Mo Kio and Tanjong Pagar towns, which is home to a larger number of our elderly. This has been proceeding well, and more than 250 seniors were vaccinated on the first day.&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp;Sign-ups for COVID-19 vaccination by seniors in the community have been encouraging. We expect more seniors to sign up in the coming days as letters are progressively being sent to invite them to book an appointment for their vaccination. As of 27 January, we have sent personalised letters to more than 10,000 seniors in Ang Mo Kio and Tanjong Pagar, and more than one third of them have booked their appointments within two days of receiving the invitation. The remaining seniors in these areas will receive their invitation letters in the coming week. Personalised letters inviting seniors to sign up for their vaccination will be progressively sent out to all seniors across Singapore starting from mid-February as we scale up operations safely.<br><br><strong>More vaccination sites for greater convenience</strong><br><br>4.&nbsp; &nbsp; &nbsp; To ensure that seniors can conveniently receive their vaccinations, we will set up more vaccination centres over the next few weeks to ensure that everyone can conveniently receive their vaccinations. The vaccination centres will be located in high population catchment areas and/or along major public transport routes for greater accessibility. In total, there will be around 40 vaccination centres, with each vaccination centre planned for an estimated capacity of 2,000 vaccinations per day. To support the start of vaccination for seniors, we have set up a new vaccination centre at Tanjong Pagar Community Centre from 27 January, while Teck Ghee Community Centre will also be operational from 1 February.&nbsp;<br><br>5.&nbsp; &nbsp; &nbsp; Besides the vaccination centres, the polyclinics and selected Public Health Preparedness Clinics (PHPCs) will also serve as vaccination sites. Currently, seniors can already be vaccinated at nine polyclinics and 21 PHPCs. Come 1 February 2021, all 20 polyclinics across Singapore will also begin offering COVID-19 vaccinations. Seniors may be more familiar with the polyclinics and PHPCs, and these areas will be wheelchair accessible. To reach out to seniors with mobility issues and hence may find it challenging to visit a vaccination site in-person, we will set up mobile vaccination teams to deliver the vaccines to these individuals.<br><br><strong>Vaccine safety monitoring and update</strong><br><br>6.&nbsp; &nbsp; &nbsp; The Ministry of Health (MOH) and Health Sciences Authority (HSA) are closely monitoring the safety profile of the Pfizer-BioNTech COVID-19 vaccine as it is being administered to our population. Among the more than 113,000 individuals who have received the Pfizer-BioNTech vaccine, HSA has received 432 adverse event reports from healthcare professionals as of 27 January 2021. Most of these reports were for regular symptoms such as injection site pain and swelling, fever, headache, fatigue, body aches, giddiness, nausea and allergic reactions (such as itch, rash, swelling of eyes/lip). These symptoms are reactions generally associated with all vaccinations and they generally resolved on their own within a few days.&nbsp;<br><br>7.&nbsp; &nbsp; &nbsp; &nbsp;There were three reported cases of anaphylaxis (rapid onset of severe allergic reactions) that were quickly resolved by our healthcare professionals. The individuals, in their 20s and 30s, developed multiple symptoms such as rash, breathlessness, lip swelling, throat tightness and giddiness. All three individuals had a history of allergies, including allergic rhinitis and food allergy such as to shellfish, but none had a history of anaphylaxis which would have precluded them from receiving the vaccine. Anaphylaxis can be controlled when detected and treated in a timely manner. As all vaccinated persons in Singapore are closely monitored, the symptoms in these three individuals were promptly detected and treated. All have recovered from the episode and were discharged from the hospital after a day’s observation or treatment.&nbsp;<br><br>8.&nbsp; &nbsp; &nbsp; &nbsp; The incidence rate of anaphylaxis locally is currently about 2.7 per 100,000 doses administered. The incidence rates reported abroad is around one to two per 100,000 doses administered, after they have administered millions of vaccine doses. Variations in the incidence rate are to be expected initially as the numbers vaccinated in Singapore to-date are relatively small.&nbsp;<br><br>9.&nbsp; &nbsp; &nbsp; &nbsp;Currently, the benefits of getting vaccinated to protect oneself from the effects of severe COVID-19 disease and its complications far outweigh the risk of any potential adverse events known to be associated with vaccination. MOH and HSA will continue to work with the Expert Committee on COVID-19 Vaccination to closely monitor the safety of the vaccine and ensure the vaccines used in Singapore are safe for our population groups, as we roll out our vaccination programme.<br><br>10.&nbsp; &nbsp; &nbsp; Associate Professor Kenneth Mak, Director of Medical Services at MOH, said, “Anaphylaxis is a known but rare side effect of the Pfizer-BioNTech COVID-19 vaccine. As with all vaccines, there will always be a small proportion of susceptible persons who experience severe allergic reactions upon vaccination. We have put in place precautionary measures such as pre-vaccination screening and post-vaccination observation, to ensure that our vaccination programme can be carried out safely. All three cases of anaphylaxis were promptly treated and are well. Healthcare professionals in Singapore generally have a high rate of reporting of adverse events, which reflects their vigilance and promptness to report any adverse events. We will continue to work with them and our partners to ensure that vaccinations are performed safely. Vaccination remains safe for those who are eligible, and I encourage all Singaporeans and long-term residents to be vaccinated when your turn comes.”<br><br><strong>New Vaccine Injury Financial Assistance Programme for COVID-19</strong><br><br>11.&nbsp; &nbsp; &nbsp;While we expect few to need this, MOH will nevertheless introduce a vaccine injury financial assistance programme for COVID-19 vaccination (VIFAP) to provide financial assistance for affected persons in the rare event of serious side effects that are assessed to be related to COVID-19 vaccines administered in Singapore. This programme will give a greater peace of mind for those taking the vaccination.&nbsp;<br><br>12.&nbsp; &nbsp; &nbsp; The VIFAP will provide the following tiers of financial support:&nbsp;<br><br>&nbsp; &nbsp; &nbsp; &nbsp; i. A one-time pay-out of up to $10,000 will be provided to an eligible individual who is hospitalised requiring care in the High Dependency or Intensive Care Unit but subsequently recovers from medically significant serious side effects; and&nbsp;<br><br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; ii. A one-time pay-out of $225,000 will be provided to an individual who dies or suffers permanent severe disability as a result of COVID-19 vaccination.&nbsp;<br><br>13.&nbsp; &nbsp; &nbsp; Any individual who experiences serious side effects after COVID-19 vaccination can also continue to concurrently receive support through applicable healthcare schemes, such as MediShield Life and subsidies at our public healthcare institutions.&nbsp;<br><br>14.&nbsp; &nbsp; &nbsp;To qualify for the VIFAP, individuals must be a Singapore Citizen, Permanent Resident or long-term pass holder who has received the COVID-19 vaccination in Singapore<sup>1</sup>, and experienced a serious side effect that is potentially life-threatening or fatal, and has required inpatient hospitalisation or has caused persistent incapacity or disability. The serious side effects must be assessed by a doctor to be linked to the individual’s COVID-19 vaccination.&nbsp;<br><br>15.&nbsp; &nbsp;As the severity of serious side effects can be broad, and assessment by the treating doctors may vary, MOH has appointed an independent clinical panel comprising experts in relevant fields such as neurology, immunology and infectious diseases, to assess and adjudicate VIFAP applications.&nbsp;<br><br><strong>High vaccination coverage to maximise protection for the population</strong><br><br>16.&nbsp; &nbsp; &nbsp; Vaccination is critical to protect us and our loved ones against COVID-19. Vaccination also protects those in our community who cannot be vaccinated due to medical reasons. This collective protection will become more effective as more people are vaccinated and is a key enabler allowing us to return to normalcy. We strongly encourage Singaporeans and long-term residents to come forward for vaccination when their turn comes, so that as a society, we can keep each other safe from the disease.<br><br>17.&nbsp; &nbsp; &nbsp; Even as we progressively vaccinate our population, we must keep in mind that vaccination is not a silver bullet. We must continue to adhere to the safe management measures to help us mitigate the spread and keep community transmission low.&nbsp;&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>28 JANUARY 2021</strong></span></span></p><div style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 16px;\"></span><hr><span style=\"font-family: Arial; font-size: 16px;\"><br><sup>1&nbsp;</sup>Using COVID-19 vaccines which are approved under the Health Sciences Authority (HSA)’s Pandemic Special Access Route (PSAR) and/or registered under the Health Products Act.<br></span></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "update-on-covid-19-vaccination-programme", "CurrentPageUrl": null}, {"Title": "No New Cases of Locally Transmitted Covid-19 Infection ", "PublishedDate": "/Date(1611819480000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "28 Jan 2021", "Summary": "", "MainContent": "&nbsp; &nbsp; &nbsp; As of 28 January 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed that there are no new cases of locally transmitted COVID-19 infection.&nbsp;<br><br>2.&nbsp; &nbsp; There are 34 imported cases, who had already been placed on Stay-Home Notice or isolated upon arrival in Singapore.<br><br>3.&nbsp; &nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>28 JANUARY 2021</strong><br><div><br></div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "no-new-cases-of-locally-transmitted-covid-19-infection-28jan", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}