{"pressItemDictionary": {"Press Releases": [{"Title": "Calibrated Adjustments In Stabilisation Phase", "PublishedDate": "/Date(1636367400000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "08 Nov 2021", "Summary": "", "MainContent": "<p style=\"margin-left: 0cm; text-align: justify;\"><span style=\"font-family: Arial;\"><span style=\"font-size: 16px;\"><span style=\"font-family: Arial; font-size: 16px;\">&nbsp; &nbsp; &nbsp;The Multi-Ministry Taskforce announced on 20 October 2021 the extension of the Stabilisation Phase for four weeks, through to 21 November 2021, with a mid-point review. Over the past fortnight, with everyone’s cooperation and the enhancement of collective immunity of our population, the growth in new COVID-19 cases has moderated. The week-on-week ratio of community cases has decreased and is now hovering around 0.8 to 1.0. While the total number of COVID-19 cases in hospitals and the intensive care unit (ICU) remains high, numbers are also stable.&nbsp;<br><br>2. &nbsp;&nbsp;</span><span style=\"text-align: left; font-family: Arial; font-size: 16px;\">Progress in vaccination and boosters has contributed immensely to the tempering of COVID-19 cases. However, those who are not fully vaccinated continue to disproportionately make up the bulk of severe and ICU cases, and impose a strain on our healthcare system. There remains a need to protect them. Vaccination-Differentiated Safe Management Measures (VDS) will therefore remain a crucial prong of our re-opening strategy in the coming weeks.<br><br>3. &nbsp; </span><span style=\"text-align: left; font-family: Arial; font-size: 16px;\">With this backdrop, we will carefully ease some measures, while we continue to protect the most vulnerable in our society from the risk of COVID-19 infection. &nbsp;<br><br>4. &nbsp;&nbsp;</span><span style=\"text-align: left; font-family: Arial; font-size: 16px;\">First, we will allow up to five fully vaccinated persons from the same household to dine-in together at food and beverage (F&amp;B) establishments that are able to administer comprehensive VDS checks.&nbsp;<br><br>5. &nbsp;&nbsp;</span><span style=\"text-align: left; font-family: Arial; font-size: 16px;\">Second, we will pilot the resumption of more activities for those who are fully vaccinated, starting with sports and selected MICE (Meetings, Incentives, Conferences and Exhibitions) events, subject to the additional requirement of testing using Antigen Rapid Test (ART) kits, i.e.&nbsp;&nbsp;a “VDS+ART” protocol. This will allow higher-risk activities to resume safely. If successful, this protocol can be extended to other settings. &nbsp;<br><br>6. &nbsp;&nbsp;</span><span style=\"text-align: left; font-family: Arial; font-size: 16px;\">Third, we will take steps towards resuming more activities in schools, in preparation for the larger-scale safe resumption of co-curricular learning activities in the coming school year, as these are critical for the nurturing of well-rounded students. The Ministry of Education (MOE) will provide more details on this separately.<br><br>7. &nbsp;&nbsp;</span><span style=\"text-align: left; font-family: Arial; font-size: 16px;\">Finally, our experience to date with the Vaccinated Travel Lanes (VTLs) has shown that we can open up air travel in a safe way. We will further simplify travel protocols to safely and seamlessly reconnect with the rest of the world.<br><br>8. &nbsp;&nbsp;</span><span style=\"text-align: left; font-family: Arial; font-size: 16px;\">Notwithstanding these adjustments, there remains a need to stay vigilant in our approach towards COVID-19. ICU utilisation has been hovering at around 70%. While this is still manageable by stretching our healthcare manpower, we must not let down our guard and must avoid a resurgence of cases that could once again threaten to overwhelm our healthcare system.<br><br></span><strong style=\"text-align: left;\">Updates on Local COVID-19 Situation and Healthcare Capacity<br><br></strong><span style=\"text-align: left;\">9. &nbsp;&nbsp;</span><span style=\"text-align: left;\">Daily case numbers have stabilised for around three weeks now. While cases have remained at more than 3,000 a day on average, close to 99% of cases continue to have mild or no symptoms and the vast majority are able to recover well at home. The proportion of patients who require oxygen supplementation has held steady at 0.8% of our total cases, and those who require ICU care at 0.3%, in the past 28 days. The number of cases in the ICU remains high but stable at around 140 cases, who occupy 70% of our current ICU bed capacity. We have been actively expanding the capacity of COVID-19 Treatment Facilities (CTFs) and Community Isolation Facilities (CIFs) over the past few weeks to take in COVID-19 patients who do not require acute care in hospitals.&nbsp;<br><br></span><span style=\"text-align: left;\"><u>Further Expansion of the Home Recovery Programme</u><br><br>10. &nbsp; &nbsp;</span><span style=\"text-align: left;\">We will expand the Home Recovery Programme (HRP) by lowering the minimum age for default home recovery, from 5 years to 3 years old starting from 10 November 2021. All children 3 years and older will be allowed to stay at home if their household environment is suitable. They will undergo a telemedicine assessment by a community or hospital paediatrician. Infants and children from 3 months old to under 3 years of age will also be allowed to recover at home, after they have been clinically assessed at hospitals to be suitable for home recovery. All infants under 3 months of age who are infected with COVID-19 will continue to be admitted to hospital.&nbsp;<br><br></span><span style=\"text-align: left;\"><u>Good Progress in Vaccinations and Boosters</u><br><br>11. &nbsp;&nbsp;</span><span style=\"text-align: left;\">Vaccinations and boosters continue to prove pivotal in safeguarding lives and our healthcare capacity amidst high case volumes, as they provide strong protection against infection and severe illness. To date, 85% of our population have completed their full primary series regimen/ received two doses of COVID-19 vaccines, and 18% have received boosters. We have been prioritising our outreach to encourage seniors to get vaccinated, as they are most vulnerable to serious illness if infected with COVID-19. Currently, 94% of seniors in the 60 to 69 age group and 90% of seniors aged 70 years and above have completed their full primary series regimen of COVID-19 vaccination, while 82% of eligible seniors aged 60 years and above have received boosters. We are heartened by the growing number of persons coming forward for their vaccinations and boosters, and strongly encourage everyone to do so as soon as they are eligible. This will help to keep you and your loved ones safe.&nbsp;<br><br></span><span style=\"text-align: left;\"><u>Expanding Vaccination Eligibility to Protect Our Children</u><br><br>12. &nbsp;&nbsp;</span><span style=\"text-align: left;\">The Expert Committee on COVID-19 Vaccination (EC19V) has noted that the Pfizer BioNTech/ Comirnaty vaccine has been approved by the US for use in those aged 5 to 11 years. EC19V is assessing the extension of vaccination to children aged 5 to 11 years in Singapore. This will confer on them protection against infection and severe illness, and better enable the resumption of a richer educational experience for our school children in 2022.&nbsp;<br><br></span><span style=\"text-align: left;\"><u>Further Bolstering Our Healthcare Capacity&nbsp;</u><br><br>13. &nbsp;&nbsp;</span><span style=\"text-align: left;\">Given the good progress in vaccinations and boosters, our National Vaccination Programme (NVP) has shifted to focusing on booster jabs. As vaccination capacity remains robust overall, the Ministry of Health (MOH) will be closing four more Vaccination Centres (VCs) on 1 December 2021.&nbsp;</span><span style=\"text-align: left;\">The healthcare staff currently working in these VCs can then be re-deployed to bolster our manpower needs in other areas, such as the COVID-19 Treatment Facilities.&nbsp;<br><br>14. &nbsp;&nbsp;</span><span style=\"text-align: left;\">These four VCs are Kebun Baru Community Club (CC), Potong Pasir CC, Taman Jurong CC and Geylang Serai CC. The last day for Dose One walk-ins at Kebun Baru CC and Potong Pasir CC was on 6 November 2021, while the last day for Dose One walk-ins at Taman Jurong CC and Geylang Serai CC will be on 9 November 2021. All four&nbsp;</span><span style=\"text-align: left;\">will continue to accept appointments for Dose Two and booster vaccinations until 30 November 2021.&nbsp;</span></span></span></p><p style=\"text-align: justify;\"><p><span style=\"font-family: Arial; font-size: 16px;\"><span style=\"font-family: Arial;\"></span><span style=\"font-family: Arial;\"><u>COVID-19 Patients who are Unvaccinated by Choice to be Responsible for their Medical Bills</u><br><br>15. &nbsp;&nbsp;</span><span style=\"font-family: Arial;\">The Government is currently footing the full COVID-19 medical bills of all Singaporeans, Permanent Residents and Long-Term Pass Holders (SCs/PRs/LTPHs), other than for those who tested positive soon after returning from overseas travel. This was to avoid financial considerations adding to public uncertainty and concern when COVID-19 was an emergent and unfamiliar disease. For the majority who are vaccinated, this special approach for COVID-19 bills will continue until the COVID-19 situation is more stable.<br><br>16. &nbsp;&nbsp;</span><span style=\"font-family: Arial;\">Currently, unvaccinated persons make up a sizeable majority of those who require intensive inpatient care, and disproportionately contribute to the strain on our healthcare resources.<br><br>17. &nbsp;&nbsp;</span><span style=\"font-family: Arial;\">Hence, from 8 December 2021, we will begin charging COVID-19 patients who are unvaccinated by choice.[1]&nbsp;</span><span style=\"font-family: Arial;\">This will apply to all unvaccinated COVID-19 patients admitted on or after 8 December 2021 to hospitals and CTFs. COVID-19 medical bills for those who are ineligible for vaccination will still be fully paid for by the government, i.e. children under 12 years old or medically ineligible persons.<br><br>18. &nbsp;&nbsp;</span><span style=\"font-family: Arial;\">COVID-19 patients who are unvaccinated by choice may still tap on regular healthcare financing arrangements to pay for their bills where applicable – SCs and PRs may access regular Government subsidies and MediShield Life/ Integrated Shield Plan (MSHL/ IP) where applicable, while LTPHs may tap on their usual financing arrangements, such as private insurance.<br><br></span><strong>Calibrated Adjustments of Safe Management Measures (SMMs)<br><br></strong><u>Easing of Dine-In Restrictions for Households</u><br><br>19. &nbsp;&nbsp;From&nbsp;<strong style=\"font-size: 12pt;\">10 November 2021,&nbsp;</strong>up to 5 fully vaccinated persons from the same household[2]&nbsp;will be allowed to dine in together at F&amp;B establishments. Nevertheless, we urge households to continue to exercise care and restraint when dining out together, especially if there are elderly members staying in the household. The dine-in group size for those who qualify for VDS but are not from the same household will remain capped at 2.<br><br>20. &nbsp;&nbsp;For now, this easing will&nbsp;<strong style=\"font-size: 12pt;\">not be extended</strong>&nbsp;to hawker centres and coffee shops as they are unable to conduct comprehensive VDS checks of all their diners. We are prepared to extend the same concession to hawker centres and coffee shops once they have put in place additional control measures. The National Environment Agency (NEA) and Singapore Food Agency (SFA) will be engaging the hawkers’ associations and coffee shop operators respectively on this matter. Further updates will be provided when ready. &nbsp;<br><br>21. &nbsp;&nbsp;Strict enforcement actions will be taken against any individuals who breach this rule by pretending to be from the same household as well as F&amp;B outlets that do not implement the necessary checks. Errant individuals will be fined, and F&amp;B outlets will be subject to immediate closures. These penalties will apply even for first-time offenders. &nbsp;<br><br><u>Music for F&amp;B Establishments and Zone Sizes</u></span></p></p><p style=\"text-align: justify;\"><p><span style=\"font-family: Arial; font-size: 16px;\"><span style=\"font-family: Arial;\">22. &nbsp;&nbsp;</span><span style=\"font-family: Arial;\">We will also make several adjustments to existing SMMs from 10 November 2021, in order to better facilitate operations for businesses and workplaces. F&amp;B establishments will be allowed to play soft recorded music from&nbsp;</span><strong style=\"font-size: 12pt;\">10 November 2021</strong>, butlive music and entertainment remain disallowed. Other measures include an increase in zone sizes for various event categories such as congregational worship and live performances, whilst keeping within overall attendance numbers. Details can be found in&nbsp;<span style=\"font-size: 12pt;\"><a href=\"/docs/librariesprovider5/default-document-library/annex-a39a31d18bd324688a47830c7515de449.pdf?sfvrsn=b4915bd9_0\" title=\"Annex A\" style=\"text-decoration: underline;\">Annex A</a><span style=\"color: rgb(0, 0, 0);\">.</span></span></span></p></p><p style=\"text-align: justify;\"><p><span style=\"font-family: Arial; font-size: 16px;\"><u></u><u>Expanding VDS to More Settings, and “VDS+ART” pilots&nbsp;</u><br><br>23. &nbsp;&nbsp;To better protect the unvaccinated who are at higher risk of infection and severe illness, we intend to expand VDS to more settings over time. As a start, MOH will also introduce VDS for residential care homes, given that this is a vulnerable setting where unvaccinated residents are likely to suffer worse outcomes than their vaccinated counterparts if they contract COVID-19. Measures will apply to areas like visitations and activities for residents. MOH will share more details when ready.<br><br>24. &nbsp;&nbsp;In addition, we will explore further easing of SMMs for settings which are able to enforce both VDS and pre-activity testing (“VDS+ART”). Under this regime, all participants will need to be fully vaccinated and will be required to produce a valid negative ART result on-site prior to the activity. We will begin with pilots in sports settings, to allow the resumption of team sports for a group of up to 10 fully vaccinated persons (including players, umpires, linesmen, etc.) to play together in controlled and supervised settings at suitable ActiveSG sports centres and PA community clubs from 10 November 2021. Please refer to SportSG’s advisory for more details.&nbsp;<br><br>25. &nbsp;&nbsp;We will also pilot the use of “VDS+ART” at selected mass sporting events as well as selected MICE events, where we will allow some easing of the SMMs.&nbsp;&nbsp;If successful, we can expand such pilots to additional settings. &nbsp;<br><br><u>VDS Concession for Medically Ineligible Individuals&nbsp;</u><br><br>26. &nbsp;&nbsp;We are taking a stronger stance against those who choose not to be vaccinated, be it through the VDS, or by requiring them to pay for their medical bills. But we recognise that there are a few individuals who&nbsp;are medically ineligible for all COVID-19 vaccines under the National Vaccination Programme (NVP). As earlier announced by the MTF, these individuals will be exempted from the VDS.&nbsp;<br><br>27. &nbsp;&nbsp;This VDS concession for medically ineligible individuals will take effect from 1 December 2021. From 15 November 2021, such individuals can visit any General Practitioner (GP) clinic, or public or private healthcare institution to be certified as medically ineligible, subject to meeting the revised criteria articulated in&nbsp;<u style=\"font-size: 12pt;\"><a href=\"/docs/librariesprovider5/default-document-library/annex-bb44528cbc27b4ceb9571fb222a0c5777.pdf?sfvrsn=8d3e6457_0\" title=\"Annex B\">Annex B</a></u>. They will be issued with a standard paper memo, which should be presented along with a government-issued photo identification card to be exempted from VDS. Please refer to&nbsp;<u style=\"font-size: 12pt;\"><a href=\"/docs/librariesprovider5/default-document-library/annex-c9a9cea75ff0a4a1bb60301f0acc9aa68.pdf?sfvrsn=6496a006_0\" title=\"Annex C\">Annex C</a></u>&nbsp;for a list of settings with VDS.<br><br>28. &nbsp;&nbsp;MOH is also working with GovTech to reflect the medical ineligibility status in individuals’ TraceTogether App, so that they are able to pass through TraceTogether/ Safe Entry check-in systems at VDS venues without needing to show the paper memo. MOH will separately update healthcare establishments on the certification process. &nbsp;<br><br>29. &nbsp;&nbsp;<strong>While we have extended a concession to those who are medically ineligible to be able to dine-in, enter malls and participate in activities where VDS is required,&nbsp;<u>they remain unvaccinated and their risk of becoming infected with COVID-19 and/or becoming severely ill remains real and very high</u>. We strongly encourage these individuals to minimise such activities and to use this concession judiciously.<br><br></strong><strong>Ongoing Updates to Border Measures&nbsp;</strong></span></p></p><p style=\"text-align: justify;\"><p><span style=\"font-family: Arial; font-size: 16px;\"></span><span style=\"font-family: Arial; font-size: 16px;\"><u>Review of Countries/ Regions Categories</u><br><br>30. &nbsp;&nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">As part of our regular review of the COVID-19 situation in countries/ regions, we have updated the list of countries/ regions in the various categories. Details&nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">are in&nbsp;<u><a href=\"/docs/librariesprovider5/default-document-library/annex-d3a5da93206f544a296cbecc3a285dbe0.pdf?sfvrsn=d0a8ed70_0\" title=\"Annex D\">Annex D</a></u>. These will be effective for arrivals from&nbsp;<strong>11 November 2021, 2359 hours</strong>.&nbsp;</span></p></p><p style=\"text-align: justify;\"><p><span style=\"font-family: Arial; font-size: 16px;\"><span style=\"font-family: Arial;\"></span><span style=\"font-family: Arial;\"><u>Changes in Border Measures for Cat II/III Countries</u><br><br>31. &nbsp; </span><span style=\"font-family: Arial;\">We will be expanding the types of tests recognised as a valid Pre-Departure Test (PDT) for all travellers arriving in, or transiting through, Singapore from Category II/III countries/ regions (including travellers arriving via VTL). This is in alignment with the testing protocols we now have in place in Singapore. From&nbsp;</span><strong style=\"font-size: 12pt;\">11 November 2021, 2359 hours</strong>, we will also accept a negative, professionally administered[3]&nbsp;ART result taken within 2 days[4]&nbsp;prior to departure as a valid PDT for travellers from these countries/ regions.</span></p></p><p style=\"text-align: justify;\"><p><span style=\"font-family: Arial; font-size: 16px;\"><span style=\"font-family: Arial;\"></span><u>Extending Vaccinated Travel Lanes</u></span></p><p><span style=\"font-family: Arial; font-size: 16px;\"><span style=\"font-family: Arial;\">32. &nbsp;&nbsp;</span><span style=\"font-family: Arial;\">We have launched VTLs with Australia, Brunei, Canada, Denmark, France, Germany, Italy, the Netherlands, Spain, Switzerland, United Kingdom and the United States, and will be launching a joint VTL with the Republic of Korea (ROK) from 15 November 2021. Travellers under the VTLs need not be subject to Stay-Home Notice (SHN). Instead, they will be required to produce a negative PDT taken within two days prior to departure and undergo an on-arrival Polymerase Chain Reaction (PCR) test. &nbsp;<br><br>33. &nbsp;&nbsp;</span><span style=\"font-family: Arial;\">We will launch a joint VTL with&nbsp;<strong>Malaysia</strong>&nbsp;for travel between Changi Airport and Kuala Lumpur International Airport (KLIA)&nbsp;<strong>from 29 November 2021</strong>. Vaccinated Travel Pass&nbsp;</span><span style=\"font-family: Arial;\">applications for&nbsp;</span><span style=\"font-family: Arial;\">Short-Term Visitors and Long-Term Pass Holders&nbsp;</span><span style=\"font-family: Arial;\">will commence on</span><strong>&nbsp;22 November 2021</strong>; returning Singapore Citizens and Permanent Residents who are fully vaccinated will not need to apply. Singapore and Malaysia are also in detailed discussion to launch a similar scheme for travel across the land links.&nbsp;<br><br>34. &nbsp;&nbsp;We will also extend the VTLs to&nbsp;<strong>Finland</strong>&nbsp;and&nbsp;<strong>Sweden</strong>&nbsp;from&nbsp;<strong>29 November 2021</strong>, with applications for Short-Term Visitors and Long-Term Pass Holders commencing on&nbsp;<strong>22 November 2021</strong>.&nbsp;<br><br>35. &nbsp;&nbsp;The Civil Aviation Authority of Singapore will provide more details nearer the date when applications are open.<br><br><strong>Towards a COVID-19 Resilient Singapore</strong></span></p></p><p><p style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 16px;\"><span style=\"font-family: Arial;\">36. &nbsp;&nbsp;</span><span style=\"font-family: Arial;\">We thank everyone for your understanding and patience during the Stabilisation Phase. We will continue to adjust our measures progressively to prepare for a safe re-opening without compromising the well-being of the vulnerable members of our community. We seek everyone’s continued effort and cooperation to exercise social responsibility and comply with all the SMMs and VDS measures we have put in place. If you are eligible for vaccinations or boosters, do come forward to receive them. Test yourself regularly and follow the simplified health protocols if you test positive. This will ensure that our limited healthcare resources are effectively allocated to those in need, and pave the way to being a COVID-19 resilient nation.&nbsp;<br><br></span><strong style=\"text-align: justify;\">MINISTRY OF HEALTH&nbsp;<br></strong></span><strong style=\"text-align: justify;\"><span style=\"font-size: 12pt; font-family: Arial;\">8 NOVEMBER 2021</span></strong></p></p><div><br clear=\"all\"><hr align=\"left\" size=\"1\" width=\"33%\"><div id=\"ftn1\"><p style=\"text-align: justify;\"><span style=\"font-family: Arial, sans-serif;\"><font size=\"2\">[1]&nbsp;</font>We will not charge individuals who are partially vaccinated until 31 December 2021, to allow them time to be fully vaccinated.&nbsp;&nbsp;From 1 January 2022, only SC/PR/LTPH COVID-19 patients who are fully vaccinated and have not recently travelled will have their COVID-19 medical bills fully paid for by the Government.<br><br>[2]&nbsp;</span><span style=\"font-family: Arial, sans-serif; text-align: left;\">Including unvaccinated children 12 years old and below, in line with their eligibility for VDS.</span></p></div><div id=\"ftn3\"><p style=\"text-align: justify;\"><span style=\"font-family: Arial, sans-serif;\"><font size=\"2\">[3]&nbsp;</font>ART has to be performed by trained professionals (e.g. medical professionals, Government-recognised trained professionals, etc.)</span></p></div><div id=\"ftn4\"><p style=\"text-align: justify;\"><span style=\"font-family: Arial, sans-serif;\"><font size=\"2\">[4]&nbsp;</font>For example, if the PDT is taken on 1 November 2021, it will be valid for departures (for air/ sea checkpoints) or arrivals (for land checkpoint) up to 3 November 2021, 2359 hours.</span></p></div></div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "calibrated-adjustments-in-stabilisation-phase_8Nov2021", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}