{"pressItemDictionary": {"Press Releases": [{"Title": "9 New Cases of Locally Transmitted Covid-19 Infection ", "PublishedDate": "/Date(1619856720000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "01 May 2021", "Summary": "<p><br><p>&nbsp;</p></p><p>&nbsp;</p>", "MainContent": "<p><span style=\"font-size: 16px;\">As of 1 May 2021, 12pm,&nbsp;the Ministry of Health (MOH) has preliminarily confirmed 9 new&nbsp;cases of locally transmitted COVID-19 infection.&nbsp;Based on our investigations so far, 7 are&nbsp;in the community, and 2 reside in a dormitory.&nbsp;Of these, 3&nbsp;cases are linked to Case 62541 [1], and were detected from our proactive testing of patients and staff at Tan Tock Seng Hospital.<br><br>2. &nbsp; &nbsp; In addition, there are 25 imported cases, who had already been placed on Stay-Home Notice or isolated upon arrival in Singapore. Amongst them, 9 are Singaporeans or Singapore Permanent Residents and 4 are foreign domestic workers.<br><br>3. &nbsp; &nbsp; In total, there are 34 new cases of COVID-19 infection in Singapore today.<br><br>4. &nbsp; &nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;</span></p><p><strong>MINISTRY OF HEALTH<br></strong><strong>1 MAY 2021</strong></p><div><br clear=\"all\"><div id=\"ftn1\"><p>[1] Case 62541 is a 46 year-old female Philippines national who is a nurse at Tan Tock Seng Hospital (TTSH), and is deployed at Ward 9D. She was confirmed to have COVID-19 infection on 27 April. There are 16 cases in total linked to TTSH so far.&nbsp;</p></div></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "9-new-cases-of-locally-transmitted-covid-19-infection_1May2021", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}