{"pressItemDictionary": {"Press Releases": [{"Title": "Opening Remarks by Parliamentary Secretary for Ministry of Health and Ministry of Communications and Information Ms Rahayu Mahzam At the 30th Anniversary Celebrations of the Breastfeeding Mothers’ Support Group (singapore) On 18 December 2021", "PublishedDate": "/Date(1639800000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "18 Dec 2021", "Summary": "", "MainContent": "<p style=\"font-size: medium;\"><span style=\"font-family: Arial;\">Ms Khatim Hamidon, BMSG President,&nbsp;</span></p><p style=\"font-size: medium;\"><span style=\"font-family: Arial;\"></span><span style=\"font-family: Arial;\">BMSG Executive Committee Members, &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;<br><br></span><span style=\"font-family: Arial;\">Mothers, Breastfeeding Advocates, Breastfeeding community</span></p><p style=\"font-size: medium; text-align: justify;\"><span style=\"font-family: Arial;\"><strong>&nbsp; &nbsp;&nbsp;</strong></span><span style=\"font-family: Arial;\">Good morning. I am very pleased to join all of you today to celebrate the 30</span><sup style=\"font-family: Arial;\">th</sup><span style=\"font-family: Arial;\">&nbsp;anniversary of the Breastfeeding Mothers’ Support Group (BMSG) Singapore.</span></p><p style=\"font-size: medium; text-align: justify;\"><span style=\"font-family: Arial;\"></span><strong style=\"font-family: Arial;\">Breastfeeding Efforts in Singapore<br><br></strong><span style=\"font-family: Arial;\">2. &nbsp;</span><span style=\"font-family: Arial; text-align: left;\">Breastfeeding is important to keep our babies healthy. It provides the essential energy and nutrients needed for optimal growth and development, as well as protection against infectious and chronic diseases. Especially relevant to current times,&nbsp;&nbsp;the breastmilk of mothers vaccinated against COVID-19 can help protect their babies from COVID-19 due to antibodies against the virus it contains. Pregnant or breastfeeding mothers are therefore recommended to be vaccinated if not already so. In addition, mother's milk is more easily digested than formula milk.&nbsp;<br><br>3. &nbsp;</span><span style=\"font-family: Arial; font-size: 16px; text-align: left;\">The World Health Organization (WHO) and the Health Promotion Board recommend all babies to be exclusively breastfed for the first six months and for up to two years or longer as long as both mother and baby are comfortable. Babies can continue with breast milk and be weaned at four to six months to a balanced diet. Breastfeeding boosts the mother-child relationship, prevents uterine bleeding after birth and helps the uterus return to its normal size. It also lowers the risk of diabetes, breast and ovarian cancers.<br><br>4. &nbsp;</span><span style=\"font-family: Arial; font-size: 16px; text-align: left;\">There are many upsides of breastfeeding. However, we also recognise that breastfeeding may sometimes be challenging and an emotional journey for mothers. It is important to provide support for mothers in the form of education, putting in place an enabling environment, and letting mothers know that they are not alone in this journey. In this aspect, I am encouraged by the strong commitment of BMSG and its key stakeholders in supporting breastfeeding.<br><br>5. &nbsp;</span><span style=\"font-family: Arial; font-size: 16px; text-align: left;\">A key stakeholder in perinatal nutrition and infant health is our hospitals. In 2017, the Ministry of Health called for all maternity hospitals, including private hospitals, to&nbsp;come on-board the Baby-Friendly Hospital Initiative (BFHI). This initiative was launched by the WHO and UNICEF to provide a conducive environment for successful breastfeeding and optimal nutrition for babies from birth. I am pleased that&nbsp;&nbsp;all public and five private maternity hospitals in Singapore are now BFHI-certified. The remaining two&nbsp;&nbsp;private maternity hospitals are committed to being accredited.&nbsp;<br><br>6. &nbsp;</span><span style=\"font-family: Arial; font-size: 16px; text-align: left;\">Beyond this,&nbsp;&nbsp;BMSG also provides&nbsp;antenatal and postnatal breastfeeding education, as well as counselling across both physical and virtual platforms&nbsp;through a team of 40 trained counsellors. BMSG’s efforts will help to complement the Government’s work to raise awareness of breastfeeding, and provide appropriate emotional support and resources to breastfeeding mothers, as well as&nbsp;training for healthcare workers and caregivers.<br><br></span><strong style=\"text-align: left; font-family: Arial; font-size: 16px;\">Looking beyond COVID-19<br><br></strong><span style=\"text-align: left; font-family: Arial; font-size: 16px;\">7. &nbsp;</span><span style=\"font-family: Arial; font-size: 16px; text-align: left;\">Being a mother is no easy feat, especially amidst uncertain times like this. Even as we transit towards a COVID-19 resilient nation, challenges to our health, healthcare system and economy will remain. We can expect that the psychosocial impact of the pandemic will continue to be felt for some years to come, with knock-on effects on our mental health and wellbeing. I urge all to remain resilient and come together to support one another.<br><br>8. &nbsp;</span><span style=\"text-align: left; font-size: 16px; font-family: Arial;\">Thank you, and once again, happy 30</span><sup style=\"text-align: left; font-family: Arial;\">th</sup><span style=\"text-align: left; font-size: 16px; font-family: Arial;\">&nbsp;anniversary to BMSG! &nbsp;</span></p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "opening-remarks-by-parliamentary-secretary-for-ministry-of-health-and-ministry-of-communications-and-information-ms-rahayu-mahzam-at-the-30th-anniversary-celebrations-of-the-breastfeeding-mothers-support-group-(singapore)-on-18-december-2021", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}