{"pressItemDictionary": {"Press Releases": [{"Title": "Strengthening Our Precautionary Measures Against the Omicron Variant", "PublishedDate": "/Date(1638534120000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "03 Dec 2021", "Summary": "", "MainContent": "Since the emergence of the Omicron variant of concern, the Multi-Ministry Taskforce (MTF) has announced travel restrictions for affected countries/regions1 and enhanced our testing regime for travellers, including air travellers arriving via the Vaccinated Travel Lane (VTL).&nbsp;<br><br>2. Since then, a growing number of countries/regions have reported Omicron cases. Singapore is no exception. We have preliminarily detected two imported COVID-19 cases with the Omicron variant. They are both fully vaccinated, experiencing mild symptoms, and currently recovering at the National Centre for Infectious Diseases (NCID). The National Public Health Laboratory is conducting whole genome sequencing to confirm the Omicron variant. All other passengers who came into Singapore on the same flight have tested negative for COVID-19 on arrival and are quarantined under SHN at designated facilities. They will undergo PCR tests at the end of their SHN.&nbsp;<br><br>3. We expect to see more Omicron cases being reported globally in the weeks to come. We are coordinating with health authorities globally to study and understand the Omicron variant. While we do so, we will further augment our testing regime for travellers. Should the Omicron variant be more transmissible than Delta and become the globally dominant variant over time, it is a matter of time before it establishes itself in Singapore. But the additional measures will help to buy time to learn more about dealing with Omicron, and to continue with our booster programme to strengthen our collective resilience for better protection against this new variant.&nbsp;&nbsp;<br><br><strong>Update on Assessment of Omicron Variant&nbsp;</strong><br><br>4. As of 2 December 2021, the Omicron variant has been detected in at least 28 other countries, mainly from persons with recent travel history to southern Africa. There is currently no evidence to suggest that symptoms associated with the Omicron variant are different or more severe than those of other variants, or that current vaccines and therapeutics would be ineffective against Omicron. More data and further studies are needed to verify this.<br><br>5. We have also been closely monitoring studies on the sensitivity of Antigen Rapid Tests (ARTs) to the Omicron variant. Preliminary validation by the manufacturers show that ARTs remain effective in detecting COVID-19 cases of the Omicron variant, and laboratories are doing further biochemical tests to confirm these results. These initial results lend confidence that ARTs remain effective as a method of detecting COVID-19, including Omicron cases.&nbsp;<br><br><strong>Updates to Border Measures&nbsp;</strong><br><br><span style=\"text-decoration: underline;\">Review of Country/Region Classifications</span><br><br>6. Due to the situation in <strong>Bulgaria, Hungary, Iceland, Ireland, Luxembourg, Norway and Poland</strong>, these countries will be placed in Category III from <strong>6 December 2021, 2359 hours</strong>.<br><br><span style=\"text-decoration: underline;\">Expansion of Travel Restrictions to Additional Affected Countries/Regions&nbsp;</span><br><br>7. To further step up our precautionary stance amidst growing transmissions of Omicron globally, we will extend travel restrictions to more countries which have seen a spike in Omicron cases. From <strong>4 December 2021, 2359 hours</strong>, all long-term pass holders and short-term visitors with recent travel history to <strong>Ghana, Malawi and Nigeria</strong> within the last 14 days will not be allowed to enter Singapore, or transfer/ transit through Singapore. This restriction will apply to those who have obtained prior approval for entry into Singapore. We will apply these restrictions for four weeks in the first instance, after which we will review and extend them if necessary.<br><br><span style=\"text-decoration: underline;\">Self-Administered ART for Travellers on Vaccinated Travel Lanes</span><br><br>8. Currently, all VTL travellers entering Singapore by air are to take an On-Arrival PCR test, followed by supervised ART tests on Days 3 and 7. We will augment this testing regime with effect from <strong>6 December 2021, 2359 hours</strong>.&nbsp;<br><br>9. The enhanced ART protocol draws reference from the prevailing Health Protocol 3 which is in place for all who are identified as close contacts of an infected person.&nbsp; Essentially, besides the Pre-Departure and On-Arrival Tests, all travellers on VTL will be put on a daily testing regime over 7 days using ART. The tests are all self-administered, and travellers will be required to submit the results of their self-administered ART online using a link which will be sent to them via their declared contact details after arrival in Singapore. However, on Days 3 and 7, the tests will have to be done under supervision at a Combined Test Centre (CTC) or Quick Test Centre (QTC).<sup>2</sup> Day 3 is the median incubation period, and Day 7 is the day of exit from this testing protocol. During this 7-day period, other than on days when they go out for their supervised tests, these travellers must test negative on their self-administered ART before going out for activities on that day.<br><br>10. The above 7-day enhanced ART protocols will also apply to travellers arriving from Malaysia via VTL-Land from <strong>6 December 2021, 2359 hours</strong>. The additional measures will further enhance the current testing protocols for VTL-Land, which include a Pre-Departure Test and an On-Arrival ART.&nbsp;<br><br>11. The testing regime for all VTL travellers from <strong>6 December 2021, 2359 hours<sup>3</sup></strong>&nbsp;is summarised in <span style=\"text-decoration: underline;\">Table 1</span> below. This enhanced testing regime will remain in place for four weeks in the first instance, i.e. until 2 January 2022, 2359 hours.<br><br><span style=\"text-decoration: underline;\">Table 1: Testing regime for VTL travellers (dates illustrative based on arrival on 7 December 2021)</span><br><div><br></div><table border=\"1\" cellspacing=\"0\" cellpadding=\"0\"> <tbody><tr> <td width=\"212\" valign=\"top\"> <p><strong>Day</strong></p> </td> <td width=\"227\" valign=\"top\"> <p><strong>Date</strong></p> </td> <td width=\"463\" valign=\"top\"> <p><strong>Test</strong></p> </td> </tr> <tr> <td width=\"212\" valign=\"top\"> <p>Within 2 days before departure </p> </td> <td width=\"227\" valign=\"top\"> <p>On or after 5 December 2021</p> </td> <td width=\"463\" valign=\"top\"> <p>Pre-Departure PCR test or ART</p> </td> </tr> <tr> <td width=\"212\" valign=\"top\"> <p>1 (arrival)</p> </td> <td width=\"227\" valign=\"top\"> <p>7 December 2021</p> </td> <td width=\"463\" valign=\"top\"> <p>On-Arrival PCR test (for VTL-Air) or ART (for VTL-Land)</p> </td> </tr> <tr> <td width=\"212\" valign=\"top\"> <p>2</p> </td> <td width=\"227\" valign=\"top\"> <p>8 December 2021</p> </td> <td width=\"463\" valign=\"top\"> <p>Unsupervised self-administered ART*</p> </td> </tr> <tr> <td width=\"212\" valign=\"top\"> <p>3</p> </td> <td width=\"227\" valign=\"top\"> <p>9 December 2021</p> </td> <td width=\"463\" valign=\"top\"> <p>Supervised self-administered ART at QTC/CTC^</p> </td> </tr> <tr> <td width=\"212\" valign=\"top\"> <p>4</p> </td> <td width=\"227\" valign=\"top\"> <p>10 December 2021</p> </td> <td width=\"463\" valign=\"top\"> <p>Unsupervised self-administered ART*</p> </td> </tr> <tr> <td width=\"212\" valign=\"top\"> <p>5</p> </td> <td width=\"227\" valign=\"top\"> <p>11 December 2021</p> </td> <td width=\"463\" valign=\"top\"> <p>Unsupervised self-administered ART*</p> </td> </tr> <tr> <td width=\"212\" valign=\"top\"> <p>6</p> </td> <td width=\"227\" valign=\"top\"> <p>12 December 2021</p> </td> <td width=\"463\" valign=\"top\"> <p>Unsupervised self-administered ART*</p> </td> </tr> <tr> <td width=\"212\" valign=\"top\"> <p>7</p> </td> <td width=\"227\" valign=\"top\"> <p>13 December 2021</p> </td> <td width=\"463\" valign=\"top\"> <p>Supervised self-administered ART at QTC/CTC^</p> </td> </tr> </tbody></table><br>*Results to be submitted online.<br><br><span style=\"text-decoration: underline;\">Regular Review of Border Measures</span><br><br>12. The full set of Safe Travel Lanes for travel to Singapore and prevailing border measures under each lane for different categories will be updated on the <a href=\"https://safetravel.ica.gov.sg/\" title=\"\" class=\"\" target=\"\">SafeTravel website</a>. Not all lanes may utilise the Category I/II/III/IV health measure framework. Travellers are advised to visit the website to check the latest border measures for the associated country or region before entering Singapore, and be prepared to be subjected to the prevailing border measures upon entry into Singapore.<br><br>13. All travellers are reminded to accurately declare their travel history. Strict enforcement actions will be taken against false declarations.<br><br><strong>Being Prepared to Respond Nimbly to Omicron</strong><br><br>14. Our tightened border measures will help to limit importation and onward transmission of Omicron cases as we continue to study the variant’s characteristics. However, given its high transmissibility and spread to many parts of the world, we should expect to find more cases at our borders and, in time to come, also within our community. We will press on with our booster programme to best prepare our community for any eventuality. We will monitor and evaluate data on the Omicron variant as it emerges and need to remain nimble in our responses. We seek Singaporeans’ understanding and support in the coming weeks as we will need to introduce or change our measures at short notice, in response to the fluid situation.&nbsp;<br><div><br><a href=\"/docs/librariesprovider5/default-document-library/mtf-press-release-3-dec-2021---annex-a.pdf?sfvrsn=31a81957_0\" title=\"Annex A\">Annex A</a><br><br>[1]&nbsp;Botswana, Eswatini, Lesotho, Mozambique, Namibia, South Africa, and Zimbabwe. Please refer to the <a href=\"https://www.moh.gov.sg/news-highlights/details/updates-on-border-measures-for-travellers-from-botswana-eswatini-lesotho-mozambique-namibia-south-africa-and-zimbabwe\" title=\"\" class=\"\" target=\"\">Press Release</a>&nbsp;on 26 November 2021.<br><br>[2]&nbsp;VTL travellers will be provided with a link via their contact details submitted in the Singapore Arrival Card and electronic Health Declaration Card (SGAC/eHDC) to book their supervised tests on Days 3 and 7. Bookings will be on a first-come-first-served basis.<br><br>[3]&nbsp;Travellers who have entered Singapore between 3 December 2021 and 6 December 2021 (inclusive) are not required to undergo the self-administered ARTs on Days 2, 4, 5 and 6 of their arrival, but will continue to be required to take the supervised self-administered ARTs at QTCs or CTCs on Days 3 and 7 of their arrival.<br></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "strengthening-our-precautionary-measures-against-the-omicron-variant", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}