{"pressItemDictionary": {"Press Releases": [{"Title": "92 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1628072340000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "04 Aug 2021", "Summary": "<br>", "MainContent": "&nbsp; &nbsp; &nbsp; As of 4 August 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 92 new cases of locally transmitted COVID-19 infection. 54 are linked to previous cases, and have already been placed on quarantine. 8 are linked to previous cases and were detected through surveillance. 30 are currently unlinked. Amongst the cases is 1 senior above 70 years who is unvaccinated, and is at risk of serious illness.<br><br>2.&nbsp; &nbsp; In addition, there are 3 imported cases, who have already been placed on Stay-Home Notice (SHN) or isolated upon arrival in Singapore. 1 was detected upon arrival in Singapore, while 2 developed the illness during SHN or isolation.<br><br>3.&nbsp; &nbsp; In total, there are 95 new cases of COVID-19 infection in Singapore today.<br><br>4.&nbsp; &nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.<br><br><br><strong>MINISTRY OF HEALTH<br>4 AUGUST 2021</strong>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "92-new-cases-of-locally-transmitted-covid-19-infection-4-aug-2021", "CurrentPageUrl": null}, {"Title": "Interim Tightened Visitor Management Measures and Opportunistic Patient Covid-19 Vaccination At All Hospitals", "PublishedDate": "/Date(1628058600000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "04 Aug 2021", "Summary": "", "MainContent": "The Ministry of Health (MOH) has detected more COVID-19 community cases recently, including staff and patients of hospitals. Any detection of cases within a hospital will invariably lead to a ward closure, limiting movements of patients and staff in and out of the affected ward. Affected patients and staff will also be placed on quarantine. Such measures while necessary to control further transmission of the virus, will have an adverse impact on hospitals’ capacity in caring for patients by reducing the availability of hospital staff and bed capacities.<br><br>2. As an interim measure to reduce the potential transmission in the hospitals,<strong> all visitation to hospital wards will be stopped from 5 August to 18 August 2021 (both dates inclusive)</strong>, except for the patient groups below, who will be allowed visitation on a conditional and case-by-case basis, as assessed by the hospital:<br><br>a. Patients whose conditions have turned very ill;<br>b. Paediatric patients;<br>c. Birthing/post-partum mothers; and<br>d. Patients requiring additional care support from caregivers. Examples include assistance of inpatients who have mental incapacities and family members who are undergoing caregiver training to better care for their loved ones after hospital discharge.<br><br>3. For the above groups of patients, only one visitor is allowed per day with visit duration of no more than 30 minutes (at the bedside). For patients who are very ill, up to five pre-designated visitors may be registered, with a maximum of two visitors at the patient’s bedside at any one time of no more than 30 minutes visit duration. Any visitor who requires to stay beyond 30 minutes visit duration such as caregiver training, will only be allowed after the visitor test negative on a supervised antigen rapid test (the validity of the result of this test is 24 hours).<br><br>4. All visitors to the hospitals must don face masks with good filtration capability at all times. These include reusable masks that are made of two layers of fabrics, and surgical masks. There must be no eating or drinking in the inpatient wards. Visitors must not use the patients’ toilets in the wards and must avoid sitting on patients’ beds.<br><br>5. Relatedly, in our effort to get more people vaccinated, all patients (inpatient and outpatient) who are unvaccinated will be approached by the hospital healthcare team on COVID-19 vaccination if clinically appropriate. Patients who receive their first dose of COVID-19 vaccination at the hospital should return to the same hospital for their second dose. Vaccinated patients will protect other patients in the hospital and reduce the risk of COVID-19 clusters in the hospitals.<br><br>6. MOH will review the above measures regularly and we seek the understanding and cooperation of all Singaporeans as we make adjustments to protect our patients and hospitals during this transition period towards a COVID-resilient society.", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "interim-tightened-visitor-management-measures-and-opportunistic-patient-covid-19-vaccination-at-all-hospitals", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}