{"pressItemDictionary": {"Press Releases": [{"Title": "Remaining Vigilant Against the Omicron Variant", "PublishedDate": "/Date(1640142000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "22 Dec 2021", "Summary": "", "MainContent": "&nbsp; &nbsp; &nbsp; &nbsp; In response to the emergence of the Omicron variant globally, the Multi-Ministry Taskforce (MTF) had introduced travel restrictions for affected countries/regions and enhanced our testing regime for travellers, including those arriving via the Vaccinated Travel Lanes (VTLs).&nbsp;<br><br>2.&nbsp; &nbsp; &nbsp;We are picking up more Omicron cases because of the rapid spread of the variant across many countries/regions. Thus far, our enhanced testing regime for travellers has helped us to detect 65 confirmed Omicron cases. With aggressive contact tracing and ringfencing measures, we have, for now, been able to limit onward community transmission. But it is a matter of time before the Omicron variant spreads in our community.<br><br>3.&nbsp; &nbsp; &nbsp;Our border measures will help to buy us time to study and understand the Omicron variant, and to strengthen our defences, including enhancing our healthcare capacity, and getting more people vaccinated and boosted.&nbsp;&nbsp;<br><br>4.&nbsp; &nbsp; &nbsp;Meanwhile, we need everyone to remain vigilant to reduce the risks of widespread community transmission, and to keep yourself, your loved ones and the community safe.&nbsp; In particular, travellers must adhere closely to the travel health control measures.&nbsp;<br><br><strong>Stricter enforcement for Travellers on Vaccinated Travel Lanes<br></strong><br>5.&nbsp; &nbsp; &nbsp;We remind all VTL travellers<sup>1</sup> that they must strictly adhere to the enhanced testing regime upon arrival in Singapore. VTL travellers are required to undergo an on-arrival test<sup>2</sup>&nbsp; and test themselves daily using self-administered antigen rapid tests (ARTs). On Days 2, 4, 5 and 6, travellers are required to submit the results of their self-administered ART online using a link which will be sent to them via their declared contact details after arrival in Singapore. On Days 3 and 7, the tests must be done under supervision at a Combined Test Centre (CTC) or Quick Test Centre (QTC).<sup>3</sup> Please refer to the Annex for an illustration of the testing regime.<br><br>6.&nbsp; &nbsp; &nbsp;<strong>Travellers must test negative on their self-administered ART before going out for activities on that day</strong>, except on Days 3 and 7 whereby travellers are to undergo their supervised test at a CTC or QTC before going about any other activities on that day. Travellers must take their ARTs and submit their self-administered ART results as necessary in a timely manner. Travellers who do not undergo the required tests and/or submit their results will be issued a Stay-Order/Stay-Home Notice (SHN), and will also face enforcement actions under the Infectious Diseases Act.<br><br>7.&nbsp; &nbsp; &nbsp;In view of the rise in Omicron cases globally, travellers should exercise personal responsibility, minimise their social interactions, and refrain from high-risk mask off activities (such as dining at F&amp;B establishments, exercising in gyms or attending fitness classes), as well as avoid large gatherings and crowded places for 7 days from arrival, even if they have a negative daily ART result. Travellers who are unwell, including those showing early/mild symptoms should be socially responsible and seek medical attention immediately.<br><br><strong>Freezing of new VTL bookings<br></strong><br>8.&nbsp; &nbsp; &nbsp;To limit our exposure to imported Omicron cases, we will impose limits on the number of VTL arrivals for the time being. We will f<strong>reeze all new ticket sales for VTL flights and buses for travel into Singapore from 23 December 2021 to 20 January 2022, both dates inclusive.&nbsp;</strong>All travellers who already hold a ticket on a VTL flight or bus and meet all the other VTL requirements can continue to travel under the VTL. We will also temporarily reduce the VTL quotas and ticket sales for travel after 20 January 2022.&nbsp; We will continue to monitor developments closely and update this policy as the situation changes.&nbsp;&nbsp;<br><br>9.&nbsp; &nbsp; &nbsp;The Civil Aviation Authority of Singapore (CAAS) will provide further details for the VTL-Air, and the Ministry of Trade &amp; Industry (MTI) for the VTL-Land.&nbsp;<br><br><strong>Remaining vigilant against the Omicron variant<br></strong><br>10.&nbsp; &nbsp; &nbsp;We seek everyone’s continued effort and cooperation to exercise social responsibility and comply with all the measures that have been put in place. Test yourself regularly and follow the health protocols. Only by doing so can we strengthen our collective resilience against the evolving COVID-19 situation.<br><br><br><strong>MINISTRY OF HEALTH<br>22 DECEMBER 2021<br><br></strong><br><div><sup>1 </sup>As announced on 4 December 2021, all Construction, Marine Shipyard and Process (CMP) S Pass and work permit holders, as well as other dormitory-bound work pass holders, will not be allowed to enter Singapore via VTLs.<br><sup>2 </sup>VTL air travellers will undergo a Polymerase Chain Reaction (PCR) test and VTL Land travellers will undergo an ART.<br><sup>3</sup> VTL travellers will be provided with a link via their contact details submitted in the Singapore Arrival Card and electronic Health Declaration Card (SGAC/eHDC) to book their supervised tests on Days 3 and 7. Bookings will be on a first-come-first-served basis.&nbsp;<br><div><br><br><strong>ANNEX</strong><br><br>The table below summarises the testing regime for all VTL travellers&nbsp;<br><br><strong>Testing regime for VTL travellers last updated 6 December 2021, 2359 hours&nbsp;<br>(Dates are illustrative based on arrival on 21 December 2021)</strong><br><br><table border=\"1\" cellspacing=\"0\" cellpadding=\"0\"><tbody><tr><td width=\"141\" valign=\"top\"><p><strong>Day</strong></p></td><td width=\"151\" valign=\"top\"><p><strong>Date</strong></p></td><td width=\"308\" valign=\"top\"><p><strong>Test</strong></p></td></tr><tr><td width=\"141\" valign=\"top\"><p>Within 2 days before departure</p></td><td width=\"151\" valign=\"top\"><p>On or after 19 December 2021</p></td><td width=\"308\" valign=\"top\"><p>Pre-Departure PCR test or ART</p></td></tr><tr><td width=\"141\" valign=\"top\"><p>1 (arrival)</p></td><td width=\"151\" valign=\"top\"><p>21 December 2021</p></td><td width=\"308\" valign=\"top\"><p>On-Arrival PCR test (for VTL-Air) or ART (for VTL-Land)</p></td></tr><tr><td width=\"141\" valign=\"top\"><p>2</p></td><td width=\"151\" valign=\"top\"><p>22 December 2021</p></td><td width=\"308\" valign=\"top\"><p>Unsupervised self-administered ART*</p></td></tr><tr><td width=\"141\" valign=\"top\"><p>3</p></td><td width=\"151\" valign=\"top\"><p>23 December 2021</p></td><td width=\"308\" valign=\"top\"><p>Supervised self-administered ART at QTC/CTC^</p></td></tr><tr><td width=\"141\" valign=\"top\"><p>4</p></td><td width=\"151\" valign=\"top\"><p>24 December 2021</p></td><td width=\"308\" valign=\"top\"><p>Unsupervised self-administered ART*</p></td></tr><tr><td width=\"141\" valign=\"top\"><p>5</p></td><td width=\"151\" valign=\"top\"><p>25 December 2021</p></td><td width=\"308\" valign=\"top\"><p>Unsupervised self-administered ART*</p></td></tr><tr><td width=\"141\" valign=\"top\"><p>6</p></td><td width=\"151\" valign=\"top\"><p>26 December 2021</p></td><td width=\"308\" valign=\"top\"><p>Unsupervised self-administered ART*</p></td></tr><tr><td width=\"141\" valign=\"top\"><p>7</p></td><td width=\"151\" valign=\"top\"><p>27 December 2021</p></td><td width=\"308\" valign=\"top\"><p>Supervised self-administered ART at QTC/CTC^</p></td></tr></tbody></table>*Results to be submitted online.<br></div><br></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "remaining-vigilant-against-the-omicron-variant", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}