{"pressItemDictionary": {"Press Releases": [{"Title": "14 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1619884800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "02 May 2021", "Summary": "", "MainContent": "1.&nbsp; &nbsp; &nbsp; As of 2 May 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 14 new cases of locally transmitted COVID-19 infection, of whom 13 are linked to previous cases. Amongst them, 11 cases are linked to Case 62541<sup>1</sup>, and were detected from our proactive testing of patients, visitors and staff at Tan Tock Seng Hospital. Based on our investigations so far, the cases are in the community, and there are no new cases in the dormitories.<br><br>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In addition, there are 25 imported cases, who had already been placed on Stay-Home Notice or isolated upon arrival in Singapore. Amongst them, 10 are Singaporeans or Singapore Permanent Residents and 3 are foreign domestic workers.<br><br>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In total, there are 39 new cases of COVID-19 infection in Singapore today.<br><br>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.<br><br>[1]&nbsp;Case 62541 is a 46 year-old female Philippines national who is a nurse at Tan Tock Seng Hospital (TTSH), and is deployed at Ward 9D. She was confirmed to have COVID-19 infection on 27 April. There are 27 cases in total linked to TTSH so far.", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "14-new-cases-of-locally-transmitted-covid-19-infection-2may2021", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}