{"pressItemDictionary": {"Press Releases": [{"Title": "Updates On Local Situation and Vaccination Programme", "PublishedDate": "/Date(1622457360000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "31 May 2021", "Summary": "", "MainContent": "&nbsp; &nbsp; &nbsp; &nbsp;The Multi-Ministry Taskforce (MTF) continues to monitor the local situation closely and ringfence infected cases in the community through contact tracing, testing and quarantine. Further, due to the efforts and co-operation of our people in adhering to the tightened measures under Phase 2 (Heightened Alert), we have slowed down the chains of transmission and kept the number of unlinked community cases stable.<br><br>2.&nbsp; &nbsp; Our vaccination efforts continue to make good progress. The Expert Committee on COVID-19 Vaccination (EC19V) has studied the latest scientific evidence that has been gathered globally and locally after the mass roll-out of vaccinations, and will be updating our vaccination guidelines for pregnant and breastfeeding women, cancer patients on treatment and individuals with history of Severe Cutaneous Adverse Reactions (SCAR). The Ministry of Health (MOH) will also allow the private sector to supply vaccines under the Special Access Route (SAR).<br><br>3.&nbsp; &nbsp; &nbsp;Contact tracing, testing and vaccination continue to be key prongs of our strategy to control the pandemic. With increased incidence of household transmission observed with the new COVID-19 strains, we will strengthen public health action to include the self-isolation of household members of persons under quarantine. We are also piloting the use of Antigen Rapid Tests (ARTs) for additional surveillance testing of the population, starting with pilots for workers in dorms, construction sites, airport and selected marine shipyards.<br><br><strong>Update on Local Situation</strong><br><br>4.&nbsp; &nbsp; &nbsp;The tightened community measures under Phase 2 (Heightened Alert) began on 16 May 2021 and will be in place until 13 June 2021. Based on the data we have gathered, for example of public transport ridership, we observed significant reduction in daily activities.&nbsp; This has helped to slow down the chains of transmission and reduce the number of unlinked community cases. This has also facilitated the swift detection, isolation and ringfencing of transmission chains. We thank everyone for your contribution, and encourage all to continue to stay vigilant and to see a doctor if they are unwell.<br><br>5.&nbsp; &nbsp; &nbsp;The MTF has assessed that the current suite of tightened community measures under Phase 2 (Heightened Alert) are adequate. These have considerably reduced social interactions and the risks of transmission, while allowing most work and daily activities to carry on. The MTF will continue to monitor the situation and provide updates on our local situation and community measures as the need arises, prior to 13 June 2021.&nbsp;<br><br><strong>Updates on Vaccination Programme<br></strong><br>6.&nbsp; &nbsp; More people have been vaccinated both globally and locally. This has provided more evidence on the efficacy and safety of vaccine use especially in relation to specific sub-groups where clinical trial data had not been as substantive. The EC19V has been monitoring the evidence and developments around the world closely, and has revised the guidance for the following specific sub-groups of individuals:&nbsp;<br><br><strong>a)&nbsp; Pregnant Women.</strong> The EC19V has reviewed the real-world clinical data as vaccination has been rolled out to pregnant women globally in countries with extensive COVID-19 transmission, and there is currently no evidence to suggest that the Pfizer-BioNTech or Moderna COVID-19 vaccines may cause harm to pregnant women or their babies. However, the Committee recognises that the amount of data collected on this population segment is still much smaller compared to data on the general population. As such, pregnant women should discuss the risks and benefits with their doctors to make an informed decision on the vaccination. Pregnant women will be able to register and book a vaccination appointment from 4 June 2021 onwards if they are part of the population group eligible for vaccination, should they choose to be vaccinated.&nbsp;<br><br><strong>b)&nbsp; Breastfeeding Women.</strong> It is also safe for women who are breastfeeding to be vaccinated. There is no need to suspend breastfeeding to receive the Pfizer-BioNTech or Moderna COVID-19 vaccine.<br><br><strong>c)&nbsp; Cancer Patients on Active Treatment</strong>.<sup>1</sup> Cancer patients on active cancer treatment remain a vulnerable population that is at an increased risk of complications from COVID-19. There is currently no evidence of any safety signals or increased rates of adverse events from mRNA-based COVID-19 vaccines for this group. As such, cancer patients on active treatment can be vaccinated, but should do so in a hospital setting<sup>2</sup>, after assessment by their treating specialists on their suitability for receiving the vaccine. We are finalising the guidelines on vaccination for cancer patients on treatment, including those who consult private specialists, and will provide further updates when ready.<br><br><strong>d)&nbsp; &nbsp;Persons with Severe Cutaneous Adverse Reactions (SCAR<sup>3</sup>).</strong> It is now deemed to be safe for persons with a history of SCAR, who were previously contraindicated, to receive the Pfizer-BioNTech or Moderna COVID-19 vaccine. They may proceed with their vaccination at our vaccination centers if they are part of a population group eligible for vaccination.<br><br>7.&nbsp; &nbsp; &nbsp;In addition, the EC19V is reviewing the safety data on persons with a history of anaphylaxis, to allow more to be safely vaccinated. The Committee intends to complete this review in the next two weeks, and will set out guidelines allowing certain persons who have had previous history of anaphylaxis to be vaccinated using mRNA vaccines safely. We will continue to review the data on other types of vaccines and explore bringing in safe and efficacious vaccines that are suitable for individuals not recommended to receive the mRNA-based vaccines.&nbsp;<br><br><strong>Special Access Route (SAR) for Vaccines</strong><br><br>8.&nbsp; &nbsp; &nbsp;MOH has authorised two mRNA vaccines – Pfizer-BioNTech and Moderna for our national vaccination programme. There has been interest to access alternate vaccines used in other countries, mostly due to various medical reasons which prevent individuals from taking the two authorised vaccines in Singapore. However, there have either been no applications for approval of these alternate vaccines in Singapore, or evaluation is still on-going.&nbsp;&nbsp;<br><br>9.&nbsp; &nbsp; &nbsp; The review by EC19V to allow more individuals with a history of anaphylaxis to take the Pfizer-BioNTech and Moderna vaccines, will address some of these concerns.&nbsp; To provide even more flexibility, MOH will open up access to other COVID-19 vaccines under the Special Access Route (SAR) in order to enhance the overall vaccination coverage. The SAR is an existing process for the import and supply of unregistered medicines to address unmet medical needs. We will allow the SAR to be used for the supply of COVID-19 vaccines that have been approved by the World Health Organisation (WHO) to be on their Emergency Use Listing (EUL). The use of such vaccines should be according to the WHO EUL-approved indications and age groups. Such use of SAR for these unregistered pandemic vaccines will be time-limited, for the duration of the pandemic.<br><br>10.&nbsp; &nbsp; &nbsp;This avenue will be made available through the private healthcare sector. Like all other medicines supplied under the SAR, the doctor administering the vaccine and the patient should discuss the risks and benefits of using vaccines not registered or authorised by the Health Sciences Authority (HSA), and jointly make an informed decision. Patients will also need to sign an informed consent form to acknowledge that they have discussed with their doctor and accept all responsibility for the risks. The Government will not subsidise vaccines administered under the SAR, and persons vaccinated under the SAR will not be eligible for the Vaccine Injury Financial Assistance Programme for COVID-19 Vaccination (VIFAP). As more data becomes available, MOH will be able to determine if persons vaccinated under the SAR may be eligible for the same exemptions on testing, or public health restrictions, which may be accorded to individuals vaccinated under our national programme.<br><br><strong>Commencing Vaccinations for New Groups&nbsp;</strong><br><br><em>Steady Progress and Enhancing Access for Seniors&nbsp;</em><br><br>11.&nbsp; &nbsp; &nbsp;As of 30 May 2021, we have administered more than 4 million doses of the COVID-19 vaccine. Close to 2.3 million individuals have received at least the first dose of the vaccine, of whom over 1.7 million individuals have received their second dose and completed the full vaccination regimen. Take-up rates remain encouraging. Thus far, 72% of eligible persons aged 45-59 and about 60% of those aged 40-44 have received their COVID-19 vaccination or booked their vaccination appointments.<br><br>12.&nbsp; &nbsp; &nbsp;We are heartened by take-up among our seniors as well. Close to 73% of eligible seniors aged 60 and above have also received their COVID-19 vaccination or booked their vaccination appointments. However, we need to continue to encourage more to be vaccinated, especially among this older, vulnerable population.&nbsp;<br><br>13.&nbsp; &nbsp; Thus far, we have required all individuals to register for an appointment at our Vaccination Centres to receive their vaccination. To provide greater convenience for our seniors to receive their vaccinations, all Vaccination Centres in the community will now accept walk-ins for individuals aged 60 and above. They will not be required to register or book an appointment in advance. However, Polyclinics will not be able to accept walk-ins due to their limited capacity. We hope these facilitative efforts will provide greater accessibility for medically eligible seniors to receive vaccinations conveniently.<br><br><em>Vaccination Plans for the Rest of the Population&nbsp;</em><br><br>14.&nbsp; &nbsp; &nbsp;As we confirm the delivery schedule of our supplies, we will be able to invite more to come forward to receive their vaccinations in the coming two months. A major part of this effort is to progressively invite over 400,000 students from schools and Institutes of Higher Learning (IHLs) for their vaccinations, starting from 1 June 2021. Vaccinations for students in schools and IHLs are part of the larger national efforts to keep our educational institutions and community safe. MOE will be sharing more details in a separate media release.&nbsp;<br><br>15.&nbsp; &nbsp; &nbsp; If our supplies continue to arrive as scheduled, sometime in the middle of June, we should be able to extend vaccinations to the rest of our population, which are young adults aged 39 years and below. As this is a very big group, Singapore Citizens will be invited to register their interest and make appointments for their vaccinations two weeks before bookings are opened to others in this age group. We encourage all to register their interest via vaccine.gov.sg and get vaccinated when they are offered.&nbsp;<br><br><em>Household Contacts of Persons Under Quarantine Are to Self-Isolate</em><br><br>16.&nbsp; &nbsp; &nbsp;Individuals who have been identified as close contacts of a confirmed COVID-case are currently issued quarantine orders, and are either isolated at Government Quarantine Facilities or at home (if their home is suitable) for 14 days from the last day of their exposure to an infected individual. This isolates potentially infected individuals from the community, which limits the spread of the virus in the community.&nbsp;<br><br>17.&nbsp; &nbsp; &nbsp; As we have observed increased transmission within the same household as the infected individuals, we are taking the added precaution of expanding the ring of public health actions around cases. With immediate effect, all household members of persons under quarantine are to self-isolate at home and minimise their social interactions until the person under quarantine receives a negative COVID-19 Polymerase Chain Reaction (PCR) test result at his / her entry into quarantine or if the person is no longer under quarantine. They should also seek medical attention promptly if they feel unwell while waiting for this test result.<br><br><br><em>Increased Surveillance Testing Using Antigen Rapid Tests (ARTs)</em><br><br>18.&nbsp; &nbsp; &nbsp; Frequent and widespread testing is an important enabler that allows for more economic and social activities to continue in a safe manner. The use of PCR COVID-19 tests has been very effective in detecting positive cases across various settings, such as for patients with symptoms of acute respiratory infections and rostered routine testing for frontline workers at our borders. It remains the most suitable and effective clinical diagnosis for COVID-19 infection.&nbsp;<br><br>19.&nbsp; &nbsp; &nbsp; However, results for PCR tests can take a day or two. There are now newer tests such as the Antigen Rapid Tests (ARTs) which are available in the market and can complement our existing testing regimes where used appropriately. While such alternative tests are less sensitive than the PCR tests, they are cheaper, faster and more convenient to administer, which make them more practical for frequent use, and very effective surveillance tests. This will enable us to expand the scale of testing in the wider population, allowing us to identify potential infections earlier and to trigger public health actions sooner to stem further spread.&nbsp;<br><br>20.&nbsp; &nbsp; &nbsp;More frequent testing using such simple and easy alternative tests will allow us to continue with our work and activities more safely, even as the COVID-19 situation continues to evolve around us. We had earlier introduced the use of ARTs as pre-event testing to allow larger group sizes at events and weddings, and for surveillance testing of cargo drivers entering Singapore via the land checkpoints. Moving forward, such tests can be deployed for routine testing at workplaces, particularly in settings where interactions are high, and there is close contact with many people. Extensive testing will also give us greater confidence to resume gatherings of a larger scale. We are also working to bring in ART kits that would be sold over the counter. This will enable individuals to test themselves at home. We will provide more information on the availability of such kits when ready.<br><br>21.&nbsp; &nbsp; &nbsp;As a start, we have now started piloting the use of ARTs for regular surveillance testing for workers in dorms, construction sites, airport and selected marine shipyards. This is in addition to the PCR-based Rostered Routine Testing (RRT) that these workers continue to be required to take. Individuals who test positive on their ART will get a confirmatory PCR result at Swab and Send Home Public Health Preparedness Clinics (SASH PHPCs) or Regional Screening Centres (RSCs) to confirm if they have been infected with COVID-19. Such individuals who test positive on their ART are required to self-isolate until they receive a negative PCR test result. We will roll out such testing using alternative tests to more settings progressively, starting with pilots in student hostels in autonomous universities, and will also work with CapitaLand to run pilots at 1-2 selected malls for tenants and people who work there. All workplaces and employers are encouraged to adopt regular testing using such alternative tests to keep their staff and customers safe.<br><br><strong>Keeping our Community Safe</strong><br><br>22.&nbsp; &nbsp; &nbsp;Vaccination remains a key enabler and its ability to help us re-open safely can only be felt when we achieve a high level of population coverage for vaccination. Hence we urge everyone to be vaccinated when it is offered to you. In addition, all prevailing safe management measures should be adhered to, and individuals should see a doctor and get tested if they feel unwell. We strongly encourage everyone to continue to remain at home and leave the house only for essential activities. It is only by working together, that we can emerge stronger and safer.&nbsp;&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>31 MAY 2021</strong><br><hr><br><sup>1 </sup>Active treatment is defined as chemotherapy, immunotherapy or radiation therapy that individuals have undergone in the past three months or have planned to undergo in the next two months.<br><br><sup>2</sup> Cancer patients on hormonal therapy can continue to be vaccinated at any available vaccination sites under the current guidelines.&nbsp;<br><br><sup>3</sup> Severe Cutaneous Adverse Reactions include Stevens-Johnson Syndrome, Toxic Epidermal Necrolysis, Drug Rash with Eosinophilia and Systemic Symptoms, and Drug-induced Hypersensitivity Syndrome.<br><div><br></div><div><br></div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "updates-on-local-situation-and-vaccination-programme", "CurrentPageUrl": null}, {"Title": "16 New Cases of Locally Transmitted Infection ", "PublishedDate": "/Date(1622447100000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "31 May 2021", "Summary": "", "MainContent": "<p style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 16px;\">&nbsp; &nbsp; &nbsp; </span><span style=\"font-family: Arial; font-size: 16px;\">As of 31 May 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 16 new&nbsp;cases of locally transmitted COVID-19 infection.&nbsp;13&nbsp;are linked to previous cases, amongst whom 11 have already been placed on quarantine, and 2 were detected through surveillance.The remaining 3 are currently unlinked.&nbsp;Based on our investigations so far, the cases are in the community, and there are no new cases in the dormitories.</span></p><p style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 16px;\">2. &nbsp; &nbsp; In addition, there are 7 imported cases, who have already been placed on Stay-Home Notice upon arrival in Singapore. Of these, 4 are returning Singaporeans or Singapore Permanent Residents.<br><br>3. &nbsp; &nbsp; &nbsp; &nbsp;In total, there are 23 new cases of COVID-19 infection in Singapore today.<br><br>4. &nbsp; &nbsp; &nbsp; &nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.</span></p><p><span style=\"font-family: Arial; font-size: 16px;\"><span style=\"font-family: Arial;\"><br></span><strong>MINISTRY OF HEALTH<br></strong></span><strong><span style=\"font-size: 12pt; font-family: Arial;\">31 MAY 2021</span></strong></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "16-new-cases-of-locally-transmitted-infection_31May2021", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}