{"pressItemDictionary": {"Press Releases": [{"Title": "Updates On Border Measures for Travellers From Taiwan", "PublishedDate": "/Date(1621094280000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "15 May 2021", "Summary": "", "MainContent": "<p style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 16px;\">1.&nbsp; &nbsp; &nbsp;The Multi-Ministry Taskforce has been closely monitoring the global COVID-19 situation, and will be tightening border measures given the increase in cases in Taiwan. </span></p> <p style=\"text-align: justify;\"><span style=\"font-size: 16px; font-family: Arial;\"><strong>Travellers from Taiwan to Serve 21-Day SHN</strong><br></span></p> <p style=\"text-align: justify;\"><span style=\"font-size: 16px; font-family: Arial;\">2.&nbsp; &nbsp; &nbsp;</span><span style=\"text-align: left; font-size: 16px; font-family: Arial;\">We had earlier announced that travellers from Taiwan will be allowed to go about their activities in Singapore, without a need to serve Stay-Home Notice (SHN), if their on-arrival COVID-19 Polymerase Chain Reaction (PCR) test results are negative.</span></p><p><p><span style=\"font-size: 16px; font-family: Arial;\"><span style=\"font-size: 16px;\">3.&nbsp; &nbsp; &nbsp;</span><span style=\"font-size: 16px;\">As there has been a recent increase in cases reported by Taiwan, we will be tightening our border measures with Taiwan. From </span><strong style=\"font-family: Arial, sans-serif;\">16 May 2021, 2359 hours</strong>:</span></p></p><p><p><span style=\"font-size: 16px; font-family: Arial;\"><span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp;a,&nbsp; &nbsp; &nbsp;</span><span style=\"font-size: 16px;\">Singapore Citizens (SCs), Permanent Residents (PRs) and Long-Term Pass holders entering Singapore with travel history to Taiwan within the last 21 days before departure for Singapore, will be subject to a 14-day SHN at dedicated SHN facilities, followed by an additional 7-day SHN at their place of residence. They will undergo COVID-19 PCR tests on-arrival[1], on</span> Day 14 of their SHN, and before the end of their 21-day SHN period.</span></p><p><span style=\"font-size: 16px; font-family: Arial;\">&nbsp; &nbsp; &nbsp;b.&nbsp; &nbsp; &nbsp;Short-term travellers holding an Air Travel Pass (ATP) with travel history to Taiwan within the last 21 days before departure for Singapore, will <u>not</u> be allowed to enter Singapore.</span></p><p><span style=\"font-size: 16px; font-family: Arial;\">&nbsp; &nbsp; &nbsp;c.&nbsp; &nbsp; &nbsp;In addition, travellers who are not SCs or PRs, and who have recent travel history to Taiwan within the last 21 days before departure will be required to take a COVID-19 PCR test within 72 hours before departure. Travellers will need to present a valid negative COVID-19 test result as a condition of approval to enter Singapore.</span></p></p><p><span style=\"font-size: 16px; font-family: Arial;\">4.&nbsp; &nbsp; &nbsp;All travellers with travel history to Taiwan within the last 21 days before departure for Singapore, and who <strong>entered Singapore between 15 May 2021, 0001 hours, and 16 May 2021, 2359 hours</strong>, will be subject to Government-funded COVID-19 PCR tests on Day 3 and Day 7 of their arrival in Singapore. Affected travellers will be contacted with additional details on how they can take their COVID-19 PCR tests.</span></p><p><span style=\"font-size: 16px; font-family: Arial;\"><strong>Enabling A Safe Reopening</strong><br></span></p><p><span style=\"font-size: 16px; font-family: Arial;\">5.&nbsp; &nbsp; &nbsp;</span><span style=\"font-size: 16px; font-family: Arial;\">As the global situation evolves, we will continue to adjust our border measures to manage the risk of importation and transmission to the community. Any changes to border measures will be updated on the <a href=\"https://safetravel.ica.gov.sg/\" title=\"\" class=\"\" target=\"\">SafeTravel website</a>. Travellers are advised to visit the website to check for the most updated border measures before entering Singapore and be prepared to be subjected to the prevailing border measures upon entry, including payment for their stay at dedicated SHN facilities, tests and treatment.</span></p> <p style=\"text-align: justify;\"><span style=\"font-size: 16px; font-family: Arial;\"><strong>MINISTRY OF HEALTH</strong><br></span></p> <p style=\"text-align: justify;\"><span style=\"font-size: 16px; font-family: Arial;\"><strong>15 MAY 2021</strong></span></p> <div><span style=\"font-size: 16px; font-family: Arial;\"><br clear=\"all\"> </span><hr align=\"left\" size=\"1\" width=\"33%\"> <div id=\"ftn1\"> <p style=\"text-align: justify;\"><span style=\"font-size: 13px; font-family: Arial;\">[1] To expedite the COVID-19 PCR test at the airport, travellers are strongly encouraged to register and pre-pay for their on-arrival COVID-19 PCR test prior to departing for Singapore at https://safetravel.changiairport.com/<span>&nbsp; </span></span></p> </div> </div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "updates-on-border-measures-for-travellers-from-taiwan", "CurrentPageUrl": null}, {"Title": "Reply to Media Queries On the Number of Imported Cases Who Were Short Term Visitors", "PublishedDate": "/Date(1621089960000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "15 May 2021", "Summary": "", "MainContent": "In response to media queries on the number of imported cases who were short term visitors, MOH would like to clarify the following.<br><br>The B1617 variant prevalent in South Asia is not just a Singapore problem. The WHO has deemed it a variant of global concern.<br><br>According to the Gisaid Institute, Europe has sequenced almost 2,000 B1617 infections, US 486, Australia 85, Japan 29 and China 17.<br><br>This is a major reason why transmission is rising throughout Asia -- in Malaysia, Thailand, Japan. Even hitherto safe regions, such as Singapore, Taiwan and Vietnam, are experiencing outbreaks of community cases.<br><br>These cases all originated from imports because all borders are porous. All it takes is one case to cause an outbreak, and no country can seal itself off totally. At the minimum, citizens and residents must be allowed to return home.<br><br>For imported cases in Singapore, we reported 409 cases over 28 days from 16 Apr to 13 May. 41.6% of them were SC/PRs, 50.6% were Work pass holders, student pass holders or dependents, and 7.8% were short term visitors. All short term visitors are allowed to enter only if they have family ties here, or on specific compassionate grounds such as to attend a funeral, or seek medical treatment.<br><br>If we just look at South Asia, the number of imported cases over the past 28 days was 271, comprising 50.2% SCs/PRs, 46.5% work pass holders, student pass holders or dependents and 3.3% short term visitors.<br><br>Every arrival is subject to stringent SHN and tests. Community transmission occurred nevertheless because the virus breached our safe measures, including at Changi Airport.<br><br>The infiltrating virus can be from SC/PR/work pass holders or a short term visitor. This is a challenge faced by all countries because no one can entirely close their borders.<br><strong><br>MINISTRY OF HEALTH<br>15 MAY 2021</strong>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "reply-to-media-queries-on-the-number-of-imported-cases-who-were-short-term-visitors", "CurrentPageUrl": null}, {"Title": "19 New Cases of Locally Transmitted Covid-19 Infection ", "PublishedDate": "/Date(1621068120000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "15 May 2021", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;As of 15 May 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 19 new cases of locally transmitted COVID-19 infection, of whom 17 are linked to previous cases, and 2 are currently unlinked. Amongst them, 11 had already been placed on quarantine earlier. Based on our investigations so far, the cases are in the community, and there are no new cases in the dormitories.</p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;In addition, there are 12 imported cases, who had already been placed on Stay-Home Notice upon arrival in Singapore. Of these, 7 are returning Singaporeans or Singapore Permanent Residents.</p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;In total, there are 31 new cases of COVID-19 infection in Singapore today.</p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;</p><p><strong>MINISTRY OF HEALTH</strong><strong><br><strong>15 MAY 2021</strong></strong></p><p>&nbsp;</p><p>&nbsp;</p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "19-new-cases-of-locally-transmitted-covid-19-infection_15May2021", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}