{"pressItemDictionary": {"Press Releases": [{"Title": "1 New Case of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1611300600000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "22 Jan 2021", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; As of 22 January 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 1 new case of locally transmitted COVID-19 infection. Based on our investigations so far, the case is in the community, and there are no new cases in the dormitories. <br><br>2.&nbsp; &nbsp;In addition, there are 14 imported cases, who had already been placed on Stay-Home Notice or isolated upon arrival in Singapore. In total, there are 15 new cases of COVID-19 infection in Singapore today. <br><br>3.&nbsp; &nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.</p> <p>&nbsp;</p> <p>&nbsp;</p> <div> <p><strong>MINISTRY OF HEALTH<br></strong><strong>22 JANUARY 2021</strong></p> </div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "1-new-case-of-locally-transmitted-covid-19-infection(22janabridged)", "CurrentPageUrl": null}, {"Title": "Tightening Safe Management Measures and Update On Vaccination Plans", "PublishedDate": "/Date(1611244800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "22 Jan 2021", "Summary": "", "MainContent": "1.&nbsp; &nbsp; &nbsp; It has been nearly a month since we transitioned to Phase Three of our re-opening.&nbsp; We anticipated then that there could a greater level of transmission due to the increased interactions in the community, and that we would need to continually adjust and calibrate our measures depending on the infection situation. Indeed over the past week, we have seen an increase in the number of local cases, some of which are currently unlinked and have resulted in the formation of community clusters. This is a real cause for concern as it could indicate that there is wider, as yet undetected, community transmission. We must remain vigilant to avoid an uncontrolled resurgence of community cases.&nbsp;&nbsp;<br><br><strong>Tightening Safe Management Measures&nbsp;</strong><br><br>2.&nbsp; &nbsp; &nbsp; In light of the latest situation, the Multi-Ministry Taskforce (MTF) has decided that we will need to calibrate the pace and scale at which certain activities in the community can resume.&nbsp;<br><br>a. Hence we had earlier announced the suspension of the pilot to allow shortlisted nightclubs and karaoke outlets to resume operations.&nbsp;<br><br>b. We will also postpone the start of the National School Games which was originally scheduled in February. The Ministry of Education (MOE) will review again the type of sports to resume and in what format, to ensure that games can be conducted meaningfully but safely for our students. More details will be provided by MOE later.&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp; To further mitigate the risk of large community clusters arising from infections that spread within a household and through them to all their contacts, <strong>we will impose a cap of 8 distinct visitors per household per day. </strong>This will take effect from <strong>26 January 2021. Individuals should also limit themselves to visiting at most two other households a day, as much as possible.&nbsp;</strong><br><br>4.&nbsp; &nbsp; &nbsp; The maximum group size for social gatherings outside the house will remain at 8 people for now. That said, everyone should keep their social circle small instead of mixing with multiple social groups. We will continue to monitor the situation closely and impose further measures as necessary.&nbsp;<br><br><em>Staying Vigilant During the Festive Season&nbsp;</em><br><br>5.&nbsp; &nbsp; &nbsp; There will be increased transmission risks in the community during the upcoming Chinese New Year period.&nbsp; So it is important that everyone cooperates with the new measures.&nbsp;&nbsp;<br><br>6.&nbsp; &nbsp; &nbsp; In particular those who are dining out should make sure they wear a mask if they are not eating or drinking. We already do not allow singing (including by diners) and other live performances at F&amp;B establishments and work-related events where food is served. Diners should also avoid raising their voices, at all times. This also means that face masks must be worn during the tossing of yusheng, and that the lohei should be done without any verbalisation of the usual auspicious phrases. F&amp;B establishments and enterprises serving lohei must ensure that both the staff and patrons comply with these requirements.&nbsp;<br><br>7.&nbsp; &nbsp; &nbsp; We encourage everyone to connect digitally with their family and friends instead of going on physical visits.&nbsp; For those who would like to do house visits, they should limit their visits to family members and to not more than 2 other households a day. Singaporeans are also reminded that the prevailing rules at F&amp;B establishments will apply to reunion dinners held within them. In other words, there must not be any multiple table bookings. The only exception is for those from the same household. But even in such instances, there should not be any inter-mingling across tables.&nbsp;&nbsp;<br><br>8.&nbsp; &nbsp; &nbsp; We will step up enforcement checks at F&amp;B establishments, malls and other crowded public spaces during this period. Strict enforcement actions will be taken against individuals and operators who do not comply with safe management measure. The penalties include fines and prosecution in court, depending on the severity of the offence.&nbsp; For operators who do not comply with the measures, their operations will be suspended.&nbsp;&nbsp;<br><br>9.&nbsp; &nbsp; &nbsp; With everyone’s cooperation, we can avoid sparking large clusters which may then necessitate further tightening of measures or even a reversion to Phase Two or Phase One measures.<br><br><strong>Surveillance Testing&nbsp;&nbsp;</strong><br><br>10.&nbsp; &nbsp; &nbsp; As community interactions are likely to increase in the leadup to Chinese New Year, we will carry out surveillance testing for stallholders, shop owners, persons in the food and beverage industry, as well as food delivery persons operating in and around Chinatown. While there has been no evidence that these community groups are at higher risk of infection, the Ministry of Health (MOH) will be offering tests to them as they are expected to interact more frequently with other members of the public during this time. The testing will take place from <strong>8 February to 9 February 2021</strong>. MOH, together with other government agencies, will be progressively reaching out to these identified community groups with further details.<br><br>11.&nbsp; &nbsp; &nbsp; We strongly encourage all individuals in the identified community groups to come forward for testing. The costs of these tests will be fully borne by the Government.&nbsp;<br><br><strong>Extension of COVID-19 Testing Subsidies&nbsp;</strong><br><br>12.&nbsp; &nbsp; &nbsp; Besides active case finding and ongoing surveillance testing, the Government has been conducting Rostered Routine Testing (RRT) of workers in the various sectors that have higher risk of exposure to COVID-19 or with larger negative impact if they were to have a COVID-19 infection in their midst. These include workers living in dormitories, and those working in the construction, marine and process, aviation and maritime sectors, among others.&nbsp;<br><br>13.&nbsp; &nbsp; &nbsp; The Government had earlier announced that it will bear the costs of RRT in these sectors until 31 March 2021. As COVID-19 continues to pose significant public health risks in these sectors, the Government will continue to bear the costs for COVID-19 RRT until <strong>30 September 2021 </strong>to support their safe operations.&nbsp;<br><br>14.&nbsp; &nbsp; &nbsp;The Government will continue to review its subsidies for COVID-19 RRT to ensure that they support our public health efforts while sharing the costs equitably between taxpayers, employers and individuals.<br><br><strong>Update on Vaccination Plans</strong><br><br>15.&nbsp; &nbsp; &nbsp; Vaccination is critical to protect us and our loved ones against COVID-19. Vaccination also protects those in our community who cannot be vaccinated due to medical reasons. This collective protection will become more effective as more people are vaccinated and is a key enabler allowing us to return to normalcy.&nbsp;&nbsp;<br>&nbsp;<br>16.&nbsp; &nbsp; &nbsp; We have made good progress in our vaccination programme. As of today, more than 60,000 individuals have received their first dose of the vaccine, including staff working in healthcare, nursing home, frontline and essential services, as well as seniors in our nursing homes. 39 staff at the National Centre for Infectious Diseases (NCID) have also received their second dose of the vaccine, and completed the full vaccination regimen, and in 2 weeks’ time, they will have built up maximum protection against COVID-19. These numbers are expected to rise substantially in the coming weeks as we continue to ramp up our vaccination operations safely.&nbsp;<br><br>17.&nbsp; &nbsp; &nbsp; While there will be some upcoming delays to the shipments of Pfizer-BioNTech vaccines due to Pfizer’s manufacturing plant upgrading, we will continue to monitor our supplies closely to ensure that we will have enough vaccines for all Singaporeans and long-term residents in Singapore by the third quarter of 2021.<br><br><strong>Vaccinating Our Seniors&nbsp;</strong><br><br>18.&nbsp; &nbsp; &nbsp; This week, residents in our nursing homes have started to receive their vaccinations. Our seniors in the community will also be able to receive their vaccines very soon.&nbsp;<br><br>19.&nbsp; &nbsp; &nbsp; <strong>From 27 January 2021, we will commence vaccination for seniors, starting with pilots in Ang Mo Kio and Tanjong Pagar, where larger numbers of our seniors reside.&nbsp;</strong> The aim of these pilots is to enable us to iron out all the operational processes before scaling up nationwide. <strong>Vaccinations will be progressively extended to seniors across the island from mid-February 2021.&nbsp; </strong>More vaccination centres will be set up over the next few weeks to ensure that all seniors can conveniently receive their vaccinations at a centre near to where they live. The vaccination centres will be located in high population catchment areas and/or along public transport routes for greater accessibility. We seek everyone’s patience and support as we progressively roll-out the vaccinations to all.&nbsp;<br><br>20.&nbsp; &nbsp; &nbsp; All seniors will receive personalised letters inviting them to make an appointment for their vaccinations. They will be able to make appointments online, or they can also visit selected Community Centres near them to book an appointment in-person.&nbsp;<br><br>21.&nbsp; &nbsp; &nbsp; In addition, community volunteers from the People’s Association, as well as our Silver Generation Ambassadors will be conducting house visits and tapping on existing grassroots events, to answer queries and help our seniors to book an appointment if necessary. Seniors will also be provided with information sheets with more details on the COVID-19 vaccine and the vaccination process. Should our seniors require further assistance, they may also call the MOH hotline at 1800-333-9999.&nbsp;<br><br><strong>Keeping Safe During Phase Three</strong><br><br>22.&nbsp; &nbsp; &nbsp; Tightened safe management measures, supported by widespread surveillance testing and progressive vaccination of our population starting from those in settings with higher public health risk will help us to mitigate the spread of COVID-19 and keep community transmission rates low. This is key if we are to remain in Phase Three and consider any further re-opening.&nbsp;&nbsp;<br><br>23.&nbsp; &nbsp; &nbsp; We seek the cooperation of all Singaporeans to remain united and disciplined in the fight against COVID-19. Observe all safe management measures, see a doctor and get tested when sick, and be vaccinated when it is offered to you. Together, we can look forward to a safer and healthier 2021.&nbsp;<br><div><br></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "tightening-safe-management-measures-and-update-on-vaccination-plans", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}