{"pressItemDictionary": {"Press Releases": [{"Title": "3 New Cases of Locally Transmitted  Covid-19 Infection ", "PublishedDate": "/Date(1609510920000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "01 Jan 2021", "Summary": "", "MainContent": "<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; As of 1 January 2021, 12pm, the Ministry of Health (MOH) has confirmed and verified that there are 3 new cases of locally transmitted COVID-19 infection. The cases are in the community, and there are no new cases in the dormitories. There are 27 imported cases, who had already been placed on Stay-Home Notice (SHN) upon arrival in Singapore. Amongst the new cases today, 26 are asymptomatic, and were detected from our proactive screening and surveillance, while 4 were symptomatic.&nbsp; </p><p><strong>Summary of new cases</strong></p><table width=\"605\" border=\"1\" cellspacing=\"0\" cellpadding=\"0\"> <tbody><tr> <td width=\"129\"> <p align=\"right\">&nbsp;</p> </td> <td width=\"60\"> <p>&nbsp;</p> </td> <td width=\"16\" valign=\"top\"> <p>&nbsp;</p> </td> <td width=\"192\" colspan=\"2\"> <p align=\"center\"><strong>Breakdown by</strong></p> </td> <td width=\"16\" valign=\"top\"> <p>&nbsp;</p> </td> <td width=\"192\" colspan=\"2\"> <p align=\"center\"><strong>Breakdown by</strong></p> </td> </tr> <tr> <td width=\"129\"> <p align=\"right\">&nbsp;</p> </td> <td width=\"60\"> <p><strong>Number of cases</strong></p> </td> <td width=\"16\" valign=\"top\"> <p>&nbsp;</p> </td> <td width=\"96\"> <p><strong>Already in quarantine/ isolation before detection</strong></p> </td> <td width=\"96\"> <p><strong>Detected from surveillance</strong></p> </td> <td width=\"16\" valign=\"top\"> <p>&nbsp;</p> </td> <td width=\"96\"> <p><strong>Symptomatic</strong></p> </td> <td width=\"96\"> <p><strong>Asymptomatic</strong></p> </td> </tr> <tr> <td width=\"129\"> <p><strong>Cases in the community</strong></p> </td> <td width=\"60\"> <p align=\"center\">3</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">2</p> </td> <td width=\"96\"> <p align=\"center\">1</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">2</p> </td> <td width=\"96\"> <p align=\"center\">1</p> </td> </tr> <tr> <td width=\"129\"> <p><strong>Cases residing in dormitories</strong></p> </td> <td width=\"60\"> <p align=\"center\">0</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">0</p> </td> <td width=\"96\"> <p align=\"center\">0</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">0</p> </td> <td width=\"96\"> <p align=\"center\">0</p> </td> </tr> <tr> <td width=\"129\"> <p><strong>Imported cases</strong></p> </td> <td width=\"60\"> <p align=\"center\">27</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">27</p> </td> <td width=\"96\"> <p align=\"center\">0</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">2</p> </td> <td width=\"96\"> <p align=\"center\">25</p> </td> </tr> <tr> <td width=\"129\"> <p><strong>Total</strong></p> </td> <td width=\"60\"> <p align=\"center\">30</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">&nbsp;</p> </td> </tr> </tbody></table><p><br>2.&nbsp; &nbsp;&nbsp;Overall, the number of new cases in the community has increased from 1 case in the week before to 10 cases in the past week. The number of unlinked cases in the community has also increased from 1 case in the week before to 4 cases in the past week. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.</p><p><strong>&nbsp;</strong></p><p><strong>Case Details</strong></p><p><strong>a)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Cases in the community: 3</strong></p><p>There are 3 cases in the community today, of whom 1 is currently unlinked and 2 are linked to previous cases. </p><p><u>Case 58870</u></p><p>Case 58870 is a 14 year-old female Singaporean who is a friend of Case 58843<sup>[1]</sup>. On 27 December 2020, she visited Case 58843 at her home for a few hours while Case 58810<sup>[2]&nbsp;</sup>was present as well. As a result, she was identified as a close contact of Case 58810 on 29 December, and placed on quarantine. She developed a fever the next day and was conveyed to KK Women’s and Children’s Hospital in an ambulance, where she was tested for COVID-19. Her test result came back positive for COVID-19 infection on 31 December. Her serological test result has come back negative, indicating that this is likely a current infection. </p><p>She is a student of Raffles Girls’ School, but had not been in school since October 2020. </p><p>&nbsp;</p><p><u>Case 58872</u></p><p>Case 58872 is a 52 year-old female Singaporean who is a family member of Cases 58817<sup>[3]</sup>, 58840<sup>[4]&nbsp;</sup>and 58841<sup>[5]</sup>, and household member of Cases 58840 and 58841. She developed symptoms on 28 December and sought medical treatment at a general practitioner clinic the next day. She was advised by the doctor to take a COVID-19 test, but she did not do so. She was also given 5 days’ medical leave, during which she had to remain at home. </p><p>As she was identified as a close contact of Cases 58840 and 58841, she was placed on quarantine on 31 December and reported being unwell when contacted by MOH. She was immediately conveyed to the National Centre for Infectious Diseases (NCID) in an ambulance, where she was tested. Her test result came back positive for COVID-19 infection on the same day. Her serological test result has come back negative, indicating that this is likely a current infection.</p><p>She works as a client analyst at Deutsche Bank (One Raffles Quay) but does not interact with clients or external parties. Her last day of work was 28 December. </p><p>We urge everyone to take the COVID-19 test when advised by your doctor, so as to allow us to identify infected individuals early and to quickly contain further spread.</p><p>&nbsp;</p><p><u>Case 58874</u></p><p>Case 58874 is a 53 year-old male Japanese who is a Work Pass holder. He arrived in Singapore from Japan on 26 November and was placed on SHN at a dedicated facility until 10 December. A pre-departure test he had taken on 24 November was negative for COVID-19 infection, and his test on 6 December during SHN came back negative as well. </p><p>He is asymptomatic, and was detected when he took a COVID-19 pre-departure test on 31 December in preparation for his return to Japan. His result came back positive for COVID-19 infection that night and he was conveyed to NCID the next day. His serological test result has come back positive. </p><p>He is employed at Kurosawa &amp; Partners Pte Ltd (18 Robinson Road) but works from his home located at Rochor Road. </p><p>Epidemiological investigations are ongoing. In the meantime, all the identified close contacts of the cases, including their family members and co-workers, have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for the close contacts to determine if the case could have been infected by them</p><p><strong>&nbsp;</strong></p><p><strong>b)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Cases residing in dormitories: 0</strong></p><p>There are no cases residing in dormitories today. </p><p>&nbsp;</p><p><strong>c)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Imported cases: 27</strong></p><p>Amongst the 27 imported cases, </p><p>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 1 (Case 58875) is a Singaporean and 4 (Cases 58847, 58848, 58849 and 58862) are Singapore Permanent Residents who returned from Indonesia, India and Myanmar. <br>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 5 (Cases 58845, 58846, 58860, 58861 and 58871) are Work Pass holders who arrived from UAE and India. <br>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 16 are Work Permit holders who arrived from Indonesia, India, Myanmar and the Philippines, of whom 14 (Cases 58844, 58851, 58852, 58854, 58855, 58856, 58857, 58858, 58859, 58864, 58865, 58866, 58867 and 58868) are foreign domestic workers.<br>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 1 (Case 58869) is a Short-Term Visit Pass holder who arrived from Indonesia to visit his Singaporean child. </p><p>They had all already been placed on SHN upon arrival in Singapore and were tested while serving SHN. </p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Epidemiological investigations are in progress. In the meantime, all the identified close contacts of the cases have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for the close contacts to determine if the cases could have been infected by them.</p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Please refer to the <a title=\"Annexes\" href=\"/docs/librariesprovider5/pressroom/annex-1-jan-2021.pdf?sfvrsn=f115a1c_2\">Annexes</a>&nbsp;and MOH’s daily Situation Report (<a title=\"\" href=\"http://www.moh.gov.sg/covid-19/situation-report\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?q=http://www.moh.gov.sg/covid-19/situation-report&amp;source=gmail&amp;ust=1609597209303000&amp;usg=AFQjCNEryp3i2rxUpwWO49hD-zTycuMsQA\">www.moh.gov.sg/covid-19/<wbr>situation-report</a>) for details. </p><p>&nbsp;</p><p><strong>Investigations into 13 cases who served SHN at Mandarin Orchard Singapore</strong></p><p>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; MOH announced on 19 December that we were investigating 13 previously reported cases<sup>[6]</sup>&nbsp;of COVID-19 infection amongst individuals who had served SHN at Mandarin Orchard Singapore between 22 October and 11 November 2020. We have since completed investigation into these 13 cases and determined that there was no further transmission beyond them. The other COVID-19 cases who had served SHN at Mandarin Orchard Singapore were determined to be unlinked to the 13 cases. All the hotel staff tested under our special testing operations tested negative for COVID-19 infection using the polymerase chain reaction (PCR) test. The serological tests of 11 staff are positive, indicating likely past infections. These findings indicate that there is no ongoing transmission at Mandarin Orchard Singapore. </p><p>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In view that the premises have been thoroughly disinfected, and there is no longer risk of transmission to hotel guests, MOH has approved the re-opening of Mandarin Orchard Singapore from 2 January 2021 (14 days after its closure on 19 December), including its restaurant and event spaces. </p><p>&nbsp;</p><p><strong>Update on condition of confirmed cases</strong></p><p>7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 10 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 58,459 have fully recovered from the infection and have been discharged from hospitals or community care facilities. </p><p>8.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; There are currently 56 confirmed cases who are still in hospital. Of these, most are stable or improving, and 1 is in critical condition in the intensive care unit. 85 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 29 have passed away from complications due to COVID-19 infection. </p><p>&nbsp;</p><p><strong>MINISTRY OF HEALTH<br>1 JANUARY 2021</strong></p><p><br><sup>[1]</sup>&nbsp; Case 58843 had been identified as a close contact of Case 58810 on 29 December, and was placed on quarantine on 30 December. She was reported in MOH’s press release on 31 December 2020.<br><sup>[2]&nbsp; </sup>Case 58810 is a Singapore Permanent Resident who works as a Marine Surveyor. He was reported in MOH’s press release on 30 December.<br><sup>[3]&nbsp; </sup>Case 58817 is a Singaporean who works as a Harbour Pilot. He was reported in MOH’s press release on 31 December.<br><sup>[4]&nbsp;</sup> Case 58840 is a Singaporean who is a retiree, and a family member of Case 58817. She was reported in MOH’s press release on 31 December.<br><sup>[5]&nbsp;</sup> Case 58841 is a Singaporean who is currently unemployed, and a family member of Case 58817. He was reported in MOH’s press release on 31 December.<br><sup>[6] &nbsp;</sup>Cases 58204, 58235, 58233, 58236, 58237, 58234, 58244, 58245, 58253, 58252, 58268, 58281 and 58284. They were confirmed between 2 November and 11 November to have COVID-19 infection. These cases were classified as imported cases due to their recent travel history.</p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "3-new-cases-of-locally-transmitted-covid-19-infection_1JanUpdate", "CurrentPageUrl": null}, {"Title": "Updates On Border Measures for Travellers From South Africa", "PublishedDate": "/Date(1609488000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "01 Jan 2021", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp;The Multi-Ministry Taskforce has been closely monitoring the global COVID-19 situation and will be tightening border measures given the deteriorating situation in South Africa. </p> <p><strong>Restricting Travel from South Africa<br><br></strong>2.&nbsp;<strong> </strong>Travellers with recent travel history to South Africa within 14 days prior to departure to Singapore are currently required to serve a 14-day Stay-Home Notice (SHN) at dedicated SHN facilities. Travellers who are not Singapore Citizens or Permanent Residents are also required to take a COVID-19 polymerase chain reaction (PCR) test within 72 hours before departure and present a valid negative COVID-19 test result as a condition of approval to enter Singapore.</p><p><p>3.&nbsp; There have been recent reports of a potentially more contagious strain of the COVID-19 virus circulating in South Africa. To reduce the risks of spread to Singapore, we are putting in place new border restrictions for travellers from South Africa for further precaution. From <strong>03 January 2021, 2359 hours</strong>, until further notice:</p></p><p><p>a) All long-term pass holders and short-term visitors with recent travel history to South Africa within the last 14 days will not be allowed entry into Singapore, or transit through Singapore. This restriction will apply to those who have obtained prior approval for entry into Singapore.</p></p><p>b) Returning Singapore Citizens and Permanent Residents will be required to undergo a COVID-19 PCR test upon arrival in Singapore [1],&nbsp;at the start of their 14-day SHN. These test requirements do not apply to those who are only transiting through Singapore.<br><br>4.&nbsp; While the strain has been suggested to be more transmissible, there is currently insufficient evidence to determine if this strain is associated with any change in disease severity, antibody response or vaccine efficacy. These aspects are being investigated. MOH will evaluate the data as it emerges and review our border measures accordingly.</p><p><p><strong>Regular Review of Border Measures</strong></p><p>5.&nbsp; As the global situation evolves, we will continue to adjust our border measures to manage the risk of importation and transmission to the community. Any changes to border measures will be updated on the <a href=\"https://safetravel.ica.gov.sg\" title=\"\" class=\"\" target=\"\">SafeTravel website</a>. Travellers are advised to visit the website to check for the most updated border measures before entering Singapore and be prepared to be subjected to the prevailing border measures upon entry, including payment for their stay at dedicated SHN facilities, tests and treatment.</p></p><p><p>6.&nbsp; &nbsp;All travellers are reminded to accurately declare their travel history. Strict enforcement actions will be taken against false declarations.</p></p> <p>&nbsp;</p> <div> <p><strong>MINISTRY OF HEALTH<br></strong><strong>1 JANUARY 2021</strong></p> </div> <div><br clear=\"all\"> <hr align=\"left\" size=\"1\" width=\"33%\"> <div id=\"ftn1\"> <p>[1] To expedite the COVID-19 PCR test at the airport, travellers are strongly encouraged to register and pre-pay for their on-arrival COVID-19 PCR test prior to departing for Singapore at https:\\\\safetravel.changiairport.com/</p> </div> </div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "updates-on-border-measures-for-travellers-from-south-africa", "CurrentPageUrl": null}, {"Title": "3 New Cases of Locally Transmitted Covid-19 Infection ", "PublishedDate": "/Date(1609487100000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "01 Jan 2021", "Summary": "", "MainContent": "<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; As of 1 January 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 3 new cases of locally transmitted COVID-19 infection. Based on our investigations so far, the cases are in the community, and there are no new cases in the dormitories. Of these, 1 is a family member of Case 58817<sup>[1]</sup>, and 1 is a close contact of Cases 58810<sup>[2]</sup> and 58843<sup>[3]</sup>.</p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In addition, there are 27 imported cases, who had already been placed on Stay-Home Notice upon arrival in Singapore. Amongst them, 5 are Singaporeans or Singapore Permanent Residents, and 14 are foreign domestic workers. </p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In total, there are 30 new cases of COVID-19 infection in Singapore today.</p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight. </p><p><strong><br>MINISTRY OF HEALTH<br>1 JANUARY 2021</strong></p><p><sup>[1]&nbsp; </sup>Case 58817 is a Singaporean who works as a Harbour Pilot. He was reported in MOH’s press release on 31 December 2020.<br><sup>[2]</sup>&nbsp; Case 58810 is a Singapore Permanent Resident who works as a Marine Surveyor. He was reported in MOH’s press release on 30 December 2020. <br><sup>[3]&nbsp; </sup>Case 58843 had been identified as a close contact of Case 58810 on 29 December, and was placed on quarantine on 30 December. She was reported in MOH’s press release on 31 December 2020.</p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "3-new-cases-of-locally-transmitted-covid-19-infection_1Jan", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}