{"pressItemDictionary": {"Press Releases": [{"Title": "16 New Cases of Locally Transmitted Covid-19 Infection ", "PublishedDate": "/Date(1619711940000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "29 Apr 2021", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; As of 29 April 2021, 12pm, the Ministry of Health (MOH) has confirmed and verified that there are 16 new cases of locally transmitted COVID-19 infection. The cases are in the community, and there are no new cases in the dormitories. There are 19 imported cases, who had already been placed on Stay-Home Notice (SHN) upon arrival in Singapore. Amongst the new cases today, 28 are asymptomatic, and were detected from our proactive screening and surveillance, while 7 were symptomatic.&nbsp;<br><br><strong>Summary of new cases</strong></p> <table border=\"1\" cellspacing=\"0\" cellpadding=\"0\" width=\"605\"> <tbody><tr> <td width=\"129\"> <p align=\"right\">&nbsp;</p> </td> <td width=\"60\"> <p>&nbsp;</p> </td> <td width=\"16\" valign=\"top\"> <p>&nbsp;</p> </td> <td width=\"192\" colspan=\"2\"> <p align=\"center\"><strong>Breakdown by</strong></p> </td> <td width=\"16\" valign=\"top\"> <p>&nbsp;</p> </td> <td width=\"192\" colspan=\"2\"> <p align=\"center\"><strong>Breakdown by</strong></p> </td> </tr> <tr> <td width=\"129\"> <p align=\"right\">&nbsp;</p> </td> <td width=\"60\"> <p><strong>Number of cases</strong></p> </td> <td width=\"16\" valign=\"top\"> <p>&nbsp;</p> </td> <td width=\"96\"> <p><strong>Already in quarantine/ isolation before detection</strong></p> </td> <td width=\"96\"> <p><strong>Detected from surveillance</strong></p> </td> <td width=\"16\" valign=\"top\"> <p>&nbsp;</p> </td> <td width=\"96\"> <p><strong>Symptomatic</strong></p> </td> <td width=\"96\"> <p><strong>Asymptomatic</strong></p> </td> </tr> <tr> <td width=\"129\"> <p><strong>Cases in the community</strong></p> </td> <td width=\"60\"> <p align=\"center\">16</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">7</p> </td> <td width=\"96\"> <p align=\"center\">9</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">7</p> </td> <td width=\"96\"> <p align=\"center\">9</p> </td> </tr> <tr> <td width=\"129\"> <p><strong>Cases residing in dormitories</strong></p> </td> <td width=\"60\"> <p align=\"center\">0</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">0</p> </td> <td width=\"96\"> <p align=\"center\">0</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">0</p> </td> <td width=\"96\"> <p align=\"center\">0</p> </td> </tr> <tr> <td width=\"129\"> <p><strong>Imported cases</strong></p> </td> <td width=\"60\"> <p align=\"center\">19</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">19</p> </td> <td width=\"96\"> <p align=\"center\">0</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">0</p> </td> <td width=\"96\"> <p align=\"center\">19</p> </td> </tr> <tr> <td width=\"129\"> <p><strong>Total</strong></p> </td> <td width=\"60\"> <p align=\"center\">35</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">&nbsp;</p> </td> </tr> </tbody></table> <p><br>2.&nbsp; &nbsp;Overall, the number of new cases in the community has increased from 10 cases in the week before to 28 cases in the past week. The number of unlinked cases in the community has also increased from 5 cases in the week before to 7 cases in the past week.&nbsp;We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme. <br><br>3.&nbsp; &nbsp;Amongst the 217 confirmed cases reported from 23 April to 29 April, 86 cases have tested positive for their serology tests, 94 have tested negative, and 37 serology test results are pending.</p><p><p><strong>Case Details</strong></p><p><strong>a) Cases in the community: 16</strong></p><p>There are 16 cases in the community today, of whom 15 are linked to previous cases and 1 is currently unlinked.</p><p><u>Case 62553</u></p><p>Case 62553 is a 39 year-old female Vietnam national who works as a cleaner employed by Octo Jet Building Maintenance Services Pte Ltd, and deployed at a community care facility at Tuas South. At work, she dons full personal protection equipment (PPE), including N95 mask, face shield, gown and gloves. She also periodically helps out at a food stall at The Summit located at the National University of Singapore’s Bukit Timah campus. </p><p>She is asymptomatic, and was detected when she was tested on 26 April as part of Rostered Routine Testing (RRT). Her pooled test result came back positive for COVID-19 the next day, and she was conveyed in an ambulance to the National Centre for Infectious Diseases (NCID). An individual test was done on 27 April, and her test result came back positive for COVID-19 infection. Her earlier tests from RRT – the last being on 14 April – were all negative for COVID-19 infection. Her serology test result has come back positive but we have assessed that this is likely a recent infection.<br></p><p>Case 62553 received her first dose of COVID-19 vaccine on 27 January, and the second dose on 19 February. The COVID-19 vaccine is effective in preventing symptomatic disease for the vast majority of those vaccinated, but it is possible for vaccinated individuals to get infected.</p><p><strong>Case 62541 Cluster</strong></p><p>8 more cases are linked to Case 62541 [1], with a total of 9 cases detected so far in the cluster. Of these, 3 are Tan Tock Seng Hospital (TTSH) staff, and 6 are patients who were warded in Ward 9D. Epidemiological investigations and contact tracing are ongoing. In the meantime, we have put in place precautionary measures to ringfence the cases. </p><p><u>Case 62557</u><br></p><p>Case 62557 is a 30 year-old male Singapore Permanent Resident who is a doctor at TTSH. He had attended to patients in Ward 9D but had not gone to work after onset of symptoms.</p><p>He developed a fever on 27 April and sore throat the next day, and sought medical treatment at a General Practitioner clinic on 27 April, where he was tested for COVID-19. His test result came back positive the next day, and he was conveyed to NCID in an ambulance. His serological test result has come back negative, indicating that this is likely a current infection. Case 62557 received his first dose of COVID-19 vaccine on 18 January, and the second dose on 8 February.</p><p><u>Case 62599</u></p><p>Case 62599 is an 18 year-old female Singaporean who is a healthcare assistant trainee at TTSH, and was deployed at Ward 9D. She is asymptomatic and was detected on 28 April as part of TTSH’s proactive testing of patients and staff in Ward 9D following the confirmation of Case 62541. Her test came back positive for COVID-19 infection on the same day, and she was conveyed to NCID in an ambulance. Her serological test result has come back negative.</p><p><u>Case 62561</u></p><p>Case 62561 is a 57 year-old male Singaporean who is a patient at TTSH, and was initially warded in Ward 7D, before being transferred to Ward 9D.</p><p>He developed a fever on 16 April but did not seek medical treatment. On 18 April, as his fever persisted, and he had developed a runny nose and cough, he sought treatment at TTSH’s emergency department. He was tested for COVID-19 infection and his test result was negative. He was subsequently warded in Ward 7D. On 20 April, he was transferred to Ward 9D. As he had persistent fever, he was reviewed by an infectious diseases physician, and transferred to an isolation ward on 27 April. On 28 April, he tested positive for COVID-19 infection and was transferred to NCID. His serological test result has come back negative.</p><p><u>Cases 62567, 62568, 62573, 62574 and 62582</u></p><p>Cases 62567, 62568, 62573, 62574 and 62582 are patients warded at TTSH’s Ward 9D, and were detected as part of TTSH’s proactive testing of patients in Ward 9D. Amongst them, 3 are asymptomatic, while Cases 62567 and 62568 developed fever and/or acute respiratory infection (ARI) symptoms on 25 April and 28 April respectively.</p><p><u>Lockdown of TTSH wards and other precautionary measures.&nbsp;</u></p><p>TTSH has locked down both Ward 7D and Ward 9D. Testing for staff and patients who have been in both wards is still in progress. All close contacts of the cases, including patients, visitors and staff who have been in the affected wards, will also be placed on quarantine.</p><p>TTSH has stepped up clinical surveillance of all inpatients who may develop fever and ARI symptoms. As a precautionary measure, all patients and staff in other TTSH wards will also be tested for COVID-19 infection, including those who are asymptomatic. This additional testing will enable us to draw out any hidden links. Our strategy is to aggressively test and draw a wide ring around the cases, to try and prevent further spread.</p><p>TTSH has also taken additional steps to minimise the risks of transmission. Staff and patient movement in all the main wards has been minimised to prevent any cross-infection. From 29 April, no visitors will be allowed into the hospital except for critically ill patients. During this period, elective cases will be deferred except for those that are urgent, and A&amp;E cases that are non-life-threatening will be redirected to other hospitals.</p><p><strong>Case 62517 Cluster</strong></p><p>7 more cases are linked to the Case 62517 [2]&nbsp;cluster. They are all family members of the case, and had already been placed on quarantine earlier. All 8 had gathered for a meal on 25 April, where transmission was likely to have taken place.</p><p><u>Case 62571</u></p><p>Case 62571 is a 39 year-old male Singaporean who works as a security officer at ION Orchard, and private hire car driver. His last day at work was 27 April. He is a family member of Case 62517, and had interacted with him over dinner on 25 April.</p><p>As he had been identified as a close contact of 62517, he was placed on quarantine on 27 April. He developed a cough on 28 April but did not report his symptom. On the same day, he was tested for COVID-19 during quarantine and his test result came back positive for COVID-19 infection.&nbsp;&nbsp;</p><p><u>Case 62572</u></p><p>Case 62572 is a 3 year-old male Singaporean who last attended school on 22 April. &nbsp;He is the nephew of Case 62517, and had interacted with him on 25 April. As he had been identified as a close contact of 62517, he was placed on quarantine on 27 April. He developed a fever on 28 April and his parents reported his symptom. On the same day, he was tested for COVID-19 during quarantine and his test result came back positive. He was conveyed in an ambulance to the National University Hospital on 29 April.</p><p><u>Case 62576</u></p><p>Case 62576 is a 33 year-old female Singaporean who is a housewife. She is a family member of Case 62517, and had interacted with him over dinner on 25 April. As she had been identified as a close contact of 62517, she was placed on quarantine on 27 April. She is asymptomatic, but was tested for COVID-19 during quarantine and her test result came back positive.&nbsp;</p><p><u>Case 62583</u></p><p>Case 62583 is a 32 year-old female Singaporean who works as a nurse at TTSH. She is the spouse of Case 62517. As she had been identified as his close contact, she was placed on quarantine on 28 April. She is asymptomatic, but was tested for COVID-19 during quarantine and her test result came back positive. She does not work in Ward 9D or Ward 7D. Based on our epidemiological investigation, there is no link between Case 62583 and the TTSH cluster. However, the testing of all staff in TTSH wards will serve as an additional check on this.</p><p><u>Case 62594</u></p><p>Case 62594 is a 72 year-old male Singaporean who is a retiree. He is the parent of Case 62517, and lives in the same household as him. As he had been identified as his close contact, he was placed on quarantine on 27 April. He is asymptomatic, but was tested for COVID-19 during quarantine and his test result came back positive.</p><p><u>Case 62595</u></p><p>Case 62595 is a 65 year-old male Singaporean who works as a telephone operator at Goodwood Park Hotel. His last day of work was 27 April. He is a family member of Case 62517, and had interacted with him over dinner on 25 April. As he had been identified as a close contact of 62517, he was placed on quarantine on 27 April. He is asymptomatic, but was tested for COVID-19 during quarantine and his test result came back positive.&nbsp;</p><p><u>Case 62597</u></p><p>Case 62597 is a 25 year-old male Singaporean who works as a technical officer at SP PowerGrid. He is a family member of Case 62517, and had interacted with him over dinner on 25 April. As he had been identified as a close contact of 62517, he was placed on quarantine on 27 April. He developed a cough and body aches on 28 April. On the same day, he was tested for COVID-19 during quarantine and his test result came back positive the next day.</p><p><strong>b)&nbsp;Cases residing in dormitories: 0</strong></p><p>There are no cases residing in dormitories today. </p><p><strong>c) Imported cases: 19</strong></p></p><p><p>Amongst the 19 imported cases,</p><ul><li>2 (Cases 62558 and 62596) are Singaporeans and 9 (Cases 62559, 62560, 62580, 62586, 62587, 62588, 62589, 62590 and 62593) are Singapore Permanent Residents who returned from India and South Korea.</li><li>3 (Cases 62563, 62564 and 62565) are Dependant’s Pass holders who arrived from India and Sri Lanka.</li><li>5 are Work Permit holders who arrived from Bangladesh, India, Indonesia and the Philippines, of whom 1 (Case 62581) is a foreign domestic worker. <br></li></ul></p><p><p>They had all already been placed on SHN upon arrival in Singapore and were tested while serving SHN. </p><p>4.&nbsp; Please refer to the <a href=\"/docs/librariesprovider5/default-document-library/annexes4bea7b00b71d45f3a852360608fbf5d0.pdf?sfvrsn=caf73e23_0\" title=\"Annexes\">Annexes</a>&nbsp;and MOH’s daily Situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\">www.moh.gov.sg/covid-19/situation-report</a>) for details.</p></p><p><p>5.&nbsp;<b> &nbsp;</b>Epidemiological investigations are ongoing. In the meantime, all the identified close contacts of the cases have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for the close contacts to determine if the cases could have been infected by them.</p></p><p><p><strong></strong><strong>Update on condition of confirmed cases</strong></p><p>6.&nbsp; &nbsp;20 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 60,738 have fully recovered from the infection and have been discharged from hospitals or community care facilities.</p></p><p><p>7.&nbsp; &nbsp;There are currently 110 confirmed cases who are still in hospital. Of these, most are stable or improving, and none is in the intensive care unit. 243 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 30 have passed away from complications due to COVID-19 infection.</p></p> <p>&nbsp;</p> <div> <p><strong>MINISTRY OF HEALTH<br></strong><strong>29 APRIL 2021</strong></p> </div> <div><br clear=\"all\"> <hr align=\"left\" size=\"1\" width=\"33%\"> <div id=\"ftn1\"> <p>[1] Case 62541 is a 46 year-old female Philippines national who is a nurse at Tan Tock Seng Hospital, and is deployed at Ward 9D. She was confirmed to have COVID-19 infection on 27 April. There are 9 cases in total linked to TTSH so far. </p> </div> <div id=\"ftn2\"> <p>[2] Case 62517 is a 38 year-old male Singaporean who works as an Immigration &amp; Checkpoints Authority Officer deployed at Changi Airport Terminal 1. He was confirmed to have COVID-19 infection on 27 April. </p> </div> </div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "16-new-cases-of-locally-transmitted-covid-19-infection30aprfullpr", "CurrentPageUrl": null}, {"Title": "16 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1619685000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "29 Apr 2021", "Summary": "", "MainContent": "&nbsp; &nbsp;As of 29 April 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 16 new cases of locally transmitted COVID-19 infection. Based on our investigations so far, the cases are in the community, and there are no new cases in the dormitories. Amongst them, 7 are family members of Case 62517 [1], and had &nbsp;already been placed on quarantine earlier. 8 are linked to Case 62541 [2], and were detected from our proactive testing of patients and staff in the affected ward. <br><br>2.&nbsp; &nbsp; In addition, there are 19 imported cases, who had already been placed on Stay-Home Notice upon arrival in Singapore. In total, there are 35 new cases of COVID-19 infection in Singapore today. <br><br>3.&nbsp; &nbsp; Following the detection of Case 62541, Tan Tock Seng Hospital (TTSH) has locked down Ward 9D, and tested the patients who had been in the ward. As a precautionary measure, all staff working in TTSH wards will also be tested for COVID-19 infection. All close contacts of the cases, including patients, visitors and staff who had been in Ward 9D, will be placed on quarantine. Visitors will not be allowed into the hospital wards while investigations are ongoing. <br><br>4.&nbsp; &nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.<p>&nbsp;</p> <p>&nbsp;</p> <div> <p><strong>MINISTRY OF HEALTH<br></strong><strong>29 APRIL 2021</strong></p> </div> <div><br clear=\"all\"> <hr align=\"left\" size=\"1\" width=\"33%\"> <div id=\"ftn1\"> <p>[1] Case 62517 is a 38 year-old male Singaporean who works as an Immigration &amp; Checkpoints Authority Officer deployed at Changi Airport Terminal 1. He was confirmed to have COVID-19 infection on 27 April. </p> </div> <div id=\"ftn2\"> <p>[2] Case 62541 is a 46 year-old female Philippines national who is a nurse at Tan Tock Seng Hospital, and is deployed at Ward 9D. She was confirmed to have COVID-19 infection on 27 April. There are 9 cases in total linked to TTSH so far. </p> </div> </div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "16-new-cases-of-locally-transmitted-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}