{"pressItemDictionary": {"Press Releases": [{"Title": "10 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1620570900000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "09 May 2021", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;As of 9 May 2021, 12pm, the Ministry of Health (MOH) has confirmed and verified that there are 10 new cases of locally transmitted COVID-19 infection, of whom 7 are linked to previous cases. The cases are in the community, and there are no new cases in the dormitories. There are 18 imported cases, who had already been placed on Stay-Home Notice (SHN) or isolated upon arrival in Singapore. Amongst the new cases today, 18 are asymptomatic, and were detected from our proactive screening and surveillance, while 10 were symptomatic.&nbsp;</p><p><strong>Summary of new cases</strong></p><table border=\"1\" cellspacing=\"0\" cellpadding=\"0\" width=\"453\"><tbody><tr><td width=\"97\"><p align=\"right\">&nbsp;</p></td><td width=\"45\"><p>&nbsp;</p></td><td width=\"12\" valign=\"top\"><p>&nbsp;</p></td><td width=\"144\" colspan=\"2\"><p align=\"center\"><strong>Breakdown by</strong></p></td><td width=\"12\" valign=\"top\"><p>&nbsp;</p></td><td width=\"144\" colspan=\"2\"><p align=\"center\"><strong>Breakdown by</strong></p></td></tr><tr><td width=\"97\"><p align=\"right\">&nbsp;</p></td><td width=\"45\"><p><strong>Number of cases</strong></p></td><td width=\"12\" valign=\"top\"><p>&nbsp;</p></td><td width=\"72\"><p><strong>Already in quarantine/ isolation before detection</strong></p></td><td width=\"72\"><p><strong>Detected from surveillance</strong></p></td><td width=\"12\" valign=\"top\"><p>&nbsp;</p></td><td width=\"72\"><p><strong>Symptomatic</strong></p></td><td width=\"72\"><p><strong>Asymptomatic</strong></p></td></tr><tr><td width=\"97\"><p><strong>Cases in the community</strong></p></td><td width=\"45\"><p align=\"center\">10</p></td><td width=\"12\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"72\"><p align=\"center\">3</p></td><td width=\"72\"><p align=\"center\">7</p></td><td width=\"12\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"72\"><p align=\"center\">9</p></td><td width=\"72\"><p align=\"center\">1</p></td></tr><tr><td width=\"97\"><p><strong>Cases residing in dormitories</strong></p></td><td width=\"45\"><p align=\"center\">0</p></td><td width=\"12\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"72\"><p align=\"center\">0</p></td><td width=\"72\"><p align=\"center\">0</p></td><td width=\"12\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"72\"><p align=\"center\">0</p></td><td width=\"72\"><p align=\"center\">0</p></td></tr><tr><td width=\"97\"><p><strong>Imported cases</strong></p></td><td width=\"45\"><p align=\"center\">18</p></td><td width=\"12\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"72\"><p align=\"center\">18</p></td><td width=\"72\"><p align=\"center\">0</p></td><td width=\"12\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"72\"><p align=\"center\">1</p></td><td width=\"72\"><p align=\"center\">17</p></td></tr><tr><td width=\"97\"><p><strong>Total</strong></p></td><td width=\"45\"><p align=\"center\">28</p></td><td width=\"12\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"72\"><p align=\"center\">&nbsp;</p></td><td width=\"72\"><p align=\"center\">&nbsp;</p></td><td width=\"12\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"72\"><p align=\"center\">&nbsp;</p></td><td width=\"72\"><p align=\"center\">&nbsp;</p></td></tr></tbody></table><p>&nbsp;</p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Overall, the number of new cases in the community has decreased from 50 cases in the week before to 39 cases in the past week. The number of unlinked cases in the community has increased from 10 cases in the week before to 13 cases in the past week.&nbsp;We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.</p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Amongst the 141 confirmed cases reported from 3 May to 9 May, 55 cases have tested positive for their serology tests, 62 have tested negative, and 24 serology test results are pending.</p><p><strong>Case Details</strong></p><p><strong>a)&nbsp;&nbsp;&nbsp; </strong><strong>Cases in the community: 10</strong></p><p>There are 10 cases in the community today, of whom 7 are linked to previous cases and 3 are currently unlinked.</p><p><u>Case 62969</u></p><p>Case 62969 is a 38 year-old male Singaporean who works as a private hire car driver with Grab. He had not worked since onset of symptoms.</p><p>He developed a fever and cough on 7 May, and sought medical treatment at a General Practitioner clinic on the same day, where he was tested for COVID-19. His test result came back positive the next day, and he was conveyed in an ambulance to Alexandra Hospital. His serological test result is negative. He has tested preliminarily positive for the B1617 variant, and is pending further confirmatory tests.</p><p>Case 62969 resides with his girlfriend who is a Short-Term Visit Pass holder. She arrived from Vietnam on 12 April, and served SHN at a dedicated facility until 26 April. Her test taken during SHN on 25 April was negative for COVID-19 infection.</p><p><u>Case 62998</u></p><p>Case 62998 is a 40 year-old female Singaporean who works as a risk assessment personnel at Lendlease Pte Ltd. She has been working from home since 30 April.</p><p>She developed a fever on 7 May, and sought medical treatment at a General Practitioner clinic on the same day, and was tested for COVID-19. Her test result came back positive the next day, and she was conveyed in an ambulance to Khoo Teck Puat Hospital. Her serological test result is negative. She has tested preliminarily positive for the B1617 variant, and is pending further confirmatory tests.</p><p><u>Case 63005</u></p><p>Case 63005 is a 47 year-old male Singaporean who works as a landscaper at NParks. He usually works off-site and occasionally goes back to the office, but had not gone to work after onset of symptoms.</p><p>He developed a fever on 6 May night, and sought medical treatment at a General Practitioner clinic the next day, where he was tested for COVID-19. His test result came back positive on 8 May, and he was conveyed in an ambulance to Sengkang General Hospital. His serology test result is negative for the N antigen, which suggests the presence of early infection. Case 63005 received his first dose of COVID-19 vaccine on 23 April and has not received his second dose.</p><p><u></u><strong>Case 62873 cluster</strong></p><p><u>Case 62971</u></p><p>Case 62971 is a 51 year-old female Work Permit holder who is employed by Ramky Cleantech Services Pte Ltd as a cleaner deployed at Changi Airport Terminal 3. She had last gone to work on 3 May. She is a colleague of Case 62873[1].</p><p>She was tested on 5 May as part of RRT but her pooled test result came back inconclusive, and she was tested again on 7 May. On the same day, as she had been identified as a colleague of Case 62873, she was contacted by MOH and placed on phone surveillance. That night, she developed a cough and headache. On 8 May, she sought medical treatment at a polyclinic. Her test result came back positive for COVID-19 infection on the same day, and she was conveyed in an ambulance to Gleneagles Hospital. Her earlier tests from RRT – the last being on 21 April – were all negative for COVID-19 infection. Her serology test result is negative. She has tested preliminarily positive for the B1617 variant, and is pending further confirmatory tests.</p><p><u>Case 62972</u></p><p>Case 62972 is a 57 year-old male Singaporean who is employed by Certis Cisco as an Aviation Security Officer at Changi Airport Terminal 3. His job entails maintaining crowd control and checking of travellers’ documents. He had not gone to work since onset of symptoms.</p><p>He developed a cough on 7 May and sought medical treatment at a General Practitioner clinic on the same day, where he was tested for COVID-19. His test result came back positive the next day, and he was conveyed in an ambulance to Alexandra Hospital. His earlier tests from RRT – the last being on 2 May – were all negative for COVID-19 infection. His serological test result is negative. He has tested preliminarily positive for the B1617 variant, and is pending further confirmatory tests. Case 62972 received his first dose of COVID-19 vaccine on 15 February, and the second dose on 8 March.</p><p><u></u><u>Case 63015</u></p><p>Case 63015 is a 63 year-old male Singaporean who is employed by Ramky Cleantech Services Pte Ltd as a trolley handler and cleaner deployed at Changi Airport Terminal 3. He is a colleague of Case 62873.</p><p>He developed a sore throat on 3 May and cough on 6 May but did not seek medical treatment. On 8 May, he developed a runny nose and sought medical treatment at a General Practitioner clinic, where he was tested for COVID-19. As he had been identified as a colleague of Case 62873, he was contacted by MOH and placed on quarantine on the same day. He reported his symptoms, and was conveyed to a hospital for assessment. His test result came back positive for COVID-19 infection on 9 May and he was conveyed in an ambulance to Sengkang General Hospital.&nbsp; His earlier tests from RRT – the last being on 12 April – were all negative for COVID-19 infection. His serology test result is pending. Case 63015 received his first dose of COVID-19 vaccine on 22 January, and the second dose on 15 February.</p><p><u>Case 63026</u></p><p>Case 63026 is a 66 year-old male Singaporean who works as a SATS passenger escort at Changi Airport Terminal 3.</p><p>He developed a runny nose and sore throat on 8 May and sought medical treatment at a General Practitioner clinic on the same day, where he was tested for COVID-19. His test result came back positive the next day. His serological test result is pending. Case 63026 received his first dose of COVID-19 vaccine on 29 January, and the second dose on 19 February.</p><p><u>Additional Precautionary Measures at Changi Airport</u></p><p>In view of the recent cases detected at Changi Airport Terminal 1 and Terminal 3, MOH has commenced a special COVID-19 testing operations for all workers in Changi Airport Terminals 1 and 3, as well as Jewel Changi Airport. As an added precautionary measure, Changi Airport Terminal 3 Basement 2 will be closed to the public temporarily with effect from 10 May.</p><p>Members of the public who had visited Changi Airport Terminal 3 on 3 May are advised to monitor their health closely for 14 days from their date of visit. To pre-emptively mitigate any potential risk of wider, undetected community transmission, we will offer free COVID-19 testing for these individuals. They are strongly encouraged to visit a Regional Screening Centre or “Swab and Send Home” (SASH) Public Health Preparedness Clinic from 10 May to 16 May for a free swab test. MOH will progressively inform these individuals via SMS notification from 10 May, with information on how to book an appointment for their test.</p><p><strong>Case 62541</strong>[2]<strong>&nbsp;Cluster</strong></p><p><u>Case 63007</u></p><p>Case 63007 is a 52 year-old male Singaporean who had been warded in Tan Tock Seng Hospital (TTSH) Ward 9D from 10 April, and was transferred to the National Centre for Infectious Diseases (NCID) on 29 April. He was discharged on 2 May, and placed on quarantine until 12 May. He was tested for COVID-19 on 28 April and again on 30 April, and both results were negative. He developed a cough on 7 May, and reported his symptom to MOH. He was conveyed to Alexandra Hospital in an ambulance and tested for COVID-19 again on 8 May. His test came back positive on the same day and he was transferred to NCID. His serology test result is negative.</p><p><u>Case 63008</u></p><p>Case 63008 is a 90 year-old male Singaporean who had been warded in TTSH Ward 9D from 23 April, and was transferred to NCID on 28 April. He was tested for COVID-19 on 28 April, and daily between 1 May and 7 May, and all his test results were negative. On 8 May, he was tested again for COVID-19 even though he is asymptomatic, and his result came back positive this time. His serology test result is negative.</p><p><u>Case 63009</u></p><p>Case 63009 is a 78 year-old female Singaporean who had been warded in TTSH Ward 9D from 20 April, and was discharged on 25 April. She was placed on quarantine until 9 May. She was tested for COVID-19 on 30 April during quarantine and her test was negative. On 8 May, she developed a cough and runny nose and reported her symptoms to MOH. She was tested again and her test came back positive for COVID-19 infection on the same day and she was transferred to NCID. Her serology test result is pending.</p><p><strong>b)&nbsp;&nbsp;&nbsp; </strong><strong>Cases residing in dormitories: 0</strong></p><p>There are no cases residing in dormitories today.</p><p><strong>c)&nbsp;&nbsp;&nbsp; </strong><strong>Imported cases: 18</strong></p><p>Amongst the 18 imported cases,</p><ul><li>1 (Case 63016) is a Singaporean and 10 (Cases 62996, 62999, 63000, 63001, 63003, 63004, 63017, 63019, 63020 and 63021) are Singapore Permanent Residents who returned from India, Indonesia and Yemen.</li><li>1 (Case 62997) is a Work Pass holder who arrived from Malaysia.</li><li>4 are Work Permit holders who arrived from Indonesia, all of whom (Cases 62983, 62985, 62986 and 62990) are foreign domestic workers.</li><li>1 (Case 63002) is a Short-Term Visit Pass holder who arrived from Indonesia, and has a family member who is a Singaporean.</li><li>1 (Case 63011) is a Special Pass holder who is a sea crew. He arrived from Malaysia on a vessel and was tested onboard without disembarking.</li></ul><p>They had all already been placed on SHN or isolated upon arrival in Singapore and were tested while serving SHN or during isolation.</p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Please refer to the <a href=\"/docs/librariesprovider5/default-document-library/annexes-(9-may)bc20262396404a4fa0e42f975723ac7a.pdf?sfvrsn=5606c16_0\" title=\"Annexes \">Annexes </a>&nbsp;and MOH’s daily Situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\">www.moh.gov.sg/covid-19/situation-report</a>) for details.</p><p>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Epidemiological investigations are in progress. In the meantime, all the identified close contacts of the cases have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for the close contacts to determine if the cases could have been infected by them.</p><p><strong></strong><strong>Update on condition of confirmed cases</strong></p><p>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 21 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 60,933 have fully recovered from the infection and have been discharged from hospitals or community care facilities.</p><p>7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; There are currently 133 confirmed cases who are still in hospital. Of these, most are stable or improving, and 2 are in critical condition in the intensive care unit. 262 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 31 have passed away from complications due to COVID-19 infection.</p><div><hr align=\"left\" size=\"1\" width=\"33%\"><div id=\"ftn1\"><p>[1] Case 62873 is an 88 year-old male Singaporean who is employed by Ramky Cleantech Services Pte Ltd as a cleaner deployed at Changi Airport Terminal 3. He was confirmed to have COVID-19 infection on 5 May.</p></div><div id=\"ftn2\"><p>[2] Case 62541 is a 46 year-old nurse at Tan Tock Seng Hospital (TTSH), and is deployed at Ward 9D. She was confirmed to have COVID-19 infection on 27 April.</p></div></div><p>&nbsp;</p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "10-new-cases-of-locally-transmitted-covid-19-infection-9-may-update", "CurrentPageUrl": null}, {"Title": "10 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1620547200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "09 May 2021", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As of 9 May 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 10 new cases of locally transmitted COVID-19 infection, of whom 5 are linked to previous cases, and had already been placed on quarantine or were detected from our proactive testing. Based on our investigations so far, the cases are in the community, and there are no new cases in the dormitories.</p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In addition, there are 18 imported cases, who had already been placed on Stay-Home Notice or isolated upon arrival in Singapore. Amongst them, 11 are Singaporeans or Singapore Permanent Residents.</p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In total, there are 28 new cases of COVID-19 infection in Singapore today.</p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.</p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "10-new-cases-of-locally-transmitted-covid-19-infection-9-may", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}