{"pressItemDictionary": {"Press Releases": [{"Title": "Appointment of New Chairmen for Singapore Health Services and National Healthcare Group ", "PublishedDate": "/Date(1624615200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "25 Jun 2021", "Summary": "", "MainContent": "<p style=\"margin-bottom: 0cm; text-align: justify;\"><span style=\"font-size: 12pt; font-family: Arial;\">&nbsp; &nbsp; &nbsp; &nbsp;The Minister for Health has appointed Mr Cheng Wai Keung as the Chairman of the Board of Singapore Health Services (SingHealth) from 1 July 2021 to 30 June 2024, and Mr Tan Tee How as the Chairman of the Board of National Healthcare Group (NHG) from 15 April 2021 to 14 April 2024.&nbsp;</span></p><p style=\"margin-bottom: 0cm; margin-left: 0cm; text-align: justify;\"><span style=\"font-size: 12pt; font-family: Arial;\">&nbsp;</span></p><p style=\"margin-bottom: 0cm; text-align: justify;\"><span style=\"font-family: Arial;\"><strong><span style=\"font-size: 12pt;\">New Chairman, Mr Cheng Wai Keung, SingHealth</span></strong></span></p><p style=\"margin-bottom: 0cm; text-align: justify;\"><span style=\"font-family: Arial;\"><strong><span style=\"font-size: 12pt;\"><br></span></strong><span style=\"font-size: 12pt;\">2. </span><strong><span style=\"font-size: 12pt;\">&nbsp; &nbsp;&nbsp;</span></strong></span><span style=\"font-family: Arial; font-size: 12pt;\">Mr Cheng Wai Keung is the Chairman and Managing Director of Wing Tai Holdings Ltd and has been a member of the SingHealth Board since 1 August 2013. Mr Cheng is an accomplished business leader with vast experience across various sectors. He also serves on various private and public sector Boards including as Deputy Chairman of Temasek Holdings (Pte) Ltd and the Vice-Chairman of the Singapore-Suzhou Township Development Pte Ltd, amongst others. &nbsp;<br><br>3. &nbsp; &nbsp; &nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 12pt;\">As Chairman of SingHealth, Mr Cheng will helm the cluster’s drive to enhance&nbsp;&nbsp;&nbsp;clinical outcomes through research, innovation and education and to provide value-driven care to patients. He will lead SingHealth in its continued focus on providing a continuum of care that is holistic and integrated, while advancing new models of care that are patient-centric, with an emphasis on population health. He will play a pivotal role in leading SingHealth through key infrastructure projects such as the redevelopment of the SGH Campus, and the new Eastern General and Community Hospitals, to ensure their timely completion. With his wealth of expertise in business and management, SingHealth is set to deepen strategic partnerships and collaborations to advance key priority areas, anchored by a robust corporate governance framework.&nbsp;<br><br></span><strong style=\"font-family: Arial;\"><span style=\"font-size: 12pt;\">New Chairman, Mr Tan Tee How, NHG<br><br></span></strong><span style=\"font-family: Arial;\"><span style=\"font-size: 12pt;\">4.</span></span><strong style=\"font-family: Arial;\"><span style=\"font-size: 12pt;\">&nbsp; &nbsp; &nbsp;&nbsp;</span></strong><span style=\"font-family: Arial; font-size: 12pt;\">Mr Tan Tee How has been Deputy Chairman of the NHG Board since 1 April 2019, and was NHG’s founding Group Chief Executive Officer from 2000 to 2003. With 34 years in the Singapore Administrative Service, Mr Tan will be bringing his extensive expertise in leading public entities to NHG, having held several key appointments during his career, including the Commissioner of Inland Revenue and CEO of the Inland Revenue Authority of Singapore, Permanent Secretary at the Ministry of National Development, and Permanent Secretary at the Ministry of Home Affairs. &nbsp;<br><br>5. &nbsp; &nbsp; &nbsp;&nbsp;</span><span style=\"font-family: Arial; font-size: 12pt;\">As Chairman of NHG, Mr Tan will be advancing NHG’s population health efforts for over two million residents in the central region and scaling up NHG’s integrated ecosystem of care. He will accelerate transformational collaborations with local and global partners to achieve NHG’s vision of&nbsp;</span><em style=\"font-family: Arial; font-size: 12pt;\">“Adding Years of Healthy Life”</em><span style=\"font-family: Arial; font-size: 12pt;\">. Furthermore, he will drive the Institute of Mental Health’s rollout of mental health initiatives to increase capabilities and capacities in psychological and social cohesion, and resilience in Singapore. Mr Tan will also encourage translational growth in innovation, research and education with the Lee Kong Chian School of Medicine with NHG as its primary clinical training partner. In addition, Mr Tan will lead NHG through its critical role in partnering the Ministry of Health to strengthen Singapore’s pandemic preparedness and resilience, with the National Centre for Infectious Diseases (NCID) at the forefront of our COVID-19 response.&nbsp;</span></p><p style=\"text-align: justify;\"><p><span style=\"font-size: 12pt; font-family: Arial;\"><br></span><strong style=\"font-family: Arial;\"><span style=\"font-size: 12pt;\">Outgoing Chairmen<br><br></span></strong><span style=\"font-family: Arial;\"><span style=\"font-size: 12pt;\">6. &nbsp; &nbsp; &nbsp; &nbsp;</span></span><span style=\"font-family: Arial; font-size: 12pt;\">MOH wishes to express its appreciation to Mr Peter Seah Lim Huat and Mdm Kay Kuok Oon Kwong who led SingHealth and NHG, respectively, with distinction between 2009 and 2021. Both of them oversaw major transformations in their clusters, including the public healthcare reorganisation exercise in 2017 and the development of their respective Regional Health Systems to integrate care with the primary and community care partners in their respective regions.&nbsp;<br><br>7. &nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 12pt;\">During his time as Chairman of SingHealth, Mr Seah was instrumental in overseeing SingHealth’s development as an Academic Medical Centre. Mr Seah oversaw the opening of SingHealth’s Academia, a purpose-built facility that catalyses research and education. He also led SingHealth in fostering a close partnership with Duke-NUS Medical School to nurture a rich eco-system that harnesses synergies in clinical care, research and education. To date, 15 SingHealth-Duke NUS Academic Clinical Programmes, 13 SingHealth Duke-NUS Disease Centres and academic institutes such as the Academic Medicine Education Institute, the Academic Medicine Research Institute and the Academic Medicine Innovation Institute, have been established. &nbsp;<br><br>8. &nbsp; &nbsp; &nbsp;&nbsp;</span><span style=\"font-family: Arial; font-size: 12pt;\">In addition, Mr Seah also led the cluster through a major expansion, including the transfer of Bright Vision Hospital and Changi General Hospital to SingHealth, and the opening of the Sengkang General and Community Hospitals, Outram Community Hospital, Punggol Polyclinic, and the new National Heart Centre Singapore.&nbsp;<br><br>9. &nbsp; &nbsp; &nbsp; </span><span style=\"font-family: Arial; font-size: 12pt;\">During her tenure, Mdm Kuok played an integral role in NHG’s Care Transformation journey towards population health through its&nbsp;</span><em style=\"font-family: Arial; font-size: 12pt;\">River of Life</em><span style=\"font-family: Arial; font-size: 12pt;\">&nbsp;framework. She oversaw NHG’s efforts in strengthening its primary care and mental health infrastructure and capabilities, including the initiation of the National Mental Health Blueprint in 2006. Under her stewardship, NHG implemented numerous successful care innovations, including the development of three Family Medicine Clinics, NHG Polyclinics’ patient empanelment and the Teamlet care model, tele-health initiatives for chronic disease management, as well as mental health programmes in the community. &nbsp;<br><br>10. &nbsp; &nbsp; &nbsp;&nbsp;</span><span style=\"font-family: Arial; font-size: 12pt;\">Mdm Kuok also oversaw the expansion of institutions managed by NHG, including Khoo Teck Puat Hospital and Yishun Community Hospital following the amalgamation of the former Alexandra Health System with NHG, as well as new developments such as HealthCity Novena, NCID, the Ng Teng Fong Centre for Healthcare Innovation, Woodlands Health Campus, and the new National Skin Centre Campus.&nbsp;<br></span></p></p><p><span style=\"font-size: 16px;\"><span style=\"font-family: Arial;\"><strong><br>MINISTRY OF HEALTH<br></strong><strong>25&nbsp;</strong><strong>JUNE 2021</strong></span></span></p><p style=\"margin-bottom: 0cm; text-align: justify;\"><span style=\"font-size: 12pt; font-family: Arial;\">&nbsp;</span></p><p style=\"margin-bottom: 0cm; text-align: justify;\"><span style=\"font-size: 12pt; font-family: Arial;\">&nbsp;</span></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "appointment-of-new-chairmen-for-singapore-health-services-and-national-healthcare-group_25June2021", "CurrentPageUrl": null}, {"Title": "15 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1624606800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "25 Jun 2021", "Summary": "", "MainContent": "<p><span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As of 25 June 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 15 new cases of locally transmitted COVID-19 infection. 12 are linked to previous cases, amongst whom 4 have already been placed on quarantine, and 8 were detected through surveillance. The remaining 3 cases are currently unlinked. Based on our investigations so far, the cases are in the community, and there are no new cases in the dormitories.</span></p><p><span style=\"font-size: 16px;\">2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In addition, there are 5 imported cases, who have already been placed on Stay-Home Notice or isolated upon arrival in Singapore. Of these, 4 are returning Singaporeans or Singapore Permanent Residents.</span></p><p><span style=\"font-size: 16px;\">3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In total, there are 20 new cases of COVID-19 infection in Singapore today.</span></p><p><span style=\"font-size: 16px;\">4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.</span></p><p><span style=\"font-size: 16px;\"><strong><br>MINISTRY OF HEALTH<br>25 JUNE 2021</strong></span></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "15-new-cases-of-locally-transmitted-covid-19-infection_25Jun", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}