{"pressItemDictionary": {"Press Releases": [{"Title": "Expert Committee On Covid-19 Vaccination Recommends An Additional Dose of Mrna Covid-19 Vaccine for Immunocompromised and Seniors", "PublishedDate": "/Date(1630665000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "03 Sep 2021", "Summary": "", "MainContent": "<span style=\"font-family: Arial; font-size: 16px;\">1. &nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">The Expert Committee on COVID-19 Vaccination (EC19V) has been closely reviewing the data regarding the need for additional vaccine doses and recommends the following:</span><p><p style=\"margin-left: 40px;\"><br><span style=\"font-family: Arial;\"><span style=\"font-size: 16px;\">a. &nbsp; &nbsp;Persons with moderate to severe immunocompromise should receive a third dose of the same Pandemic Special Access Route (PSAR) mRNA vaccine two months after their second dose as part of their primary course of vaccination, and,<br><br>b. &nbsp; &nbsp;Persons aged 60 years and above, as well as residents of aged care facilities should receive a booster dose of a PSAR mRNA vaccine six to nine months after the completion of vaccination with two doses</span></span></p></p><p><strong style=\"font-family: Arial; font-size: 16px;\">Persons with moderate to severe immunocompromise<br><br></strong><span style=\"font-family: Arial; font-size: 16px;\">2. &nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">Immunocompromised persons are at risk of severe COVID-19, and a protective immune response from vaccination will be important to reduce this.&nbsp;<br><br>3. &nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">There is evidence that persons with moderate to severe immunocompromise have a blunted immune response to the two-dose COVID-19 vaccination. Studies have shown that a third dose increases the likelihood that immunocompromised persons develop a robust protective immune response.<br><br>4. &nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">As such, EC19V recommends that persons who are significantly immunocompromised receive a third dose of the same PSAR mRNA vaccine they had received for the first two doses, two months after their second dose.&nbsp;This will include persons with the following conditions:</span></p><p><p style=\"margin-left: 40px;\"><span style=\"font-family: Arial; font-size: 16px;\">a. &nbsp;Transplant patients on medications that suppress the immune system, including solid organ and allogenic stem cell transplants<br>b. &nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">Cancer patients on active treatment with chemotherapy or on other therapies that suppress the immune system<br>c. &nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">Haematological cancers<br>d. &nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">Treatments for non-cancer conditions that suppress the immune system<br>e. &nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">End-stage kidney disease on dialysis<br>f. &nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">Advanced or untreated HIV<br></span></p></p><div><span style=\"font-family: Arial; font-size: 16px;\">5. &nbsp; &nbsp; Persons who are significantly immunocompromised should be referred to receive the third dose by their doctors, who would have the best understanding of their medical condition.</span><br></div><p><strong style=\"font-family: Arial; font-size: 16px;\"><br>Persons aged 60 years and above, as well as residents of aged care facilities</strong></p><p><p><span style=\"font-size: 16px; font-family: Arial;\">6. &nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">Seniors are also at risk of more severe disease with COVID-19 infection, and ensuring a continued high level of immunity is therefore important. Seniors may develop a lower immune response to the initial two doses of vaccines, and immunity has also been observed to decline over time. While COVID-19 vaccination continues to provide a high level of protection against severe disease from infection, there is data that protection against asymptomatic and symptomatic infection can wane over time from the initial vaccination. The current strong protection against severe disease could decrease in the months ahead particularly for those who are at higher risk.&nbsp;&nbsp;A booster dose will increase the level of immunity and ensure that a high level of protection from severe disease is maintained across a longer period.<br><br>7. &nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">As such, EC19V recommends that&nbsp;persons aged 60 years and above, as well as residents of aged care facilities&nbsp;should receive a booster dose of a PSAR mRNA vaccine six to nine months after having completed a vaccination with two doses.<br><br>8. &nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">EC19V encourages immunocompromised persons to receive three doses as part of their primary series vaccination, and for seniors to receive a booster dose six to nine months after their second dose. This will help ensure high levels of protection against COVID-19 infection and severe disease. All other medically eligible persons should complete two doses of PSAR mRNA vaccines if they have not already done so.&nbsp;<br><br></span><strong style=\"font-family: Arial; font-size: 16px;\">EXPERT COMMITTEE ON COVID-19 VACCINATION<br></strong><strong><span style=\"font-size: 16px; font-family: Arial;\">3 SEPTEMBER 2021</span></strong></p></p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "expert-committee-on-covid-19-vaccination-recommends-an-additional-dose-of-mrna-covid-19-vaccine-for-immunocompromised-and-seniors_3Sep2021", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}, {"Title": "Strengthening Our Tools to Achieve Covid Resilience", "PublishedDate": "/Date(1630664100000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "03 Sep 2021", "Summary": "", "MainContent": "<p style=\"text-align: justify;\"><span style=\"font-size: 12pt; font-family: Arial;\">&nbsp; &nbsp; The easing of community measures as we exit Phase 2 (Heightened Alert) has led to an increase in COVID-19 cases, which is not unexpected.&nbsp;&nbsp;Nevertheless, the number of individuals with severe illness requiring oxygen supplementation and ICU remains under control. These point to our heightened COVID resilience – the ability to live with COVID-19 cases amongst us, with sufficient healthcare capacity for those of us who do fall ill. We will continue to strengthen our tools for achieving COVID resilience, by calibrating our safe management measures, testing more extensively and contact tracing more surgically to reduce and identify infections early. We will also begin transiting towards the next phase of our National Vaccination Programme by commencing a booster programme in September 2021.&nbsp;</span></p><p style=\"text-align: justify;\"><span style=\"font-size: 12pt; font-family: Arial;\"></span><strong style=\"font-family: Arial;\"><span style=\"font-size: 12pt;\">Updates on Local COVID-19 Situation</span></strong></p><p><span style=\"font-size: 12pt; font-family: Arial;\">2. &nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 12pt;\">While COVID-19 case numbers have increased recently, the high vaccination coverage in our population has allowed us to keep the incidences of severe illnesses and deaths low thus far. This is particularly important for those who are vulnerable to COVID-19, such as our seniors. We will need to monitor the situation closely, as there is a time lag between the onset of infections to serious illnesses and deaths. In the meantime, we will stay in the current Preparatory Stage, while we refine our public health measures and embark on pilot projects such as the Vaccinated Travel Lane with Germany and Brunei and the home recovery scheme for infected individuals with mild or no symptoms.<br><br>3. &nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 12pt;\">Among the 2,369 infected individuals in the last 28 days, 1.1% of vaccinated persons had severe illness compared with 8.2% among unvaccinated persons. The number of persons requiring ICU has held stable at around 6 to 7 in the last week, with those requiring oxygen supplementation trending downwards.&nbsp;<br><br>4. &nbsp; &nbsp;</span><span style=\"font-size: 12pt; font-family: Arial;\">We have also continued to make good progress on&nbsp;</span><span style=\"font-size: 12pt; font-family: Arial;\">our National Vaccination Programme.</span><span style=\"font-size: 12pt; font-family: Arial;\">&nbsp;As of 2 September 2021, 80%&nbsp;</span><span style=\"font-size: 12pt; font-family: Arial;\">of our total population have completed their full regimen</span><span style=\"font-size: 12pt; font-family: Arial;\">and 83% have received at least one dose of the COVID-19 vaccines.</span><span style=\"font-size: 12pt; font-family: Arial;\">&nbsp;In terms of eligible population, 88% have completed their full regimen.<br><br>5. &nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 12pt;\">Coverage among our seniors continues to increase, and has also reached 84% for those aged 70 years and above, and 90% for those aged between 60 and 69 years. With such a high vaccination rate, and because it is still possible to get a post-vaccination infection, we must expect to see more vaccinated persons amongst our daily infection cases. But the proportion of vaccinated persons who become infected remains smaller than the proportion of unvaccinated persons who get infected. The difference in proportions who become severely ill after infection, is even more stark. Importantly, the evidence also clearly shows that vaccination remains highly effective in preventing severe illness if a vaccinated person were to catch the virus. &nbsp;<br><br>6. &nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 12pt;\">We will have to continue our efforts to encourage vaccination uptake amongst eligible individuals who have not stepped forward for vaccination. As a safety precaution, these individuals will need to continue to be subjected to vaccination-differentiated safe management measures.<br><br>7. &nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 12pt;\">We will be taking further measures to prepare to move to the Transitionary Stage of opening. This includes expanding our tools for testing and surveillance to keep infections from spiking, and a vaccine booster programme to boost immunity levels of the elderly and immunocompromised to better protect them.&nbsp;</span></p><p><p><span style=\"font-family: Arial;\"></span><strong style=\"font-family: Arial;\"><span style=\"font-size: 12pt;\">Expanding Testing and Surveillance<br><br></span></strong><span style=\"font-family: Arial; font-size: 12pt;\">8.<b> &nbsp; &nbsp;</b>We will redouble our efforts to make regular testing part of the new normal.&nbsp;&nbsp;Frequent testing remains key for us to identify cases early and avoid huge peaks in cases that could risk straining our healthcare system. For certain higher risk settings, the Government has mandated rostered routine testing. But regular testing should not be confined to persons working in these settings. We strongly encourage everyone, including fully-vaccinated individuals, to self-test regularly with Antigen Rapid Test (ART) kits as a matter of social responsibility, especially if you are participating in higher-risk activities or attending large-scale events. While the unvaccinated are more susceptible to getting infected, vaccinated individuals are also at some risk.<br><br>9. &nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 12pt;\">Singaporeans can use the ART kits that are being issued to every household between 28 August to 27 September 2021. To date[1]</span><span style=\"font-family: Arial; font-size: 12pt;\">, the Health Sciences Authority has approved six ART self-test kits and these are widely available at major retailers and e-commerce platforms. We are actively reviewing new kits for public sale, and will continue to make such self-test kits more readily accessible. &nbsp;<br><br>10. &nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 12pt;\">Employers can also play their part in making regular testing a new norm. The tripartite partners will discuss further guidelines to promote the more pervasive use of antigen rapid tests at workplaces, and as a key element of business continuity plans. This will go beyond the Regular Rostered Testing (RRT) for higher risk settings and the Vaccinate or Regular Test (VoRT) regime. Such regular testing will enable us to detect cases early, help to reduce workplace transmission and prevent large workplace clusters as more people return to on-site work.<br><br>11. &nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 12pt;\">To supplement regular self-testing, members of the public can now make an appointment for a self-paid fast and easy test (FET) at the 20 Quick Test Centres (QTCs)[2]</span><span style=\"font-family: Arial; font-size: 12pt;\">&nbsp;from 1 October 2021. This can be to fulfil employment requirements, or for an unvaccinated person to attend a mass event. The QTCs were set up by the Health Promotion Board to support small businesses and freelancers who needed a supervised self-swab ART to meet their testing requirements under the FET RRT regime. We will also study the setting up of more testing sites across the island, so that it will be easier for people to get themselves tested regularly.&nbsp;<br><br>12. &nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 12pt;\">Individuals who test positive through these FETs or their ART self-tests should visit a Swab-and-Send-Home Clinic for a government-funded confirmatory PCR test to confirm your infection status so that the Ministry of Health (MOH) can follow up with the appropriate public health actions and to extend the appropriate care to you. If you are symptomatic[3]</span><span style=\"font-family: Arial; font-size: 12pt;\">, visit a doctor immediately instead of self-testing or booking a test at the QTCs.<br><br></span><strong style=\"font-family: Arial;\"><span style=\"font-size: 12pt;\">Booster Vaccination Strategy&nbsp;<br><br></span></strong><span style=\"font-family: Arial; font-size: 12pt;\">13. &nbsp; &nbsp;Eight months have passed since our first residents were vaccinated under our National Vaccination Programme. MOH with advice from the Expert Committee on COVID-19 Vaccination (EC19V) has reviewed our strategies to achieve protection against COVID-19 through vaccination, especially in light of the more transmissible variants that have emerged globally.&nbsp;<br><br>14. &nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 12pt;\">With the more transmissible Delta variant, it is not likely that countries can achieve herd immunity without a very high population vaccination rate of well over 90%. There has also been emerging data on the waning of vaccine efficacy against infection with time. Although evidence globally and locally continues to show that vaccines are very effective in reducing severe illness and death. Some countries have also decided to proceed with booster doses.<br><br>15. &nbsp; &nbsp;</span><span style=\"font-size: 12pt; font-family: Arial;\">Having reviewed the available evidence, as well as scrutinised the safety and efficacy of booster doses administered globally, the EC19V has recommended, and MOH has agreed, to commence a booster programme in Singapore for two subgroups:&nbsp;</span><span style=\"font-size: 12pt; font-family: Arial;\">(a) persons who are moderately to severely immunocompromised and (b) p</span><span style=\"font-size: 12pt; font-family: Arial;\">ersons aged 60 years and above, as well as residents of aged care facilities.<br><br>16. &nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 12pt;\">Immunocompromised persons have a blunted immune response to vaccination, and are also at a higher risk of severe illness from COVID-19. These individuals are recommended to receive a third dose of the same mRNA vaccine&nbsp;</span><u style=\"font-family: Arial; font-size: 12pt;\">two months after their second dose as part of their primary course of vaccination</u><span style=\"font-family: Arial; font-size: 12pt;\">&nbsp;to ensure that they start off with an adequate protective immune response to vaccination to.&nbsp;<br><br>17. &nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 12pt;\">Seniors are also at risk of severe COVID-19 infection and may develop a lower immune response from their two-dose vaccination regimen. This is coupled with the expected decline of their immunity over time, as many were vaccinated earlier. They should receive a booster dose of Pandemic Special Access Route (PSAR) mRNA vaccine&nbsp;</span><u style=\"font-family: Arial; font-size: 12pt;\">six to nine months after having completed their primary course of vaccination regimen</u><span style=\"font-family: Arial; font-size: 12pt;\">, to ensure higher levels of protection from infection and continued high levels of protection against severe disease, and reduce the possibility of spikes in infections and more people falling severely ill. &nbsp;<br><br>18. &nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 12pt;\">The additional dose recommendations for immunocompromised individuals, and seniors aged above 60 years, as well as residents of aged care facilities are aligned to the vaccination measures adopted in other countries such as Israel and Germany. The US Food and Drug Administration (FDA) has also approved a third dose for immunocompromised individuals and is considering its recommendation for seniors.&nbsp;<br><br>19. &nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 12pt;\">The first batch of seniors aged above 60 years completed their second doses around March this year. Hence they will be eligible for the third dose within the month of September. More details on the implementation of the booster shot will be announced later.</span></p></p><p><p><span style=\"font-family: Arial;\"></span><strong style=\"font-family: Arial;\"><span style=\"font-size: 12pt;\">Towards a COVID-19 Resilient Singapore<br><br></span></strong><span style=\"font-family: Arial;\"><span style=\"font-size: 12pt;\">20. </span></span><strong style=\"font-family: Arial;\"><span style=\"font-size: 12pt;\">&nbsp; &nbsp;</span></strong><span style=\"font-family: Arial; font-size: 12pt;\">We have made significant progress in vaccinating our population, adopting safe management measures, and moving towards a COVID-19 resilient nation. The recent rise in cases was not unexpected, and the majority of these only have mild or no symptoms because of the high level of protection conferred by the vaccines against severe illness. As we continue to open and lead our lives as normally as possible, we should expect cases to rise, but we must keep a close watch over the number who fall severely ill. <br><br>21. &nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 12pt;\">That said, we must continue to keep overall risks under control, by continuing to adhere closely to the safe management measures that have served us very well thus far. Reverting to a tightened posture must be a last resort. We are therefore at a stage where we need all employers, families and individuals to play a part – to exercise civic-consciousness, and to take care of themselves and the people around them. &nbsp;<br><br><br></span><strong><span style=\"font-size: 16px; font-family: Arial;\">MINISTRY OF HEALTH&nbsp;<br></span></strong><strong style=\"font-size: 16px;\"><span style=\"font-family: Arial;\">3 SEPTEMBER 2021</span></strong></p></p><p><span style=\"font-family: Arial;\"><span style=\"font-size: 13px;\"><br><br>[1] The list of ART self-test kits can be found at&nbsp;<a href=\"https://www.hsa.gov.sg/consumer-safety/articles/covid19_ARTselftests\" title=\"\" class=\"\" target=\"\">https://www.hsa.gov.sg/consumer-safety/articles/covid19_ARTselftests</a>.<br></span></span></p><p><span style=\"font-family: Arial; font-size: 13px;\">[2] As of 31 August, there are 20 QTCs at Yishun Bus Interchange, Tekka Facility, Bishan Sports Hall CP, Jurong West Active Sports CP, Pasir Ris Sports Hall CP, 509 MPH Jurong West, 32 New Market Road Lvl 4, 75 Marine Drive, 325A Ang Mo Kio Ave 3 Pavilion, 2 Toa Payoh Lor 7, 528 Ang Mo Kio Ave 10 Badminton Hall, Bedok Town Square, 814 Hougang Ave 10, 506 Tampines Central 1, MOE Heritage Centre, Woodlands Temporary Bus Interchange, 84A Redhill Lane, Punggol Town Square, 321 Clementi Ave 5 and 55 Sims Drive Pavilion.&nbsp;</span></p><p><div><div id=\"ftn2\"><div><span style=\"font-family: Arial;\"><span style=\"font-size: 13px;\">[3] Mild symptoms:&nbsp;Fever, cough, fatigue, new loss of taste or smell, sore throat, runny nose, muscle aches, diarrhea, nausea or vomiting; Severe symptoms: shortness of breath, chest pain or pressure, loss of speech or movement.</span></span><br></div></div></div></p><p>&nbsp;</p><p style=\"text-align: justify;\"><span style=\"font-size: 12pt; font-family: Arial;\"><div><div><br></div></div></span></p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "strengthening-our-tools-to-achieve-covid-resilience_3Sep2021", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}, {"Title": "216 New Cases of Locally Transmitted  Covid-19 Infection ", "PublishedDate": "/Date(1630663200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "03 Sep 2021", "Summary": "", "MainContent": "<p style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 16px;\">&nbsp; &nbsp; &nbsp;As of 3 September 2021, 12pm,&nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">the Ministry of Health (MOH) has preliminarily confirmed 216 new&nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">cases of locally transmitted COVID-19 infection.&nbsp;</span></p><p style=\"margin-left: 0cm; text-align: justify;\"><span style=\"font-family: Arial; font-size: 16px;\">2. &nbsp;&nbsp;</span><span style=\"font-family: Arial; font-size: 16px; text-align: left;\">56 are&nbsp;</span><span class=\"bumpedfont15\" style=\"font-family: Arial; font-size: 16px; text-align: left;\">linked to previous cases, and have already been placed on quarantine. 51 are linked to previous cases and were detected through surveillance. 109 are currently unlinked. Amongst the cases are 2 seniors above 70 years who are unvaccinated/ partially vaccinated, and are at risk of serious illness.</span></p><p><p><span style=\"font-family: Arial; font-size: 16px;\">3. &nbsp;&nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">In addition, there are 3 imported cases, who have already been placed on Stay-Home Notice (SHN) or isolated&nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">upon arrival in Singapore. 2 were detected upon arrival in Singapore, while 1 developed the illness during SHN or isolation</span><span style=\"font-family: Arial; font-size: 16px;\">.&nbsp;</span></p></p><p><p><span style=\"font-family: Arial; font-size: 16px;\">4. &nbsp;&nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">In total, there are 219 new cases of COVID-19 infection in Singapore today.</span></p></p><p><p><span style=\"font-family: Arial; font-size: 16px;\">5. &nbsp;&nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;</span></p></p><p><span style=\"font-family: Arial; font-size: 16px;\"><strong><br>MINISTRY OF HEALTH<br></strong></span><strong style=\"font-family: Arial;\"><span style=\"font-size: 16px;\">3 SEPTEMBER 2021</span></strong></p><p style=\"margin-left: 0cm; text-align: justify;\"><span style=\"font-size: 12pt; font-family: Arial, sans-serif;\">&nbsp;</span></p><div style=\"padding: 0cm 0cm 1pt; border-bottom-width: 1pt; border-style: none none solid;\"><p style=\"padding: 0cm; border: none;\">&nbsp;</p></div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "216-new-cases-of-locally-transmitted-covid-19-infection_3Sep2021", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}