{"pressItemDictionary": {"Press Releases": [{"Title": "4 New Cases of Locally Transmitted Covid-19 Infection ", "PublishedDate": "/Date(1623137580000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "08 Jun 2021", "Summary": "", "MainContent": "&nbsp; &nbsp; &nbsp; &nbsp; As of 8 June 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 4 new cases of locally transmitted COVID-19 infection. 1 is in the community and linked to previous cases, and has already been placed on quarantine. The remaining 3 are currently unlinked.&nbsp; Amongst them, 2 are in the community, and 1 resides in a dormitory.<br><br>2.&nbsp; &nbsp; &nbsp;In addition, there are 5 imported cases, who have already been placed on Stay-Home Notice upon arrival in Singapore. Of these, 2 are returning Singaporeans or Singapore Permanent Residents.<br><br>3.&nbsp; &nbsp; &nbsp;In total, there are 9 new cases of COVID-19 infection in Singapore today.<br><br>4.&nbsp; &nbsp; &nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>8 JUNE 2021</strong><br><div><br></div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "4-new-cases-of-locally-transmitted-covid-19-infection-8Jun", "CurrentPageUrl": null}, {"Title": "Publication of Fees Charged by Private Ambulance Operators for Price Transparency", "PublishedDate": "/Date(1623135600000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "08 Jun 2021", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; From 1 June 2021, the Ministry of Health (MOH) has published a list of fees charged by Private Ambulance Operators (PAOs) accredited under the Voluntary Accreditation Scheme (VAS) to provide conveyance services to the public. This helps to ensure greater price transparency for those who need private ambulance services. </p> <p>2.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The list of fees can be found on the MOH website[1]&nbsp;and provides information on common charges by VAS-accredited PAOs such as general conveyance fees and the use of commonly consumed services such as cardiopulmonary resuscitation. The list also contains detailed charges for items and consumables used for specific patient groups and medical conditions such as medications, airway/ ventilation and trauma-related equipment. These allow the public to make informed decisions about the choice of PAO based on the patient’s medical condition, and to estimate the bill size prior to engaging the PAO.</p><p><p>3.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The listing of fees by the individual VAS-accredited PAOs is currently voluntary. All PAOs will be required to publish their fees as part of price transparency requirements under the Healthcare Services Act (HCSA), when the Emergency Ambulance and Medical Transport Services Regulations[2]&nbsp;come into effect at the end of 2021.</p></p><p><p>4.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The VAS was introduced in 2018 to facilitate the PAOs’ transition into HCSA. Under HCSA, private ambulance services will be licensed to ensure the safety and safeguard the welfare of patients. Private ambulance services will be regulated as either an Emergency Ambulance Service or Medical Transport Service. Accredited operators under the VAS must adhere to standards under the scheme before the regulations for private ambulance services are implemented under HCSA.</p></p><p><p>5.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;As of 31 May 2021, more than 90 per cent[3]&nbsp;of the PAOs have come on board the VAS. The list of VAS-accredited PAOs is available on the Healthcare Institution (HCI) directory[4]. We encourage the public to make use of VAS-accredited PAOs should they require PAO services.</p></p><p><p>6.&nbsp; &nbsp;<b> &nbsp; &nbsp; &nbsp; &nbsp;</b>As MOH does not regulate the fees charged by the PAOs, the list serves as a consolidation and guide of price information. There may be other charges depending on the patient’s specific condition. The public are advised to check directly with the respective PAOs prior to engaging the service, to verify the fees applicable. The list of fees will be continually updated as PAOs submit their fees to MOH.</p></p> <div><br clear=\"all\"> <hr align=\"left\" size=\"1\" width=\"33%\"> <div id=\"ftn1\"> <p>[1]&nbsp;<a href=\"http://www.moh.gov.sg/licensing-and-regulation/accredited-private-ambulance-operators\">www.moh.gov.sg/licensing-and-regulation/accredited-private-ambulance-operators</a></p> </div> <div id=\"ftn2\"> <p>[2] Emergency Ambulance Service means a service to transport, by land, any individual suffering, or believed to be suffering, from an injury or condition of acute or sudden onset and of an emergency nature. Medical Transport Service means a ground conveyance that is used or intended to be used for the transport of patient(s) who is being provided with non-emergency clinical care or monitoring en-route.</p> </div> <div id=\"ftn3\"> <p>[3] Based on market share by number of EAS/MTS vehicles.</p> </div> <div id=\"ftn4\"> <p>[4]&nbsp;<a href=\"http://www.hcidirectory.gov.sg/hcidirectory/\">http://www.hcidirectory.gov.sg/hcidirectory/</a>.</p> </div> </div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "publication-of-fees-charged-by-private-ambulance-operators-for-price-transparency", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}