{"pressItemDictionary": {"Press Releases": [{"Title": "No New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1615188660000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "08 Mar 2021", "Summary": "", "MainContent": "<p style=\"text-align: justify;\"><span style=\"font-size: 16px; font-family: Arial;\"><span><span style=\"color: black;\">1.&nbsp; &nbsp; &nbsp;As of 8 March 2021, 12pm, </span></span></span><span style=\"font-size: 16px; font-family: Arial;\"><span><span style=\"color: black;\">the Ministry of Health (MOH) has preliminarily confirmed that there are no </span></span></span><span style=\"font-size: 16px; font-family: Arial;\"><span>new cases of locally transmitted COVID-19 infection.</span></span><span style=\"font-size: 16px; font-family: Arial;\"><span> </span></span></p> <p style=\"text-align: justify;\"><span style=\"font-size: 16px; font-family: Arial;\"><span style=\"color: black;\">2.&nbsp; &nbsp; &nbsp;</span></span><span style=\"text-align: left; font-size: 16px; font-family: Arial;\">There are 13 imported cases, who had already been placed on Stay-Home Notice or isolated upon arrival in Singapore</span><span style=\"text-align: left; font-size: 16px; font-family: Arial;\">.</span></p><p><span style=\"font-size: 16px; font-family: Arial;\">3.&nbsp; &nbsp; &nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.</span></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "no-new-cases-of-locally-transmitted-covid-19-infection_8March2021", "CurrentPageUrl": null}, {"Title": "Covid-19 Vaccination Brought Forward for All Seniors; Extended to Essential Services Personnel and Higher Risk Groups ", "PublishedDate": "/Date(1615182600000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "08 Mar 2021", "Summary": "", "MainContent": "<p style=\"text-align: justify;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Singapore continues to make good progress in our vaccination programme. As of 7 March 2021, we have administered more than 596,000 doses of the COVID-19 vaccine. In total, about 379,000 individuals in Singapore have received at least the first dose of the COVID-19 vaccine, of whom more than 217,000 have received their second dose, and completed the full vaccination regimen.&nbsp;<br><br><strong>Bringing forward the offering of vaccination for seniors<br></strong><br>2.&nbsp; &nbsp; &nbsp; Vaccination for seniors aged 70 years and above commenced island-wide on 22 February 2021. More than 55,000 seniors have received their first dose of the COVID-19 vaccine, and another 96,000 seniors have made appointments to receive their first dose in the next few weeks. Invitation letters have already been sent to all seniors aged 70 years and above, and we are making steady progress in vaccinating this group.&nbsp;&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp; The Ministry of Health (MOH) had earlier announced that seniors aged 60 to 69 years will commence vaccination from around end-March. As more vaccine supplies have arrived, we are able to bring forward the vaccination for seniors aged 60 to 69 years.&nbsp; All seniors in this age group will receive their invitation letters within the next few days. Each letter will have a weblink which can be used to register for vaccination, after which an SMS with a unique booking link will be sent to the senior’s mobile phone for them to book a vaccination appointment. Alternatively, seniors can also book their appointments for vaccination at any community centre/club island-wide.&nbsp;<br><br><strong>Vaccination for essential frontline workers of critical importance to Singapore and other higher risk groups&nbsp;<br></strong><br>4.&nbsp; &nbsp; &nbsp; &nbsp;The Expert Committee on COVID-19 Vaccination, which was tasked by MOH to make recommendations to the government on Singapore’s COVID-19 vaccination strategy, had earlier called for the prioritisation of healthcare workers, nursing home staff and residents, as well as those involved in COVID-19 operations. The Expert Committee had also recommended to prioritise frontline workers who are at higher risk of exposure to COVID-19 infection, including those working in the aviation and maritime sectors, as well as specific groups who are of critical importance to the functioning of Singapore. This would ensure that Singapore would be able to continue to function effectively amidst a local outbreak situation.<br><br>5.&nbsp; &nbsp; &nbsp; &nbsp; We will thus continue to extend our vaccination programme progressively to other higher risk groups, as well as essential frontline workers of critical importance to Singapore, including those who could pose risks to our vulnerable populations and the community at large if they are infected.&nbsp;<br><br><strong>Essential personnel in critical functions<br></strong><br>6.&nbsp; &nbsp; &nbsp; MOH, together with relevant government agencies and statutory boards, have been progressively offering vaccination to personnel who provide essential services. These include security agencies responsible for safeguarding our borders and law and order (including ICA officers who man our border controls); those involved in the provision of utilities such as water, energy and telecommunications services; and workers who ensure the supply of essential food and household items.&nbsp;<br><br>7.&nbsp; &nbsp; &nbsp; &nbsp; As more vaccine stocks arrive, we will extend vaccination to essential personnel involved in other critical functions, such as postmen and delivery staff, as well as news reporters, and bank operation staff engaged in critical banking and financial systems operations.&nbsp;<br><br><strong>Essential workers with higher risk of exposure and onward transmission<br></strong><br>8.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Vaccination was earlier offered to groups who are at higher risk of exposure, such as active taxi and private hire car drivers who might convey individuals seeking medical care who turn out to be COVID-19 patients.&nbsp;<br><br>9.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Going forward, we will extend vaccination to those who have multiple touch points with many members of our community. These include those who work in hawker centres and markets, such as stallholders and stall assistants, as well as those who serve in the food delivery industry.&nbsp;<br><br>10.&nbsp; &nbsp; &nbsp;We will also begin vaccination for the educators and staff who come into prolonged contact with children and youth. We will start with those working in pre-schools, national schools, ITEs and polytechnics, and will progressively extend to those working in other education institutions. As the current vaccines are not yet certified for those below the age of 16 years<sup>1</sup>, the vaccination for educators and adult staff will help to protect them and their students, and ensure that our schools and education institutions remain safe places for learning.&nbsp;<br><br>11.&nbsp; &nbsp; &nbsp; &nbsp;Eligible individuals will be informed of the vaccination schedule by the relevant government agencies and will receive a personalised SMS from MOH notifying them to book their vaccination appointments at vaccine.gov.sg. COVID-19 vaccination will be available at all vaccination centres, all polyclinics and selected Public Health Preparedness Clinics (PHPCs).<br><br><strong>Migrant workers living in dormitories<br></strong><br>12.&nbsp; &nbsp; &nbsp; Migrant workers living in dormitories are another group where large COVID-19 clusters could rapidly develop and grow, with a high risk of transmission to the local community. Vaccination of migrant workers living in dormitories is thus part of our national COVID-19 vaccination strategy to protect all Singaporeans and long-term residents.&nbsp;<br><br>13.&nbsp; &nbsp; &nbsp; COVID-19 vaccination for migrant workers will start with 10,000 workers who have never been infected by COVID-19 and are living in the five largest dormitories. Vaccination for migrant workers will be conducted in-situ at these five dormitories.&nbsp;&nbsp;<br><br>14.&nbsp; &nbsp; &nbsp; &nbsp; Vaccination will then be progressively made available to other migrant workers. Workers who have completed vaccination can be subjected to a lower frequency of testing, with testing occurring every 28 days instead of the current 14-day cycle.&nbsp;<br><br><strong>Cargo vehicle drivers and accompanying personnel delivering essential goods into Singapore regularly<br></strong><br>15.&nbsp; &nbsp; &nbsp; To minimise transmission risks from workers who engage in the supply of essential goods to Singapore, we will offer vaccination later this month to selected cargo drivers and accompanying personnel who enter Singapore from Malaysia on a regular basis. Vaccination will provide an additional layer of protection against COVID-19, ensuring that these personnel can continue to deliver essential goods to Singapore safely.&nbsp; Those who are eligible for vaccination will be notified via a personalised SMS from the Ministry of Trade and Industry and will be contacted subsequently for an appointment to undergo vaccination at designated sites in Singapore. Those who are not vaccinated may continue to enter, subject to the prevailing infection control measures such as on-arrival testing and corresponding safe management measures.<br><br><strong>Provisions have been made to vaccinate everyone in Singapore<br></strong><br>16.&nbsp; &nbsp; &nbsp; &nbsp; We will continue to systematically extend the vaccination to other segments from April onwards. All Singaporeans and long-term residents in Singapore will have the chance to be vaccinated.&nbsp;&nbsp;<br><br>17.&nbsp; &nbsp; &nbsp; &nbsp; While COVID-19 vaccination is voluntary, we strongly encourage Singaporeans and long-term residents who are medically eligible to come forward for vaccination when their turn comes. That is the only way we as a society can keep each other safe from the disease.<br><br><strong>MINISTRY OF HEALTH<br>8 MARCH 2021</strong><br></p><div style=\"text-align: justify;\"><sup>1&nbsp; </sup>The Health Sciences Authority has approved the use of the Pfizer-BioNTech COVID-19 Vaccine in individuals aged 16 years and above, and the use of the Moderna COVID-19 Vaccine for individuals aged 18 years and above, under the Pandemic Special Access Route.<br></div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "covid-19-vaccination-brought-forward-for-all-seniors-extended-to-essential-services-personnel-and-higher-risk-groups", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}