{"pressItemDictionary": {"Press Releases": [{"Title": "Removal of Content From Youtube Channel for Violating Community Guidelines", "PublishedDate": "/Date(1636268400000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "07 Nov 2021", "Summary": "", "MainContent": "<span id=\"docs-internal-guid-7c023f43-7fff-4e67-a033-685721b3bf7d\"></span><p dir=\"ltr\" style=\"margin-top: 0pt; margin-bottom: 0pt; text-align: justify;\"><span style=\"font-family: Arial; font-size: 16px;\">&nbsp; &nbsp; &nbsp;A group called “Healing the Divide”, founded by a Ms Iris Koh, adopts an anti-vaccination stance and claims to warn people about the dangers of vaccination.&nbsp;</span></p><p style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 16px;\"><br>2. &nbsp; The Ministry of Health (MOH) notes that Iris Koh’s channel has a history of posting and sharing content that perpetuates falsehoods and misleading information about COVID-19 and vaccines. The Government takes a serious view of the deliberate communication of these falsehoods and will not hesitate to take action against those who put the public’s health and well-being at risk by spreading misinformation about COVID-19 and vaccines.<br><br>3. &nbsp; MOH therefore notes and welcomes the latest removal of content from the YouTube channel by Iris Koh, which includes “Town Hall Meeting: United We Stand For Choice”, and “Healing the Divide: Remembering Those We Love and Lost”, for violating YouTube’s Community Guidelines. We also observe that Facebook has previously suspended Iris Koh’s account in more than one instance, for violating their Community Guidelines.&nbsp;<br><br>4. &nbsp; We advise members of the public not to speculate and/or spread misinformation which may cause public alarm, and to refer to credible sources of information instead.<br><br>5. &nbsp; Please visit www.moh.gov.sg for the latest information on COVID-19 and COVID-19 vaccinations. For vaccine SAE statistics, please refer to HSA and its Safety Updates published monthly. For information regarding consumer safety, please visit www.hsa.gov.sg.<br><br><strong>MINISTRY OF HEALTH&nbsp;<br>7 NOVEMBER 2021</strong></span></p><div><br></div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "removal-of-content-from-youtube-channel-for-violating-community-guidelines_7Nov2021", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}