{"pressItemDictionary": {"Press Releases": [{"Title": "5 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1610808960000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "16 Jan 2021", "Summary": "", "MainContent": "<p style=\"text-align: justify;\"><span style=\"font-family: Arial;\"><span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp; As of 16 January 2021, 12pm, the Ministry of Health (MOH) has confirmed and verified that there are 5 new cases of locally transmitted COVID-19 infection. Of these, 4 are in the community, and 1 resides in a dormitory. There are 19 imported cases, who had already been placed on Stay-Home Notice (SHN) or isolated upon arrival in Singapore. Amongst the new cases today, 19 are asymptomatic, and were detected from our proactive screening and surveillance, while 5 were symptomatic.&nbsp;&nbsp;<br><br><strong>Summary of new cases</strong></span></span></p><table border=\"1\" cellspacing=\"0\" cellpadding=\"0\" width=\"0\"> <tbody><tr> <td width=\"129\"> <p align=\"right\"><span style=\"font-family: Arial; font-size: 16px;\"><br></span></p> </td> <td width=\"60\"> <p><span style=\"font-family: Arial; font-size: 16px;\"><br></span></p> </td> <td width=\"16\" valign=\"top\"> <p><span style=\"font-family: Arial; font-size: 16px;\"><br></span></p> </td> <td width=\"192\" colspan=\"2\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 16px;\"><strong>Breakdown by</strong></span></p> </td> <td width=\"16\" valign=\"top\"> <p><span style=\"font-family: Arial; font-size: 16px;\"><br></span></p> </td> <td width=\"192\" colspan=\"2\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 16px;\"><strong>Breakdown by</strong></span></p> </td> </tr> <tr> <td width=\"129\"> <p align=\"right\"><span style=\"font-family: Arial; font-size: 16px;\"><br></span></p> </td> <td width=\"60\"> <p><span style=\"font-family: Arial; font-size: 16px;\"><strong>Number of cases</strong></span></p> </td> <td width=\"16\" valign=\"top\"> <p><span style=\"font-family: Arial; font-size: 16px;\"><br></span></p> </td> <td width=\"96\"> <p><span style=\"font-family: Arial; font-size: 16px;\"><strong>Already in quarantine/ isolation before detection</strong></span></p> </td> <td width=\"96\"> <p><span style=\"font-family: Arial; font-size: 16px;\"><strong>Detected from surveillance</strong></span></p> </td> <td width=\"16\" valign=\"top\"> <p><span style=\"font-family: Arial; font-size: 16px;\"><br></span></p> </td> <td width=\"96\"> <p><span style=\"font-family: Arial; font-size: 16px;\"><strong>Symptomatic</strong></span></p> </td> <td width=\"96\"> <p><span style=\"font-family: Arial; font-size: 16px;\"><strong>Asymptomatic</strong></span></p> </td> </tr> <tr> <td width=\"129\"> <p><span style=\"font-family: Arial; font-size: 16px;\"><strong>Cases in the community</strong></span></p> </td> <td width=\"60\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 16px;\">4</span></p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 16px;\"><br></span></p> </td> <td width=\"96\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 16px;\">1</span></p> </td> <td width=\"96\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 16px;\">3</span></p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 16px;\"><br></span></p> </td> <td width=\"96\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 16px;\">4</span></p> </td> <td width=\"96\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 16px;\">0</span></p> </td> </tr> <tr> <td width=\"129\"> <p><span style=\"font-family: Arial; font-size: 16px;\"><strong>Cases residing in dormitories</strong></span></p> </td> <td width=\"60\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 16px;\">1</span></p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 16px;\"><br></span></p> </td> <td width=\"96\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 16px;\">0</span></p> </td> <td width=\"96\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 16px;\">1</span></p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 16px;\"><br></span></p> </td> <td width=\"96\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 16px;\">0</span></p> </td> <td width=\"96\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 16px;\">1</span></p> </td> </tr> <tr> <td width=\"129\"> <p><span style=\"font-family: Arial; font-size: 16px;\"><strong>Imported cases</strong></span></p> </td> <td width=\"60\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 16px;\">19</span></p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 16px;\"><br></span></p> </td> <td width=\"96\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 16px;\">17</span></p> </td> <td width=\"96\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 16px;\">2</span></p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 16px;\"><br></span></p> </td> <td width=\"96\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 16px;\">1</span></p> </td> <td width=\"96\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 16px;\">18</span></p> </td> </tr> <tr> <td width=\"129\"> <p><span style=\"font-family: Arial; font-size: 16px;\"><strong>Total</strong></span></p> </td> <td width=\"60\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 16px;\">24</span></p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 16px;\"><br></span></p> </td> <td width=\"96\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 16px;\"><br></span></p> </td> <td width=\"96\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 16px;\"><br></span></p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 16px;\"><br></span></p> </td> <td width=\"96\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 16px;\"><br></span></p> </td> <td width=\"96\"> <p align=\"center\"><span style=\"font-family: Arial; font-size: 16px;\"><br></span></p> </td> </tr> </tbody></table><p style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 16px;\"><br>2.&nbsp; &nbsp; &nbsp; &nbsp;Overall, the number of new cases in the community has decreased from 8 cases in the week before to 6 cases in the past week. The number of unlinked cases in the community has also decreased from 5 cases in the week before to 4 cases in the past week. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br><br><strong>Case Details</strong><br><br><strong>a) Cases in the community: 4</strong><br><br>There are 4 cases in the community today, of whom 2 are currently unlinked and 2 are linked to previous cases.<br><br><span style=\"text-decoration: underline;\">Case 59340</span><br><br>Case 59340 is a 39 year-old male Singaporean who works at Singapore Scouts Association (1 Bishan Street 12), handling mainly administrative work in the office. He is also a part-time bus driver with Westpoint Transit who plies specific routes for Cameron (Singapore) Pte Ltd and GlaxoSmithKline Tuas.&nbsp;<br><br>He developed a fever on 11 January, and sought medical treatment from a general practitioner via tele-consultation, and again at a polyclinic on 13 January where he was tested for COVID-19 as part of our enhanced community testing to test all individuals aged 13 and above who are diagnosed with acute respiratory infection at first presentation to a doctor.&nbsp;<br><br>He was confirmed to have COVID-19 infection on 15 January and was conveyed in an ambulance to the National Centre for Infectious Diseases (NCID). His serological test result has come back negative, indicating that this is likely a current infection. He had not gone to work after onset of symptoms.<br><br><span style=\"text-decoration: underline;\">Case 59351</span><br><br>Case 59351 is a 39 year-old female Singaporean who is the spouse of Case 59340. She developed acute respiratory infection (ARI) symptoms on 13 January and sought medical treatment at a general practitioner clinic the next day. She was referred to a polyclinic to take a COVID-19 test on the same day. Her test result came back positive for COVID-19 infection on 15 January and she was conveyed in an ambulance to NCID. Her serological test result is pending.<br><br>She works as an administrative officer at OCBC Tampines Centre One (11 Tampines Central 1) but does not interact with customers. Her last day at work was on 8 January, before onset of symptoms.&nbsp;<br><br><span style=\"text-decoration: underline;\">Case 59343</span><br><br>Case 59343 is a 33 year-old male Chinese national who is a Work Permit holder. He works as a food processing worker at Golden Bridge Foods Manufacturing Pte Ltd (30 Senoko South Road).&nbsp;<br><br>He developed a cough on 7 January and sought medical treatment at a general practitioner clinic. He was swabbed but his test result came back negative for COVID-19 on 8 January. He stayed at home on medical leave between 7 January and 12 January, and went back to work on 13 January.&nbsp;<br><br>However he developed a fever on 14 January and sought medical treatment at Khoo Teck Puat Hospital where he was again tested for COVID-19. This time, his test result came back positive on 15 January and he was conveyed in an ambulance to NCID. His serological test result has come back negative, indicating that this is likely a current infection.<br><br><span style=\"text-decoration: underline;\">Case 59347</span><br><br>Case 59347 is a 28 year-old female Singaporean who is the spouse of Case 59280 . She had been identified as his close contact earlier and was placed on quarantine on 13 January.&nbsp;<br><br>She developed ARI symptoms on 14 January and was tested for COVID-19. She was confirmed to have COVID-19 infection on 15 January and was conveyed to NCID in an ambulance. Her serological test result has come back negative, indicating that this is likely a current infection.<br><br>She works as a Prison Staff Officer at Singapore Prison Service but does not interact with Prison inmates. Due to workplace safe management measures, she has mainly been working from home during this period.&nbsp;<br><br><strong>b) Cases residing in dormitories: 1</strong><br><br>There is 1 case residing in a dormitory who is currently unlinked. Case 59350 is a 37 year-old male Indian national who is a Work Permit holder. He resides at Tuas South Dormitory (1 Tuas South Street 12) and works at Chevron Oronite Pte Ltd (21 Sakra Road) as a thermal insulator installer.&nbsp;<br><br>He is asymptomatic, and was detected when his test taken on 14 January as part of Rostered Routine Testing (RRT) came back positive for COVID-19 infection. His earlier tests from RRT – the last being on 17 December – were negative for COVID-19 infection. His serological test result has come back negative, indicating that this is likely a current infection.<br><br>Epidemiological investigations are ongoing. In the meantime, all the identified close contacts of the cases, including their family and household members and co-workers, have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for the close contacts to determine if the case could have been infected by them.<br><br><strong>c) Imported cases: 19</strong><br><br>Amongst the 19 imported cases,&nbsp;<br><br>• 1 (Case 59339) is a Singapore Permanent Resident who returned from India.<br>• 3 (Cases 59329, 59331 and 59332) are Dependant’s Pass holders who arrived from the UAE and India.<br>• 2 (Cases 59327 and 59330) are Student’s Pass holders who arrived from India and France.&nbsp;<br>• 5 (Cases 59328, 59337, 59341, 59342 and 59348) are Work Pass holders who arrived from India, Japan, Spain and the UAE.&nbsp;<br>• 6 are Work Permit holders who arrived from India and Myanmar, of whom 3 (Cases 59333, 59335 and 59336) are foreign domestic workers.<br>• 1 (Case 59346) is a sea crew holding a Special Pass who arrived from Brunei onboard a vessel on 5 January and had not disembarked. He was tested for COVID-19, and conveyed to the hospital when his result came back positive.&nbsp;<br>• 1 (Case 59345) is a Short-Term Visit Pass holder who arrived from Myanmar for a job placement.&nbsp;<br><br>They had all already been placed on SHN or isolated upon arrival in Singapore and were tested while serving SHN or during isolation.&nbsp;<br><br>Cases 59348 and 59349 are Work Permit holders who arrived from India on 25 December 2020 and served SHN at dedicated facilities until 8 January 2021. Their swabs done on 5 January during SHN were negative for COVID-19, and subsequent tests on 9 January and 11 January were also negative. Their tests on 14 January came back positive for COVID-19 infection, although the Ct values were very high, which are indicative of low viral loads. Their serological test results have also come back positive. Given that these indicate likely past infection, we have classified these cases as imported. They are likely to be shedding minute fragments of the virus RNA, which are no longer transmissible and infective to others.<br><br>3.&nbsp; &nbsp; &nbsp; Please refer to the <a href=\"/docs/librariesprovider5/default-document-library/annexesc1d1cad3fc8c4266b28168000969b17f.pdf?sfvrsn=910a9d7e_0\" title=\"Annexes\">Annexes</a>&nbsp;and MOH’s daily Situation Report (<a href=\"https://www.moh.gov.sg/covid-19/situation-report\" title=\"\" class=\"\" target=\"\">www.moh.gov.sg/covid-19/situation-report</a>) for details.&nbsp;<br><br><strong>Update on condition of confirmed cases</strong><br><br>4.&nbsp; &nbsp; &nbsp; &nbsp;13 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 58,784 have fully recovered from the infection and have been discharged from hospitals or community care facilities.&nbsp;<br><br>5.&nbsp; &nbsp; &nbsp; &nbsp;There are currently 54 confirmed cases who are still in hospital. Of these, most are stable or improving, and none is in the intensive care unit. 216 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 29 have passed away from complications due to COVID-19 infection.&nbsp;<br><br>6.&nbsp; &nbsp; &nbsp; The recent locally transmitted cases are a stark reminder that we cannot afford to let our guard down. We must continue to keep up our discipline in adhering to the safe management and safe distancing measures, so as to avoid an uncontrolled resurgence of cases that may necessitate a tightening of measures.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>16 JANUARY 2021</strong><br></span></p><div><span style=\"font-family: Arial; font-size: 16px;\"><br></span></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "5-new-cases-of-locally-transmitted-covid-19-infection-16-Jan-2021", "CurrentPageUrl": null}, {"Title": "Updates On Border Measures and Travel Insurance ", "PublishedDate": "/Date(1610805600000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "16 Jan 2021", "Summary": "", "MainContent": "<p style=\"text-align: justify;\">&nbsp; &nbsp; &nbsp; &nbsp; The Multi-Ministry Taskforce regularly reviews Singapore’s border measures to manage the risk of importation and onward local transmission from travellers. Given the resurgence of COVID-19 cases around the world, we will be putting in place more stringent measures for travellers to manage the risk of importation.&nbsp;<br><br><span style=\"text-decoration: underline;\">On-arrival Testing for Travellers<br></span><br>2.&nbsp; &nbsp; &nbsp; &nbsp; We currently require travellers who are not Singapore Citizens (SCs) or Permanent Residents (PRs), and who have recent travel history to high-risk countries/ regions, to take a COVID-19 Polymerase Chain Reaction (PCR) test within 72 hours before departure. These travellers are then required to serve their Stay-Home Notice (SHN) upon arrival in Singapore, and they are tested at the end of their SHN.<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp;Given the emergence of new virus variants and the worsening COVID-19 situation around the world, we will put in place additional border control measures for all travellers. In particular, <strong>from 24 January 2021, 2359 hours, all travellers (including SCs and PRs) will need to take a COVID-19 PCR test upon arrival in Singapore</strong><sup>1</sup>. The prevailing SHN requirements, including the PCR test at the end of the SHN, will continue.&nbsp;<br><br><span style=\"text-decoration: underline;\">Further Precautions for Travellers from the United Kingdom and South Africa<br><br></span>4.&nbsp; &nbsp; &nbsp; We had earlier restricted entry and transit for all long-term pass holders and short-term visitors with recent travel history to the UK and South Africa. This arose from concerns of a more contagious variant of the COVID-19 virus circulating in these countries.&nbsp;<br><br>5.&nbsp; &nbsp; &nbsp; As a further precaution, from 18 January 2021, 2359 hours, until further notice, all returning SCs and PRs from the UK and South Africa will be subject to an additional 7-day self-isolation at their place of residence, following their 14-day SHN at dedicated SHN facilities. The returnees from the UK and South Africa will be tested at the end of their SHN (as per the current requirement), and again after they have completed their 7-day self-isolation period. These further precautions will apply to travellers who are currently serving their SHN.&nbsp;&nbsp;<br>&nbsp;&nbsp;<br><strong>Insurance Coverage<br></strong><br>6.&nbsp; &nbsp; &nbsp; &nbsp; Currently, short-term visitors entering Singapore under the Air Travel Pass (ATP) and Reciprocal Green Lanes (RGLs) are required to bear the full costs of medical treatment, should they be suspected of being infected with COVID-19 or require medical treatment for COVID-19 while in Singapore.&nbsp;&nbsp;<br><br>7.&nbsp; &nbsp; &nbsp; &nbsp; With effect from <strong>31 January 2021, 2359 hours, visitors applying to enter Singapore under the ATP and RGLs will need to have travel insurance for their COVID-19-related medical treatment and hospitalisation costs in Singapore, with a minimum coverage of S$30,000.</strong> The travel insurance will help them pay for the costs of their medical treatment in Singapore. The visitors can purchase the travel insurance from Singapore-based or overseas insurers. A list of available insurance products can be found at the <a href=\"https://safetravel.ica.gov.sg/health\" title=\"\" class=\"\" target=\"\">SafeTravel website</a>.<br><br><strong>Looking Ahead to Further Reopening<br></strong><br>8.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;As the global situation evolves, we will continue to adjust our border measures to manage the risk of importation and transmission to the community. The Ministry of Health will also continue to review the data and evidence on any new viral strains and update the measures accordingly.&nbsp;<br><br>9.&nbsp; &nbsp; &nbsp;Any changes to border measures will be updated on the <a href=\"https://safetravel.ica.gov.sg/health\" title=\"\" class=\"\" target=\"\">SafeTravel website</a>. Travellers are advised to visit the website to check for the most updated border measures before entering Singapore and be prepared to be subjected to the prevailing border measures upon entry, including payment for their stay at dedicated SHN facilities, tests and treatment.&nbsp;<br><br>10.&nbsp; &nbsp;We seek the continued cooperation of all Singaporeans to remain united and disciplined in our fight against COVID-19.&nbsp;&nbsp;<br><br><strong>MINISTRY OF HEALTH<br>16 JANUARY 2021<br><br><sup></sup></strong><sup>1</sup> To expedite the COVID-19 PCR test at the airport, travellers are strongly encouraged to register and pre-pay for their on-arrival COVID-19 PCR test prior to departing for Singapore at <a href=\"https://safetravel.changiairport.com\" title=\"\" class=\"\" target=\"\">https://safetravel.changiairport.com</a>.<br></p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "updates-on-border-measures-and-travel-insurance", "CurrentPageUrl": null}, {"Title": "5 New Cases of Locally Transmitted  Covid-19 Infection", "PublishedDate": "/Date(1610784420000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "16 Jan 2021", "Summary": "", "MainContent": "<p style=\"text-align: justify;\"><span style=\"font-family: Arial;\"><span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As of 16 January 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 5 new cases of locally transmitted COVID-19 infection. Based on our investigations so far, 4 are in the community, and 1 resides in a dormitory.&nbsp;<br><br>2.&nbsp; &nbsp; &nbsp; &nbsp; In addition, there are 19 imported cases, who had already been placed on Stay-Home Notice or isolated upon arrival in Singapore. In total, there are 24 new cases of COVID-19 infection in Singapore today.<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>16 JANUARY 2021</strong></span></span></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "5-new-cases-of-locally-transmitted-covid-19-infection", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}