{"pressItemDictionary": {"Press Releases": [{"Title": "24 Private Healthcare Institutions Selected to Administer the Government's Stock of Sinovac-coronavac Covid-19 Vaccine", "PublishedDate": "/Date(1623854700000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "16 Jun 2021", "Summary": "", "MainContent": "<span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp; The Ministry of Health (MOH) has selected 24 private healthcare institutions licensed under the Private Hospitals and Medical Clinics Act (PHMCA) to be licensed providers of the Sinovac-CoronaVac vaccine under the Special Access Route (SAR). These providers will draw from MOH's existing stock, and can administer the vaccine to Singapore Citizens, Permanent Residents and persons holding Long-Term Passes who wish to take the Sinovac-CoronaVac vaccine.<br><br>2.&nbsp; &nbsp; &nbsp; MOH reviewed the applications based on the providers' ability to administer the vaccines safely, properly and efficiently. MOH also considered the providers' proposed vaccination administration fees, experience in vaccine administration and its compliance history at past licensing inspections, so as to ensure that the services will be safe and affordable to members of public.<br><br>3.&nbsp; &nbsp; &nbsp; The list of selected providers and their vaccination administration fee per dose of the Sinovac-CoronaVac vaccine is listed in <span style=\"text-decoration: underline;\"><a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-a-(1).pdf?sfvrsn=2dcfc975_0\" title=\"Annex A \">Annex A </a></span>. As these vaccines are being provided to the providers at no cost, individuals should take note that the providers should not charge them for the vaccine cost. The vaccination administration fees listed is also inclusive of consultation and 7% GST, so there should not be any additional costs (beyond the vaccination administration fees listed) charged by these providers. Interested individuals may contact these providers directly from 18 June 2021 for more details on how they may receive the vaccine.<br><br>4.&nbsp; &nbsp; &nbsp; As the Sinovac-CoronaVac COVID-19 vaccine remains unregistered and is not authorised by the Health Sciences Authority (HSA) for use under the Pandemic Special Access Route, it is to be provided only under the SAR framework, and hence will not be covered under the Vaccine Injury Financial Assistance Programme (VIFAP) meant for our national vaccination programme. Individuals who nevertheless wish to receive Sinovac-CoronaVac vaccinations under the SAR framework should discuss with their doctors in the selected private healthcare institutions the risks and benefits of using the Sinovac-CoronaVac vaccine, and jointly make an informed decision.<br><br><br>MINISTRY OF HEALTH<br>16 JUNE 2021</span>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "24-private-healthcare-institutions-selected-to-administer-the-government's-stock-of-sinovac-coronavac-covid-19-vaccine", "CurrentPageUrl": null}, {"Title": "19 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1623852600000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "16 Jun 2021", "Summary": "", "MainContent": "&nbsp; &nbsp; &nbsp; &nbsp; <span style=\"font-size: 16px;\">As of 16 June 2021, 12pm, the Ministry of Health (MOH) has confirmed and verified that there are 19 new cases of locally transmitted COVID-19 infection. The cases are in the community, and there are no new cases in the dormitories. Of the 19 cases, 10 are linked to previous cases and have already been placed on quarantine. 9 were detected through surveillance, amongst whom 6 are linked to previous cases and 3 are currently unlinked.&nbsp; There are 5 imported cases, who have already been placed on Stay-Home Notice (SHN) upon arrival in Singapore. Amongst the new cases today, 10 are asymptomatic, and were detected from our proactive screening and surveillance, while 14 were symptomatic.&nbsp;<br><br><strong>Summary of new cases</strong><br></span><div dir=\"ltr\" align=\"left\"><table><span style=\"font-size: 16px;\"><strong><colgroup><col width=\"129\"><col width=\"60\"><col width=\"16\"><col width=\"96\"><col width=\"96\"><col width=\"16\"><col width=\"96\"><col width=\"96\"></colgroup></strong></span><tbody><tr><td><span style=\"font-size: 16px;\"><strong><br></strong></span></td><td><span style=\"font-size: 16px;\"><strong><br></strong></span></td><td><span style=\"font-size: 16px;\"><strong><br></strong></span></td><td colspan=\"2\"><p dir=\"ltr\"><span style=\"font-size: 16px;\"><strong>Breakdown by</strong></span></p></td><td><span style=\"font-size: 16px;\"><strong><br></strong></span></td><td colspan=\"2\"><p dir=\"ltr\"><span style=\"font-size: 16px;\"><strong>Breakdown by</strong></span></p></td></tr><tr><td><span style=\"font-size: 16px;\"><strong><br></strong></span></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\"><strong>Number of cases</strong></span></p></td><td><span style=\"font-size: 16px;\"><strong><br></strong></span></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\"><strong>Already in quarantine/ isolation before detection</strong></span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\"><strong>Detected from surveillance</strong></span></p></td><td><span style=\"font-size: 16px;\"><strong><br></strong></span></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\"><strong>Symptomatic</strong></span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\"><strong>Asymptomatic</strong></span></p></td></tr><tr><td><p dir=\"ltr\"><span style=\"font-size: 16px;\"><strong>Cases in the community</strong></span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">19</span></p></td><td><span style=\"font-size: 16px;\"><br></span></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">10</span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">9</span></p></td><td><span style=\"font-size: 16px;\"><br></span></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">13</span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">6</span></p></td></tr><tr><td><p dir=\"ltr\"><span style=\"font-size: 16px;\"><strong>Cases residing in dormitories</strong></span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">0</span></p></td><td><span style=\"font-size: 16px;\"><br></span></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">0</span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">0</span></p></td><td><span style=\"font-size: 16px;\"><br></span></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">0</span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">0</span></p></td></tr><tr><td><p dir=\"ltr\"><span style=\"font-size: 16px;\"><strong>Imported cases</strong></span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">5</span></p></td><td><span style=\"font-size: 16px;\"><br></span></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">5</span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">0</span></p></td><td><span style=\"font-size: 16px;\"><br></span></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">1</span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">4</span></p></td></tr><tr><td><p dir=\"ltr\"><span style=\"font-size: 16px;\"><strong>Total</strong></span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">24</span></p></td><td><span style=\"font-size: 16px;\"><br></span></td><td><span style=\"font-size: 16px;\"><br></span></td><td><span style=\"font-size: 16px;\"><br></span></td><td><span style=\"font-size: 16px;\"><br></span></td><td><span style=\"font-size: 16px;\"><br></span></td><td><span style=\"font-size: 16px;\"><br></span></td></tr></tbody></table></div><span style=\"font-size: 16px;\"><br><br>2.&nbsp; &nbsp; &nbsp;Overall, the number of new cases in the community has increased from 71 cases in the week before to 77 cases in the past week. The number of unlinked cases in the community has also increased from 6 cases in the week before to 19 cases in the past week. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br><br>3.&nbsp; &nbsp; &nbsp;Amongst the 116 confirmed cases reported from 10 June to 16 June, 45 cases have tested positive for their serology tests, 62 have tested negative, and 9 serology test results are pending.<br><br><strong>Case Details</strong><br><br><strong>a) Cases in the community: 19</strong><br><br>There are 19 cases in the community today, of whom 16 are linked to previous cases and 3 are currently unlinked.<br><br><strong>Currently unlinked cases</strong><br><br>Detected through surveillance:<br><br><span style=\"text-decoration: underline;\">Case 64254</span> is an 85 year-old female Singaporean who is a retiree. She developed a fever on 12 June, but did not seek medical treatment until 15 June when she went to a General Practitioner (GP) clinic, where she was administered both an antigen rapid test (ART) and polymerase chain reaction (PCR) test. She was immediately isolated when her ART result came back positive on the same day. Her PCR test result also came back positive for COVID-19 infection on 15 June. Her serology test result is pending.<br><br><span style=\"text-decoration: underline;\">Case 64263</span> is a 47 year-old female Indonesia national who is a foreign domestic worker. She developed a fever on 15 June, and sought medical treatment at a GP clinic, where she underwent both an ART and PCR test. She was immediately isolated when her ART result came back positive on the same day. Her PCR test result came back positive for COVID-19 infection on 16 June. Her serology test result is pending.<br><br><span style=\"text-decoration: underline;\">Case 64264</span> is a 32 year-old female Indonesia national who is a foreign domestic worker. She developed a fever on 13 June, and a sore throat and cough on 14 June but did not seek medical attention.&nbsp; She was tested for COVID-19 on 15 June as part of our community surveillance testing for visitors to 115 and 116 Bukit Merah View. On the same day, she also sought medical treatment at a GP clinic, and underwent both an ART and PCR test. She was immediately isolated when her ART result came back positive for COVID-19 on the same day. Her PCR test result came back positive for COVID-19 infection on 16 June. Her serology test result is pending.<br><br><strong>115 Bukit Merah View Market &amp; Food Centre cluster</strong><br><br>Already quarantined:<br><br><span style=\"text-decoration: underline;\">Case 64240</span> is a 76 year-old male Singaporean who is a retiree, and frequently visited 115 and 116 Bukit Merah View. As he had been identified as a close contact of Case 64193[1], he was placed on quarantine on 13 June. He is asymptomatic, and was detected when he was tested for COVID-19 on 14 June during quarantine. His test result came back positive for COVID-19 infection on 15 June. He subsequently developed a fever on the same day. His serology test result is pending. Case 64240 received his first dose of COVID-19 vaccine on 8 March, and the second dose on 29 March.<br><br><span style=\"text-decoration: underline;\">Case 64241</span> is a 12 year-old female Singaporean who is a student at CHIJ St Theresa's Convent and was last in school on 18 May. She is a family member and household contact of Cases 64218[2] and 64242, and was placed on quarantine on 14 June. She was tested for COVID-19 on 14 June during quarantine. On the same day, she developed a fever, cough and runny nose and reported her symptoms. Her test result came back positive for COVID-19 infection on 15 June. Her serology test result is negative.<br><br><span style=\"text-decoration: underline;\">Case 64242</span> is a 33 year-old female Singaporean who works in an administrative role at South Asia Construction Pte Ltd, and part-time at Telok Blangah Food Centre.&nbsp; She is a family member and household contact of Cases 64218 and 64241, and was placed on quarantine on 14 June. She is asymptomatic, and was detected when she was tested for COVID-19 on 14 June during quarantine. Her test result came back positive for COVID-19 infection on 15 June. Her serology test result is pending.<br><br><span style=\"text-decoration: underline;\">Case 64246</span> is a 60 year-old male Singaporean who is a food stall vendor at 115 Bukit Merah View Market &amp; Food Centre. As he had been identified as a close contact of Case 64132[3], he was placed on quarantine on 12 June. He is asymptomatic, and was detected when he was tested for COVID-19 on 13 June during quarantine. His test result came back positive for COVID-19 infection on 15 June. His serology test result is pending. Case 64246 received his first dose of COVID-19 vaccine on 18 March, and the second dose on 8 April.<br><br><span style=\"text-decoration: underline;\">Case 64252</span> is a 38 year-old female Singaporean who works as a stall assistant at Zhangde Primary School's canteen and had last gone to work on 18 May. She is a family member and household contact of Cases 64202[4], 64212[5] and 64213[6], and&nbsp; a household contact of Cases 64201[7] and 64226[8], and was placed on quarantine on 13 June. She was tested for COVID-19 on 13 June during quarantine. On the same day, she developed a fever but did not report her symptoms. Her ART result came back positive on 13 June, and her PCR test result came back positive for COVID-19 infection on 15 June. She has tested preliminarily positive for the Delta variant, and is pending further confirmatory tests. Her serology test result is pending. Case 64252 received her first dose of COVID-19 vaccine on 9 April, and the second dose on 8 May.<br><br><span style=\"text-decoration: underline;\">Case 64260</span> is a 63 year-old male Singaporean who is a freelance worker and visits 115 and 116 Bukit Merah View frequently. He developed a cough, sore throat and runny nose on 12 June and sought medical treatment at a GP clinic on the same day where he was referred to undergo a COVID-19 test but did not do so. As he had been identified as a family member and household contact of Case 64229[9], he was placed on quarantine on 14 June. He was tested for COVID-19 on 15 June during quarantine, and his test result came back positive for COVID-19 infection on 16 June. His serology test result is negative for the N antigen, which suggests the presence of early infection. Case 64260 received his first dose of COVID-19 vaccine on 24 January, and the second dose on 16 February.<br><br><span style=\"text-decoration: underline;\">Case 64261 </span>is a 71 year-old female Singaporean who is a retiree. She is a family member and household contact of Case 64239[10], and was placed on quarantine on 15 June. She is asymptomatic and was detected when she was tested for COVID-19 on 15 June during quarantine. Her test result came back positive for COVID-19 infection on 16 June. Her serology test result is negative for the N antigen, which suggests the presence of early infection. Case 64261 received her first dose of COVID-19 vaccine on 22 May, and the second dose on 12 June.<br><br><span style=\"text-decoration: underline;\">Case 64262</span> is a 15 year-old female Singaporean who is a student at Gan Eng Seng School and was last in school on 18 May. She is a family member and household contact of Cases 64218[11] and 64241, and was placed on quarantine on 14 June. She was tested for COVID-19 on 15 June during quarantine. The next day, she developed a sore throat. Her test result came back positive for COVID-19 infection on 16 June. Her serology test result is pending.<br><br>Detected through surveillance:<br><span style=\"text-decoration: underline;\"><br>Case 64243</span> is a 69 year-old female Singaporean who works as a stall helper at New Changi Eating House. She sometimes helps out at a stall at 115 Bukit Merah View Market &amp; Food Centre, and had last gone to work at 115 Bukit Merah View Market &amp; Food Centre on 6 June. She is asymptomatic, was detected when she was tested for COVID-19 on 14 June as part of our testing operations for those who worked at 115 and 116 Bukit Merah View. Her test result came back positive for COVID-19 infection on 15 June. Her serology test result is negative.<br><span style=\"text-decoration: underline;\"><br>Case 64244</span> is a 49 year-old female Singaporean who works as a sales coordinator at Gold Lite Pte Ltd. As she had visited 116 Bukit Merah View on 8 June and 115 Bukit Merah View Market &amp; Food Centre on 9 June, she went for a COVID-19 test on 14 June as part of our testing operations for those who had visited the locations. Her test result came back positive for COVID-19 on 15 June. On the same day, she developed a sore throat. Her serology test result is negative for the N antigen, which suggests the presence of early infection. Case 64244 received her first dose of COVID-19 vaccine on 21 May.<br><span style=\"text-decoration: underline;\"><br>Case 64248</span> is a 45 year-old female Malaysia national who works as a stall assistant at Tiong Bahru Yong Tao Hu (56 Eng Hoon Street). She developed a cough and blocked nose on 14 June and sought medical treatment at a GP clinic on the same day, where she underwent both an ART and PCR test. She was immediately isolated when her ART result came back positive for COVID-19 on the same day. Her PCR test result came back positive for COVID-19 on 15 June. Her serology test result is negative.<br><br><span style=\"text-decoration: underline;\">Case 64257 </span>is a 64 year-old male Singaporean who is a taxi driver and frequently visited 115 Bukit Merah View Market &amp; Food Centre. He was detected when he underwent a COVID-19 test on 14 June as part of our community surveillance testing for visitors to 115 and 116 Bukit Merah View. He subsequently developed a cough and fever on the same day and sought medical treatment at a polyclinic on 15 June. His test result came back positive for COVID-19 infection the same day. His serology test result is negative.&nbsp;<br><br><span style=\"text-decoration: underline;\">Case 64258</span> is an 82 year-old male Singaporean who is a retiree, and frequently visited 115 Bukit Merah View Market and Food Centre. He developed a runny nose on 12 June but did not seek medical attention. He was detected when he visited a GP clinic for a COVID-19 test on 15 June, where he underwent an ART and PCR test. He was immediately isolated when his ART result came back positive for COVID-19. His PCR test result also came back positive for COVID-19 infection on 16 June. His serology test result is pending. Case 64258 received his first dose of COVID-19 vaccine on 28 March, and the second dose on 25 April.<br><br><strong>Case 64184 cluster </strong>[12]<br><br>Already quarantined:<br><br><span style=\"text-decoration: underline;\">Case 64249</span> is a 50 year-old male Singaporean who is employed as a part-time housekeeper at Eunike Living Pte Ltd. As he had been identified as a close contact of Case 64208[13], he was placed on quarantine on 13 June. He underwent an ART test on the same day and his test result came back negative. He subsequently developed a sore throat and headache on 15 June, and was tested for COVID-19. His test result came back positive for COVID-19 infection on the same day. His serology test result is negative for the N antigen, which suggests the presence of early infection. Case 64249 received his first dose of COVID-19 vaccine on 6 May, and the second dose on 3 June.<br><br><span style=\"text-decoration: underline;\">Case 64251</span> is a 26 year-old female Malaysia national who works as a waitress at Common Man Stan. As she had been identified as a household contact of Cases 64198[14], 64199[15] and 64206[16], she was placed on quarantine on 12 June. She was tested for COVID-19 on 13 June during quarantine. She subsequently developed a runny nose, body aches and breathlessness on 15 June but did not report her symptoms. Her test result came back positive for COVID-19 infection on 15 June. Her serology test result is negative.<br><br><strong>Other linked cases</strong><br><br>Detected through surveillance:<br><br><span style=\"text-decoration: underline;\">Case 64255</span> is an 84 year-old female Singaporean who is a retiree, and a household contact of Case 64264. She was tested for COVID-19 on 15 June as part of our community surveillance testing for visitors to 115 and 116 Bukit Merah View. On the same day, she developed a fever. Her test result came back positive for COVID-19 infection on 15 June. Her serology test result is pending.<br><br><strong>b) Cases residing in dormitories: 0</strong><br><br>There are no cases residing in dormitories today.<br><br><strong>c) Imported cases: 5</strong><br><br>Amongst the 5 imported cases,<br><br></span><ul><li dir=\"ltr\" aria-level=\"1\"><p dir=\"ltr\" role=\"presentation\"><span style=\"font-size: 16px;\">2 (Cases 64256 and 64259) are Singaporeans who returned from India and the UK.</span></p></li><li dir=\"ltr\" aria-level=\"1\"><p dir=\"ltr\" role=\"presentation\"><span style=\"font-size: 16px;\">3 (Cases 64247, 64250 and 64253) are Work Permit holders who arrived from Indonesia, all of whom are foreign domestic workers. </span></p></li></ul><span style=\"font-size: 16px;\"><br>They have all already been placed on SHN upon arrival in Singapore and were tested while serving SHN.<br><br>4.&nbsp; &nbsp; &nbsp;Please refer to the <a href=\"/docs/librariesprovider5/pressroom/press-releases/annexes-16-jun.pdf?sfvrsn=c87e89f4_0\" title=\"Annexes\">Annexes</a>&nbsp;and MOH's daily Situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\" title=\"\" class=\"\" target=\"\">http://www.moh.gov.sg/covid-19/situation-report</a>) for details.<br><br>5.&nbsp; &nbsp; &nbsp;Epidemiological investigations are in progress. In the meantime, all the identified close contacts of the cases have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for the close contacts to determine if the cases could have been infected by them.<br><br><strong>Update on condition of confirmed cases</strong><br><br>6.&nbsp; &nbsp; &nbsp;20 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 61,931 have fully recovered from the infection and have been discharged from hospitals or community care facilities.<br><br>7.&nbsp; &nbsp; &nbsp;There are currently 146 confirmed cases who are still in hospital. Of these, most are stable or improving, and 1 is in critical condition in the intensive care unit. 228 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 34 have passed away from complications due to COVID-19 infection.<br><br><br><strong>MINISTRY OF HEALTH<br>16 JUNE 2021</strong></span><br><br><br><br>[1]&nbsp;&nbsp;Case 64193 is a 72 year-old male Singaporean who works at a sundry shop at 115 Bukit Merah View Market &amp; Food Centre. He was confirmed to have COVID-19 infection on 12 June.<br><div>[2]&nbsp;Case 64218 is a 42 year-old male Singaporean who works as a hawker at Telok Blangah Drive Food Centre. He was confirmed to have COVID-19 infection on 14 June.<br>[3]&nbsp;Case 64132 is a 74 year-old male Singaporean who works at a sundry store at 115 Bukit Merah View Market &amp; Food Centre. He was confirmed to have COVID-19 infection on 9 June.<br>[4]&nbsp;Case 64202 is a 17 year-old male Singaporean who is a student at ITE College Central. He was confirmed to have COVID-19 infection on 13 June.<br>[5]&nbsp;Case 64212 is a 21 year-old female Singaporean who works as an IT engineer at IBM (Changi Business Park Central 1). She was confirmed to have COVID-19 infection on 13 June.<br>[6]&nbsp;Case 64213 is a 47 year-old male Singaporean who works as a cooking assistant at 115 Bukit Merah View Market &amp; Food Centre. He was confirmed to have COVID-19 infection on 13 June.<br>[7]&nbsp;Case 64201 is a 29 year-old female India national who is currently unemployed. She was confirmed to have COVID-19 infection on 13 June.<br>[8]&nbsp;Case 64226 is a 30 year-old male India national who works as a supervisor at Keong Hong Construction Pte Ltd. He was confirmed to have COVID-19 infection on 14 June.<br>[9]&nbsp;Case 64229 is an 87 year-old male Singaporean who is a retiree. He frequently visited 115 and 116 Bukit Merah View. He was confirmed to have COVID-19 infection on 14 June.<br>[10]&nbsp;Case 64239 is a 72 year-old male Singaporean who is a retiree. He was confirmed to have COVID-19 infection on 15 June.<br>[11]&nbsp;Case 64218 is a 42 year-old male Singaporean who works as a hawker at Telok Blangah Drive Food Centre. He was confirmed to have COVID-19 infection on 14 June.<br>[12]&nbsp;Case 64184 is a 27 year-old male India national who works as an engineer at Ecoxplore Pte Ltd. He was confirmed to have COVID-19 infection on 12 June.<br>[13]&nbsp;Case 64208 is a 33 year-old male Malaysia national who is employed as a cleaner by Eunike Living Pte Ltd. He was confirmed to have COVID-19 infection on 13 June.<br>[14]&nbsp;Case 64198 is a 29 year-old female India national who is a student at Amity Global Institute, Singapore. She was confirmed to have COVID-19 infection on 13 June.<br>[15]&nbsp;Case 64199 is a 40 year-old female Singaporean who is a food stall vendor at 115 Bukit Merah View Market &amp; Food Centre. She was confirmed to have COVID-19 infection on 13 June.<br>[16]&nbsp;Case 64206 is a 45 year-old female Malaysia national who works as an analyst at Pinnacle Credit Services. She was confirmed to have COVID-19 infection on 13 June.<br><div><br></div></div><br>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "19-new-cases-of-locally-transmitted-covid-19-infection-16-june-2021-update", "CurrentPageUrl": null}, {"Title": "19 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1623828600000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "16 Jun 2021", "Summary": "", "MainContent": "<span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp;As of 16 June 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 19 new cases of locally transmitted COVID-19 infection. 16 are linked to previous cases, amongst whom 10 have already been placed on quarantine, and 6 were detected through surveillance. The remaining 3 cases are currently unlinked. Based on our investigations so far, the cases are in the community, and there are no new cases in the dormitories.<br><br>2.&nbsp; &nbsp; In addition, there are 5 imported cases, who have already been placed on Stay-Home Notice upon arrival in Singapore. Of these, 2 are returning Singaporeans or Singapore Permanent Residents.<br><br>3.&nbsp; &nbsp; In total, there are 24 new cases of COVID-19 infection in Singapore today.<br><br>4.&nbsp; &nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.<br><br><br><strong>MINISTRY OF HEALTH<br>16 JUNE 2021</strong></span>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "19-new-cases-of-locally-transmitted-covid-19-infection-16-june-2021", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}