{"pressItemDictionary": {"Press Releases": [{"Title": "5 New Cases of Locally Transmitted Covid-19 Infection ", "PublishedDate": "/Date(1625038320000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "30 Jun 2021", "Summary": "", "MainContent": "&nbsp; &nbsp; &nbsp; As of 30 June 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 5 new cases of locally transmitted COVID-19 infection, all of whom are linked to previous cases, and have already been placed on quarantine. There are no unlinked cases today.<br><br>2.&nbsp; &nbsp; In addition, there are 11 imported cases, who have already been placed on Stay-Home Notice (SHN) or isolated upon arrival in Singapore. 6 were detected upon arrival in Singapore, while 5 developed the illness during SHN or isolation.<br><br>3.&nbsp; &nbsp; In total, there are 16 new cases of COVID-19 infection in Singapore today.<br><br>4.&nbsp; &nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>30 JUNE 2021</strong><br><div><br></div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "5-new-cases-of-locally-transmitted-covid-19-infection-30Jun", "CurrentPageUrl": null}, {"Title": "Updates On Border Measures for Travellers From Australia and Guangdong Province, Mainland China", "PublishedDate": "/Date(1625022600000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "30 Jun 2021", "Summary": "", "MainContent": "<p>The Multi-Ministry Taskforce has been closely monitoring the global COVID-19 situation. We will tighten our border measures for travellers from Australia, given the increase in the number of COVID-19 cases there. <br><br>2.&nbsp; &nbsp; &nbsp; As the situation in Guangdong province, Mainland China has improved, we will allow travellers from Guangdong province, Mainland China to undergo a COVID-19 polymerase chain reaction (PCR) test upon arrival, and to go about their activities in Singapore if the PCR test result is negative.</p><p><p><strong>Travellers from Australia to Serve 7-Day SHN at Place of Residence</strong></p><p>3.&nbsp; &nbsp; &nbsp;Given the increased cases observed in Australia, we will be tightening border control measures for travellers with travel history to Australia. From <strong>2 July 2021, 2359 hours:</strong></p></p><p><p>a) Singapore Citizens (SCs), Permanent Residents (PRs) and Long-Term Pass holders entering Singapore with travel history to Australia, within the last 21 days before departure for Singapore, will be subject to an on-arrival COVID-19 PCR test, a 7-day SHN at their place of residence, and a COVID-19 PCR test before the end of the SHN period.<br></p></p><p>b)&nbsp; Short-term travellers holding an Air Travel Pass (ATP), with travel history to Australia within the last 21 days before departure for Singapore, will <u>not</u> be allowed to enter Singapore.<br><br><strong>Updated Border Measures for Travellers from Guangdong Province, Mainland China<br><br></strong>4.&nbsp;<strong> &nbsp;</strong>We had earlier announced that travellers from Guangdong province, Mainland China will be subjected to an on-arrival COVID-19 PCR test, a 7-day SHN at their place of residence, and a COVID-19 PCR test before the end of the SHN period.<br><br>5.&nbsp; &nbsp;As the situation in Guangdong province, Mainland China has improved.<br><br>a) From&nbsp;<strong>2 July 2021, 2359 hours</strong>, all travellers entering Singapore with travel history to Guangdong province, Mainland China within the last 21 days before departure for Singapore will undergo a COVID-19 PCR test upon arrival, and will be allowed to go about their activities in Singapore if the PCR test result is negative. They will not need to serve a 7-day SHN period.<br><br>b)&nbsp;Short-term visitors with travel history to Guangdong province, Mainland China, within the last 21 days before departure for Singapore, can apply for an ATP with immediate effect, for entry into Singapore on or after&nbsp;<strong>7 July 2021</strong>. They will undergo a COVID-19 PCR test upon arrival, and will be allowed to go about their activities in Singapore if the PCR test result is negative.<br><br>c)&nbsp; Travellers who are already serving their 7-day SHN at their place of residence as of 2 July 2021, 2359 hours will still be required to complete their 7-day SHN and exit swab.<br><br>6.&nbsp; &nbsp;All other travellers with travel history to Mainland China (excluding Guangdong province) in the last 21 days prior to travel will continue to be subject to a COVID-19 test upon arrival at the airport, in lieu of their SHN.</p><p><strong>Regular Review of Border Measures<br><br></strong>7.&nbsp;<strong> &nbsp;&nbsp;</strong>As the global situation evolves, we will continue to adjust our border measures to manage the risk of importation and transmission to the community. Any changes to border measures will be updated on the <a href=\"https://safetravel.ica.gov.sg\" title=\"\" class=\"\" target=\"\">SafeTravel website</a>. Travellers are advised to visit the website to check for the most updated border measures before entering Singapore and be prepared to be subjected to the prevailing border measures upon entry.</p> <p><br> <br> </p> <div> <p><strong>MINISTRY OF HEALTH<br></strong><strong>30 JUNE 2021</strong></p> </div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "updates-on-border-measures-for-travellers-from-australia-and-guangdong-province-mainland-china", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}