{"pressItemDictionary": {"Press Releases": [{"Title": "4 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1623160800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "08 Jun 2021", "Summary": "", "MainContent": "&nbsp; &nbsp; &nbsp; As of 8 June 2021, 12pm, the Ministry of Health (MOH) has confirmed and verified that there are 4 new cases of locally transmitted COVID-19 infection. 1 is in the community and linked to previous cases, and has already been placed on quarantine. The remaining 3 are currently unlinked.&nbsp; Amongst them, 2 are in the community, and 1 resides in a dormitory. There are 5 imported cases, who have already been placed on Stay-Home Notice (SHN) upon arrival in Singapore. Amongst the new cases today, 8 are asymptomatic, and were detected from our proactive screening and surveillance, while 1 was symptomatic.&nbsp;&nbsp;<br><br><strong>Summary of new cases</strong><br><br><div dir=\"ltr\" align=\"left\"><table><colgroup><col width=\"129\"><col width=\"60\"><col width=\"16\"><col width=\"96\"><col width=\"96\"><col width=\"16\"><col width=\"96\"><col width=\"96\"></colgroup><tbody><tr><td><strong><br></strong></td><td><strong><br></strong></td><td><strong><br></strong></td><td colspan=\"2\"><p dir=\"ltr\"><strong>Breakdown by</strong></p></td><td><strong><br></strong></td><td colspan=\"2\"><p dir=\"ltr\"><strong>Breakdown by</strong></p></td></tr><tr><td><strong><br></strong></td><td><p dir=\"ltr\"><strong>Number of cases</strong></p></td><td><strong><br></strong></td><td><p dir=\"ltr\"><strong>Already in quarantine/ isolation before detection</strong></p></td><td><p dir=\"ltr\"><strong>Detected from surveillance</strong></p></td><td><strong><br></strong></td><td><p dir=\"ltr\"><strong>Symptomatic</strong></p></td><td><p dir=\"ltr\"><strong>Asymptomatic</strong></p></td></tr><tr><td><p dir=\"ltr\"><strong>Cases in the community</strong></p></td><td><p dir=\"ltr\">3</p></td><td><br></td><td><p dir=\"ltr\">1</p></td><td><p dir=\"ltr\">2</p></td><td><br></td><td><p dir=\"ltr\">1</p></td><td><p dir=\"ltr\">2</p></td></tr><tr><td><p dir=\"ltr\"><strong>Cases residing in dormitories</strong></p></td><td><p dir=\"ltr\">1</p></td><td><br></td><td><p dir=\"ltr\">0</p></td><td><p dir=\"ltr\">1</p></td><td><br></td><td><p dir=\"ltr\">0</p></td><td><p dir=\"ltr\">1</p></td></tr><tr><td><p dir=\"ltr\"><strong>Imported cases</strong></p></td><td><p dir=\"ltr\">5</p></td><td><br></td><td><p dir=\"ltr\">5</p></td><td><p dir=\"ltr\">0</p></td><td><br></td><td><p dir=\"ltr\">0</p></td><td><p dir=\"ltr\">5</p></td></tr><tr><td><p dir=\"ltr\"><strong>Total</strong></p></td><td><p dir=\"ltr\">9</p></td><td><br></td><td><br></td><td><br></td><td><br></td><td><br></td><td><br></td></tr></tbody></table></div><div><br>2.&nbsp; &nbsp; Overall, the number of new cases in the community has decreased from 125 cases in the week before to 93 cases in the past week. The number of unlinked cases in the community has also decreased from 24 cases in the week before to 10 cases in the past week. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br><br>3.&nbsp; &nbsp; Amongst the 150 confirmed cases reported from 2 June to 8 June, 79 cases have tested positive for their serology tests, 61 have tested negative, and 10 serology test results are pending.<br><br><br><strong>Case Details</strong><br><br><strong>a) Cases in the community: 3</strong><br><br>There are 3 cases in the community today, of whom 1 is linked to previous cases and 2 are currently unlinked.&nbsp;<br><br><strong>Currently unlinked cases&nbsp;<br></strong><br><em>Detected through surveillance:</em><br><br>Case 64107 is a 54 year-old male Singapore Permanent Resident who works as a vessel manager at NYK Shipmanagement Pte Ltd. He is asymptomatic, and was detected when he was administered both an antigen rapid test (ART) and polymerase chain reaction (PCR) test on 7 June before boarding a vessel. He was immediately isolated when his ART result came back positive for COVID-19. His PCR test result also came back positive for COVID-19 infection on 7 June. His earlier tests from Rostered Routine Testing (RRT) – the last being on 3 June – were all negative for COVID-19 infection. His serology test result is negative for the N antigen, which suggests the presence of early infection. Case 64107 received his first dose of COVID-19 vaccine on 25 January and the second dose on 17 February.<br><br>Case 64112 is a 35 year-old female Malaysia national who works as a retail assistant at Four Leaves (Ion Orchard and AMK Hub). She developed a fever, cough, sore throat and runny nose on 5 June but did not seek medical treatment until 7 June when she visited a General Practitioner (GP) clinic, where she was administered both an ART and PCR test, and was immediately isolated when her ART result came back positive for COVID-19. Her PCR test result also came back positive for COVID-19 infection on the same day. Her serology test result is pending.<br><br><strong>MINDSville@Napiri cluster</strong><br><br><em>Already quarantined:</em><br><br>Case 64108 is a resident at MINDSville@Napiri. He is asymptomatic, and was detected from our proactive testing of residents of the Home. He has already been vaccinated against COVID-19.&nbsp;<br><br><strong>b) Cases residing in dormitories: 1</strong><br><br>There is 1 case residing in a dormitory today who is currently unlinked.&nbsp;<br><br><em>Detected through surveillance:</em><br><br>Case 64113 is a 31 year-old male Bangladesh national who is employed by Isogo Marine Engineering Pte Ltd as a plumber and pipe fitter, and works at Keppel Shipyard Tuas Yard. He resides at Avery Lodge (2D Jalan Papan). He is asymptomatic, and was detected when he was tested on 7 June as part of testing for dormitory residents before they visited Terusan Recreation Centre. His ART result came back positive on the same day, and he was immediately isolated. His PCR test result came back positive for COVID-19 infection on 8 June. His earlier tests from RRT – the last being on 3 June – were all negative for COVID-19 infection. His serology test result is pending. Case 64113 received his first dose of COVID-19 vaccine on 7 March and the second dose on 28 March.&nbsp;<br><br><strong>c) Imported cases: 5</strong><br><br>Amongst the 5 imported cases,&nbsp;<br><br>-&nbsp; &nbsp;2 (Cases 64104 and 64110) are Singapore Permanent Residents who returned from India.<br>-&nbsp; &nbsp;2 are Work Permit holders who arrived from Indonesia and the Philippines, of whom 1 (Case 64109) is a foreign domestic worker.<br>-&nbsp; &nbsp;1 (Case 64106) is a Short-Term Visit Pass holder who was already receiving medical care in Singapore and had arrived from Indonesia for further treatment.&nbsp;<br><br>They have all already been placed on SHN upon arrival in Singapore and were tested while serving SHN.&nbsp;<br><br>4.&nbsp; &nbsp; Please refer to the <a href=\"/docs/librariesprovider5/default-document-library/annexesc03a41c4717a4187b5f3720c8dc3c43a.pdf?sfvrsn=c3400079_0\" title=\"Annexes\">Annexes</a>&nbsp;and MOH’s daily Situation Report (<a href=\"https://www.moh.gov.sg/covid-19/situation-report\" title=\"\" class=\"\" target=\"\">www.moh.gov.sg/covid-19/situation-report</a>) for details.&nbsp;<br><br>5.&nbsp; &nbsp; Epidemiological investigations are in progress. In the meantime, all the identified close contacts of the cases have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for the close contacts to determine if the cases could have been infected by them.<br><br>6.&nbsp; &nbsp; MOH has been monitoring existing clusters for any further transmission. As there have been no more cases linked to the MT ALLI cluster for the past two incubation periods (i.e. 28 days), the cluster has now been closed.<br><br><strong>Update on condition of confirmed cases</strong><br><br>7.&nbsp; &nbsp;42 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 61,702 have fully recovered from the infection and have been discharged from hospitals or community care facilities.&nbsp;<br><br>8.&nbsp; &nbsp; There are currently 187 confirmed cases who are still in hospital. Of these, most are stable or improving, and 2 are in critical condition in the intensive care unit. 296 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 34 have passed away from complications due to COVID-19 infection.&nbsp;<br><br>9.&nbsp; &nbsp; Case 62680, an 86 year-old female Singaporean, has passed away from complications due to COVID-19 infection on 7 June 2021. She was confirmed to have COVID-19 infection on 30 April when she was warded at Khoo Teck Puat Hospital for an unrelated medical condition. She had not been vaccinated against COVID-19, and had a history of diabetes mellitus, hyperlipidaemia, hypertension and hypothyroidism. Khoo Teck Puat Hospital has reached out to her family and is extending assistance to them.<br><br><br><strong>MINISTRY OF HEALTH<br>8 JUNE 2021</strong><br><br></div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "4-new-cases-of-locally-transmitted-covid-19-infection-8Jun-updated", "CurrentPageUrl": null}, {"Title": "4 New Cases of Locally Transmitted Covid-19 Infection ", "PublishedDate": "/Date(1623137580000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "08 Jun 2021", "Summary": "", "MainContent": "&nbsp; &nbsp; &nbsp; &nbsp; As of 8 June 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 4 new cases of locally transmitted COVID-19 infection. 1 is in the community and linked to previous cases, and has already been placed on quarantine. The remaining 3 are currently unlinked.&nbsp; Amongst them, 2 are in the community, and 1 resides in a dormitory.<br><br>2.&nbsp; &nbsp; &nbsp;In addition, there are 5 imported cases, who have already been placed on Stay-Home Notice upon arrival in Singapore. Of these, 2 are returning Singaporeans or Singapore Permanent Residents.<br><br>3.&nbsp; &nbsp; &nbsp;In total, there are 9 new cases of COVID-19 infection in Singapore today.<br><br>4.&nbsp; &nbsp; &nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>8 JUNE 2021</strong><br><div><br></div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "4-new-cases-of-locally-transmitted-covid-19-infection-8Jun", "CurrentPageUrl": null}, {"Title": "Publication of Fees Charged by Private Ambulance Operators for Price Transparency", "PublishedDate": "/Date(1623135600000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "08 Jun 2021", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; From 1 June 2021, the Ministry of Health (MOH) has published a list of fees charged by Private Ambulance Operators (PAOs) accredited under the Voluntary Accreditation Scheme (VAS) to provide conveyance services to the public. This helps to ensure greater price transparency for those who need private ambulance services. </p> <p>2.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The list of fees can be found on the MOH website[1]&nbsp;and provides information on common charges by VAS-accredited PAOs such as general conveyance fees and the use of commonly consumed services such as cardiopulmonary resuscitation. The list also contains detailed charges for items and consumables used for specific patient groups and medical conditions such as medications, airway/ ventilation and trauma-related equipment. These allow the public to make informed decisions about the choice of PAO based on the patient’s medical condition, and to estimate the bill size prior to engaging the PAO.</p><p><p>3.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The listing of fees by the individual VAS-accredited PAOs is currently voluntary. All PAOs will be required to publish their fees as part of price transparency requirements under the Healthcare Services Act (HCSA), when the Emergency Ambulance and Medical Transport Services Regulations[2]&nbsp;come into effect at the end of 2021.</p></p><p><p>4.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The VAS was introduced in 2018 to facilitate the PAOs’ transition into HCSA. Under HCSA, private ambulance services will be licensed to ensure the safety and safeguard the welfare of patients. Private ambulance services will be regulated as either an Emergency Ambulance Service or Medical Transport Service. Accredited operators under the VAS must adhere to standards under the scheme before the regulations for private ambulance services are implemented under HCSA.</p></p><p><p>5.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;As of 31 May 2021, more than 90 per cent[3]&nbsp;of the PAOs have come on board the VAS. The list of VAS-accredited PAOs is available on the Healthcare Institution (HCI) directory[4]. We encourage the public to make use of VAS-accredited PAOs should they require PAO services.</p></p><p><p>6.&nbsp; &nbsp;<b> &nbsp; &nbsp; &nbsp; &nbsp;</b>As MOH does not regulate the fees charged by the PAOs, the list serves as a consolidation and guide of price information. There may be other charges depending on the patient’s specific condition. The public are advised to check directly with the respective PAOs prior to engaging the service, to verify the fees applicable. The list of fees will be continually updated as PAOs submit their fees to MOH.</p></p> <div><br clear=\"all\"> <hr align=\"left\" size=\"1\" width=\"33%\"> <div id=\"ftn1\"> <p>[1]&nbsp;<a href=\"http://www.moh.gov.sg/licensing-and-regulation/accredited-private-ambulance-operators\">www.moh.gov.sg/licensing-and-regulation/accredited-private-ambulance-operators</a></p> </div> <div id=\"ftn2\"> <p>[2] Emergency Ambulance Service means a service to transport, by land, any individual suffering, or believed to be suffering, from an injury or condition of acute or sudden onset and of an emergency nature. Medical Transport Service means a ground conveyance that is used or intended to be used for the transport of patient(s) who is being provided with non-emergency clinical care or monitoring en-route.</p> </div> <div id=\"ftn3\"> <p>[3] Based on market share by number of EAS/MTS vehicles.</p> </div> <div id=\"ftn4\"> <p>[4]&nbsp;<a href=\"http://www.hcidirectory.gov.sg/hcidirectory/\">http://www.hcidirectory.gov.sg/hcidirectory/</a>.</p> </div> </div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "publication-of-fees-charged-by-private-ambulance-operators-for-price-transparency", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}