{"pressItemDictionary": {"Press Releases": [{"Title": "Community Surveillance Testing At Henderson Crescent and Lengkok Bahru", "PublishedDate": "/Date(1624804200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "27 Jun 2021", "Summary": "", "MainContent": "<p style=\"margin: 0px 0px 18px; padding: 0px; font-size: 13px; font-family: Arial, Verdana, sans-serif; text-align: justify;\"><span style=\"font-family: Arial;\"><span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The Ministry of Health (MOH) is investigating likely COVID-19 transmission at Henderson Crescent and Lengkok Bahru. So far, four cases[1]&nbsp;of COVID-19 infection have been detected in three households at&nbsp;103 Henderson Crescent. Separately, COVID-19 viral fragments were detected in wastewater samples collected from 55, 56 and 57 Lengkok Bahru.&nbsp;Epidemiological investigations are ongoing to determine linkages and the source of transmission.</span></span></p><p style=\"margin: 0px 0px 18px; padding: 0px; font-size: 13px; font-family: Arial, Verdana, sans-serif; text-align: justify;\"><span style=\"font-size: 16px;\"><span style=\"font-family: Arial;\"></span></span><strong style=\"font-family: Arial; font-size: 16px;\">103 HENDERSON CRESCENT&nbsp;</strong></p><p style=\"margin: 0px 0px 18px; padding: 0px; font-size: 13px; font-family: Arial, Verdana, sans-serif; text-align: justify;\"><span style=\"font-size: 16px;\"><span style=\"font-family: Arial;\"></span></span><span style=\"font-family: Arial; font-size: 16px;\">2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;In&nbsp;order to disrupt any wider, undetected community transmission, MOH&nbsp;will conduct mandatory&nbsp;COVID-19&nbsp;testing for all residents of 103 Henderson Crescent.&nbsp;Testing is optional for those who have tested negative for COVID-19 infection from 23 June onwards. In the event that a positive&nbsp;COVID-19&nbsp;case is detected, MOH will isolate the case, identify all close contacts, test and quarantine them to protect the community from further transmission.&nbsp;Mandatory testing will be conducted at the pavilion at 104B Henderson Crescent from 28 to 29 June 2021 between 9am and 4pm.<br><br></span><span style=\"font-family: Arial; font-size: 16px;\">3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;To detect possible asymptomatic cases in the community, MOH will also conduct voluntary COVID-19 testing for visitors and those who have interacted with residents of&nbsp;103 Henderson Crescent&nbsp;between 7 June and 26 June 2021. We encourage these individuals to come forward for testing.&nbsp;Testing will be conducted by appointment only at designated Regional Screening Centres from&nbsp;28 to 29 June 2021 and at the pavilion at 104B Henderson Crescent&nbsp;on 29 June 2021, between 9am and 4pm.&nbsp;To book an appointment and for information on the alternate test locations, please visit&nbsp;</span><a href=\"https://go.gov.sg/103-hc-covid-19-testing\" style=\"font-family: Arial; font-size: 16px;\" title=\"\" class=\"\" target=\"\">https://go.gov.sg/103-hc-covid-19-testing</a><span style=\"font-family: Arial; font-size: 16px;\">,&nbsp;or call 1800 333 9999 if you have any queries.</span></p><p style=\"margin: 0px 0px 18px; padding: 0px; font-size: 13px; font-family: Arial, Verdana, sans-serif; text-align: justify;\"><span style=\"font-size: 16px;\"><span style=\"font-family: Arial;\"></span></span><strong style=\"font-family: Arial; font-size: 16px;\">55, 56 and 57 LENGKOK BAHRU</strong></p><p style=\"margin: 0px 0px 18px; padding: 0px; font-size: 13px; font-family: Arial, Verdana, sans-serif; text-align: justify;\"><span style=\"font-size: 16px;\"><span style=\"font-family: Arial;\"><strong></strong></span></span><span style=\"font-family: Arial; font-size: 16px;\">4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;MOH&nbsp;will conduct mandatory&nbsp;COVID-19&nbsp;testing for all residents, as well as, owners and staff of shops at 55, 56 and 57 Lengkok Bahru.&nbsp;Testing is optional for those who have tested negative for COVID-19 infection from 23 June onwards.&nbsp;Mandatory testing will be conducted at the void deck of 53 Lengkok Bahru from 28 to 29 June 2021 between 9am and 4pm.</span></p><p style=\"margin: 0px 0px 18px; padding: 0px; font-size: 13px; font-family: Arial, Verdana, sans-serif; text-align: justify;\"><span style=\"font-size: 16px;\"><span style=\"font-family: Arial;\"></span></span><span style=\"font-family: Arial; font-size: 16px;\">5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;MOH will also conduct voluntary COVID-19 testing for visitors and those who have interacted with residents,&nbsp;as well as, owners and staff of shops at&nbsp;of 55, 56 and 57 Lengkok Bahru between 12 June and 26 June 2021.&nbsp;Testing will be conducted by appointment only at designated Regional Screening Centres from&nbsp;28 to 29 June 2021 and at the void deck of 53 Lengkok Bahru&nbsp;on 30 June 2021, between 9am and 4pm.&nbsp;To book an appointment and for information on the alternate test locations, please visit&nbsp;</span><a href=\"https://go.gov.sg/55-57-lb-covid-19-testing\" style=\"font-family: Arial; font-size: 16px;\" title=\"\" class=\"\" target=\"\">https://go.gov.sg/55-57-lb-covid-19-testing</a><span style=\"font-family: Arial; font-size: 16px;\">.</span></p><p style=\"margin: 0px 0px 18px; padding: 0px; font-size: 13px; font-family: Arial, Verdana, sans-serif; text-align: justify;\"><span style=\"font-size: 16px;\"><span style=\"font-family: Arial;\">6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;All residents are to bring along their NRIC for identification purposes.<strong>&nbsp;</strong>Leaflets have been distributed and SMS notifications have been sent to the residents to provide them with more information. Residents are also advised to monitor their health closely and consult a doctor immediately if they feel unwell. Those who are still awaiting their test results are advised to minimise social interactions as much as possible. They should continue to monitor their health and seek immediate medical attention if they feel unwell.</span></span></p><p style=\"margin: 0px 0px 18px; padding: 0px; font-size: 13px; font-family: Arial, Verdana, sans-serif;\"><span style=\"font-size: 16px;\"><span style=\"font-family: Arial;\"><strong></strong></span></span><strong style=\"font-family: Arial; font-size: 16px;\">MINISTRY OF HEALTH&nbsp;<br></strong><strong style=\"font-family: Arial; font-size: 16px;\">27 JUNE 2021</strong></p><div style=\"margin: 0px; padding: 0px; font-size: 13px; font-family: Arial, Verdana, sans-serif;\"><span style=\"font-size: 16px;\"><span style=\"font-family: Arial;\"><br clear=\"all\"></span></span><hr align=\"left\" size=\"1\" width=\"33%\"><div id=\"ftn1\" style=\"margin: 0px; padding: 0px;\"></div></div><p style=\"margin: 0px 0px 18px; padding: 0px;\"><span style=\"font-family: Arial;\"><span style=\"font-size: 13px;\">[1] Cases 64217, 64270, 64454 and 64478.</span></span></p><p><div style=\"margin: 0px; padding: 0px; font-size: 13px; font-family: Arial, Verdana, sans-serif;\"><div id=\"ftn1\" style=\"margin: 0px; padding: 0px;\"></div></div><br></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "community-surveillance-testing-at-henderson-crescent-and-lengkok-bahru_27Jun2021", "CurrentPageUrl": null}, {"Title": "12 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1624804140000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "27 Jun 2021", "Summary": "", "MainContent": "As of 27 June 2021, 12pm, the Ministry of Health (MOH) has confirmed and verified that there are 12 new cases of locally transmitted COVID-19 infection. The cases are in the community, and there are no new cases in the dormitories. Of the 12 cases, 10 are linked to previous cases and have already been placed on quarantine. 2 were detected through surveillance, amongst whom 1 is linked to previous cases and the remaining is currently unlinked. There are 2 imported cases, who have already been placed on Stay-Home Notice (SHN) upon arrival in Singapore. Amongst the new cases today, 8 are asymptomatic, and were detected from our proactive screening and surveillance, while 6 were symptomatic.<br><p>&nbsp;</p> <p><strong>Summary of new cases</strong></p> <p>&nbsp;</p> <table border=\"1\" cellspacing=\"0\" cellpadding=\"0\" width=\"907\"> <tbody><tr> <td width=\"194\"> <p align=\"right\">&nbsp;</p> </td> <td width=\"90\"> <p>&nbsp;</p> </td> <td width=\"24\" valign=\"top\"> <p>&nbsp;</p> </td> <td width=\"288\" colspan=\"2\"> <p align=\"center\"><strong>Breakdown by</strong></p> </td> <td width=\"24\" valign=\"top\"> <p>&nbsp;</p> </td> <td width=\"288\" colspan=\"2\"> <p align=\"center\"><strong>Breakdown by</strong></p> </td> </tr> <tr> <td width=\"194\"> <p align=\"right\">&nbsp;</p> </td> <td width=\"90\"> <p><strong>Number of cases</strong></p> </td> <td width=\"24\" valign=\"top\"> <p>&nbsp;</p> </td> <td width=\"144\"> <p><strong>Already in quarantine/ isolation before detection</strong></p> </td> <td width=\"144\"> <p><strong>Detected from surveillance</strong></p> </td> <td width=\"24\" valign=\"top\"> <p>&nbsp;</p> </td> <td width=\"144\"> <p><strong>Symptomatic</strong></p> </td> <td width=\"144\"> <p><strong>Asymptomatic</strong></p> </td> </tr> <tr> <td width=\"194\"> <p><strong>Cases in the community</strong></p> </td> <td width=\"90\"> <p align=\"center\">12</p> </td> <td width=\"24\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"144\"> <p align=\"center\">10</p> </td> <td width=\"144\"> <p align=\"center\">2</p> </td> <td width=\"24\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"144\"> <p align=\"center\">6</p> </td> <td width=\"144\"> <p align=\"center\">6</p> </td> </tr> <tr> <td width=\"194\"> <p><strong>Cases residing in dormitories</strong></p> </td> <td width=\"90\"> <p align=\"center\">0</p> </td> <td width=\"24\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"144\"> <p align=\"center\">0</p> </td> <td width=\"144\"> <p align=\"center\">0</p> </td> <td width=\"24\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"144\"> <p align=\"center\">0</p> </td> <td width=\"144\"> <p align=\"center\">0</p> </td> </tr> <tr> <td width=\"194\"> <p><strong>Imported cases</strong></p> </td> <td width=\"90\"> <p align=\"center\">2</p> </td> <td width=\"24\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"144\"> <p align=\"center\">2</p> </td> <td width=\"144\"> <p align=\"center\">0</p> </td> <td width=\"24\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"144\"> <p align=\"center\">0</p> </td> <td width=\"144\"> <p align=\"center\">2</p> </td> </tr> <tr> <td width=\"194\"> <p><strong>Total</strong></p> </td> <td width=\"90\"> <p align=\"center\">14</p> </td> <td width=\"24\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"144\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"144\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"24\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"144\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"144\"> <p align=\"center\">&nbsp;</p> </td> </tr> </tbody></table> <br><div><br>2. Overall, the number of new cases in the community has decreased from 108 cases in the week before to 95 cases in the past week. The number of unlinked cases in the community has increased from 13 cases in the week before to 18 cases in the past week. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br><br>3. Amongst the 130 confirmed cases reported from 21 June to 27 June, 45 cases have tested positive for their serology tests, 78 have tested negative, and 7 serology test results are pending.<br><br><strong>Case Details<br><br>a) Cases in the community: 12</strong><br><br>There are 12 cases in the community today, of whom 11 are linked to previous cases and 1 is currently unlinked.&nbsp;<br><br><strong>Currently unlinked cases&nbsp;</strong><br><br>Detected through surveillance:<br><br><span style=\"text-decoration: underline;\">Case 64483</span> is a 37 year-old male Singaporean who works as a bunk surveyor at GW Marine Pte Ltd. He was detected when he was tested for COVID-19 on 24 June as part of Rostered Routine Testing (RRT). His pooled test result came back positive for COVID-19 on 25 June, and he subsequently developed a fever. An individual test was administered the next day, and his test result came back positive for COVID-19 infection on 26 June. His earlier tests from RRT – the last being on 21 June – were all negative for COVID-19 infection. His serology test result is negative for the N antigen, which suggests the presence of early infection. Case 64483 received his first dose of COVID-19 vaccine on 20 January and the second dose on 10 February.<br><br><strong>115 Bukit Merah View Market &amp; Food Centre cluster</strong><br><br>Already quarantined:<br><br><span style=\"text-decoration: underline;\">Case 64485</span> is a 30 year-old female Singaporean who works as an executive at the Central Provident Fund Board and was last at work on 23 June. She is a family member and household contact of Case 64474<sup>1</sup> and was placed on quarantine on 25 June. She was tested for COVID-19 on 26 June during quarantine, and developed body aches on the same day. Her test result came back positive for COVID-19 infection on 26 June. Her serology test result is negative.<br><br><span style=\"text-decoration: underline;\">Case 64492</span> is a 12 year-old female Singaporean who is a student at Zhangde Primary School and was last in school on 18 May. She is a family member and household contact of Case 64461<sup>2</sup>&nbsp; and was placed on quarantine on 24 June. She was tested for COVID-19 on 24 June during quarantine, and her test result came back positive for COVID-19 infection on 26 June. Her serology test result is negative for the N antigen, which suggests the presence of early infection. Case 64492 received her first dose of COVID-19 vaccine on 10 June.<br><br><strong>105 Henderson Crescent cluster</strong><br><br>Already quarantined:<br><br><span style=\"text-decoration: underline;\">Case 64495</span> is an 82 year-old female Singaporean who is a retiree. She developed a cough and runny nose on 21 June but did not seek medical attention. As she had been identified as a household contact of Case 64473<sup>3</sup>, she was placed on quarantine on 26 June. She was tested for COVID-19 on 26 June during quarantine and her test result came back positive for COVID-19 infection on 27 June. Her serology test result is pending.<br><br><strong>Changi General Hospital cluster</strong><br><br>Already quarantined:<br><br><span style=\"text-decoration: underline;\">Case 64486</span> is a 58 year-old female Singaporean who is a homemaker. She is a family member and household contact of Cases 64462<sup>4</sup>&nbsp;and 64490, and was placed on quarantine on 25 June. She was tested for COVID-19 on the same day during quarantine, and developed a fever and cough later that day. Her test result came back positive for COVID-19 infection on 26 June. Her serology test result is negative for the N antigen, which suggests the presence of early infection. Case 64486 received her first dose of COVID-19 vaccine on 2 June.<br><br><span style=\"text-decoration: underline;\">Case 64487</span> is a 16 year-old female Singaporean who is a student at Republic Polytechnic, and was last on campus on 1 June. She is a family member and household contact of Case 64476<sup>5</sup>, and was placed on quarantine on 25 June. She is asymptomatic, and was detected when she was tested for COVID-19 on 25 June during quarantine. Her test result came back positive for COVID-19 infection on 26 June. Her serology test result is negative for the N antigen, which suggests the presence of early infection. Case 64487 received her first dose of COVID-19 vaccine on 16 June.<br><br><span style=\"text-decoration: underline;\">Case 64489</span> is a 62 year-old male Singaporean who works as a porter at Changi General Hospital (CGH), and was last at work on 21 June. He is a workplace contact of Cases 64413<sup>6</sup>, 64442<sup>7</sup>, 64443<sup>8</sup>, 64462 and 64476, and was placed on quarantine on 24 June. He developed a cough and runny nose on the same day, but did not report his symptoms. He was detected when he was tested for COVID-19 on 25 June during quarantine. His test result came back positive for COVID-19 infection on 26 June. His earlier tests from RRT – the last being on 21 June – were all negative for COVID-19 infection. His serology test result is pending. Case 64489 received his first dose of COVID-19 vaccine on 29 March and the second dose on 16 April.<br><br><span style=\"text-decoration: underline;\">Case 64490</span> is a 24 year-old female Singaporean who works as a porter at National University Hospital. She is a family member and household contact of Cases 64462 and 64486, and was placed on quarantine on 25 June. She was tested for COVID-19 on the same day during quarantine, and developed a fever the next day. Her test result came back positive for COVID-19 infection on 26 June, and she developed a sore throat and runny nose the next day. Her earlier tests from RRT – the last being on 22 June – were all negative for COVID-19 infection. Her serology test result is negative for the N antigen, which suggests the presence of early infection. Case 64490 received her first dose of COVID-19 vaccine on 20 January and the second dose on 10 February.<br><br>Detected through surveillance:<br><br><span style=\"text-decoration: underline;\">Case 64484</span> is a 69 year-old female Singaporean who works as a healthcare assistant at CGH. She is a workplace contact of Cases 64413 and 64442, and was last at work on 21 June. She developed body aches on 24 June and sought medical treatment at a polyclinic on the same day but was not tested for COVID-19. She subsequently developed a fever and sore throat on 25 June evening and sought medical treatment at a General Practitioner clinic that night, where she was referred for a COVID-19 test. On 26 June, she sought medical treatment at CGH, and was tested for COVID-19. Her test result came back positive for COVID-19 infection on the same day. Her earlier tests from RRT – the last being on 21 June – were all negative for COVID-19 infection. Her serology test result is negative for the N antigen, which suggests the presence of early infection. Case 64484 received her first dose of COVID-19 vaccine on 23 June.<br><br><strong>Case 64394<sup>9</sup> cluster</strong><br><br>Already quarantined:<br><br><span style=\"text-decoration: underline;\">Case 64494</span> is a 58 year-old male Singaporean who works as a private hire driver for Grab. He is a close contact of Case 64438<sup>10</sup>, and was placed on quarantine on 24 June. He is asymptomatic and was detected when he was tested for COVID-19 on 25 June during quarantine. His test result came back positive for COVID-19 infection on 26 June. His serology test result is pending. Case 64494 received his first dose of COVID-19 vaccine on 30 March, and his second dose on 20 April.<br><br><strong>Case 64444<sup>11</sup> cluster</strong><br><br>Already quarantined:<br><br><span style=\"text-decoration: underline;\">Case 64488</span> is a 74 year-old female Singaporean who is a retiree. She is a family member and household contact of Cases 64444 and 64491, and was placed on quarantine on 24 June. She is asymptomatic, and was detected when she was tested for COVID-19 on 25 June during quarantine. Her test result came back positive for COVID-19 infection on 26 June. Her serology test result is negative for the N antigen, which suggests the presence of early infection. Case 64488 received her first dose of COVID-19 vaccine on 5 March, and her second dose on 26 March.&nbsp;<br><br><span style=\"text-decoration: underline;\">Case 64491</span> is an 83 year-old male Singaporean who works as a cleaner at Seacare Environment Pte Ltd. He is a family member and household contact of Cases 64444 and 64488, and was placed on quarantine on 24 June. He is asymptomatic, and was detected when he was tested for COVID-19 on 25 June during quarantine. His test result came back positive for COVID-19 infection on 26 June. His serology test result is negative for the N antigen, which suggests the presence of early infection. Case 64491 received his first dose of COVID-19 vaccine on 5 March, and his second dose on 26 March.<br><br><strong>b) Cases residing in dormitories: 0</strong><br><br>There are no cases residing in dormitories today.&nbsp;<br><br><strong>c) Imported cases: 2</strong><br><br>Amongst the 2 imported cases,&nbsp;<br><br>• 1 (Case 64481) is a Singapore Permanent Resident who returned from India.<br>• 1 (Case 64482) is a Work Permit holder who arrived from Indonesia.<br><br>They have already been placed on SHN upon arrival in Singapore and were tested while serving SHN.<br><br>4. Please refer to the <a href=\"/docs/librariesprovider5/pressroom/press-releases/annexes---27-june-2021.pdf?sfvrsn=2b2a0ae6_2\" title=\"Annexes\">Annexes</a>&nbsp;and MOH’s daily Situation Report (<a href=\"https://www.moh.gov.sg/covid-19/situation-report\" title=\"\" class=\"\" target=\"\">www.moh.gov.sg/covid-19/situation-report</a>) for details.<br><br>5. Epidemiological investigations are in progress. In the meantime, all the identified close contacts of the cases have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for the close contacts to determine if the cases could have been infected by them.<br><br>6. MOH has been monitoring existing clusters for any further transmission. As there have been no more cases linked to the Case 63446 cluster for the past two incubation periods (i.e. 28 days), the cluster has now been closed.<br><br><strong>Update on condition of confirmed cases</strong><br><br>7. 14 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 62,195 have fully recovered from the infection and have been discharged from hospitals or community care facilities.&nbsp;<br><br>8. There are currently 148 confirmed cases who are still in hospital. Of these, most are stable or improving, and 4 are in critical condition in the intensive care unit. 165 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 36 have passed away from complications due to COVID-19 infection.&nbsp;<br><div><br>[1] Case 64474 is a 28 year-old female Singaporean who works as an officer with the Singapore Police Force. She was confirmed to have COVID-19 infection on 25 June.<br><br>[2] Case 64461 is an 11 year-old male Singaporean who is a student at Alexandra Primary School. He was confirmed to have COVID-19 infection on 25 June.<br><br>[3] Case 64473 is a 43 year-old female Indonesia national who is a foreign domestic worker. She was confirmed to have COVID-19 infection on 25 June.<br><br>[4] Case 64462 is a 66 year-old male Singaporean who works as a porter at Changi General Hospital. He was confirmed to have COVID-19 infection on 24 June.<br><br>[5] Case 64476 is a 48 year-old female Singaporean who works as a porter at Changi General Hospital. She was confirmed to have COVID-19 infection on 25 June.<br><br>[6] Case 64413 is a 35 year-old male Singaporean who works as a porter at Changi General Hospital. He was confirmed to have COVID-19 infection on 23 June.<br><br>[7] Case 64442 is a 67 year-old male Singaporean who works as a porter at Changi General Hospital. He was confirmed to have COVID-19 infection on 24 June.<br><br>[8] Case 64443 is a 72 year-old male Singaporean who works as a porter at Changi General Hospital. He was confirmed to have COVID-19 infection on 24 June.<br><div><br>[9] Case 64394 is an 81 year-old male Singaporean who is a retiree. He was confirmed to have COVID-19 infection on 22 June.<br><br>[10] Case 64438 is a 74 year-old female Singaporean who is a retiree. She was confirmed to have COVID-19 infection on 24 June.<br><br>[11] Case 64444 is a 32 year-old male Singaporean who works as an equipment specialist at Singapore General Hospital. He was confirmed to have COVID-19 infection on 24 June.<br></div></div><br></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "12-new-cases-of-locally-transmitted-covid-19-infection-27jun2021-update", "CurrentPageUrl": null}, {"Title": "12 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1624723200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "27 Jun 2021", "Summary": "", "MainContent": "As of 27 June 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 12 new cases of locally transmitted COVID-19 infection. 11 are linked to previous cases, amongst whom 10 have already been placed on quarantine, and 1 was detected through surveillance. The remaining case is currently unlinked. Based on our investigations so far, the cases are in the community, and there are no new cases in the dormitories.<br><br>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In addition, there are 2 imported cases, who have already been placed on Stay-Home Notice upon arrival in Singapore. Of these, 1 is a returning Singapore Permanent Resident.<br><br>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In total, there are 14 new cases of COVID-19 infection in Singapore today.<br><br>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "12-new-cases-of-locally-transmitted-covid-19-infection-27jun2021", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}