{"pressItemDictionary": {"Press Releases": [{"Title": "21 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1621953900000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "25 May 2021", "Summary": "", "MainContent": "<span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp;As of 25 May 2021, 12pm, the Ministry of Health (MOH) has confirmed and verified that there are 21 new cases of locally transmitted COVID-19 infection. 15 are linked to previous cases, amongst which 8 have already been placed on quarantine, and 7 were detected through surveillance. The remaining 6 are currently unlinked. 18 are in the community, and 3 reside in dormitories. There are 9 imported cases, who had already been placed on Stay-Home Notice (SHN) upon arrival in Singapore. Amongst the new cases today, 13 are asymptomatic, and were detected from our proactive screening and surveillance, while 17 were symptomatic.&nbsp;<br><br><strong>Summary of new cases</strong></span><div><span style=\"font-size: 16px;\"><br></span><div dir=\"ltr\" align=\"left\"><span style=\"font-size: 16px;\"><strong></strong></span><span style=\"font-size: 16px;\"></span><table><colgroup><col width=\"129\"><col width=\"60\"><col width=\"16\"><col width=\"96\"><col width=\"96\"><col width=\"16\"><col width=\"96\"><col width=\"96\"></colgroup><tbody><tr><td><span style=\"font-size: 16px;\"><strong><br></strong></span></td><td><span style=\"font-size: 16px;\"><strong><br></strong></span></td><td><span style=\"font-size: 16px;\"><strong><br></strong></span></td><td colspan=\"2\"><p dir=\"ltr\"><span style=\"font-size: 16px;\"><strong>Breakdown by</strong></span></p></td><td><span style=\"font-size: 16px;\"><strong><br></strong></span></td><td colspan=\"2\"><p dir=\"ltr\"><span style=\"font-size: 16px;\"><strong>Breakdown by</strong></span></p></td></tr><tr><td><span style=\"font-size: 16px;\"><strong><br></strong></span></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\"><strong>Number of cases</strong></span></p></td><td><span style=\"font-size: 16px;\"><strong><br></strong></span></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\"><strong>Already in quarantine/ isolation before detection</strong></span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\"><strong>Detected from surveillance</strong></span></p></td><td><span style=\"font-size: 16px;\"><strong><br></strong></span></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\"><strong>Symptomatic</strong></span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\"><strong>Asymptomatic</strong></span></p></td></tr><tr><td><p dir=\"ltr\"><span style=\"font-size: 16px;\"><strong>Cases in the community</strong></span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">18</span></p></td><td><span style=\"font-size: 16px;\"><br></span></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">8</span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">10</span></p></td><td><span style=\"font-size: 16px;\"><br></span></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">16</span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">2</span></p></td></tr><tr><td><p dir=\"ltr\"><span style=\"font-size: 16px;\"><strong>Cases residing in dormitories</strong></span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">3</span></p></td><td><span style=\"font-size: 16px;\"><br></span></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">0</span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">3</span></p></td><td><span style=\"font-size: 16px;\"><br></span></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">1</span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">2</span></p></td></tr><tr><td><p dir=\"ltr\"><span style=\"font-size: 16px;\"><strong>Imported cases</strong></span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">9</span></p></td><td><span style=\"font-size: 16px;\"><br></span></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">8</span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">1</span></p></td><td><span style=\"font-size: 16px;\"><br></span></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">0</span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">9</span></p></td></tr><tr><td><p dir=\"ltr\"><span style=\"font-size: 16px;\"><strong>Total</strong></span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">30</span></p></td><td><span style=\"font-size: 16px;\"><br></span></td><td><span style=\"font-size: 16px;\"><br></span></td><td><span style=\"font-size: 16px;\"><br></span></td><td><span style=\"font-size: 16px;\"><br></span></td><td><span style=\"font-size: 16px;\"><br></span></td><td><span style=\"font-size: 16px;\"><br></span></td></tr></tbody></table></div><span style=\"font-size: 16px;\"><br>2.&nbsp; &nbsp; &nbsp; Overall, the number of new cases in the community has increased from 163 cases in the week before to 176 cases in the past week. The number of unlinked cases in the community has decreased from 37 cases in the week before to 30 cases in the past week.&nbsp;We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br><br>3.&nbsp; &nbsp; &nbsp;&nbsp;Amongst the 239 confirmed cases reported from 19 May to 25 May, 59 cases have tested positive for their serology tests, 165 have tested negative, and 15 serology test results are pending.<br><br><br><strong>Case Details</strong><br><br><strong>a) Cases in the community: 18</strong><br><br>There are 18 cases in the community today, of whom 12 are linked to previous cases and 6 are currently unlinked.<br><br><strong>Currently unlinked cases</strong><br><br>Detected through surveillance:<br><br><span style=\"text-decoration: underline;\">Case 63683 </span>is a 29 year-old male Malaysia national who works at Tiger Sugar Bubble Tea (Holland Piazza). He developed a fever and sore throat on 21 May and sought medical treatment at a General Practitioner (GP) clinic on the same day, where he was tested for COVID-19. His test result came back positive for COVID-19 infection on 24 May. His serology test result is negative.<br><br><span style=\"text-decoration: underline;\">Case 63708</span> is a 15 year-old male Singaporean who is a student at Westwood Secondary School and was last in school on 18 May. He developed a fever and runny nose on 22 May and sought medical treatment at a polyclinic on 24 May, where he underwent both an antigen rapid test (ART) and polymerase chain reaction (PCR) test, and was immediately isolated when his ART result came back positive. His PCR test result came back positive for COVID-19 infection on the same day. His serology test result is negative.<br><br><span style=\"text-decoration: underline;\">Case 63710 </span>is a 27 year-old male Singaporean who works as a project manager at Fei Ying Trading Enterprise. He developed a fever on 23 May and sought medical treatment at a GP clinic on the same day, where he was tested for COVID-19. His test result came back positive for COVID-19 infection on 24 May. His serology test result is negative.<br><br><span style=\"text-decoration: underline;\">Case 63711</span> is a 27 year-old male Malaysia national who works as a housekeeper at Sengkang General Hospital. He developed a fever on 23 May and sought medical treatment at a polyclinic on 24 May, where he underwent both an ART and PCR test on the same day. He was immediately isolated when his ART result came back positive. His PCR test result also came back positive for COVID-19 infection on 24 May. His serology test result is negative.<br><br><span style=\"text-decoration: underline;\">Case 63714</span> is a 74 year-old male Singaporean who is a retiree. He developed a cough, runny nose and chills on 23 May and sought medical treatment at a GP clinic on 24 May. He underwent both an ART and PCR test on the same day, and was immediately isolated when his ART result came back positive. His PCR test result also came back positive for COVID-19 infection on 24 May. His serology test result is pending. Case 63714 received his first dose of COVID-19 vaccine on 27 February, and the second dose on 20 March.<br><br><span style=\"text-decoration: underline;\">Case 63721</span> is a 50 year-old male Singaporean who works as an engineer at Tektronix Southeast Asia Pte Ltd. He developed a fever and sore throat on 22 May and sought medical treatment at a GP clinic on 24 May, where he was tested for COVID-19. His test result came back positive for COVID-19 infection on the same day. His serology test result is pending. Case 63721 received his first dose of COVID-19 vaccine on 17 May.<br><br><strong>JEM/ Westgate cluster</strong><br><br>Already quarantined:<br><span style=\"text-decoration: underline;\"><br>Case 63704</span> is a 13 year-old male Singaporean who is a student at Kranji Secondary School and had last gone to school on 17 May. He is a family member of Case 63524[1[, and was placed on quarantine on 21 May. He developed a fever on 23 May and reported his symptom. He was tested for COVID-19 on the same day and his test result came back positive for COVID-19 infection on 24 May. His serology test result is negative.<br><br><span style=\"text-decoration: underline;\">Case 63707</span> is a 7 year-old male Singaporean who is a student at Rulang Primary School and had last gone to school on 14 May. He is a family member and household contact of Cases 63417[2] and 63508[3], and was placed on quarantine on 17 May. He was tested for COVID-19 on 19 May during quarantine, and his test result was negative. He subsequently developed a fever on 23 May and reported his symptom. He was tested for COVID-19 again on 23 May and his test result came back positive for COVID-19 infection on 24 May. His serology test result is pending.<br><br><strong>Learning Point cluster</strong><br><br>Already quarantined:</span></div><div><span style=\"font-size: 16px;\"><br><span style=\"text-decoration: underline;\">Case 63706 </span>is a 44 year-old female Singaporean who works at Citibank but has been working from home since 17 April. She is a family member and household contact of Case 63353[4], and was placed on quarantine on 17 May. She was tested for COVID-19 on 17 May and 20 May, and her test results were negative. She developed a sore throat on 23 May and was tested for COVID-19 on 24 May. Her test result came back positive for COVID-19 infection on the same day. Her serology test result is negative.<br><strong><br>McDonald's delivery riders cluster</strong><br><br>Already quarantined:<br><br><span style=\"text-decoration: underline;\">Case 63694</span> is a 25 year-old male Malaysia national who works as a delivery rider for Domino's Pizza (Tanjong Katong). As he had been identified as a close contact of Case 63629[5], he was placed on quarantine on 22 May. He was tested for COVID-19 on 22 May and his test result came back positive for COVID-19 infection the next day. He developed a fever, headache, body aches and vomiting on 24 May. His serology test result is pending.<br><br>Detected through surveillance:<br><br><span style=\"text-decoration: underline;\">Case 63713</span> is a 72 year-old female Singaporean who works as a kitchen staff at McDonald's (Pasir Ris Elias Community Club). She is asymptomatic and was arranged by her company to be tested for COVID-19 on 21 May. Her test result came back positive for COVID-19 infection on 24 May. Her serology test result is pending.<br><br><span style=\"text-decoration: underline;\">Case 63717</span> is a 32 year-old male Singaporean who works as a kitchen staff for McDonald's (Bedok Reservoir). As he had been identified as a colleague of Case 63534[6], he was placed on phone surveillance on 22 May. He developed a fever on 24 May and sought medical treatment at a GP clinic, where he underwent both an ART and PCR test, and was immediately isolated when his ART result came back positive on the same day. His PCR test result came back positive on 25 May. His serology test result is pending.<br><br><strong>Case 63479 cluster</strong>[7]<br><br>Already quarantined:<br><br><span style=\"text-decoration: underline;\">Case 63699</span> is a 40 year-old male Myanmar national who works as a technician at Greenland Technology Pte Ltd. As he had been identified as a household contact of Case 63479, he was placed on quarantine on 19 May. He was tested for COVID-19 on 23 May during quarantine, and developed a runny nose on the same day. His test result came back positive for COVID-19 infection on 24 May. His earlier tests from Rostered Routine Testing (RRT) - the last being on 12 May - were all negative for COVID-19 infection. His serology test result is negative.<br><br><strong>Case 63543 cluster</strong>[8]<br><br>Already quarantined:<br><span style=\"text-decoration: underline;\"><br>Case 63700</span> is a 6 year-old male Singaporean who is a student at My First Skool at 211 Jurong East Street 21. He is a family member of Cases 63543 and 63551[9], and was placed on quarantine on 21 May. He is asymptomatic and was detected when he was tested for COVID-19 on 23 May during quarantine. His test result came back positive for COVID-19 infection on 24 May. His serology test result is pending.<br><br><br><strong>Case 63660 cluster</strong>[10]<br><br>Already quarantined:<br><br><span style=\"text-decoration: underline;\">Case 63701</span> is a 60 year-old male Singaporean who is a retiree. He is a family member and household contact of Case 63661[11]. He developed a cough on 17 May but did not seek medical treatment. As he had been identified as a close contact of Case 63661, he was placed on quarantine on 23 May. He was tested for COVID-19 on the same day during quarantine, and his test result came back positive for COVID-19 infection on 24 May. His serology result is negative.<br><br>Detected through surveillance:<br><br><span style=\"text-decoration: underline;\">Case 63702</span> is a 57 year-old female Singaporean who works as a retail vendor at Chong Pang City, and is a family member and household contact of Case 63661. She developed a fever and anosmia on 17 May but did not seek medical treatment. As she had been identified as a close contact of Case 63661, she was placed on quarantine on 23 May. She was tested for COVID-19 on the same day during quarantine, and her test result came back positive for COVID-19 infection on 24 May. Her serology result is pending.<br><br><span style=\"text-decoration: underline;\">Case 63703</span> is a 30 year-old male Singaporean who is self-employed and works from home. He is a family member and household contact of Case 63661. He developed a fever on 21 May but did not seek medical treatment. As he had been identified as a close contact of Case 63661, he was placed on quarantine on 23 May. He was tested for COVID-19 on the same day during quarantine, and his test result came back positive for COVID-19 infection on 24 May. His serology result is negative.<br><br><strong>Other linked cases</strong><br><br>Detected through surveillance:<br><br>Case 63709 is a 46 year-old female Singaporean who works as a secretary at Prestige Legal LLP. She is a family member and household contact of Case 63708. She developed a fever, sore throat and cough on 23 May, and sought medical treatment at a polyclinic on 24 May, where she underwent both an ART and PCR test. She was immediately isolated when her ART result came back positive. Her PCR test result came back positive for COVID-19 infection on the same day. Her serology test result is negative.<br><strong><br>b) Cases residing in dormitories: 3</strong><br><br>There are 3 cases residing in a dormitory today who are linked to a previous case.<br><br>Cases 63696, 63697 and 63698 are construction workers at H&amp;W Communications Pte Ltd, and reside at Harvest @ Woodlands (280 Woodlands Industrial Park E5).&nbsp; They are roommates of Case 63622[12]. They were detected when they were tested on 22 May as part of RRT. Case 63696 developed a fever on the same day, while Cases 63697 and 63698 are asymptomatic. They were confirmed to have COVID-19 infection on 24 May. Their earlier tests from RRT - the last being on 8 May - were negative for COVID-19 infection. Their serology test results are negative.<br><br><strong>c) Imported cases: 9</strong><br><br>Amongst the 9 imported cases,<br><br></span><ul><li dir=\"ltr\" aria-level=\"1\"><p dir=\"ltr\" role=\"presentation\"><span style=\"font-size: 16px;\">2 (Cases 63705 and 63712) are Singaporeans and 1 (Case 63718) is a Singapore Permanent Resident who returned from India, Indonesia and Myanmar.</span></p></li><li dir=\"ltr\" aria-level=\"1\"><p dir=\"ltr\" role=\"presentation\"><span style=\"font-size: 16px;\">1 (Case 63716) is a Dependant’s Pass holder who arrived from the US.</span></p></li><li dir=\"ltr\" aria-level=\"1\"><p dir=\"ltr\" role=\"presentation\"><span style=\"font-size: 16px;\">1 (Case 63715) is a Work Pass holder who arrived from the Philippines.</span></p></li><li dir=\"ltr\" aria-level=\"1\"><p dir=\"ltr\" role=\"presentation\"><span style=\"font-size: 16px;\">3 (Cases 63687, 63691 and 63719) are Work Permit holders who arrived from Indonesia and the Philippines, all of whom are foreign domestic workers.</span></p></li></ul><ul><li dir=\"ltr\" aria-level=\"1\"><p dir=\"ltr\" role=\"presentation\"><span style=\"font-size: 16px;\">1 (Case 63695) is a Short-Term Visit Pass holder who arrived from Papua New Guinea to visit his Singapore family member.&nbsp;</span></p></li></ul><span style=\"font-size: 16px;\"><br>They had all already been placed on SHN upon arrival in Singapore and were tested while serving SHN.<br><br>Case 63705 is a 62 year-old male Singaporean who had been in Indonesia since 7 June 2020. He returned to Singapore on 28 March 2021, and served SHN at a dedicated facility until 11 April. Both his on-arrival test on 28 March, as well as his swab done on 10 April during SHN, were negative for COVID-19. He is asymptomatic, and was detected when he took a COVID-19 pre-departure test on 21 May in preparation for a trip to Indonesia. His test result came back positive on 22 May. His Ct value was very high, which is indicative of a low viral load, and his serology test result has also come back positive. Given that these indicate likely past infection, we have classified the case as imported based on his travel history. He is likely to be shedding minute fragments of the virus RNA, which are no longer transmissible and infective to others.<br><br>4.&nbsp; &nbsp; &nbsp; &nbsp;Please refer to the <a href=\"/docs/librariesprovider5/pressroom/press-releases/annexes-25-may-rev.pdf?sfvrsn=dc384f46_0\" title=\"Annexes\">Annexes</a>&nbsp;and MOH's daily Situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\" rel=\"noreferrer\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?q=http://www.moh.gov.sg/covid-19/situation-report&amp;source=gmail&amp;ust=1622040097647000&amp;usg=AFQjCNFiFvAO6JzNjGPzwsPrfbWAdFui2g\">http://www.moh.gov.sg/covid-1<wbr>9/situation-report</a>) for details.<br><br>5.&nbsp; &nbsp; &nbsp; &nbsp;Epidemiological investigations are in progress. In the meantime, all the identified close contacts of the cases have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for the close contacts to determine if the cases could have been infected by them.<br><br>6.&nbsp; &nbsp; &nbsp; &nbsp;MOH has been monitoring existing clusters for any further transmission. As there have been no more cases linked to the Westlite Woodlands Dormitory cluster for the past two incubation periods (i.e. 28 days), the cluster has now been closed.<br><strong><br>Update on condition of confirmed cases</strong><br><br>7.&nbsp; &nbsp; &nbsp; &nbsp;13 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 61,329 have fully recovered from the infection and have been discharged from hospitals or community care facilities.<br><br>8.&nbsp; &nbsp; &nbsp; &nbsp;There are currently 250 confirmed cases who are still in hospital. Of these, most are stable or improving, and 2 are in critical condition in the intensive care unit. 279 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 32 have passed away from complications due to COVID-19 infection.<br><br><strong><br>MINISTRY OF HEALTH<br>25 MAY 2021</strong></span><br><br><br><br>[1] Case 63524 is a 41 year-old female Singaporean who is a homemaker, and a close contact of Case 63357. She was confirmed to have COVID-19 infection on 20 May.<br>[2] Case 63417 is a 38 year-old female Singaporean who works as an analyst at HSBC. She was confirmed to have COVID-19 infection on 18 May.<br>[3]Case 63508 is a 40 year-old male Singaporean who works as an engineer at Flexicon Singapore Pte Ltd. He was confirmed to have COVID-19 infection on 20 May.<br>[4] Case 63353 is a 7 year-old female Singaporean who is a student at Maha Bodhi School. She was confirmed to have COVID-19 infection on 16 May.<br>[5] Case 63629 is a 31 year-old male Malaysia national who works as a delivery rider for Pizza Hut (Punggol Plaza). He was confirmed to have COVID-19 infection on 23 May.<br>[6]&nbsp; Case 63534 is a 27 year-old male Malaysia national who works as a delivery rider for IVIC Logistic Pte Ltd and McDonald's (Bedok Reservoir). He was confirmed to have COVID-19 on 20 May.<br>[7] Case 63479 is a 49 year-old female Singapore Permanent Resident who is a homemaker. She was confirmed to have COVID-19 infection on 20 May.<br>[8] Case 63543 is a 40 year-old male Singaporean who works as an operations personnel at The Meatery SG. He was confirmed to have COVID-19 infection on 21 May.<br>[9] Case 63551 is a 39 year-old female Singaporean who works as an administrative personnel at Tomoe Transtech Specialty Gases Pte Ltd. She was confirmed to have COVID-19 infection on 21 May.<br>[10] Case 63660 is a 31 year-old male Singaporean who works as a property agent with ERA Realty Network Pte Ltd. He was confirmed to have COVID-19 infection on 23 May.<br>[11] Case 63661 is a 28 year-old female Singaporean who works as an engineer at Takenaka Corporation. She was confirmed to have COVID-19 infection on 23 May.<br>[12] Case 63622 is a 46 year-old male Malaysia national who works as a construction worker at H&amp;W Communications Pte Ltd, and resides at Harvest @ Woodlands. He was confirmed to have COVID-19 infection on 22 May.<br></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "21-new-cases-of-locally-transmitted-covid-19-infection-25-may-2021-update", "CurrentPageUrl": null}, {"Title": "21 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1621929000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "25 May 2021", "Summary": "", "MainContent": "<span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;As of 25 May 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 21 new cases of locally transmitted COVID-19 infection. 15 are linked to previous cases, amongst which 8 have been placed on quarantine, and 7 were detected through surveillance. The remaining 6 are currently unlinked. Based on our investigations so far, 18 are in the community, and 3 reside in dormitories.<br><br>2.&nbsp; &nbsp; &nbsp;In addition, there are 9 imported cases, who have already been placed on Stay-Home Notice upon arrival in Singapore. Of these, 3 are returning Singaporeans or Singapore Permanent Residents.<br><br>3.&nbsp; &nbsp; &nbsp;In total, there are 30 new cases of COVID-19 infection in Singapore today<br><br>4.&nbsp; &nbsp; &nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.<br><br><br><strong>MINISTRY OF HEALTH<br>25 MAY 2021<br></strong></span><div><span style=\"font-size: 16px;\"><br></span></div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "21-new-cases-of-locally-transmitted-covid-19-infection-25-may-2021", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}