{"pressItemDictionary": {"Press Releases": [{"Title": "7 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1622816460000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "04 Jun 2021", "Summary": "", "MainContent": "<span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp; As of 4 June 2021, 12pm, the Ministry of Health (MOH) has confirmed and verified that there are 7 new cases of locally transmitted COVID-19 infection. 6&nbsp;are linked to previous cases, amongst whom 5 have already been placed on quarantine, and 1 was detected through surveillance. The remaining case is currently unlinked[1]. The cases are in the community, and there are no new cases in the dormitories. There are 6 imported cases, who have already been placed on Stay-Home Notice (SHN) upon arrival in Singapore. Amongst the new cases today, 8 are asymptomatic, and were detected from our proactive screening and surveillance, while 5 were symptomatic.&nbsp;<br><br><strong>Summary of new cases</strong><br><br></span><div dir=\"ltr\" align=\"left\"><span style=\"font-size: 16px;\"></span><table><colgroup><col width=\"129\"><col width=\"60\"><col width=\"16\"><col width=\"96\"><col width=\"96\"><col width=\"16\"><col width=\"96\"><col width=\"96\"></colgroup><tbody><tr><td><span style=\"font-size: 16px;\"><strong><br></strong></span></td><td><span style=\"font-size: 16px;\"><strong><br></strong></span></td><td><span style=\"font-size: 16px;\"><strong><br></strong></span></td><td colspan=\"2\"><p dir=\"ltr\"><span style=\"font-size: 16px;\"><strong>Breakdown by</strong></span></p></td><td><span style=\"font-size: 16px;\"><strong><br></strong></span></td><td colspan=\"2\"><p dir=\"ltr\"><span style=\"font-size: 16px;\"><strong>Breakdown by</strong></span></p></td></tr><tr><td><span style=\"font-size: 16px;\"><strong><br></strong></span></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\"><strong>Number of cases</strong></span></p></td><td><span style=\"font-size: 16px;\"><strong><br></strong></span></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\"><strong>Already in quarantine/ isolation before detection</strong></span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\"><strong>Detected from surveillance</strong></span></p></td><td><span style=\"font-size: 16px;\"><strong><br></strong></span></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\"><strong>Symptomatic</strong></span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\"><strong>Asymptomatic</strong></span></p></td></tr><tr><td><p dir=\"ltr\"><span style=\"font-size: 16px;\"><strong>Cases in the community</strong></span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">7</span></p></td><td><span style=\"font-size: 16px;\"><br></span></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">5</span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">2</span></p></td><td><span style=\"font-size: 16px;\"><br></span></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">4</span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">3</span></p></td></tr><tr><td><p dir=\"ltr\"><span style=\"font-size: 16px;\"><strong>Cases residing in dormitories</strong></span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">0</span></p></td><td><span style=\"font-size: 16px;\"><br></span></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">0</span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">0</span></p></td><td><span style=\"font-size: 16px;\"><br></span></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">0</span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">0</span></p></td></tr><tr><td><p dir=\"ltr\"><span style=\"font-size: 16px;\"><strong>Imported cases</strong></span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">6</span></p></td><td><span style=\"font-size: 16px;\"><br></span></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">6</span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">0</span></p></td><td><span style=\"font-size: 16px;\"><br></span></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">1</span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">5</span></p></td></tr><tr><td><p dir=\"ltr\"><span style=\"font-size: 16px;\"><strong>Total</strong></span></p></td><td><p dir=\"ltr\"><span style=\"font-size: 16px;\">13</span></p></td><td><span style=\"font-size: 16px;\"><br></span></td><td><span style=\"font-size: 16px;\"><br></span></td><td><span style=\"font-size: 16px;\"><br></span></td><td><span style=\"font-size: 16px;\"><br></span></td><td><span style=\"font-size: 16px;\"><br></span></td><td><span style=\"font-size: 16px;\"><br></span></td></tr></tbody></table></div><span style=\"font-size: 16px;\"><br><br><br>2.&nbsp; &nbsp; &nbsp; Overall, the number of new cases in the community has increased from 137 cases in the week before to 139 cases in the past week. The number of unlinked cases in the community has also increased from 21 cases in the week before to 23 cases in the past week.&nbsp;We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br><br>3.&nbsp; &nbsp; &nbsp;&nbsp;Amongst the 188 confirmed cases reported from 29 May to 4 June, 74 cases have tested positive for their serology tests, 99 have tested negative, and 15 serology test results are pending.<br><br><strong>Case Details</strong><br><strong><br>a) Cases in the community: 7</strong><br><br>There are 7 cases in the community today, of whom 6 are linked to previous cases and 1 is currently unlinked.<br><br><strong>Currently unlinked case</strong><br><br>Detected through surveillance:<br><br><span style=\"text-decoration: underline;\">Case 64029 </span>is a 19 year-old male Singaporean who is a student at Hwa Chong Institution and was last in school on 18 May. He developed a fever, sore throat and body aches on 2 June and sought medical treatment at a General Practitioner (GP) clinic on 3 June, where he underwent both an antigen rapid test (ART) and a polymerase chain reaction (PCR) test, and was immediately isolated when his ART result came back positive. His PCR test result also came back positive for COVID-19 infection on the same day. His serology test result is pending.<br><strong><br>Hong Ye Group cleaners cluster</strong><br><br>Already quarantined:<br><br><span style=\"text-decoration: underline;\">Case 64026</span> is an 8 year-old male Singaporean who is a student at Fuhua Primary School, and was last in school on 18 May. He is a family member and household contact of Cases 63953[2] and 63970[3], and was placed on quarantine on 1 June. He was tested for COVID-19 on 2 June during quarantine, and developed a cough and fever on the same day. His test result came back positive for COVID-19 on 3 June. His serology result is negative.<br><br>Detected through surveillance:<br><br><span style=\"text-decoration: underline;\">Case 64032 </span>is a 38 year-old male Singaporean who works as a driver at Wongso Limousine Services, and is deployed by Certis Cisco to convey persons placed on quarantine to government quarantine facilities. At work, he dons full personal protective equipment (PPE), including N95 mask, face shield, gown and gloves. He had transported 2 cases in his vehicle on 23 May who were later confirmed to have COVID-19 infection and were linked to the Hong Ye Group cleaners cluster. He developed a fever on 1 June and sought medical treatment at a hospital on 3 June, where he was tested for COVID-19. His test result came back positive for COVID-19 infection on the same day. His serology test result is pending.<br><br><strong>Case 63892 cluster</strong>[4]<br><br>Already quarantined:<br><br><span style=\"text-decoration: underline;\">Case 64027</span> is a 34 year-old male Malaysia national who works as a car groomer at Kok Wang Car Grooming. He is a household contact of Cases 63892 and 64028, and was placed on quarantine on 30 May. He was tested for COVID-19 infection on 31 May, and his test result was negative. He is asymptomatic, and was detected when he was tested again on 3 June and his test result came back positive for COVID-19 infection on the same day. His serology test result is negative.<br><span style=\"text-decoration: underline;\"><br>Case 64028</span> is a 64 year-old female Singaporean who works as a cleaner at Phoenix Entertainment KTV Music Lounge, and had last gone to work on 15 May. She is a household contact of Cases 63892 and 64027, and was placed on quarantine on 30 May. She was tested for COVID-19 infection on 31 May during quarantine, and her test result was negative. She is asymptomatic, and was detected when she was tested again on 2 June. Her test result came back positive for COVID-19 infection on 3 June. Her serology test result is negative for the N antigen, which suggests the presence of early infection. Case 64028 received her first dose of COVID-19 vaccine on 21 April and the second dose on 12 May.<br><br><strong>Case 63922 cluster</strong>[5]<br><br>Already quarantined:<br><br><span style=\"text-decoration: underline;\">Case 64024</span> is a 31 year-old male Singaporean who works as a technical officer at Fugro Singapore Land Pte Ltd. He is a family member and household contact of Cases 63922, 639276 and 64025, and was placed on quarantine on 31 May. He is asymptomatic, and was detected when he was tested for COVID-19 on 2 June during quarantine. His test result came back positive for COVID-19 infection on 3 June. His earlier tests from Routine Rostered Testing (RRT) - the last being on 28 May - were all negative for COVID-19 infection. His serology test result is negative for the N antigen, which suggests the presence of early infection. Case 64024 received his first dose of COVID-19 vaccine on 4 May.<br><br><span style=\"text-decoration: underline;\">Case 64025</span> is a 31 year-old female Singaporean who works as an administrative staff at Citibank, and was last at work on 28 May. She is a family member and household contact of Cases 63922, 63927 and 64024, and was placed on quarantine on 31 May. She was tested for COVID-19 on 2 June during quarantine, and developed a cough on 3 June. Her test result came back positive for COVID-19 infection on 3 June. Her serology test result is negative.&nbsp;<br><br><br><strong>b) Cases residing in dormitories: 0</strong><br><br>There are no cases residing in dormitories today.<br><br><strong>c) Imported cases: 6</strong><br><br>Amongst the 6 imported cases, 2 (Cases 64037 and 64043) are Singaporeans and 4 (Cases 64033, 64036, 64038 and 64041) are Singapore Permanent Residents who returned from India and the UAE.<br><br>They had all already been placed on SHN upon arrival in Singapore and were tested while serving SHN.<br><br>4.&nbsp; &nbsp; &nbsp; &nbsp;Please refer to the <a href=\"/docs/librariesprovider5/pressroom/press-releases/annexes-(12).pdf?sfvrsn=f1ee32c4_0\" title=\"Annexes\">Annexes</a>&nbsp;and MOH's daily Situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\" rel=\"noreferrer\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?q=http://www.moh.gov.sg/covid-19/situation-report&amp;source=gmail&amp;ust=1622902869475000&amp;usg=AFQjCNFwL8KZzJxizjdmtivmgGagOTz86Q\">http://www.moh.gov.sg/covid-1<wbr>9/situation-report</a>) for details.<br><br>5.&nbsp; &nbsp; &nbsp; &nbsp;Epidemiological investigations are in progress. In the meantime, all the identified close contacts of the cases have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for the close contacts to determine if the cases could have been infected by them.<br><br><strong>Update on condition of confirmed cases</strong><br><br>6.&nbsp; &nbsp; &nbsp; &nbsp;23 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 61,580 have fully recovered from the infection and have been discharged from hospitals or community care facilities.<br><br>7.&nbsp; &nbsp; &nbsp; &nbsp;There are currently 229 confirmed cases who are still in hospital. Of these, most are stable or improving, and 2 are in critical condition in the intensive care unit. 316 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 33 have passed away from complications due to COVID-19 infection.<br><br><br></span><strong><span style=\"font-size: 16px;\">MINISTRY OF HEALTH<br>4 JUNE 2021<br></span><br><br><br><br><br></strong><p dir=\"ltr\">[1] This is updated from the afternoon press release as 1 more case has been linked to previous cases following epidemiological investigations.&nbsp;<br>[2]&nbsp;Case 63953 is a 4 year-old male Singaporean who is a student at The Spark Playhouse (406 Hougang Avenue 10). He was confirmed to have COVID-19 infection on 1 June.<br>[3] Case 63970 is a 9 year-old male Singaporean who is a student at Fuhua Primary School. He was confirmed to have COVID-19 infection on 1 June.<br>[4] Case 63892 is a 68 year-old male Singaporean who works as a manager at Phoenix Entertainment Karaoke TV Music Lounge Pte Ltd. He was confirmed to have COVID-19 infection on 30 May.<br>[5] Case 63922 is a 56 year-old female Singaporean who is a homemaker. She was confirmed to have COVID-19 infection on 31 May.<br>[6]&nbsp;Case 63927 is a 30 year-old male Singaporean who works as a technician at ST Engineering Innosparks. He was confirmed to have COVID-19 infection on 31 May.</p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "7-new-cases-of-locally-transmitted-covid-19-infection-4-june-2021-updated", "CurrentPageUrl": null}, {"Title": "7 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1622791800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "04 Jun 2021", "Summary": "", "MainContent": "<span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp; As of 4 June 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 7 new cases of locally transmitted COVID-19 infection.&nbsp;5&nbsp;are linked to previous cases, all of whom have already been placed on quarantine. The remaining 2 are currently unlinked.&nbsp;Based on our investigations so far, the cases are in the community, and there are no new cases in the dormitories.<br><br>2.&nbsp; &nbsp; &nbsp;In addition, there are 6 imported cases, who have already been placed on Stay-Home Notice upon arrival in Singapore. All of them are returning Singaporeans or Singapore Permanent Residents.<br><br>3.&nbsp; &nbsp; &nbsp;In total, there are 13 new cases of COVID-19 infection in Singapore today.<br><br>4.&nbsp; &nbsp; &nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.<br><br><strong><br>MINISTRY OF HEALTH<br>4 JUNE 2021</strong></span>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "7-new-cases-of-locally-transmitted-covid-19-infection-4-jun-2021", "CurrentPageUrl": null}, {"Title": "Updates On Border Measures for Travellers From Guangdong Province, Mainland China", "PublishedDate": "/Date(1622781000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "04 Jun 2021", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp;The Multi-Ministry Taskforce has been closely monitoring the global COVID-19 situation. We will tighten our border measures for travellers from Guangdong province, Mainland China given the increase in the number of COVID-19 cases there.</p> <p><strong>Travellers from Guangdong Province to Serve 7-Day SHN at Place of Residence </strong></p> <p>2.&nbsp; &nbsp;We had earlier announced that travellers from Mainland China will be allowed to undergo a COVID-19 Polymerase Chain Reaction (PCR) test upon arrival, and if the PCR test result is negative, they will be allowed to go about their activities in Singapore, without a need to serve a Stay-Home Notice (SHN).</p><p><p>3.&nbsp; &nbsp; Given the increased cases observed in Guangzhou, we will be tightening border control measures for travellers with travel history to Guangdong province. From <strong>5 June 2021, 2359 hours:</strong></p></p><p>a) Singapore Citizens (SCs), Permanent Residents (PRs) and Long-Term Pass holders entering Singapore with travel history to Guangdong province, Mainland China within the last 21 days before departure for Singapore, will be subject to an on-arrival COVID-19 PCR test, a 7-day SHN at their place of residence, and a COVID-19 PCR test before the end of the SHN period. </p><p>b) Short-term travellers holding an Air Travel Pass (ATP) with travel history to Guangdong province, Mainland China within the last 21 days before departure for Singapore, will <u>not</u> be allowed to enter Singapore.</p><p>4.&nbsp; &nbsp; All other travellers departing from Mainland China who have been in Mainland China (excluding Guangdong province) in the last 21 days prior to travel will continue to be subject to a COVID-19 test upon arrival at the airport, in lieu of their SHN.</p><p><strong>Regular Review of Border Measures</strong></p><p>5.&nbsp; &nbsp; As the global situation evolves, we will continue to adjust our border measures to manage the risk of importation and transmission to the community. Any changes to border measures will be updated on the <a href=\"https://safetravel.ica.gov.sg/\">SafeTravel website</a>. Travellers are advised to visit the website to check for the most updated border measures before entering Singapore and be prepared to be subjected to the prevailing border measures upon entry.</p> <div> <p><strong>MINISTRY OF HEALTH<br></strong><strong>4 JUNE 2021</strong></p> </div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "updates-on-border-measures-for-travellers-from-guangdong-province-mainland-china", "CurrentPageUrl": null}, {"Title": "Joint Moh-moe Statement On Erroneous Administration of Moderna Covid-19 Vaccine to 16 Year-old Youth", "PublishedDate": "/Date(1622737200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "04 Jun 2021", "Summary": "", "MainContent": "<p><span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; On 3 June 2021, a 16 year-old youth was administered the first dose of the Moderna COVID-19 vaccine<sup>[1]</sup> at Kolam Ayer Community Club Vaccination Centre. The error was discovered onsite when vaccination centre staff identified that the individual was under 18 years of age during the post-vaccination observation period. As an additional precaution, he was placed under a longer observation time of 50 minutes, and remains generally well. </span></p> <p><span style=\"font-size: 16px;\">2&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Our investigations found that the individual’s date of birth had been erroneously entered when booking a vaccination appointment after receiving the sign-up link. This resulted in his age being incorrectly registered as above 18 years of age, making it possible for a Moderna vaccination centre to be selected. The vaccination centre staff had failed to verify his age during registration, which should have been carried out. </span></p><p><span style=\"font-size: 16px;\">3&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;The safety of those receiving the vaccination is of utmost priority. The Ministry of Health (MOH) and Ministry of Education (MOE) take a serious view of this incident. We apologise for the inconvenience and anxiety caused, and have reached out to the youth’s parents to explain the situation. The Expert Committee for COVID-19 Vaccination has reviewed this case, and does not expect him to suffer any safety issues from this incident.</span></p><p><span style=\"font-size: 16px;\">4&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;A thorough review of our internal processes at vaccination sites has been carried out by MOH to prevent a recurrence. This includes strengthening our online registration process to ensure individuals make appointments at suitable vaccination centres based on their eligibility, as well as putting in place more stringent protocols at our vaccination sites to verify eligibility. We are in close contact with the individual and his family, and will continue to monitor his health closely and provide the necessary support.</span></p> <p><span style=\"font-size: 16px;\"><strong><br>MINISTRY OF HEALTH<br></strong><strong></strong><strong>MINISTRY OF EDUCATION<br></strong><strong></strong><strong>4 JUNE 2021</strong></span></p><div> <hr align=\"left\" size=\"1\" width=\"33%\"> <div id=\"ftn1\"> <p><span style=\"font-size: 16px;\"><sup>[1] </sup>The Moderna COVID-19 vaccine is currently authorised for use in individuals aged 18 and above. </span></p> </div> </div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "joint-moh-moe-erroneous-administration-of-moderna-youth", "CurrentPageUrl": null}, {"Title": "Expert Committee On Covid-19 Vaccination On the Incident of 16 Year-old Youth Administered With Moderna Covid-19 Vaccine ", "PublishedDate": "/Date(1622737200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "04 Jun 2021", "Summary": "", "MainContent": "<span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The Expert Committee on COVID-19 Vaccination has reviewed the incident where a 16 year-old youth had been erroneously administered the first dose of the Moderna COVID-19 vaccine on 3 June 2021.<br><br>2 &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;The Moderna COVID-19 vaccine is currently authorised for use in Singapore for individuals aged 18 and above. Data from a trial&nbsp; involving more than 3,700 adolescents aged 12 to 17 years old has found that the Moderna COVID-19 vaccine is safe and effective among adolescents with no significant safety issues identified. The majority of adverse events were mild or moderate in severity, and the common ones were injection site pain, headache, fatigue, muscle aches and chills.&nbsp;&nbsp;<br><br>3 &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;The Expert Committee for COVID-19 Vaccination does not expect any safety issues from the receipt of the Moderna COVID-19 vaccine in the 16-year-old youth, and the medical team will consult the Expert Committee on what would be best for the youth for the completion of the vaccination.&nbsp;<br><br>4 &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;The Expert Committee will continue to closely monitor the global evidence and developments on COVID-19 vaccines, in particular the emerging data on the efficacy and safety of vaccine use for more population subgroups, as more people are vaccinated globally and locally.<br><br><br><strong>EXPERT COMMITTEE ON COVID-19 VACCINATION<br>4 JUNE 2021</strong></span><br><div><br></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "EC19V_moderna-youth", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}