{"pressItemDictionary": {"Press Releases": [{"Title": "4 New Cases of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1624865400000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "28 Jun 2021", "Summary": "", "MainContent": "<span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp; As of 28 June 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 4 new cases of locally transmitted COVID-19 infection, all of whom are linked to previous cases, and have already been placed on quarantine. Based on our investigations so far, the cases are in the community, and there are no new cases in the dormitories.<br><br>2.&nbsp; &nbsp; &nbsp;In addition, there are 5 imported cases, who have already been placed on Stay-Home Notice or isolated upon arrival in Singapore. Of these, 2 are returning Singaporeans or Singapore Permanent Residents.<br><br>3.&nbsp; &nbsp; &nbsp;In total, there are 9 new cases of COVID-19 infection in Singapore today.<br><br>4.&nbsp; &nbsp; &nbsp;We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.<br><br><br><strong>MINISTRY OF HEALTH<br>28 JUNE 2021</strong></span>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "4-new-cases-of-locally-transmitted-covid-19-infection-28-jun-2021", "CurrentPageUrl": null}, {"Title": "Suspension of Eng’s Wanton Noodles At 287 Tanjong Katong Road Lifted After Meeting Required Standards", "PublishedDate": "/Date(1624863060000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "28 Jun 2021", "Summary": "", "MainContent": "<div><span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The Singapore Food Agency (SFA) has lifted the suspension of Eng’s Wanton Noodles’ (located at 287 Tanjong Katong Road) food business operations today. As the licensee has implemented the required measures as stipulated by SFA, operations can be resumed.</span></div><div><span style=\"font-size: 16px;\">&nbsp;</span></div><div><span style=\"font-size: 16px;\">2&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;The Ministry of Health (MOH) and SFA had received reports of gastroenteritis involving 68 persons who consumed food prepared at Eng’s Wanton Noodles between 14 and 17 May 2021. They either sought outpatient treatment, self-medicated, or recovered without treatment, and none were hospitalised. To protect consumers from further public health risks, the food business operations of Eng’s Wanton Noodles was suspended by SFA from 18 May to 28 June 2021.</span></div><div><span style=\"font-size: 16px;\">&nbsp;</span></div><div><span style=\"font-size: 16px;\">3&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Investigation into the cause of the gastroenteritis illness is ongoing.</span></div><div><span style=\"font-size: 16px;\">&nbsp;</span></div><div><span style=\"font-size: 16px;\"><strong>Measures Taken by Eng’s Wanton Noodles</strong></span></div><div><span style=\"font-size: 16px;\">&nbsp;</span></div><div><span style=\"font-size: 16px;\">4&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;During the suspension period, Eng’s Wanton Noodles has complied with measures stipulated by SFA. The licensee has disposed all ready-to-eat food, thawed food and perishable food items, and also cleaned and sanitised their premises, including their equipment and utensils.</span></div><div><span style=\"font-size: 16px;\">&nbsp;</span></div><div><span style=\"font-size: 16px;\">5&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Food handlers who will be involved in food preparation have since re-attended and passed the Basic Food Hygiene course. The Food Hygiene Officer<sup>[1]</sup>(FHO) for Eng’s Wanton Noodles has also undergone training and passed the WSQ Conduct Food and Beverage Hygiene Audit course.</span></div><div><span style=\"font-size: 16px;\">&nbsp;</span></div><div><span style=\"font-size: 16px;\"><strong>Continuing Surveillance</strong></span></div><div><span style=\"font-size: 16px;\">&nbsp;</span></div><div><span style=\"font-size: 16px;\">6&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Following the lifting of suspension, SFA will continue to place Eng’s Wanton Noodles under close surveillance to ensure that it adheres to food safety requirements.</span></div><div><span style=\"font-size: 16px;\">&nbsp;</span></div><div><span style=\"font-size: 16px;\"><strong>Public Advisory</strong></span></div><div><span style=\"font-size: 16px;\">&nbsp;</span></div><div><span style=\"font-size: 16px;\">7&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; To prevent the spread of disease and protect oneself from acquiring infections, individuals should practise good personal hygiene at all times. These include:</span></div><div><span style=\"font-size: 16px;\">• Washing hands with soap and water before eating and after going to the toilet;</span></div><div><span style=\"font-size: 16px;\">• Covering mouth and nose with a tissue when coughing or sneezing, and throwing the tissue away into a bin immediately; and</span></div><div><span style=\"font-size: 16px;\">• Not sharing food/drinks, eating utensils, toothbrushes or towels with others.</span></div><div><span style=\"font-size: 16px;\">&nbsp;</span></div><div><span style=\"font-size: 16px;\">8&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;In the interest of maintaining a high standard of food hygiene at all eating establishments, we would also like to advise members of the public who come across poor hygiene practices in food establishments not to patronise such outlets but to report to SFA via the online feedback form (<a href=\"http://www.sfa.gov.sg/feedback\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?q=http://www.sfa.gov.sg/feedback&amp;source=gmail&amp;ust=1624950277865000&amp;usg=AFQjCNEmjNvoyGNI0H9chHvKX0wsw_HPeg\" title=\"\" class=\"\"><u>www.sfa.gov.sg/feedback</u></a>) with details for our follow-up investigations.</span></div><div><span style=\"font-size: 16px;\"><br></span></div><div><span style=\"font-size: 16px;\"><strong>MINISTRY OF HEALTH</strong></span></div><div><span style=\"font-size: 16px;\"><strong>SINGAPORE FOOD AGENCY</strong></span></div><div><span style=\"font-size: 16px;\"><strong>28 JUNE 2021</strong></span></div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "suspension-of-engs-wanton-noodles-tk-lifted-after-meeting-required-standards", "CurrentPageUrl": null}, {"Title": "Benefits of Mrna Covid-19 Vaccines Continue to Outweigh the Risk of Vaccination", "PublishedDate": "/Date(1624854120000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "28 Jun 2021", "Summary": "", "MainContent": "&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The Expert Committee on COVID-19 Vaccination has been made aware of an open letter on social media attributed to a group of 5 doctors, including a cardiologist, calling for a halt in the COVID-19 vaccination of our youths. The group cited reports of the US Centres for Diseases Control and Prevention’s (CDC’s) investigations into the death of a 13-year-old male after being vaccinated with the second dose of an mRNA vaccine. They also claimed that the 13-year-old male from the US had died from heart failure, and highlighted the recent international reports of the association between myocarditis and dose 2 of the mRNA vaccines in young men.<br>&nbsp;<br>2&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The said news report actually did not state death from heart failure as alleged, and the matter is still under investigation by the US authorities. The writers also chose to highlight only one of the presentations to the Advisory Committee on Immunization Practices (ACIP) of the CDC, but failed to mention the point stated in its summary slide that “available data indicate that patients generally recover from symptoms and do well”. They also failed to mention that subsequent discussions at the same meeting went on to support the vaccination of adolescents because the benefits outweighed the risks.<br>&nbsp;<br>3&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The use of safe and efficacious COVID-19 vaccines in Singapore is of paramount concern to the Expert Committee, and we are closely monitoring local and international data to ensure our recommendations are up to date. The Expert Committee had on 11 June 2021 highlighted the possibility of a small risk of myocarditis and pericarditis associated with the second dose of the mRNA vaccines, and the assessment is that the benefits of receiving the mRNA COVID-19 vaccines continue to outweigh the risks of vaccination. The data on myocarditis and pericarditis has not changed, and the Expert Committee’s assessment holds.<br>&nbsp;<br>4&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The risks of acquiring COVID-19 and suffering damaging illness outweigh the risk of vaccination. A meta-analysis of 129 studies from 31 countries involving 10,251 children found that 22.9% of children diagnosed with COVID-19 had been admitted to the intensive care unit, and 3.6% died. In the US alone, of the around 4 million children infected with COVID-19 since the beginning of the pandemic, we have seen around 380 reported cases of deaths in the age group 12 to 17 years, and COVID-19 in the young can result in Multisystem Inflammatory Syndrome in Children (MIS-C) and other prolonged disability. In the face of a more transmissible Delta variant associated with more severe COVID-19, it is imperative that we protect our children from severe COVID-19 and its complications. This will have to mean full vaccination of two doses, as studies showed that one dose of the COVID-19 vaccine confers 33% protection against the Delta variant. In fact, Israel has recently started vaccinating teenagers after the Delta variant caused school outbreaks as well, despite earlier news reports stating a more ambivalent position.<br>&nbsp;<br>5&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The data reported from the US indicates that cases of myocarditis following mRNA vaccinations are rare. In addition, among the small number of cases, almost all had resolved. Professional medical associations in the US, including the American College of Paediatrics and the American Heart Association in the US have continued to strongly encourage vaccination in everyone aged 12 years and older. Nevertheless, we understand the anxiety parents face, and hence we endorse MOH’s position to make vaccination voluntary in Singapore, even as it is strongly encouraged.<br>&nbsp;<br>6&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The Expert Committee continues to recommend the use of the mRNA COVID-19 vaccines for young men. However, as a precaution, vaccinated persons, in particular adolescents and younger men, should avoid strenuous physical activity for one week after their second dose. During this time, they should seek medical attention promptly if they develop chest pain, shortness of breath or abnormal heartbeats. The Expert Committee notes that MOH had also issued guidance to all doctors to properly advise patients on the care they receive.<br>&nbsp;<br>7&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The Expert Committee will continue to monitor the local and international data and will review its recommendations as needed.<br>&nbsp;<br>&nbsp;<br><strong>EXPERT COMMITTEE ON COVID-19 VACCINATION<br>28 JUNE 2021</strong>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "benefits-of-mrna-covid-19-vaccines-continue-to-outweigh-the-risk-of-vaccination", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}