{"pressItemDictionary": {"Press Releases": [{"Title": "MOH Appoints Multilateral Healthcare Insurance Committee", "PublishedDate": "/Date(1618394400000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "14 Apr 2021", "Summary": "", "MainContent": "&nbsp; &nbsp; &nbsp; &nbsp;The Ministry of Health (MOH) has appointed a 12-member Multilateral Healthcare Insurance Committee (MHIC) to provide a platform for healthcare providers, payors, consumer representatives and the Government to collaboratively address issues related to health insurance. The MHIC’s appointment will come into effect on 27 April 2021.<br><br>2.&nbsp; &nbsp; The MHIC comprises representatives from the Academy of Medicine, Singapore (AMS), Consumer Association of Singapore (CASE), Fee Benchmarks Advisory Committee (FBAC), Life Insurance Association (LIA), Singapore Medical Association (SMA) and private hospitals. The MHIC is co-chaired by MOH’s Deputy Secretary (Policy), Ms Ngiam Siew Ying and Deputy Director of Medical Services (Health Performance Group), Dr Daphne Khoo. The full list of the Multilateral Healthcare Insurance Committee members is at <a href=\"/docs/librariesprovider5/default-document-library/moh-appoints-multilateral-healthcare-insurance-committee---annex.pdf?sfvrsn=fd436899_2\">Annex</a><a href=\"/docs/librariesprovider5/default-document-library/moh-appoints-multilateral-healthcare-insurance-committee---annex.pdf?sfvrsn=fd436899_2\" title=\"Annex A\"> </a>A.<br><br>3.&nbsp; &nbsp; The MHIC will be the primary platform through which MOH, doctors, insurers and hospitals work together to enhance Singapore’s healthcare insurance system. It will work in the public and patients’ best interest in providing recommendations on ensuring quality, safe, cost-effective and affordable healthcare for Singaporeans. It will recommend improvements to manage rising healthcare costs in the current healthcare insurance system. It will also guide the establishment of platforms to address complaints and conflicts arising from healthcare insurance claims.<br><br>4.&nbsp; &nbsp; The involvement of AMS, FBAC, LIA, SMA and private hospitals in the Committee provides opportunity for the stakeholders to work collaboratively towards the shared objectives of the MHIC, and be ambassadors for decisions taken by the MHIC. CASE’s participation will also help to represent and uphold policyholders’ interests.<br><br>5.&nbsp; &nbsp; The MHIC stems from an earlier Pro-Tem Committee established in October 2020 between AMS, LIA and SMA, to facilitate discussions related to Integrated Shield Plans (IPs). Since its inception, the Pro-Tem Committee has made progress over issues such as the amendment of IP contracts’ exclusion clauses to cover medically indicated diagnostic procedures, improving consumer education on IP, improving panel sizes and facilitating the setting of panel fees to be within the MOH Fee Benchmarks.<br><br>6.&nbsp; &nbsp; The MHIC will build on the work of the Pro-Tem Committee, and will focus on key priority areas including improvements to the accessibility and transparency of IP doctor panels, enhancements to the claims pre-authorisation process for treatment, and improving transparency across the board. More details on the MHIC’s recommendations will be released when ready.<br><br>7.&nbsp; &nbsp; MOH will continue to work collaboratively with all stakeholders to strike a balance between preserving patient choice, while ensuring quality, cost-effective and sustainable care.<br><br><br><strong>MINISTRY OF HEALTH&nbsp;<br>14 APRIL 2021</strong><br><div><br></div>", "PressCategory": ["Press Releases"], "CustomDetailUrl": "", "UrlName": "moh-appoints-multilateral-healthcare-insurance-committee", "CurrentPageUrl": null}, {"Title": "1 New Case of Locally Transmitted  Covid-19 Infection", "PublishedDate": "/Date(1618385760000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "14 Apr 2021", "Summary": "", "MainContent": "&nbsp; &nbsp; &nbsp; &nbsp;As of 14 April 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 1 new case of locally transmitted COVID-19 infection. Based on our investigations so far, the case is in the community, and there are no new cases in the dormitories.&nbsp;<br><br>2.&nbsp; &nbsp; In addition, there are 26 imported cases, who had already been placed on Stay-Home Notice or isolated upon arrival in Singapore. In total, there are 27 new cases of COVID-19 infection in Singapore today.&nbsp;<br><br>3.&nbsp; &nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>14 APRIL 2021</strong><br><div><br></div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "1-new-case-of-locally-transmitted-covid-19-infection-14Apr", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}