{"pressItemDictionary": {"Press Releases": [{"Title": "Stabilising Our Covid-19 Situation and  Protecting Our Overall Healthcare Capacity", "PublishedDate": "/Date(1632478500000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "24 Sep 2021", "Summary": "", "MainContent": "<p style=\"text-align: justify;\"><span style=\"font-size: 12pt; font-family: Arial;\">&nbsp; &nbsp; &nbsp; Singapore entered the Preparatory Stage of our transition journey to a COVID-19 resilient nation on 19 August 2021. We ramped up our healthcare and response capacity as daily cases increased. We also introduced Home Recovery, as most of the cases, especially younger or vaccinated individuals, have mild symptoms or are asymptomatic and can stay at home to recover.</span></p><p style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 16px;\">2. &nbsp; &nbsp;However, daily cases started to rise exponentially from end of August 2021. While the number of COVID-positive individuals who become severely ill – i.e., requiring oxygen supplementation and intensive care unit (ICU) – remains within expectations, the number of individuals with mild symptoms has increased very rapidly. This has put a strain on our overall healthcare and response system and on our healthcare workers, as many COVID-positive individuals with mild symptoms are seeking medical attention at our hospitals when it might not be necessary.&nbsp;</span></p><p style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 16px;\"></span><span style=\"font-family: Arial; font-size: 16px;\">3. &nbsp; &nbsp;While we have been advising individuals with mild COVID-19 symptoms that it is appropriate to recover at home, we understand the anxiety of some individuals to want to seek medical attention at hospitals. The protocols and processes for home recovery are also new, and we are still improving the system as people are adjusting to them. There have also been service lapses as the numbers on Home Recovery increased, which added to their anxiety. We are ironing out the teething issues with the Home Recovery programme, and in the coming few weeks, will further ramp up our care facilities to handle more cases.&nbsp;</span></p><p style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 16px;\">4. &nbsp; &nbsp;Most infection cases are mild in symptoms or asymptomatic and home recovery is the most appropriate care protocol for them. But if the overall number of cases continues to rise rapidly, we are also likely to see a growing number of infected persons, especially among the elderly, who do need hospital care. Hence, there is a need to slow down community transmission. We will thus be tightening our community safe management measures until our overall healthcare and response capacity has been appropriately augmented.&nbsp;</span></p><p style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 16px;\"><span style=\"font-family: Arial;\"></span><strong>Updates on Local COVID-19 Situation</strong></span></p><p style=\"margin-left: 0cm; text-align: justify;\"><span style=\"font-family: Arial; font-size: 16px;\"><strong></strong><span style=\"text-align: left;\">5. &nbsp; &nbsp;The large majority (98%) of cases were asymptomatic or had mild symptoms. This is due to our high vaccination coverage, which is now at 82% of the population who have completed their full regimen. Of the 254 cases with severe illness in the last two weeks, a disproportionate 48% were unvaccinated with the remainder being vaccinated individuals with co-morbidities. This ratio needs to be understood in the context of more than 80% of our population being fully vaccinated, indicating a vaccine efficacy against severe illnesses that is still around 80% to 90%, with the elderly and individuals with co-morbidities among the vaccinated making up the 10% to 20% who remain susceptible despite vaccination.</span></span></p><p style=\"text-align: justify;\"><p><span style=\"font-family: Arial; font-size: 16px;\"></span><span style=\"font-family: Arial; font-size: 16px;\">6. &nbsp; &nbsp;The number of persons requiring ICU is rising at the same rate as our overall case numbers, albeit with a lag. We had 21 new cases in ICU in the past week, as compared to 9 in the preceding week. &nbsp;&nbsp;</span></p></p><p style=\"text-align: justify;\"><p><span style=\"font-family: Arial; font-size: 16px;\"><span style=\"font-family: Arial;\"></span><u>Right-siting Patients for Appropriate Care</u></span></p><p><span style=\"font-family: Arial; font-size: 16px;\"></span><span style=\"font-family: Arial; font-size: 16px;\">7. &nbsp; &nbsp;The most appropriate care management protocol for fully vaccinated individuals aged 12 to 69 years will continue to be recovery at home[1]</span><span style=\"font-family: Arial; font-size: 16px;\">. These individuals are less likely to fall severely ill and there is no need for them to be cared for in our hospitals. Similarly, parents with infected children aged 2 to 11 years who choose to home recovery may also do so after their children have been assessed in our hospitals for suitability to do so.&nbsp;<br><br></span><span style=\"font-family: Arial; font-size: 16px;\">8. &nbsp; &nbsp;To make best use of our hospital facilities and beds, and allow our hospitals to care for both their COVID-19 patients as well as the many other non-COVID patients requiring hospital care, we will be admitting those who are stable but do require closer monitoring to appropriate intermediate care facilities where their care and close monitoring needs will be met. &nbsp; &nbsp;<br><br></span><span style=\"font-family: Arial; font-size: 16px;\">9. &nbsp; &nbsp;Patients with co-morbidities, with a risk of potentially developing severe illness, but who are otherwise asymptomatic or mildly symptomatic will be closely monitored at Community Treatment Facilities (CTFs), which are being set up progressively islandwide. These CTFs will be closely partnered with our hospitals so that there will be seamless escalation protocols for such patients to be conveyed from the CTF to an acute hospital expeditiously for further treatment when necessary. This is similar to the existing protocol&nbsp;&nbsp;for Community Care Facilities (CCFs), but with a higher level of medical care at the CTFs to ensure that these patients who are stable but at higher risk of serious illness are cared for with the appropriate level of medical manning and supporting equipment.</span></p></p><p style=\"text-align: justify;\"><p><span style=\"font-family: Arial; font-size: 16px;\"><span style=\"font-family: Arial;\"></span><strong>Safe Management Measures for Stabilisation Phase</strong></span></p><p><span style=\"font-family: Arial; font-size: 16px;\"><span style=\"font-family: Arial;\"></span><span style=\"font-family: Arial;\">10. &nbsp; &nbsp;If the infection continues at its current trajectory, we can expect to reach a daily count of 3,200 and beyond within the next 2 weeks. Beyond that, there is a range of possibilities, but we cannot rule out cases doubling further. To minimise the strain on our overall healthcare capacity, we will have to tighten measures before that happens. We would like to thank Singaporeans for reducing their level of activity and interactions in the past two weeks. We do not need to return to a Heightened Alert. But we have to do more to scale back social interactions further in order to slow down community transmissions and allow for better stability. The following measures will take effect from&nbsp;</span><strong style=\"font-size: 12pt;\">27 September 2021 through 24 October 2021</strong>. We will review the measures two weeks after implementation and adjust these based on the community situation then. Please refer to&nbsp;<u style=\"font-size: 12pt;\"><u style=\"font-family: Arial, sans-serif; font-size: 12pt;\"><a href=\"/docs/librariesprovider5/default-document-library/annex-aa5baa87fe53a4004af60b6dbf9a35858.pdf?sfvrsn=f680e823_0\">Annex A</a></u></u>&nbsp;for details.</span></p></p><p style=\"text-align: justify;\"><p><span style=\"font-family: Arial; font-size: 16px;\"><span style=\"font-family: Arial;\"></span><u>Permissible Group Sizes</u></span></p><p><span style=\"font-family: Arial; font-size: 16px;\"><u></u>11. &nbsp; &nbsp;Permissible group sizes for social gatherings will be reduced from a maximum of 5 persons to a&nbsp;<strong style=\"font-size: 12pt;\"><u>maximum of 2 persons</u></strong>. Correspondingly, the maximum number of unique visitors per household will be reduced to 2 per day. Individuals should continue to limit their overall number of social gatherings to not more than 1 per day, whether to another household, or meeting with friends and family members in a public place.</span></p></p><p style=\"text-align: justify;\"><p><span style=\"font-family: Arial; font-size: 16px;\"><span style=\"font-family: Arial;\"></span><u>Protecting Our Vulnerable Groups</u></span></p><p><span style=\"font-family: Arial; font-size: 16px;\"><u></u>12. &nbsp; &nbsp;We strongly encourage all individuals to reduce social activities and wear our masks diligently. In particular, the elderly and persons with comorbidities who are more vulnerable to severe illnesses, should stay home as much as possible, except for essential activities such as working, buying food and groceries, seeing the doctor, and exercising individually in uncrowded locations. &nbsp;</span></p></p><p style=\"text-align: justify;\"><p><span style=\"font-family: Arial; font-size: 16px;\"><u></u>13. &nbsp; &nbsp;In order to better protect younger children who are not yet medically eligible for vaccination, the Ministry of Education (MOE) had earlier announced that Home-Based Learning (HBL) will be implemented for all Primary and Special Education (SPED) schools from 27 September through 6 October 2021. Primary 6 students will go on a study break prior to the Primary School Leaving Examinations (PSLE) from 25 September through 29 September 2021. As an added precaution, the<strong style=\"font-size: 12pt;\">&nbsp;HBL period will now be extended till 7 October 2021</strong>, so that students can continue to stay home for the rest of the week.</span></p></p><p style=\"text-align: justify;\"><p><span style=\"font-family: Arial; font-size: 16px;\"></span><span style=\"font-family: Arial; font-size: 16px;\">14. &nbsp; &nbsp;Private Education Institutions (PEIs) must also implement HBL for all students aged 12 years and below from 27 September to 10 October 2021, although preschool services in PEIs may remain open. During this period, in-person tuition and enrichment classes for students aged 12 years and below must pivot online or otherwise be suspended. Preschools, MOE kindergartens, KCare Services and Student Care Centres will remain open during this period but parents are encouraged to keep their children at home if they can. Please refer to MOE’s website for more details.</span></p></p><p style=\"text-align: justify;\"><p><span style=\"font-family: Arial; font-size: 16px;\"><span style=\"font-family: Arial;\"></span><u>Minimising Workplace Interactions&nbsp;</u></span></p><p><span style=\"font-family: Arial; font-size: 16px;\"><u></u>15. &nbsp; <strong>&nbsp;Work-from-home will be the default</strong>&nbsp;for employees who are able to work from home. During this period, the 10-day snap Work from Home regime will be suspended. There should continue to be no cross-deployment of workers to multiple worksites for those who need to go into worksites to work. Social gatherings at the workplace will continue to be disallowed. Employers should continue to implement flexible working hours and stagger the start times of employees who need to return to the workplace.</span></p></p><p style=\"text-align: justify;\"><p><span style=\"font-family: Arial; font-size: 16px;\"></span><span style=\"font-family: Arial; font-size: 16px;\">16. &nbsp; &nbsp;Employees, contractors, and vendors who are unable to work from home are strongly encouraged to self-test weekly via an Antigen Rapid Test (ART) to keep infected employees from coming to work and keep their workplace safe. Those who are able to work from home but need to return to the workplace for ad-hoc reasons may do so after testing negative via ART before returning onsite.&nbsp;</span></p></p><p style=\"text-align: justify;\"><p><span style=\"font-family: Arial; font-size: 16px;\"><u></u><u>Dine-in at F&amp;B Establishments</u></span></p><p><span style=\"font-family: Arial; font-size: 16px;\"><span style=\"font-family: Arial;\"></span>17. &nbsp;<strong> &nbsp;Groups of up to 2 persons will be allowed to dine-in at regular F&amp;B establishments if all the diners are fully vaccinated</strong>. This is a reduction from the current limit of 5 persons for dine-in. Unvaccinated individuals with a valid negative pre-event test (PET) result, recovered individuals, and children aged 12 years and below may also be included in such groups of 2.</span></p></p><p style=\"text-align: justify;\"><p><span style=\"font-family: Arial; font-size: 16px;\"></span><span style=\"font-family: Arial; font-size: 16px;\">18. &nbsp; &nbsp;F&amp;B establishments that are not able to ensure that all dine-in patrons meet the criteria for full vaccination may only operate take-away and delivery services. At this stage of the transition, entertainment such as live performances, recorded music, and videos/TV screening will continue to be prohibited. Patrons to F&amp;B establishments are also reminded to adhere to all safe management measures and keep their masks on at all times except when eating or drinking.</span></p></p><p style=\"text-align: justify;\"><p><span style=\"font-family: Arial; font-size: 16px;\"></span><span style=\"font-family: Arial; font-size: 16px;\">19. &nbsp; &nbsp;Because hawker centres and coffee shops offer essential food services to the community, the concession to dine-in at these premises will remain at up to 2 persons, regardless of vaccination status.</span></p></p><p style=\"text-align: justify;\"><p><span style=\"font-family: Arial; font-size: 16px;\"><span style=\"font-family: Arial;\"></span><u>Activity and Event Sizes and Pre-Event Testing Requirements</u></span></p><p><span style=\"font-family: Arial; font-size: 16px;\"><span style=\"font-family: Arial;\"></span><span style=\"font-family: Arial;\">20. &nbsp; &nbsp;Vaccination-differentiated safe management measures, mask wearing, and proper distancing remain essential to ensure that large events can proceed safely for attendees. The&nbsp;</span><strong style=\"font-size: 12pt;\">event sizes and capacity limits for congregational and other worship services, cinemas, MICE, live performances, spectator sport events will</strong>&nbsp;<strong style=\"font-size: 12pt;\">remain</strong>&nbsp;at up to 1,000 attendees if all are fully vaccinated. Otherwise, only up to 50 attendees will be allowed without PET. The concession for children aged 12 years and below, who cannot yet be vaccinated, will also apply for these events. Such unvaccinated children may be included in a group of up to two persons if the child is from the same household.&nbsp;</span></p></p><p style=\"text-align: justify;\"><p><span style=\"font-family: Arial; font-size: 16px;\"><s></s>21. &nbsp; &nbsp;Marriage solemnisations may continue, seated in groups of up to 2 persons, if all are fully vaccinated. Home solemnisations will continue to be allowed with up to 10 attendees. Otherwise, only up to 50 attendees will be allowed without PET. We acknowledge that wedding couples have faced significant uncertainties over the past few months. Hence, as a special concession, wedding receptions may be allowed to continue with up to 250 attendees if all are fully vaccinated, and with a group size of up to 5 persons per table. All wedding guests must strictly abide by the safe management measures, and in particular maintain social distancing and avoid mingling with others beyond their own table. Given their higher vulnerability, we also strongly discourage unvaccinated individuals and the elderly from attending such events, as PET only reduces their risk to others but not the risk to themselves.</span></p></p><p style=\"text-align: justify;\"><p><span style=\"font-family: Arial; font-size: 16px;\"><span style=\"font-family: Arial;\"></span><u>Targeted Support Measures</u></span></p><p><span style=\"font-family: Arial; font-size: 16px;\"><u></u>22. &nbsp; &nbsp;The Government will enhance the Jobs Support Scheme support to 25% for the period of&nbsp;<strong style=\"font-size: 12pt;\">27 September 2021 through 24 October 2021</strong>&nbsp;for sectors significantly affected by the tightened measures. These include F&amp;B, retail, cinemas, museums, art galleries, historical sites, family entertainment, tourism, gyms and fitness studios, and performing arts and arts education. Please refer to&nbsp;<u style=\"font-size: 12pt;\"><a href=\"/docs/librariesprovider5/default-document-library/annex-ba931964bba4b4226922fe16e57aea367.pdf?sfvrsn=f27ad40a_0\" title=\"Annex B\">Annex B</a></u>&nbsp;for details.</span></p></p><p style=\"text-align: justify;\"><p><span style=\"font-family: Arial; font-size: 16px;\"><span style=\"font-family: Arial;\"></span><span style=\"font-family: Arial;\">23. &nbsp; &nbsp;The Government will provide a 2-week rental waiver for qualifying tenants on Government-owned commercial properties. Qualifying tenant-occupiers and owner-occupiers of privately-owned commercial properties will also be given a 2-week rental relief cash payout under the Rental Support Scheme (RSS)</span><a href=\"applewebdata://0716638B-5A4A-4B71-ABF4-06C3A8043225#_ftn2\" name=\"_ftnref2\" title=\"\" style=\"font-size: 12pt;\"><span style=\"color: black;\">[2]</span></a>. These will offset rent for half the duration of the stabilisation phase. More details on the RSS will be made available on the Inland Revenue Authority Singapore (IRAS) website.</span></p></p><p style=\"text-align: justify;\"><p><span style=\"font-family: Arial; font-size: 16px;\"></span><span style=\"font-family: Arial; font-size: 16px;\">24. &nbsp; &nbsp;Cooked food and market stallholders in centres managed by the National Environment Agency (NEA) or NEA-appointed operators will receive a 2-week rental waiver.</span></p></p><p style=\"text-align: justify;\"><p><span style=\"font-family: Arial; font-size: 16px;\"></span><span style=\"font-family: Arial; font-size: 16px;\">25. &nbsp; &nbsp;To support taxi and private hire car drivers, we will also extend the COVID-19 Driver Relief Fund payout at $10 and $5 per vehicle per day in October and November 2021 respectively. &nbsp;</span></p></p><p style=\"text-align: justify;\"><p><span style=\"font-family: Arial; font-size: 16px;\"></span><span style=\"font-family: Arial; font-size: 16px;\">26. &nbsp; &nbsp;The total sum of the support measures is $650m. This will be funded from the higher-than-expected revenues collected to-date. There will be no further draw on Past Reserves.</span></p></p><p style=\"text-align: justify;\"><p><span style=\"font-family: Arial; font-size: 16px;\"><strong>Encouraging Regular Self-Testing for All</strong></span></p><p><span style=\"font-family: Arial; font-size: 16px;\">27. &nbsp; &nbsp;Regular testing is key to early detection of possible COVID-19 infection and allows individuals who test positive to take precautions to self-isolate and protect their family, friends, and colleagues. Individuals are encouraged to use their free kits distributed through the nationwide distribution to self-test before visiting crowded places such as wet markets and hawker centres or visiting elderly or children. Those who are unable to work from home or who have to attend school are also encouraged to self-test.</span></p></p><p style=\"text-align: justify;\"><p><span style=\"font-family: Arial; font-size: 16px;\"><span style=\"font-family: Arial;\"></span><span style=\"font-family: Arial;\">28. &nbsp; &nbsp;Firms with employees that work onsite and are not already subject to mandatory RRT may apply for 8 ART kits per onsite employee for weekly testing of their staff over a two-month period as previously announced[3]. Applications are open until 13 October and we strongly encourage firms with employees who are unable to work from home, to apply for ART kits. More details may be found at&nbsp;</span><a href=\"https://go.gov.sg/time-limited-rrt-art\" title=\"\" class=\"\" target=\"\">www.go.gov.sg/time-limited-rrt-art</a>.&nbsp;</span></p></p><p style=\"text-align: justify;\"><p><span style=\"font-family: Arial; font-size: 16px;\"><strong></strong>29. &nbsp; &nbsp;From 1 October 2021, we will also publish on the MOH website a map of areas frequented recently by a larger number of confirmed COVID-19 cases. We hope this can help guide individuals on your movement and activities. Individuals who have been to these hotspots during the same timeframe are encouraged to monitor their health, perform regular ART self-tests throughout the 10 days following their potential exposure, and minimise any unnecessary interaction with others. SafeEntry and TraceTogether would continue to be used to inform individuals of recent confirmed close contacts to infected persons or recent exposure to an area of increased spread through Health Risk Alerts and Health Risk Warnings.</span></p></p><p style=\"text-align: justify;\"><p><span style=\"font-family: Arial; font-size: 16px;\"></span><span style=\"font-family: Arial; font-size: 16px;\">30. &nbsp; &nbsp;There have also been many queries over various tests – for Quarantine, Health Risk Warnings, Health Risk Alerts. We will be putting out public information through public advisory advertisements in the newspapers to help guide the public.&nbsp;</span></p></p><p style=\"text-align: justify;\"><p><span style=\"font-family: Arial; font-size: 16px;\"><strong></strong><u>Increased Weekend Testing Options for Individuals with Acute Respiratory Symptoms</u></span></p><p><span style=\"font-family: Arial; font-size: 16px;\"><strong></strong>31. &nbsp; &nbsp; Currently, individuals with acute respiratory symptoms can visit private GP clinics – called Swab and Send Home (SASH) clinics – to take a confirmatory polymerase chain reaction (PCR) swab test. However, we recognise that not all SASH clinics are open on weekends to serve such individuals.&nbsp;To facilitate prompt testing over weekends, from&nbsp;<strong>25 September 2021 (Saturday)</strong>,we will open 8&nbsp;Regional Screening Centres (RSCs) and 3 Quick Test Centres (QTCs)&nbsp;on Saturdays and Sundays, so that such individuals may get&nbsp;a free confirmatory PCR test. Such weekend visits to the RSCs and QTCs are by appointment only, to prevent overcrowding, with appointment booking only open from Friday, 6pm to Sunday, 3pm of each weekend for bookings on that weekend.&nbsp;More details are at&nbsp;<a href=\"http://www.go.gov.sg/ari-weekend-testing\">www.go.gov.sg/ari-weekend-testing</a>.&nbsp;We encourage symptomatic individuals to get their confirmatory PCR test quickly so that they can get appropriate care, if needed. This will also provide earlier protection to&nbsp;family members, colleagues and friends who might otherwise come into contact with the infected individual.</span></p></p><p style=\"text-align: justify;\"><p><span style=\"font-family: Arial; font-size: 16px;\"><span style=\"font-family: Arial;\"></span><strong>Expanding the Booster Vaccination Strategy</strong></span></p><p><span style=\"font-family: Arial; font-size: 16px;\"></span><span style=\"font-family: Arial; font-size: 16px;\">32. &nbsp; &nbsp;On 15 September 2021, we commenced the booster&nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">programme for&nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">p</span><span style=\"font-family: Arial; font-size: 16px;\">ersons aged 60 and above and residents of aged care facilities.</span><span style=\"font-family: Arial; font-size: 16px;\">&nbsp;As of&nbsp;23&nbsp;September 2021,&nbsp;almost 91,500 seniors have received their booster dose. 56% of seniors who have been invited to-date for their booster dose have either booked an appointment or already received their booster dose.</span></p></p><p style=\"text-align: justify;\"><p><span style=\"font-family: Arial; font-size: 16px;\"></span><span style=\"font-family: Arial; font-size: 16px;\">33. &nbsp; &nbsp;The Expert Committee on COVID-19 Vaccination (EC19V) has been closely monitoring the data regarding the need for additional vaccine doses. It has further recommended for persons aged 50 to 59 years to receive a booster dose of the Pandemic Special Access Route (PSAR) mRNA vaccine from six months after completing their primary course of vaccination. Adults aged 50 to 59 years have a higher risk of underlying comorbidities and hence a risk of severe illness as compared to younger persons, and as many would have completed the full regimen of their primary course of vaccination earlier in the year, their levels of protection could have decreased over time. Boosting the immunity of members of our population will ensure continued high levels of protection against severe disease.</span></p></p><p style=\"text-align: justify;\"><p><span style=\"font-family: Arial; font-size: 16px;\"><span style=\"font-family: Arial;\"></span><span style=\"font-family: Arial;\">34. &nbsp; &nbsp;MOH agrees with the EC19V’s recommendations. From&nbsp;<strong>4 October 2021</strong>, we will progressively invite persons aged 50 to 59 years who have completed their vaccination regimen with two doses at least six months ago to receive their booster dose of a PSAR mRNA vaccine. An SMS with a personalised booking link will be sent to the mobile number that they had registered with for their first two doses, for them to book a new appointment on&nbsp;</span><a href=\"https://www.vaccine.gov.sg\" title=\"\" class=\"\" target=\"\">www.vaccine.gov.sg</a>. These individuals may receive their booster dose at any vaccination centre, polyclinic, or participating Public Health Preparedness Clinic (PHPC).</span></p></p><p style=\"text-align: justify;\"><p><span style=\"font-family: Arial; font-size: 16px;\"><span style=\"font-family: Arial;\"></span><u>Moderna Vaccine Dosage&nbsp;</u></span></p><p><span style=\"font-family: Arial; font-size: 16px;\"><span style=\"font-family: Arial;\"></span><span style=\"font-family: Arial;\">35. &nbsp; &nbsp;The EC19V has also further reviewed the dosing for the Moderna vaccine used for boosting and recommended that 50mcg of the Moderna vaccine be used for boosting given evidence that a 50mcg dosage is sufficient to boost immune response significantly. Based on EC19V recommendations and to ensure the efficient use of vaccines, from&nbsp;</span><strong style=\"font-size: 12pt;\">25 September 2021</strong>, vaccination sites carrying the Moderna vaccine will begin administering the vaccine at a dosage of 50mcg for booster doses, as compared to the 100mcg dose used in the primary vaccination course. There are no safety concerns in persons who have already received 100mcg of the Moderna vaccine for their booster dose.&nbsp;</span></p></p><p style=\"text-align: justify;\"><p><span style=\"font-family: Arial; font-size: 16px;\"></span><span style=\"font-family: Arial; font-size: 16px;\">36. &nbsp; &nbsp;The 100mcg dose of the Moderna vaccine will continue to be used for the two-dose primary series vaccination regimen, and three-dose enhanced primary series for immunocompromised persons. For the Pfizer-BioNTech/Comirnaty vaccine, there is no change in dosage for both the primary series and the booster dose.</span></p></p><p style=\"text-align: justify;\"><p><span style=\"font-family: Arial; font-size: 16px;\"><strong></strong><strong>Towards a COVID-19 Resilient Singapore</strong></span></p><p><span style=\"font-family: Arial; font-size: 16px;\"></span><span style=\"font-family: Arial; font-size: 16px;\">37. &nbsp; &nbsp;We are staying the course to transit towards a COVID-19 resilient nation. But we are still at the Preparatory Stage and have not reached the stage where COVID-19 can be considered as endemic. In this journey towards living with COVID-19, we have to make continual adjustments in our measures to protect our healthcare system, and ensure it is not overwhelmed. &nbsp;</span></p></p><p><p style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 16px;\"><span style=\"font-family: Arial;\"></span><span style=\"font-family: Arial;\">38. &nbsp; &nbsp;During this stabilisation phase, we seek everyone’s cooperation to observe all safe management measures so that we can lower transmission risks and slow down the pace of community infections. Everyone needs to be socially responsible to take care of themselves and minimise their unnecessary movement and social interactions. If you have been exposed to positive cases, please isolate yourself, test yourself regularly and seek medical treatment if you are symptomatic.<br><br></span><strong style=\"text-align: justify;\">MINISTRY OF HEALTH&nbsp;<br></strong></span><strong style=\"text-align: justify;\"><span style=\"font-size: 12pt; font-family: Arial;\">24 SEPTEMBER 2021</span></strong></p></p><div><br clear=\"all\"><hr align=\"left\" size=\"1\" width=\"33%\"><div id=\"ftn1\"><p style=\"text-align: justify;\"><span style=\"font-family: Arial;\"><span style=\"font-size: 13px;\">[1]&nbsp;The eligibility criteria are: (a) Fully vaccinated with PSAR mRNA vaccine, (b) age 2-69 years old, (c) no other severe illnesses or diseases and (d) no household members above 80 years old or belonging to the vulnerable group.</span></span></p></div><div id=\"ftn2\"><p style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 13px;\"><span style=\"font-family: Arial;\">[2]&nbsp;</span>Small and Medium Enterprises and eligible Non-Profit Organisations with an annual revenue not exceeding $100 million, who are tenant-occupiers or owner-occupiers of qualifying commercial properties, will be eligible for rental relief.</span></p></div><div id=\"ftn3\"><p style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 13px;\"><span style=\"font-family: Arial;\">[3]&nbsp;</span>Refer to the MOH press release titled ‘Collective Actions to Slow Down Community Transmission’ on 6 September 2021:&nbsp;</span><a href=\"https://www.moh.gov.sg/news-highlights/details/collective-actions-to-slow-down-community-transmission\" title=\"\" class=\"\" target=\"\"><span style=\"font-family: Arial; font-size: 13px;\">https://www.moh.gov.sg/news-highlights/details/collective-actions-to-slow-down-community-transmission</span></a></p></div></div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "stabilising-our-covid-19-situation-and-protecting-our-overall-healthcare-capacity_24September2021", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}