{"pressItemDictionary": {"Press Releases": [{"Title": "Updates On Local Situation and Heightened Alert to Minimise Transmission", "PublishedDate": "/Date(1620968400000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "14 May 2021", "Summary": "", "MainContent": "&nbsp; &nbsp; &nbsp; &nbsp; The Multi-Ministry Taskforce (MTF) has been closely monitoring the local and global COVID-19 situation. The number of locally transmitted COVID-19 cases and unlinked community cases has continued to increase. This is concerning as the situation could quickly escalate if these cases are not contained swiftly and decisively.&nbsp;<br><br><strong>Update on Local Situation</strong><br><br>2.&nbsp; &nbsp; &nbsp;We have detected several clusters of infections emerging in the past 2 weeks around (i) an ICA officer and his extended family, (ii) Tan Tock Seng Hospital (TTSH), (iii) Tuas South Community Care Facility, and (iv) Pasir Panjang Terminal. Most recently, we have an emerging cluster at Changi Airport Terminal 3 with a total of 46 cases to date.&nbsp;<br><br>3.&nbsp; &nbsp; To reduce the risk of any spread from undetected cases in the community, we have cast a wide net and taken swift action to detect, isolate, and ringfence any possible emerging transmissions to the community. We have carried out mass surveillance testing of persons with possible exposure to cases surrounding these clusters, such as TTSH patients and visitors who were at TTSH during the infectious period. Special testing operations have also been conducted to test port workers who had been deployed at Pasir Panjang Terminal, as well as workers at Changi Airport Terminals 1 and 3 and Jewel Changi Airport. Since <strong>1 May 2021</strong>, we have also implemented additional pre-emptive measures to minimise interactions at both social settings and workplaces so as to break the chains of transmission to the community. These measures were further enhanced with effect from <strong>8 May 2021</strong>, with reductions in the prevailing group size of social gatherings and the size of larger scale events or activities, to minimise the likelihood of large clusters forming.<br><br>4.&nbsp; &nbsp; However, a pattern of local unlinked community cases has emerged and is persisting. This is worrying as it suggests that there may be unknown cases in the community with possible ongoing community transmission and that our earlier and ongoing measures to break the chains of transmissions may be insufficient. We need to act decisively to contain these risks as any one leak could result in an uncontrolled resurgence of cases. Hence we will move to impose targeted restrictions on higher risk settings such as those where there is a high density of people who are unmasked for prolonged periods.<br><br><strong>Phase 2 (Heightened Alert) in the Fight Against COVID-19</strong><br><br>5.&nbsp; &nbsp; Following the measures introduced on 8 May 2021, we need to tighten more measures to decisively arrest the increasing number of cases in the community. The following measures will take effect <strong>from Sunday 16 May 2021 through Sunday 13 June 2021</strong>.&nbsp;<br><br><em>A) Further reductions in permissible group size&nbsp;</em><br>&nbsp;<br>6.&nbsp; &nbsp; We will further reduce the current permissible group size of up to 5 persons to up to 2 persons, and the cap of 5 distinct visitors per household per day to 2 distinct visitors per household per day. Individuals should continue to limit their overall number of social gatherings to not more than 2 per day, whether to another household, or meeting with friends and family members in a public place.<br><br>7.&nbsp; &nbsp; In order to allow families’ current childcare arrangements to continue, grandchildren being cared for by their grandparents on a daily basis would not be counted towards the cap of 2 distinct visitors per household, or to the number of social gatherings per day. However grandparents are strongly encouraged to be vaccinated against COVID-19, to protect both themselves and their grandchildren from COVID-19 infection. To reduce the risk of transmission, grandparents should also minimise intermingling between grandchildren from different households.<br><br><em>B) Minimising Workplace Interactions&nbsp;</em><br><br>8.&nbsp; &nbsp; Work-from-home will be the default at workplaces. Employers must ensure that employees who are able to work from home do so. There should continue to be no cross-deployment of workers to multiple worksites. Employers should continue to stagger start times of employees who need to return to the workplace and implement flexible working hours. Social gatherings at the workplace will not be allowed.&nbsp; Employees may have meal breaks at the workplace, but refrain from&nbsp; intermingling with their colleagues when their masks are taken off. These measures will lower transmission risks by reducing overall footfall and interactions at common spaces at or near the workplace, and in public places, including public transport.<br><br><em>C) Cessation of Indoor “Mask-Off” Activities</em><br><br>9.&nbsp; &nbsp; The recent clusters have demonstrated higher attack rates and secondary transmission occur in mask-off settings, households, and at eateries. To reduce risks of community transmission, indoor “mask-off” activities such as dine-in F&amp;B establishments will cease during this period. Other activities which will also not be allowed during this period include strenuous indoor exercise class or strenuous individual and group indoor sports and exercise activities. In addition, personalised services which require masks to be removed (e.g. facials and saunas), singing, and the playing of instruments that require intentional expulsion of air (e.g. wind or brass instruments) will also not be allowed. These restrictions will not apply to medical and dental consultations that require patients to have their masks off. Please see details in following paragraphs and in <a href=\"/docs/librariesprovider5/default-document-library/annex-a8d79f0b9d0974376aa6e13ecd2b8f63e.pdf?sfvrsn=4eeeb3f1_0\" title=\"Annex A\">Annex A</a>.<br><br>10.&nbsp; &nbsp; Cessation of Dine-in Food and Beverage (F&amp;B). Dine-in F&amp;B establishments are a higher-risk setting as customers often dine for prolonged periods in close proximity with one another with their masks-off. To reduce the risk of community transmission, dine-in F&amp;B establishments (including hawker centres and foodcourts), both indoor and outdoor, will only be able to offer takeaway and delivery options.<br><br>11.&nbsp; &nbsp; Reduction of Activity and Event Sizes and Pre-Event Testing Requirements. To minimise the likelihood of large cluster formations, we will further scale down event sizes and lower the event size caps. Pre-event testing (PET) remains an essential measure to help ensure that events can proceed safely for attendees. More details on PET can be found on the <a href=\"https://www.moh.gov.sg/covid-19/pet\" title=\"\" class=\"\" target=\"\">MOH website</a>.<br><br>a.&nbsp; <strong>Congregational and other worship services</strong>. Congregational and other worship services may continue with a reduced capacity of 50 attendees at any one time without PET, or up to 100 attendees at any one time with PET implemented. To further mitigate the risk of spread through aerosol transmissions, religious workers and all other participants must wear their masks at all times. Live singing and playing of wind instruments will also be suspended during this period.<br><br>b.&nbsp; <strong>Shopping malls and showrooms.</strong> The occupancy limits for shopping malls and showrooms will be further reduced from the current limit of 10sqm per person of Gross Floor Area (GFA), to 16sqm per person. Odd and even date entry restrictions on Sundays for popular malls will continue.<br><br>c.&nbsp; <strong>Attractions and shows. </strong>The operating capacity of attractions that have received MTI’s prior approval will be reduced to 25% from the current permissible capacity of 50%. Indoor and outdoor shows may proceed with up to 100 persons with PET, and up to 50 persons without PET.&nbsp;<br><br>d.&nbsp; <strong>Museums and public libraries</strong>. Museums and public libraries will be allowed to operate at a reduced capacity of 25%.<br><br>e.&nbsp; <strong>Cinemas. </strong>Up to 100 persons may be allowed into cinema halls with PET implemented. Without PET, only up to 50 persons may be allowed. The prevailing group size of 2 persons applies, and food and beverages may not be sold or consumed in the cinema.<br><br>f.&nbsp; <strong>MICE and live performances.</strong> Up to 100 persons may be allowed with PET, and up to 50 persons may be allowed without PET. Unmasking is not allowed for speakers and performers, and there should be no singing or playing of instruments that require intentional expulsion of air (e.g. wind and brass instruments).<br><br>g.&nbsp; <strong>Wedding receptions and solemnisations.&nbsp;</strong><br><br>-&nbsp; &nbsp;In line with measures on dine-in F&amp;B establishments, wedding receptions will not be allowed.<br><br>-&nbsp; &nbsp;Marriage solemnisations may continue for up to 100 participants with PET and 50 participants without PET.&nbsp;&nbsp;<br><br>h.&nbsp; <strong>Funerals. </strong>The cap for attendees applicable to all days of the funeral, including the burial/ cremation, is 20 persons or less, down from 30 persons currently. Attendees are reminded to maintain safe distancing and keep masks on at all times to reduce the risk of transmission.<br><br><strong>Targeted Support Measures</strong><br><br><em>A) Enhanced Jobs Support Scheme (JSS) Support for F&amp;B Firms</em><br><br>12.&nbsp; &nbsp; In view of the cessation of dining-in at F&amp;B establishments, the Government will increase the JSS support rate to 50% of the first $4,600 of gross monthly wages paid to local employees during the period for which dining-in is prohibited. This is an increase from the 10% support for wages paid up to June 2021.<br><br><em>B) One-Month Rental Relief for Hawker Centres and Coffeeshops on Government-owned Premises</em><br><br>13.&nbsp; &nbsp; To support hawkers and coffeeshop stallholders, who are self-employed and do not benefit from the JSS, the Government will provide one month of rental waiver for hawker stall and coffeeshop tenants of Government agencies. Commercial landlords are urged to support their F&amp;B tenants through this period.&nbsp;<br><br><strong>Use of Face Shields</strong><br><br>14.&nbsp; &nbsp; Research has demonstrated that face shields cannot substitute masks in protecting the wearer from droplet infection. More importantly, face shields do not adequately prevent droplet spread if the wearer is infected. Face shields should therefore not be used as a substitute for mask wear, except for medical exceptions; or where the child is 12 years or younger; or for the marriage couple during the solemnisation of their marriage.<br><br><strong>Expansion of Testing Strategy</strong><br><br>15.&nbsp; &nbsp; The above measures will continue to be complemented by our testing, contact tracing, and vaccination capabilities, that we have built up over the past year to manage community spread. Testing, in particular, is one of our key defensive tools to quickly identify individuals who have been exposed to the virus and reduce chances of further spread. Active surveillance and routine testing of targeted groups, such as those with higher risk of exposure to COVID-19, and testing for those diagnosed with Acute Respiratory Infection (ARI) with a COVID-19 Polymerase Chain Reaction (PCR) test has enabled quick detection of unlinked cases in the community. For swifter detection of possible cases, we will be also begin Antigen Rapid Testing (ART) for all who present themselves with ARI symptoms at our Swab and Send Home (SASH) Public Health Preparedness Clinics (PHPCs), Polyclinics, Emergency Departments and Regional Swab Centres (RSCs). This ART will be done together with the PCR test that all such patients are already subjected to. Both the ART and PCR tests will be funded by the Government for all individuals with ARI symptoms. While the ART is less accurate than the PCR test, and there will be more false positives and false negatives, the ART’s quicker turnaround time compared to a PCR test<sup>1</sup> will allow us to take any public health actions more quickly for persons who test positive by ART.&nbsp;<br><br>16.&nbsp; &nbsp; This enhanced testing regime will be rolled out progressively, starting with around 200 SASH PHPCs that are already licensed as ART providers from <strong>15 May 2021</strong>, and will be expanded to include all SASH PHPCs through May alongside Polyclinics, Emergency Departments in hospitals, and RSCs. Along with our use of digital tools, such as the TraceTogether and SafeEntry programme, these measures will enable us to quickly identify and draw wide rings around cases and their close contacts.<br><br><strong>Keeping our Vulnerable and Community Safe</strong><br><br>17.&nbsp; &nbsp; Vaccination remains critical in our fight against the pandemic. We have continued to make steady progress with our vaccination programme, having started with our most vulnerable, such as healthcare workers, elderly, and workers with high risks of exposure to COVID-19. As of 13 May 2021, we have administered more than 3.2 million doses of the COVID-19 vaccine. About 1.9 million individuals have received at least one dose of the vaccine, of whom about 1.3 million individuals have received their second dose and completed the full vaccination regimen.<br><br>18.&nbsp; &nbsp; The recent cases illustrate that vaccination may not eliminate the risks of infection completely. However it provides significant protection against infections and helps to reduce the severity of the disease and onward transmission. Vaccination thus remains a key enabler and its ability to help us re-open safely can only be felt when we achieve a high level of population coverage for vaccination. Hence, we urge everyone to be vaccinated when it is offered to you. Observe all safe management measures, see a doctor, and get tested if you feel unwell. It is only together, that we can emerge stronger and safer.&nbsp;&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>14 MAY 2021<br><br></strong><hr><sup>1&nbsp;</sup><span style=\"font-size: 11px;\">The time from swab registration to notification of results is typically around 30 minutes for ART, but take up to 48 hours for PCR tests.</span><br>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "updates-on-local-situation-and-heightened-alert-to-minimise-transmission-14May", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}