{"pressItemDictionary": {"Press Releases": [{"Title": "106 New Cases of Locally Transmitted  Covid-19 Infection", "PublishedDate": "/Date(1627900320000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "02 Aug 2021", "Summary": "", "MainContent": "&nbsp; &nbsp; &nbsp; &nbsp;As of 2 August 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 106 new cases of locally transmitted COVID-19 infection. 65 are linked to previous cases, and have already been placed on quarantine. 16 are linked to previous cases and were detected through surveillance. 25 are currently unlinked. Amongst the cases are 7 seniors above 70 years who are unvaccinated or partially vaccinated, and are at risk of serious illness.&nbsp;<br><br>2.&nbsp; &nbsp; In addition, there are 5 imported cases, who have already been placed on Stay-Home Notice (SHN) or isolated upon arrival in Singapore. 3 were detected upon arrival in Singapore, while 2 developed the illness during SHN or isolation.<br><br>3.&nbsp; &nbsp; In total, there are 111 new cases of COVID-19 infection in Singapore today.<br><br>4.&nbsp; &nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>2 AUGUST 2021</strong><br>&nbsp;<br><div><br></div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "106-new-cases-of-locally-transmitted-covid-19-infection", "CurrentPageUrl": null}, {"Title": "Amendments to Dental Registration Act", "PublishedDate": "/Date(1627898400000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "02 Aug 2021", "Summary": "", "MainContent": "<p style=\"margin-left: 0cm; text-align: justify;\"><span style=\"font-size: 12pt; font-family: Arial;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;The Ministry of Health (MOH), through the Singapore Dental Council (SDC), will introduce new measures to ensure the continued high quality of foreign-trained dental graduates seeking to practise in Singapore.<br><br>2. &nbsp; &nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 16px; text-align: left;\">The new measures are being introduced as the SDC had observed a high degree of variability in overseas clinical practices and the dental curriculum of overseas universities. To ensure that the quality and competencies of foreign-trained dental graduates who are eligible to register and practise in Singapore remain high, the standards of the mandatory Qualifying Examination (QE) will be benchmarked to the final-year dental professional examination taken by graduates of the National University of Singapore’s Faculty of Dentistry.<br><br></span><strong style=\"text-align: left; font-family: Arial; font-size: 16px;\">Qualifying Examination<br><br></strong><span style=\"text-align: left; font-family: Arial; font-size: 16px;\">3. &nbsp; &nbsp;Presently, foreign-trained dental graduates with dentistry degrees listed in the Schedule of the&nbsp;</span><span style=\"text-align: left; font-family: Arial; font-size: 16px;\">Dental Registration Act (DRA)&nbsp;</span><span style=\"text-align: left; font-family: Arial; font-size: 16px;\">can apply for conditional registration to practise in Singapore as long as they fulfill the requirement of securing employment with a local dental clinic or healthcare institution, subject to other requirements under the DRA. Foreign-trained dental graduates</span><span style=\"text-align: left; font-family: Arial; font-size: 16px;\">&nbsp;with basic dental qualifications not listed in the Schedule are similarly required to secure employment with a local dental clinic or healthcare institution. In addition, for this latter group, the SDC also mandates that they pass an examination to demonstrate the requisite knowledge and skills necessary for conditional registration as a dentist.<br><br>4. &nbsp; &nbsp; &nbsp; </span><span style=\"font-family: Arial; font-size: 16px; text-align: left;\">From 2029, foreign-trained dentists are required to demonstrate that they have the requisite clinical knowledge and procedural skills to practise dentistry in Singapore by taking and passing a QE, before they are eligible for conditional registration. Passing the QE will grant eligibility for conditional registration, the usual route by which most foreign-trained dental graduates are first registered in Singapore. The Dental Registration (Amendment) Bill passed in Parliament today will give effect to this requirement, irrespective of the graduate’s nationality.<br><br></span><span style=\"font-family: Arial; font-size: 16px; text-align: left;\">5. &nbsp; &nbsp; &nbsp;The new QE requirement will be effective from&nbsp;1 January 2029. This means that students who are currently enrolled in, or have secured places in dentistry degree programmes and would graduate before 1 January 2029, as well as foreign-trained dental graduates who already hold dental qualifications will not be affected by this change. They will be considered for conditional registration if they fulfil the requirements under the current DRA and until the measures takes effect from 1 January 2029.</span></p><p><p style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 16px;\"></span><strong style=\"font-family: Arial; font-size: 16px;\">Revision of Registrable Overseas Basic Dental Qualifications</strong></p><p style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 16px;\">6. &nbsp; &nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">The list of dentistry degrees in the Schedule to the&nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">DRA</span><span style=\"font-family: Arial; font-size: 16px;\">&nbsp;will be revised</span><span style=\"font-family: Arial; font-size: 16px;\">. Holders of&nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">dentistry degrees</span><span style=\"font-family: Arial; font-size: 16px;\">under the revised list will be automatically eligible to take the QE following the amendments to the DRA, whereas holders of qualifications not under the revised list will have to apply for permission to take the QE</span><span style=\"font-family: Arial; font-size: 16px;\">. The revision to the Schedule to the DRA will be done through subsidiary legislation.<br><br>7. &nbsp; &nbsp; &nbsp;I</span><span style=\"font-family: Arial; font-size: 16px;\">n line with the objective of ensuring the continued high quality of foreign-trained dental graduates, the SDC has reviewed the Schedule and will reduce the number of overseas dental schools and universities in the Schedule from the current 89 to 62. Those to be removed are schools from which the SDC had received no applications for registration over the past 12 years.<br><br>8. &nbsp; &nbsp; &nbsp;&nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">The SDC will make available the revised Schedule by end 2021. The Schedule will come into effect in 2029. Students who have secured places, or are enrolled in the affected overseas dental schools or universities will not be impacted. They will still be able to apply to take the QE, and their applications will be considered on a case-by-case basis. The revised Schedule will apply to students who graduate from their studies on or after 1 January 2029.<br><br>9. &nbsp; &nbsp; &nbsp;&nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">MOH and SDC will continue to review the regulatory policies and practices in place to&nbsp;</span><span style=\"color: rgb(51, 51, 51); font-family: Arial; font-size: 16px;\">ensure high standards of professional competence by all registered dental practitioners.<br><br></span><strong style=\"font-family: Arial; font-size: 16px;\">MINISTRY OF HEALTH&nbsp;<br></strong><strong><span style=\"font-size: 12pt; font-family: Arial;\">2 AUGUST 2021</span></strong></p></p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "amendments-to-dental-registration-act_2August2021", "CurrentPageUrl": null}, {"Title": "No Prior Appointment Needed At Moderna Vaccination Centres ", "PublishedDate": "/Date(1627887120000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "02 Aug 2021", "Summary": "", "MainContent": "<p>We have made good progress in our national COVID-19 vaccination programme thus far. As of 31 July 2021, we have administered around 7.5 million doses of COVID-19 vaccine. Around 4.3 million individuals have received at least the first dose of the vaccine, of whom about 3.3 million have completed the full vaccination regimen. This means about 61% of Singapore residents have completed the full vaccination regimen.<br><br>2.&nbsp; &nbsp; &nbsp; &nbsp;Thus far, 83% of those aged 60 and above, 88% of those aged 45 to 59, 87% of those aged 40 to 44, and 83% of those aged 12 to 39 years of age, have received at least one dose of COVID-19 vaccine or booked their appointments.<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp;Since mid-July, seniors aged 60 and above have been allowed to walk into any vaccination centre, polyclinic or participating Public Health Preparedness Clinic to receive their vaccination without an appointment. To further increase the convenience for all to get vaccinated, from 2 August 2021, all Singaporeans, Permanent Residents, and Long-Term Pass holders aged 18 years old and above who have not yet come forward for their first dose will be able to walk-in to any of our 11 community vaccination centres offering the Moderna COVID-19 vaccine without a prior appointment. These vaccination centres are at:</p><ul><li>Buona Vista Community Club</li><li>Hong Kah North Community Club</li><li>Kebun Baru Community Club</li><li>Kolam Ayer Community Club</li><li>Marsiling Community Club</li><li>Potong Pasir Community Club</li><li>Punggol 21 Community Club</li><li>Radin Mas Community Club</li><li>Tampines East Community Club</li><li>Woodlands Community Club</li><li>Yew Tee Community Club</li></ul><p>4.&nbsp; &nbsp; &nbsp;Vaccination remains a key enabler in our fight against COVID-19. Its ability to help Singapore reopen safely can only be felt when we can collectively achieve a high level of population coverage for vaccination. We urge all who are eligible to be vaccinated. Individuals can also book appointments at www.vaccine.gov.sg to get vaccinated.<br><br><strong>MINISTRY OF HEALTH<br>2 AUGUST 2021</strong><br></p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "no-prior-appointment-needed-at-moderna-vaccination-centres", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}