{"pressItemDictionary": {"Press Releases": [{"Title": " 1 New Case of Locally Transmitted  Covid-19 Infection ", "PublishedDate": "/Date(1620316620000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "06 May 2021", "Summary": "", "MainContent": "As of 5 May 2021, 12pm, the Ministry of Health (MOH) has confirmed and verified that there is 1 new case of locally transmitted COVID-19 infection. The case is in the community, and there are no new cases in the dormitories. There are 15 imported cases, who had already been placed on Stay-Home Notice (SHN) upon arrival in Singapore. Amongst the new cases today, 13 are asymptomatic, and were detected from our proactive screening and surveillance, while 3 were symptomatic.&nbsp;&nbsp;<br><br><strong>Summary of new cases</strong><br><div><br><div dir=\"ltr\" align=\"left\"><table><colgroup><col width=\"129\"><col width=\"60\"><col width=\"16\"><col width=\"96\"><col width=\"96\"><col width=\"16\"><col width=\"96\"><col width=\"96\"></colgroup><tbody><tr><td><br></td><td><strong><br></strong></td><td colspan=\"2\"><p dir=\"ltr\"><strong>Breakdown by</strong></p></td><td colspan=\"2\"><p dir=\"ltr\"><strong>Breakdown by</strong></p></td></tr><tr><td><strong><br></strong></td><td><p dir=\"ltr\"><strong>Number of cases</strong></p></td><td><p dir=\"ltr\"><strong>Already in quarantine/ isolation before detection</strong></p></td><td><p dir=\"ltr\"><strong>Detected from surveillance</strong></p></td><td><p dir=\"ltr\"><strong>Symptomatic</strong></p></td><td><p dir=\"ltr\"><strong>Asymptomatic</strong></p></td></tr><tr><td><p dir=\"ltr\"><strong>Cases in the community</strong></p></td><td><p dir=\"ltr\">1</p></td><td><p dir=\"ltr\">0</p></td><td><p dir=\"ltr\">1</p></td><td><p dir=\"ltr\">1</p></td><td><p dir=\"ltr\">0</p></td></tr><tr><td><p dir=\"ltr\"><strong>Cases residing in dormitories</strong></p></td><td><p dir=\"ltr\">0</p></td><td><p dir=\"ltr\">0</p></td><td><p dir=\"ltr\">0</p></td><td><p dir=\"ltr\">0</p></td><td><p dir=\"ltr\">0</p></td></tr><tr><td><p dir=\"ltr\"><strong>Imported cases</strong></p></td><td><p dir=\"ltr\">15</p></td><td><p dir=\"ltr\">15</p></td><td><p dir=\"ltr\">0</p></td><td><p dir=\"ltr\">2</p></td><td><p dir=\"ltr\">13</p></td></tr><tr><td><p dir=\"ltr\"><strong>Total</strong></p></td><td><p dir=\"ltr\">16</p></td><td><br></td><td><br></td><td><br></td><td><br></td></tr></tbody></table></div><br><br>2.&nbsp; &nbsp; &nbsp;Overall, the number of new cases in the community has increased from 13 cases in the week before to 62 cases in the past week. The number of unlinked cases in the community has also increased from 6 cases in the week before to 7 cases in the past week. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br><br>3.&nbsp; &nbsp; &nbsp;Amongst the 182 confirmed cases reported from 29 April to 5 May, 49 cases have tested positive for their serology tests, 101 have tested negative, and 32 serology test results are pending.<br><br><strong>Case Details<br></strong><br><strong>a) Cases in the community: 1</strong><br><br>There is 1 case in the community today who is linked to previous cases.&nbsp;<br><br>Case 62824 is a 59 year-old male Singaporean who is employed by GKE Express Logistics Pte Ltd as a trailer truck driver at Brani Terminal and Pasir Panjang Terminal. He was last at work on 1 May.&nbsp;<br><br>He developed a fever and sore throat on 2 May, and remained at home. The next day, he sought medical treatment at a General Practitioner clinic and was tested for COVID-19. His result came back positive for COVID-19 on 4 May, and he was conveyed in an ambulance to Alexandra Hospital. His serology test result is pending.&nbsp;<br><br>Our investigations found that Cases 61822<sup>1</sup>, 62684<sup>2</sup>, 62691<sup>3</sup> and 62824 had been at Pasir Panjang Terminal for work, and transmission could have occurred at the Terminal. Further epidemiological investigations are ongoing. As a precautionary measure, MOH will carry out a special testing operations to test port workers employed by PSA Singapore who had been deployed at Pasir Panjang Terminal.<br><br><strong>b) Cases residing in dormitories: 0</strong><br><br>There are no cases residing in dormitories today.&nbsp;<br><br><strong>c) Imported cases: 15</strong><br><br>Amongst the 15 imported cases,&nbsp;<br><br>-&nbsp; 5 (Cases 62821, 62825, 62827, 62828 and 62838) are Singaporeans and 2 (Cases 62822 and 62830) are Singapore Permanent Residents who returned from India, Indonesia, Thailand, the UK and US.<br>-&nbsp; 1 (Case 62826) is a Dependant’s Pass holder who arrived from India, and who has a Singaporean family member.<br>-&nbsp; 2 (Cases 62829 and 62831) are Student’s Pass holders who arrived from India and Myanmar. They were already studying in Singapore before, and had returned to their home country, or had been emplaced on their course earlier.<br>-&nbsp; 3 (Cases 62823, 62834 and 62837) are Work Pass holders who arrived from the Philippines, Sri Lanka and Thailand.<br>-&nbsp; 2 are Work Permit holders who arrived from the Philippines and Sri Lanka, of whom 1 (Case 62833) is a foreign domestic worker.<br><br>They had all already been placed on SHN upon arrival in Singapore and were tested while serving SHN. The arrivals from the Indian sub-continent had already come in to Singapore before the restrictions on travel were imposed<sup>4</sup>.<br><br>4.&nbsp; &nbsp; &nbsp;Please refer to the <a href=\"/docs/librariesprovider5/default-document-library/annexes9ec0979869e84ecea26130892ede0f99.pdf?sfvrsn=c728d9cf_0\" title=\"Annexes\">Annexes</a>&nbsp;and MOH’s daily Situation Report (<a href=\"https://www.moh.gov.sg/covid-19/situation-report\" title=\"\" class=\"\" target=\"\">www.moh.gov.sg/covid-19/situation-report</a>) for details.&nbsp;<br><br>5.&nbsp; &nbsp; &nbsp;Epidemiological investigations are in progress. In the meantime, all the identified close contacts of the cases have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for the close contacts to determine if the cases could have been infected by them.<br><br><strong>Update on condition of confirmed cases</strong><br><br>6.&nbsp; &nbsp; &nbsp;21 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 60,844 have fully recovered from the infection and have been discharged from hospitals or community care facilities.&nbsp;<br><br>7.&nbsp; &nbsp; &nbsp;There are currently 131 confirmed cases who are still in hospital. Of these, most are stable or improving, and 2 are in critical condition in the intensive care unit<sup>5</sup>. 262 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 31 have passed away from complications due to COVID-19 infection.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH<br>5 MAY 2021<br>&nbsp;<br></strong><hr><span style=\"font-size: 10px;\"><sup>1 </sup>Case 61822 is a 23 year-old male Indian national who works as a lashing specialist at Pasir Panjang Terminal. He was confirmed to have COVID-19 infection on 10 April.&nbsp;<br><br><sup>2 </sup>Case 62684 is a 23 year-old male India national who works as a stevedore at Pasir Panjang Terminal. He was confirmed to have COVID-19 infection on 30 April.<br></span><div><span style=\"font-size: 10px;\"><br><sup>3&nbsp;&nbsp;</sup>Case 62691 is a 35 year-old male Myanmar national who works as a stevedore at Pasir Panjang Terminal and Brani Terminal. He was confirmed to have COVID-19 infection on 28 April.<br></span><div><span style=\"font-size: 10px;\"><br></span></div><div><span style=\"font-size: 10px;\"><sup>4</sup>&nbsp; From 23 April 2021, 2359 hours, all long-term pass holders and short-term visitors with recent travel history (including transit) to India within the last 14 days will not be allowed entry into Singapore, or transit through Singapore. From 1 May 2021, 2359 hours, all long-term pass holders and short-term visitors with recent travel history (including transit) to Bangladesh, Nepal, Pakistan and Sri Lanka within the last 14 days will not be allowed entry into Singapore, or transit through Singapore.<br><br><sup>5</sup>&nbsp;&nbsp;These are not linked to the Case 62541 cluster.</span> </div><br></div><br></div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "1-new-case-of-locally-transmitted-covid-19-infection-5May-updated", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}