{"pressItemDictionary": {"Press Releases": [{"Title": "Police Report Filed Against Singapore Emergency Ambulance Services (seas)", "PublishedDate": "/Date(1612785600000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "08 Feb 2021", "Summary": "", "MainContent": "<p style=\"text-align: justify;\"><span style=\"font-family: Arial;\"><span style=\"font-size: 14px;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The Ministry of Health (MOH) has filed a Police report on the online listings of Singapore Emergency Ambulance Services (SEAS), a private ambulance service, that was found to have misrepresented multiple public and private hospitals.&nbsp;<br><br>2.&nbsp; &nbsp; &nbsp; MOH received feedback that the contact number “6100 6995”, which belongs to SEAS, a private ambulance operator, has been linked to search engine results purporting to be in connection with the following, but not limited to :&nbsp;&nbsp;<br><br>i. Changi General Hospital Ambulance Service Bay;<br>ii. Khoo Teck Puat Hospital Ambulance Service Bay;<br>iii. Ng Teng Fong General Hospital Ambulance Bay;<br>iv. Raffles Hospital Ambulance Bay;<br>v. Singapore General Hospital Ambulance Service Bay;<br>vi. Singapore General Hospital Block 5 Ambulance Bay; and<br>vii. Tan Tock Seng Hospital Ambulance Service Bay.<br><br>3.&nbsp; &nbsp; &nbsp; As SEAS is not endorsed or provided by the hospitals set out in the list above, and has no authorisation to operate any “ambulance service bays” or “ambulance bays” on their behalf, MOH has filed a Police report in respect of SEAS’ misrepresentations. The Police are currently looking into the matter. MOH will also consider referring the matter to the Competition and Consumer Commission of Singapore.<br><br>4.&nbsp; &nbsp; &nbsp; &nbsp;To ensure the safety and safeguard the welfare of patients, MOH introduced the Voluntary Accreditation Scheme in 2018, to help operators raise their capabilities and competencies. Private ambulance operators must meet a set of standards, which include defining the core competencies, capabilities and training requirements for the ambulance crew members, as well as the essential documentation, equipment, medications, and life-saving and infection control protocols, before they come onboard the Scheme.&nbsp;<br><br>5.&nbsp; &nbsp; &nbsp; Should there be a need to engage private ambulance services, the public are advised to refer to the Healthcare Institutions Directory (<a href=\"http://hcidirectory.sg/hcidirectory/\" title=\"\" class=\"\" target=\"\">http://hcidirectory.sg/hcidirectory/</a>) for the list of private ambulance operators accredited under the Voluntary Accreditation Scheme.<br><br><br><strong>MINISTRY OF HEALTH<br>8 FEBRUARY 2021</strong></span></span></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "police-report-filed-against-singapore-emergency-ambulance-services-(seas)", "CurrentPageUrl": null}, {"Title": "2 New Cases of Locally Transmitted  Covid-19 Infection ", "PublishedDate": "/Date(1612713600000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "08 Feb 2021", "Summary": "", "MainContent": "<br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;As of 8 February 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 2 new cases of locally transmitted COVID-19 infection. Based on our investigations so far, both cases are in the community, and there are no new cases in the dormitories.&nbsp;<br><br>2.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; In addition, there are 20 imported cases, who had already been placed on Stay-Home Notice upon arrival in Singapore. In total, there are 22 new cases of COVID-19 infection in Singapore today.<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.&nbsp;<br><div><br></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "2-new-cases-of-locally-transmitted-covid-19-infection-8-feb", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}