{"pressItemDictionary": {"Press Releases": [{"Title": "4 New Cases of Locally Transmitted Covid-19 Infection ", "PublishedDate": "/Date(1611064920000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "19 Jan 2021", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;As of 19 January 2021, 12pm, the Ministry of Health (MOH) has confirmed and verified that there are 4 new cases of locally transmitted COVID-19 infection. The cases are in the community, and there are no new cases in the dormitories. There are 26 imported cases, who had already been placed on Stay-Home Notice (SHN) upon arrival in Singapore. Amongst the new cases today, 23 are asymptomatic, and were detected from our proactive screening and surveillance, while 7 were symptomatic.&nbsp;</p><p><strong>Summary of new cases</strong></p><table border=\"1\" cellspacing=\"0\" cellpadding=\"0\" width=\"453\"><tbody><tr><td width=\"97\"><p align=\"right\">&nbsp;</p></td><td width=\"45\"><p>&nbsp;</p></td><td width=\"12\" valign=\"top\"><p>&nbsp;</p></td><td width=\"144\" colspan=\"2\"><p align=\"center\"><strong>Breakdown by</strong></p></td><td width=\"12\" valign=\"top\"><p>&nbsp;</p></td><td width=\"144\" colspan=\"2\"><p align=\"center\"><strong>Breakdown by</strong></p></td></tr><tr><td width=\"97\"><p align=\"right\">&nbsp;</p></td><td width=\"45\"><p><strong>Number of cases</strong></p></td><td width=\"12\" valign=\"top\"><p>&nbsp;</p></td><td width=\"72\"><p><strong>Already in quarantine/ isolation before detection</strong></p></td><td width=\"72\"><p><strong>Detected from surveillance</strong></p></td><td width=\"12\" valign=\"top\"><p>&nbsp;</p></td><td width=\"72\"><p><strong>Symptomatic</strong></p></td><td width=\"72\"><p><strong>Asymptomatic</strong></p></td></tr><tr><td width=\"97\"><p><strong>Cases in the community</strong></p></td><td width=\"45\"><p align=\"center\">4</p></td><td width=\"12\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"72\"><p align=\"center\">3</p></td><td width=\"72\"><p align=\"center\">1</p></td><td width=\"12\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"72\"><p align=\"center\">2</p></td><td width=\"72\"><p align=\"center\">2</p></td></tr><tr><td width=\"97\"><p><strong>Cases residing in dormitories</strong></p></td><td width=\"45\"><p align=\"center\">0</p></td><td width=\"12\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"72\"><p align=\"center\">0</p></td><td width=\"72\"><p align=\"center\">0</p></td><td width=\"12\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"72\"><p align=\"center\">0</p></td><td width=\"72\"><p align=\"center\">0</p></td></tr><tr><td width=\"97\"><p><strong>Imported cases</strong></p></td><td width=\"45\"><p align=\"center\">26</p></td><td width=\"12\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"72\"><p align=\"center\">24</p></td><td width=\"72\"><p align=\"center\">2</p></td><td width=\"12\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"72\"><p align=\"center\">5</p></td><td width=\"72\"><p align=\"center\">21</p></td></tr><tr><td width=\"97\"><p><strong>Total</strong></p></td><td width=\"45\"><p align=\"center\">30</p></td><td width=\"12\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"72\"><p align=\"center\">&nbsp;</p></td><td width=\"72\"><p align=\"center\">&nbsp;</p></td><td width=\"12\" valign=\"top\"><p align=\"center\">&nbsp;</p></td><td width=\"72\"><p align=\"center\">&nbsp;</p></td><td width=\"72\"><p align=\"center\">&nbsp;</p></td></tr></tbody></table><p>&nbsp;</p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Overall, the number of new cases in the community has increased from 6 cases in the week before to 14 cases in the past week. The number of unlinked cases in the community has also increased from 4 cases in the week before to 5 cases in the past week.&nbsp;We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.</p><p><strong>Case Details</strong></p><p><strong>a)&nbsp;&nbsp;&nbsp; </strong><strong>Cases in the community: 4</strong></p>There are 4 cases in the community today, of whom 1 is currently unlinked and 3 are linked to previous cases.<h3></h3><p><u><span style=\"font-size: 13px;\">Case 59419<br></span></u>Case 59419 is a 31 year-old male Chinese national who is a Work Permit holder. He works as a food processing worker at Golden Bridge Foods Manufacturing Pte Ltd (30 Senoko South Road). He is a co-worker and housemate of Case 59343[1].</p><p>He had been identified as a close contact of Case 59343, and was placed on quarantine on 15 January. He was tested on 17 January during quarantine even though he is asymptomatic, and his result came back positive for COVID-19 infection the next day. He was subsequently conveyed in an ambulance to the National Centre for Infectious Diseases (NCID). His serological test result has come back negative, indicating that this is likely a current infection.</p><p><u>Case 59420<br></u>Case 59420 is a 48 year-old female Chinese national who is a Work Permit holder, and the spouse of Case 59343. She works as a food processing worker at Soon Lee Heng Satay Foodstuff Manufacturer (15 Woodlands Loop).</p><p>She had been identified as a close contact of Case 59343 and was placed on quarantine on 15 January. She was tested on 17 January during quarantine, even though she is asymptomatic. Her result came back positive for COVID-19 infection the next day, and she was conveyed in an ambulance to NCID. Her serological test result has also come back negative, indicating that this is likely a current infection.</p><p><u>Case 59428<br></u>Case 59428 is a 8 year-old male Singaporean who is the child of Cases 59365[2]&nbsp;and 59393[3]. He is a student at Chua Chu Kang Primary School, and had last gone to school on 15 January. He was identified as a close contact of Case 59365 on 16 January, and was placed on quarantine.</p><p>He was swabbed on the same day and his result came back negative for COVID-19. &nbsp;There is therefore no risk of transmission to the students he had contact with previously.&nbsp;However he developed a fever on 17 January while he was in quarantine, and was tested again at KK Women’s and Children’s Hospital. This time, his test came back positive for COVID-19 infection. His serological test result has come back negative, indicating that this is likely a current infection.</p><h3></h3><p><u>Case 59429<br></u><span style=\"font-size: 14px;\">Case 59429 is a 39 year-old male Singapore Permanent Resident who works as a sales personnel at BS Industrial &amp; Construction Supply Pte Ltd (34 Kallang Place).</span></p><p>He developed a fever on 16 January, and sought medical treatment at a polyclinic on 18 January, where he was tested for COVID-19 as part of our enhanced community testing to test all individuals aged 13 and above who are diagnosed with acute respiratory infection at first presentation to a doctor.</p><p>His test result came back positive for COVID-19 infection on the same day, and he was conveyed to NCID in an ambulance. His serological test result has come back negative, indicating that this is likely a current infection.</p><p>Epidemiological investigations are ongoing. In the meantime, all the identified close contacts of the cases, including their family and household members, as well as co-workers, have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for the close contacts to determine if the case could have been infected by them.</p><p><strong>b)&nbsp;&nbsp;&nbsp; </strong><strong>Cases residing in dormitories: 0</strong></p><p>There are no cases residing in dormitories today.</p><p><strong>c)&nbsp;&nbsp;&nbsp; </strong><strong>Imported cases: 26</strong></p><p>Amongst the 26 imported cases,</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 4 (Cases 59408, 59427, 59430 and 59433) are Singaporeans and 3 (Cases 59426, 59431 and 59432) are Singapore Permanent Residents who returned from Indonesia, Ireland, Myanmar and UK.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 2 (Cases 59412 and 59422) are Student’s Pass holders who arrived from Bulgaria and Malaysia.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 1 (Case 59416) is a Work Pass holder who arrived from the UAE.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 16 are Work Permit holders who arrived from Bangladesh, India and Indonesia, of whom 3 (Cases 59421, 59424 and 59425) are foreign domestic workers.</p><p>They had all already been placed on SHN upon arrival in Singapore and were tested while serving SHN.</p><p>Case 59415 is a Work Permit holder who arrived from Bangladesh on 28 December 2020 and served SHN at a dedicated facility until 11 January 2021. His swab done on 8 January during SHN was negative for COVID-19, and subsequent tests on 12 January and 14 January were also negative. His test on 17 January came back positive for COVID-19 infection, although the Ct value was very high, which is indicative of a low viral load. His serological test result has also come back positive. Given that these indicate likely past infection, we have classified the case as imported. He is likely to be shedding minute fragments of the virus RNA, which are no longer transmissible and infective to others.</p><p>Case 59433 is a 28 year-old female Singaporean who returned from Ireland on 3 January, and was placed on SHN at a dedicated facility. Her swab done on 14 January during SHN was negative for COVID- 19. She developed a dry throat later that day, and cough on 16 January but did not report her symptoms. Her SHN ended on 17 January, and on 18 January, she sought medical treatment at the National University Hospital where she was tested for COVID-19. Her result came back positive on the same day.</p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Please refer to the <a href=\"/docs/librariesprovider5/default-document-library/annexes-(19-jan)-(1).pdf?sfvrsn=8477e92_0\" title=\"Annexes \">Annexes </a>and MOH’s daily Situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\">www.moh.gov.sg/covid-19/situation-report</a>) for details.</p><p><strong>Update on condition of confirmed cases</strong></p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 26 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 58,894 have fully recovered from the infection and have been discharged from hospitals or community care facilities.</p><p>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; There are currently 45 confirmed cases who are still in hospital. Of these, most are stable or improving, and none is in the intensive care unit. 189 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 29 have passed away from complications due to COVID-19 infection.</p><div><hr align=\"left\" size=\"1\" width=\"33%\"><div id=\"ftn1\"><p>[1] Case 59343 is a 33 year-old male Chinese national who works at Golden Bridge Foods Manufacturing Pte Ltd. He was confirmed to have COVID-19 infection on 15 January.</p></div><div id=\"ftn2\"><p>[2] Case 59365 is a 44 year-old male Singaporean who works as an administrative officer at the Singapore Police Force, and is a colleague of Case 59280. He was confirmed to have COVID-19 infection on 16 January.</p></div><div id=\"ftn3\"><p>[3] Case 59393 is a 43 year-old female Singaporean who is the spouse of Case 59365. She was confirmed to have COVID-19 infection on 17 January.</p></div></div>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "4-new-cases-of-locally-transmitted-covid-19-infection-19-jan-update", "CurrentPageUrl": null}, {"Title": "4 New Cases of Locally Transmitted Covid-19 Infection ", "PublishedDate": "/Date(1611043920000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "19 Jan 2021", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;As of 19 January 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 4 new cases of locally transmitted COVID-19 infection. Based on our investigations so far, the cases are in the community, and there are no new cases in the dormitories.</p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In addition, there are 26 imported cases, who had already been placed on Stay-Home Notice upon arrival in Singapore. In total, there are 30 new cases of COVID-19 infection in Singapore today.</p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.</p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "4-new-cases-of-locally-transmitted-covid-19-infection-19-jan", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}