{"pressItemDictionary": {"Press Releases": [{"Title": "1 New Case of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1618931100000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "20 Apr 2021", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As of 20 April 2021, 12pm, the Ministry of Health (MOH) has confirmed and verified 1 new case of locally transmitted COVID-19 infection. The case resides in a dormitory and there are no new cases in the community. There are 13 imported cases, who had already been placed on Stay-Home Notice (SHN) upon arrival in Singapore. Amongst the new cases today, 10 are asymptomatic, and were detected from our proactive screening and surveillance, while 4 were symptomatic.&nbsp;<br><strong><br>&nbsp;Summary of new cases</strong></p> <table border=\"1\" cellspacing=\"0\" cellpadding=\"0\" width=\"605\"> <tbody><tr> <td width=\"129\"> <p align=\"right\">&nbsp;</p> </td> <td width=\"60\"> <p>&nbsp;</p> </td> <td width=\"16\" valign=\"top\"> <p>&nbsp;</p> </td> <td width=\"192\" colspan=\"2\"> <p align=\"center\"><strong>Breakdown by</strong></p> </td> <td width=\"16\" valign=\"top\"> <p>&nbsp;</p> </td> <td width=\"192\" colspan=\"2\"> <p align=\"center\"><strong>Breakdown by</strong></p> </td> </tr> <tr> <td width=\"129\"> <p align=\"right\">&nbsp;</p> </td> <td width=\"60\"> <p><strong>Number of cases</strong></p> </td> <td width=\"16\" valign=\"top\"> <p>&nbsp;</p> </td> <td width=\"96\"> <p><strong>Already in quarantine/ isolation before detection</strong></p> </td> <td width=\"96\"> <p><strong>Detected from surveillance</strong></p> </td> <td width=\"16\" valign=\"top\"> <p>&nbsp;</p> </td> <td width=\"96\"> <p><strong>Symptomatic</strong></p> </td> <td width=\"96\"> <p><strong>Asymptomatic</strong></p> </td> </tr> <tr> <td width=\"129\"> <p><strong>Cases in the community</strong></p> </td> <td width=\"60\"> <p align=\"center\">0</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">0</p> </td> <td width=\"96\"> <p align=\"center\">0</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">0</p> </td> <td width=\"96\"> <p align=\"center\">0</p> </td> </tr> <tr> <td width=\"129\"> <p><strong>Cases residing in dormitories</strong></p> </td> <td width=\"60\"> <p align=\"center\">1</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">0</p> </td> <td width=\"96\"> <p align=\"center\">1</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">1</p> </td> <td width=\"96\"> <p align=\"center\">0</p> </td> </tr> <tr> <td width=\"129\"> <p><strong>Imported cases</strong></p> </td> <td width=\"60\"> <p align=\"center\">13</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">13</p> </td> <td width=\"96\"> <p align=\"center\">0</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">3</p> </td> <td width=\"96\"> <p align=\"center\">10</p> </td> </tr> <tr> <td width=\"129\"> <p><strong>Total</strong></p> </td> <td width=\"60\"> <p align=\"center\">14</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"16\" valign=\"top\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">&nbsp;</p> </td> <td width=\"96\"> <p align=\"center\">&nbsp;</p> </td> </tr> </tbody></table> <p>&nbsp;</p> <p>2.&nbsp; &nbsp; Overall, the number of new cases in the community has increased from 2 cases in the week before to 9 cases in the past week. The number of unlinked cases in the community has also increased from 2 cases in the week before to 4 cases in the past week. We will continue to closely monitor these numbers, as well as the cases detected through our surveillance programme.<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Amongst the 173 confirmed cases reported from 14 April to 20 April, 66 cases have tested positive for their serology tests, 89 have tested negative, and 18 serology test results are pending.<br><strong><br>Case Details<br><br>a)&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Cases in the community: 0<br></strong><br>There are no cases in the community today.<br><br><u>Update on Cases 62045<sup>[1]&nbsp;</sup>and 62143<sup>[2]</sup>:</u> As part of epidemiological investigations into Case 62045, MOH tested all her close contacts, including Case 61536, a 43 year-old Indian national who is a Work Pass holder.<br><br>Case 61536 is Case 62045’s brother-in-law, and had been identified as a household contact of Cases 62045 and 62143. He arrived from India on 2 April, and was asymptomatic. His on-arrival swab was positive for COVID-19 infection and he was conveyed to a hospital. He was subsequently assessed to be a recovered case based on his high Ct value which indicated a low viral load, positive serology test result on 4 April, as well as negative pre-departure test taken on 31 March. He was discharged from the hospital on 6 April, without the need for further isolation as he was deemed to have been shedding minute fragments of the virus RNA, which were no longer transmissible and infective to others.&nbsp;<br><br>On 17 April, as he had been identified as a close contact of Case 62045, he was tested for COVID-19 and his test result came back positive. His serology test result is also positive. The Ct value of his polymerase chain reaction (PCR) test taken on 17 April was lower than his test done on 2 April, indicating a higher viral load this time. His antibody titres are also currently very high, suggesting that he was exposed to a new infection which boosted his antibody levels. MOH, in consultation with an expert panel which comprises infectious diseases and microbiology experts, has assessed that he was likely to have been re-infected with COVID-19 recently. Our epidemiological investigations indicate that Case 61536 was probably re-infected when he was in India, and had been infectious when he returned to Singapore. He then passed the infection to Cases 62045 and 62143.<br><br>With the emergence of new variants of concern around the world, we will closely monitor for re-infection of recovered COVID-19 cases, and are reviewing our border measures for recovered travellers. Similar imported cases suspected of re-infection will be isolated and undergo repeat COVID-19 PCR tests to monitor the trend of their viral loads, to ensure that such cases are detected promptly.<br><strong><br>&nbsp;b)&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Cases residing in dormitories: 1</strong><br><br>There is 1 case residing in a dormitory today who is currently unlinked.<br><br>Case 62181, a 35 year-old male Bangladesh national, is a Work Permit holder who arrived in Singapore in July 2019. He is employed by Prosper Environmental &amp; Engineering Pte Ltd as a construction supervisor, and works at Sembcorp Marine Admiralty Yard (60 Admiralty Road West). He resides at Westlite Woodlands Dormitory (2 Woodlands Sector 2).<br><br>He developed a runny nose on 16 April but did not report his symptom. On the same day, he was tested for COVID-19 as part of Rostered Routine Testing (RRT). His pooled test result came back positive for COVID-19 on 18 April, and he was immediately isolated and conveyed to the National Centre for Infectious Diseases in an ambulance. An individual test was done on 18 April, and his test result came back positive for COVID-19 infection the next day. His earlier tests from RRT – the last being on 9 April – were all negative for COVID-19 infection. His serology test result has come back positive but we have assessed that this is likely a current infection.<br><br>Case 62181 received his first dose of COVID-19 vaccine on 12 March, and the second dose on 13 April. This likely accounts for his positive serology test result as he has produced antibodies following vaccination. However as it typically takes a few weeks for an individual to build up immunity after completing vaccination, he was likely to have been infected before he was conferred protection after vaccination.<br><br>Epidemiological investigations are in progress. In the meantime, all the identified close contacts of the case, including his dormitory and workplace contacts, have been isolated and placed on quarantine, and will be tested at the start and end of their quarantine period so that we can detect asymptomatic cases. We will also conduct serological tests for the close contacts to determine if the case could have been infected by them.<br><br><strong>&nbsp;c)&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Imported cases: 13</strong><br><br>&nbsp;Amongst the 13 imported cases,<br><br>&nbsp;•&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;1 (Case 62183) is a Singaporean and 2 (Cases 62179 and 62180) are Singapore Permanent Residents who returned from India and the Philippines.<br>•&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;1 (Case 62191) is a Dependant’s Pass holder who arrived from Sri Lanka.<br>•&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;4 (Cases 62178, 62182, 62185 and 62187) are Work Pass holders who arrived from India and Malaysia.<br>•&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;4 are Work Permit holders who arrived from Bangladesh, India and Myanmar, of whom 1 (Case 62188) is a foreign domestic worker.<br>•&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;1 (Case 62177) is a Short-Term Visit Pass holder who arrived from India to visit her family member who is a Singaporean.<br><br>&nbsp;They had all already been placed on SHN upon arrival in Singapore and were tested while serving SHN.<br><br>&nbsp;4.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Please refer to the <a href=\"/docs/librariesprovider5/pressroom/press-releases/annex-20-apr.pdf?sfvrsn=95c2d3fe_2\" title=\"Annexes\">Annexes</a>&nbsp;and MOH’s daily Situation Report (<a href=\"http://www.moh.gov.sg/covid-19/situation-report\" title=\"\" class=\"\" target=\"\">www.moh.gov.sg/covid-19/situation-report</a>) for details.<br><br>&nbsp;<br><strong>Update on condition of confirmed cases</strong><br><br>5.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; 37 more cases of COVID-19 infection have been discharged from hospitals or community isolation facilities. In all, 60,540 have fully recovered from the infection and have been discharged from hospitals or community care facilities.<br><br>6.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; There are currently 74 confirmed cases who are still in hospital. Of these, most are stable or improving, and 1 is in critical condition in the intensive care unit. 221 are isolated and cared for at community facilities. These are those who have mild symptoms, or are clinically well but still test positive for COVID-19. 30 have passed away from complications due to COVID-19 infection.<br><br><strong>&nbsp;<br>MINISTRY OF HEALTH<br>20 APRIL 2021</strong><br><br><sup>[1]</sup>&nbsp;Case 62045 is a 41 year-old female Singapore Permanent Resident (PR) who works as an accountant at OM Universal Pte Ltd and was confirmed to have COVID-19 infection on 16 April.<br><br><sup>[2]</sup>&nbsp;Case 62143 is a 44 year-old male PR who is the spouse of Case 62045. He works as a manager at Spice Grill Restaurant and Rangoon Bar &amp; Bistro. He was confirmed to have COVID-19 infection on 18 April.</p><div id=\"ftn1\"></div><p>&nbsp;</p><p> </p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "1-new-case-of-locally-transmitted-covid-19-infection_20AprUpdate", "CurrentPageUrl": null}, {"Title": "Updates On Border Measures for Travellers From India, Hong Kong, United Kingdom and South Africa", "PublishedDate": "/Date(1618914900000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "20 Apr 2021", "Summary": "", "MainContent": "<p dir=\"ltr\"><span style=\"font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;The Multi-Ministry Taskforce regularly reviews Singapore’s border measures to manage the risk of importation from travellers and onward local transmission, taking into account the current situation in their source countries/ regions. <br><br>2.&nbsp; &nbsp; &nbsp; &nbsp;Given the worsening situation in India, and emergence of new virus variants, we will tighten border measures for travellers from India by reducing entry approvals for non-Singapore Citizens/ Permanent Residents, and subjecting all travellers arriving from India to an additional 7-day Stay Home Notice (SHN) at their place of residence, following their 14-day SHN at dedicated SHN facilities from <strong>22 April 2021, 2359 hours</strong>.<br><br>3.&nbsp; &nbsp; &nbsp; &nbsp;As the situation in Hong Kong has improved, we will reduce the SHN period from 14 days to 7 days which can be served at their place of residence if suitable. This will apply to travellers who have remained in Hong Kong in the last 14 consecutive days and who enter Singapore from <strong>22 April 2021, 2359 hours.<br><br></strong>4.&nbsp; <strong>&nbsp; &nbsp; &nbsp;</strong>From <strong>22 April 2021, 2359 hours</strong>, we will allow entry and transit for all Long-Term Pass holders and short-term visitors with recent travel history to the UK and South Africa. <br><br>5.&nbsp; &nbsp; &nbsp; &nbsp;To facilitate critical and essential official travel in a safe and calibrated manner, fully-vaccinated individuals on such official overseas travel to higher risk countries/ regions will be required to adhere to a controlled itinerary while overseas, and undergo a stringent testing regime and a 7-day self-isolation period upon their return.<br><br><strong>Further Precautions for Travellers from India<br><br></strong>6.&nbsp; &nbsp; &nbsp; &nbsp;Given the worsening situation in India, and emergence of new virus variants, we will tighten border measures for travellers with recent travel history to India by reducing entry approvals for non-Singapore Citizens/ Permanent Residents with immediate effect.<br><br>7.&nbsp; &nbsp; &nbsp; &nbsp;As a further precaution, from <strong>22 April 2021, 2359 hours</strong>, all travellers with recent travel history to India will be subjected to an additional 7-day SHN at their place of residence&nbsp;[1], following their 14-day SHN at dedicated SHN facilities. They will be tested at the end of their SHN (as per the current requirement), and again after they have completed their 7-day SHN period. Travellers who have yet to complete their 14-day SHN by 22 April 2021, 2359 hours, will also be subjected to the additional 7-day SHN period. Migrant workers arriving from India in the Construction, Marine and Process sectors will continue to be subjected to a 21-day SHN. These measures will minimise importation risks and protect public health. <br><br><strong>Travellers from Hong Kong to Serve a 7-Day SHN<br></strong><br>8.&nbsp; &nbsp; &nbsp; &nbsp;We had earlier announced that travellers from Hong Kong are required to serve a 14-day SHN at dedicated SHN facilities.<br><strong><br></strong>9.<strong>&nbsp; &nbsp; &nbsp; &nbsp;</strong>Given the improved local situation in Hong Kong, travellers arriving from Hong Kong from <strong>22 April 2021, 2359 hours</strong> will undergo a reduced 7-day SHN, which can be served at their place of residence if suitable [2]. They will be subjected to an on-arrival COVID-19 Polymerase Chain Reaction (PCR) test [3] and another PCR test before the end of their 7-day SHN.<br><br><strong>Lifting of Entry Restrictions for Travellers from the United Kingdom and South Africa<br><br></strong>10.<strong>&nbsp; &nbsp; &nbsp; &nbsp;</strong>We had earlier restricted entry and transit for all Long-Term Pass holders and short-term visitors with recent travel history to the UK and South Africa. This arose from concerns of a more contagious variant of the COVID-19 virus circulating in these countries/ regions. Singapore Citizens and Permanent Residents who were in these countries/ regions in the last 14 days prior to their entry have also been subjected to an additional 7-day SHN period at their place of residence, following their 14-day SHN at dedicated SHN facilities.<br><br>11.&nbsp; &nbsp; &nbsp; &nbsp;Our existing border control and domestic measures have been able to contain the risks of community spread from imported cases with such variants, which is now present in many countries beyond UK and South Africa. As such, from <strong>22 April 2021, 2359 hours</strong>:<br><br>a. Long-Term Pass holders and short-term visitors with recent travel history to the UK and South Africa within the last 14 days will now be allowed entry into Singapore, after obtaining the relevant entry approvals. <br><br>b. Arriving travellers will continue to serve a 14-day SHN at dedicated SHN facilities, with an additional 7-day SHN at their place of residence.<br><br>c. Travellers with recent travel history to the UK and South Africa will now be allowed to transit through Singapore on airlines approved to operate such transfers.<br><br>12.<strong>&nbsp; &nbsp; &nbsp; &nbsp;</strong>The Ministry of Health will continue to evaluate the data on the various strains of the COVID-19 virus as these emerge and review our border measures accordingly.<br><br><strong>Border Measures for Critical and Essential Official Travel [4]<br><br></strong>13.<strong><strong>&nbsp; &nbsp; &nbsp; &nbsp;</strong></strong>In spite of the COVID-19 pandemic, essential business and official travels still need to continue. While many meetings have been conducted over digital media, certain critical discussions need to be done face-to-face. <br><br>14.<strong>&nbsp; &nbsp; &nbsp; &nbsp;</strong>Official interactions are also crucial to safeguarding and advancing Singapore’s national interests. To facilitate critical and essential official travel in a safe manner, we will allow fully-vaccinated individuals who travel to higher-risk countries/ regions as part of an official delegation [5] to be subjected to a stringent testing and self-isolation regime from 22 April 2021, 2359 hours. <br><br>15.<strong>&nbsp; &nbsp; &nbsp; &nbsp;</strong>They must adhere to a strict event-by-event controlled itinerary while overseas, and undergo COVID-19 PCR tests on-arrival, and on Day 3, Day 7 and Day 14 of their return [6]. As an added precaution, these travellers will also be required to undergo a 7-day self-isolation period at home (or in a hotel) upon return. They may only leave their place of accommodation to commute to the PCR test site or to the workplace for essential work that cannot be done remotely.<br><br>16.<strong>&nbsp; &nbsp; &nbsp; &nbsp;</strong>Travellers who are not fully-vaccinated will continue to be subjected to prevailing border measures upon their return.<br><br><strong>Looking Ahead to Further Reopening<br><br></strong>17.&nbsp; &nbsp; &nbsp; &nbsp;As the global situation evolves, we will continue to adjust our border measures to manage the risk of importation and transmission to the community with changes updated on the <a href=\"http://safetravel.ica.gov.sg\" title=\"\" class=\"\" target=\"\"><span style=\"text-decoration: underline;\">SafeTravel</span></a>&nbsp;website. The Ministry of Health will also continue to review the data and evidence on any new viral strains and update the measures accordingly. <br><br><br></span><strong><span style=\"font-size: 16px;\">MINISTRY OF HEALTH<br>20 APRIL 2021</span><br><br><br><br></strong><span style=\"font-size: 11px;\">[1] Singapore Citizens, Permanent Residents and Long-Term Pass holders may serve their additional 7-day SHN at their place of residence, that they or their family members own or are sole tenants of, or in suitable accommodations such as a hotel.<strong> <br></strong>[2]&nbsp;Singapore Citizens, Permanent Residents and Long-Term Pass holders may serve their 7-day SHN at their place of residence, that they or their family members own or are sole tenants of, or in suitable accommodations such as a hotel.<br>[3] To expedite the COVID-19 PCR test at the airport, travellers are strongly encouraged to register and pre-pay for their on-arrival COVID-19 PCR test prior to departing for Singapore at <a href=\"https://safetravel.changiairport.com/\" title=\"\" class=\"\" target=\"\">https://safetravel.changiairport.com/</a>.<br>[4] “Critical and Essential Official travel” refers to travel at the request of the Singapore Government, that is important to safeguarding or advancing Singapore’s national interests, for the purposes of representing Singapore in an official capacity in important meetings, functions or international forums overseas.<br>[5] Travellers in official delegations will be informed by Government agencies of their eligibility for such travel arrangements prior to their departure from Singapore.<br>[6] This is similar to the testing requirements imposed for the Business Travel Pass scheme available for business travellers.</span></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "updates-on-border-measures-for-travellers-from-india-hong-kong-united-kingdom-and-south-africa", "CurrentPageUrl": null}, {"Title": "1 New Case of Locally Transmitted Covid-19 Infection", "PublishedDate": "/Date(1618903740000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "20 Apr 2021", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; As of 20 April 2021, 12pm, the Ministry of Health (MOH) has preliminarily confirmed 1 new case of locally transmitted COVID-19 infection. Based on our investigations so far, the case resides in a dormitory and there are no new cases in the community.</p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In addition, there are 13 imported cases, who had already been placed on Stay-Home Notice upon arrival in Singapore. In total, there are 14 new cases of COVID-19 infection in Singapore today.<br></p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We are still working through the details of the cases, and further updates will be shared via the MOH press release that will be issued tonight.<br></p><p><br><strong>MINISTRY OF HEALTH<br>20 APRIL 2021</strong></p><p>&nbsp;</p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "1-new-case-of-locally-transmitted-covid-19-infection_20Apr", "CurrentPageUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}