{"pressItemDictionary": {"Press Releases": [{"Title": "Seniors’ Mobility and Enabling Fund and Assistive Technology Fund to Provide Enhanced Support for Seniors and Persons With Disabilities", "PublishedDate": "/Date(1642415400000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "17 Jan 2022", "Summary": "", "MainContent": "&nbsp;&nbsp; &nbsp; &nbsp; The Seniors’ Mobility and Enabling Fund (SMF) and Assistive Technology Fund (ATF) will be enhanced to expand support for seniors and persons with disabilities, and improve client centricity by having each scheme support individuals throughout their lifetime without the need to apply to different schemes at various points. This was announced by Mr Masagos Zulkifli, Minister for Social and Family Development and Second Minister for Health, on the sidelines of a visit to TOUCHpoint@AMK433 in Ang Mo Kio today. The changes to both funds will take effect from 14 February 2022.&nbsp;<br><br><table border=\"1\" cellspacing=\"0\" cellpadding=\"0\"><tbody><tr><td width=\"601\" valign=\"top\"><p><strong>The key changes to the SMF and ATF are as follows:</strong></p><p>· Seniors will be able to receive subsidies for replacement, customised and specialised devices under the SMF, so that they only need to apply to this scheme. Today, seniors can only purchase one subsidised device from each of the eleven standard device categories.</p><p>· Seniors can also receive higher subsidies for selected device categories under the SMF.</p><p>· Persons with disabilities benefitting from ATF before age 60 can continue to apply to the scheme for all their device needs throughout their lifetime, as ATF will cover items previously covered only under the SMF.</p><p>· Both SMF and ATF will use the same subsidy framework and tiers, so that there is consistency for the beneficiaries of both schemes.</p></td></tr></tbody></table><br><strong>Expanded support for seniors under the SMF<br></strong><br>2.&nbsp; &nbsp; &nbsp;The SMF supports Singaporeans as they age by providing eligible seniors (aged 60 years and above) with means-tested subsidies to offset the cost of home healthcare items and assistive devices. Currently, the SMF subsidises only one device from each of the eleven device categories (details in <strong><a href=\"/docs/librariesprovider5/default-document-library/annex-abb2b4141ae6b4187b7d20c38e10f5bf6.pdf?sfvrsn=19400030_0\" title=\"Annex A\">Annex A</a></strong>).&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp;As devices undergo wear and tear in the normal course of use, from 14 February 2022, SMF can be used for replacements when the current device reaches the end of its lifespan. This will strengthen the support for seniors, as they can continue to make use of the devices they need to help them age well in the community, and will help them and their caregivers defray long-term care expenses. SMF will also be expanded to include customised devices (e.g. prostheses, orthoses) and other items that are currently not in its scope (e.g. specialised devices like ventilators, vision aids). With these enhancements, seniors will have their device needs met under a single scheme and need not apply to both SMF and ATF.&nbsp;&nbsp;<br><br>4.&nbsp; &nbsp; &nbsp;The changes to the SMF will include a new subsidy tier of 75% for those with Per Capita Household Income (PCHI) from $1,201 to $2,000. Those with PCHI at or below $1,200 will continue to receive 90% subsidy. With this change, higher support would be provided to seniors who need more assistance. Subsidies will be raised for selected device categories, to better reflect current market prices and lower out-of-pocket costs for seniors. The summary of changes to the SMF is in&nbsp;<strong>Annex A</strong>.<br><br><strong>Enhanced support for persons with disabilities under the ATF&nbsp;<br></strong><br>5.&nbsp; &nbsp; &nbsp;The ATF supports persons with disabilities by providing them with means-tested subsidies to offset the cost of the purchase, replacement, upgrade, or repair of assistive technology devices that they may require for early intervention, education, employment, therapy, rehabilitation, and independent living.&nbsp;&nbsp;<br><br>6.&nbsp; &nbsp; &nbsp;Currently, persons with disabilities may also apply to the SMF for devices that would support their ageing needs. From 14 February 2022, persons with disabilities who have tapped on the ATF before age 60 years will be supported by the ATF for all their device needs throughout their lifetime .&nbsp;<br><br>7.&nbsp; &nbsp; &nbsp;The ATF will be enhanced such that seniors with disabilities who are Singapore Citizens can claim for items that were previously covered only under the SMF (e.g. oxygen concentrator, suction pumps, spectacles). In addition, the subsidy tiers will be enhanced so that Singaporeans whose PCHI falls within $801 to $2,000 will be eligible for a higher level of subsidy, with the subsidy level similar to that of the SMF. This will make assistive devices more affordable for persons with disabilities and their caregivers. The summary of changes to the ATF is in&nbsp;<strong><a href=\"/docs/librariesprovider5/default-document-library/annex-b9ab3ccad9e634b969187816800eff65d.pdf?sfvrsn=85d08766_0\" title=\"Annex B\">Annex B</a></strong>.<br><br>8.&nbsp; &nbsp; &nbsp;Seniors and persons with disabilities can approach their care provider, including hospitals, community care organisations, and social service agencies, to enquire about their eligibility for these two schemes. They may also contact the Agency for Integrated Care (AIC) or SG Enable if they are not currently receiving support from any care provider .<br><br><br><strong>ISSUED BY<br>MINISTRY OF HEALTH<br>MINISTRY OF SOCIAL AND FAMILY DEVELOPMENT<br>17 JANUARY 2022<br><br></strong><sup>1</sup>&nbsp;Seniors who did not tap on ATF before age 60 will be supported by SMF throughout their lifetime.<br><sup>2</sup>&nbsp;For enquiries on the SMF, please contact AIC at 1800 650 6060, or email&nbsp;<a href=\"mailto:enquiries@aic.sg\" title=\"\" class=\"\" target=\"\">enquiries@aic.sg</a>.&nbsp;<br>For enquiries on the ATF, please contact SG Enable at 1800 8585 885, or email&nbsp;<a href=\"mailto:ATF@sgenable.sg\" title=\"\" target=\"\">ATF@sgenable.sg</a>.&nbsp;&nbsp;<strong><br></strong><div><br></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "seniors-mobility-and-enabling-fund-and-assistive-technology-fund-to-provide-enhanced-support-for-seniors-and-persons-with-disabilities", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}