{"pressItemDictionary": {"Press Releases": [{"Title": "Honorary Citizen Award Conferred On Professor K Ranga Rama Krishnan and Professor Duane J. Gubler", "PublishedDate": "/Date(1654769700000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "09 Jun 2022", "Summary": "", "MainContent": "&nbsp; &nbsp; &nbsp; &nbsp; Singapore has honoured Professor K Ranga Rama Krishnan, Chairman of the National Medical Research Council (NMRC), and Professor Duane J. Gubler, Emeritus Professor at Duke-NUS Medical School, with the Honorary Citizen Award for their valuable contributions to Singapore. President Halimah Yacob conferred the Award on Professor Krishnan and Professor Gubler at a ceremony held at the Istana today.<br><br>2.&nbsp; &nbsp; &nbsp;The Award is the highest form of recognition bestowed by the Singapore Government for outstanding contributions by individuals to the country’s growth and development. It is conferred on those who have made a significant impact in the areas of business, science and technology, information communications, education, health, arts and culture, sports, tourism, community services or security. Please refer to <a href=\"/docs/librariesprovider5/default-document-library/annex-a8d97e745b06543ff9ba77b949d46f7da.pdf?sfvrsn=46f2a460_0\" title=\"Annex A\">Annex A</a>&nbsp;for more information on the Honorary Citizen Award, and <a href=\"/docs/librariesprovider5/default-document-library/annex-b2fd5591f985e40ce9e563df8d3633649.pdf?sfvrsn=8a8b1998_0\" title=\"Annex B\">Annex B</a>&nbsp;for the biographies of the awardees.<br><br><strong>Professor K Ranga Rama Krishnan<br></strong><br>3.&nbsp; &nbsp; &nbsp;Professor Ranga Krishnan is Chairman of the NMRC of the Ministry of Health (MOH), and Chief Executive Officer of the Rush University System for Health in the United States of America.&nbsp;<br><br>4.&nbsp; &nbsp; &nbsp;As the longest serving Chairman of the NMRC Board, Professor Krishnan guided NMRC to formulate and implement strategies to promote excellence in health and biomedical sciences, leading to impactful outcomes for Singapore. In particular, he strengthened NMRC’s support of translational research in key areas such as ageing and health services research, and also helped develop innovation and commercialisation of research. This included the setting up of the National Health Innovation Centre Singapore in 2014, of which he was the founding Chairman.&nbsp;&nbsp;<br><br>5.&nbsp; &nbsp; &nbsp;As Dean of Duke-NUS from 2008 to 2015, he was instrumental in laying the foundations for the school and the broader SingHealth Duke-NUS Academic Medical Centre. He also served as Member of the SingHealth Board from 2013 to 2022, helping to steer the academic medicine partnership between SingHealth and Duke-NUS to become a leader in medical research and education in Singapore and beyond.<br><br>6.&nbsp; &nbsp; &nbsp;Professor Krishnan was Chairman of the Singapore Clinical Research Institute and Board Member of the Health Sciences Authority, both of which benefitted greatly from his extensive experience and expertise in clinical trials and regulatory science. His influence also led to the establishment of the Centre of Regulatory Excellence at Duke-NUS, which is the first dedicated centre in Asia targeted to the needs of national health regulators and other stakeholders.&nbsp;<br><br>7.&nbsp; &nbsp; &nbsp;Professor Krishnan also served on various national research oversight committees, including the Human Health and Potential Executive Committee and the A*STAR Biomedical Research Council. In these roles, he provided guidance and critical insights towards the formulation of national research and biomedical sciences strategies.<br><br>8.&nbsp; &nbsp; &nbsp;Professor Krishnan said, “I am humbled and deeply grateful to receive the Honorary Citizen Award and to join a very respected group of recipients. Singapore gave me an unique, once in a lifetime opportunity to be part of building a new medical school, and a truly outstanding academic health system. I am thankful for that opportunity and for the chance to participate in the transformation of Singapore’s health system and biotech sector to be a true global leader. I would like to express my gratitude to the many individuals, through these many years from A*STAR, Duke-NUS, MOH, Ministry of Education, Ministry of Trade and Industry, National Research Foundation, National University of Singapore, and SingHealth, too many to enumerate, whose support and friendship made it all possible.”<br><br><strong>Professor Duane J. Gubler&nbsp;<br></strong><br>9.&nbsp; &nbsp; &nbsp;Professor Duane J. Gubler is an Emeritus Professor and Founding Director of the Emerging Infectious Diseases (EID) Programme at Duke-NUS Medical School. He is also the Chair of National Environment Agency (NEA)’s Dengue Expert Advisory Panel, which guides NEA’s research team in developing and piloting the novel <em>Wolbachia</em> technology.<br><br>10.&nbsp; &nbsp; Singapore’s partnership with Professor Gubler dates back to 1977, when he attended a dengue meeting held here by the World Health Organization. Since then, he has played a pivotal role in shaping Singapore’s public health strategies, serving on numerous expert advisory panels for MOH and NEA. He advocated fostering strong political will to control infectious diseases, and proposed a government-community partnership for dengue control, emphasising public education, removal of stagnant water, and robust surveillance. His advice forms the foundation of Singapore’s dengue control programme today. Beyond dengue, Professor Gubler led the establishment of the EID programme at Duke-NUS and institutionalised the lessons learned from Singapore’s experience with SARS in 2003 and H1N1 influenza in 2009. Thanks to this effort, Singapore’s COVID-19 response has been lauded by many around the world for its high level of readiness and efficiency.&nbsp;&nbsp;<br><br>11.&nbsp; &nbsp; &nbsp;Many young scientists in Singapore have also been inspired by Professor Gubler and benefited from his guidance. At Duke-NUS, he was selfless in sharing his wealth of knowledge in research, especially to early career scientists, helping to shape and nurture the local research landscape in the field of virology and medical entomology. Professor Gubler’s deep and generously offered insights also strengthened the scientific capabilities of NEA’s Environmental Health Institute during its formative years. He continues to contribute to Singapore as the Chair of NEA’s Dengue Expert Advisory Panel. The Panel has guided NEA’s research team in developing and piloting the novel <em>Wolbachia</em> technology, which has since successfully reduced dengue risk in the study sites.<br><br>12.&nbsp; &nbsp; &nbsp;Professor Gubler said, “Words cannot convey how humbled I am to receive Honorary Citizenship from a great country like Singapore. I am deeply greatly honoured to receive this award. My first visit to Singapore was over 50 years ago, before shopping centres and high-rise condos and hotels dotted the skyline. I have watched Singapore evolve into a global public health and economic leader, becoming a model for other countries to emulate. I am proud to have been a part of this evolution, but any contribution I may have made must be attributed to the many Singaporean colleagues and friends whom I have worked with over the years. I humbly thank them for making this award possible and will do my best to live up to the honour conferred on me today.”<br><br><br><strong>MINISTRY OF HEALTH&nbsp;<br>NATIONAL ENVIRONMENT AGENCY<br>9 JUNE 2022</strong><br><div><br></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "honorary-citizen-award-conferred-on-professor-k-ranga-rama-krishnan-and-professor-duane-j.-gubler", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}