{"pressItemDictionary": {"Press Releases": [{"Title": "Further Rationalisation of Smms, Boosting Vaccinations, and Updates to Covid-19 Subsidies", "PublishedDate": "/Date(1654855200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "10 Jun 2022", "Summary": "", "MainContent": "<p>Our local epidemic situation has been stable over the past month, despite having stood down most of our Safe Management Measures (SMMs) and the opening up of our borders. The daily average local case count is around 3,000 per day, the average number of COVID-19 related hospitalisation has stayed lower than 300 (compared to a peak of around 1,700 during the Omicron wave), and COVID-19 related Intensive Care Unit (ICU) patients are in the single digits.</p><p>2. However, we must continue to stay vigilant against the risk of a new wave of cases, as immunity in our population wanes in the coming months and new variants may emerge. As such, we will keep the requirement for indoor masking. We also strongly urge eligible individuals who have not received their primary series and booster vaccinations to do so quickly, so as to protect themselves from the risk of severe illness should a new infection wave emerge in the next couple of months. As we progressively return to normalcy and learn to live with COVID-19, we will also begin to scale back the pandemic subsidy provisions for COVID-19-related treatments.<br></p><p><strong>Updates on Community SMMs</strong></p><p><u>Mask-Wearing</u></p><p>3. Since 26 April 2022, we have removed most of the SMMs 1-5, except for the indoor masking requirement which will be retained as a key line of defence against community transmission. (Refer to <u><a href=\"/docs/librariesprovider5/default-document-library/annex-a7e5179456a7c435192a9e81b39644d00.pdf?sfvrsn=fc2d3a14_0\" title=\"Annex A\">Annex A</a></u> for overview of SMMs 1-5.)</p><p><u>Nightlife Establishments</u></p><p>4. From <strong>14 June 2022</strong>, nightlife establishments with dancing among patrons will no longer be subjected to a capacity limit, and patrons will not need to obtain a negative Antigen Rapid Test (ART) result to enter the venue. This will rationalise the rules for night spots with other social settings. However, Vaccination-Differentiated SMMs (VDS) will continue to apply, and operators will still be required to conduct VDS checks to ensure that only fully-vaccinated persons enter these settings. Random checks may be conducted by enforcement officers to ensure that operators comply with the requirement for VDS checks.<br></p><p><u>Transition from Exit Pass Requirement to New Popular Places Pass for Migrant Workers Residing in Dormitories</u></p><p>5. From <strong>24 June 2022</strong>, migrant workers (MWs) residing in dormitories will no longer need an exit pass to visit community areas. To manage crowding at popular places, we will introduce a new mechanism to manage the high footfall at four locations – Chinatown, Geylang Serai, Jurong East and Little India. If an MW wishes to visit one of these popular locations during Sundays and public holidays, he will have to apply for a visit pass. Up to 80,000 such passes will be made available in total per Sunday or public holiday. For a start there will be 30,000 passes for Little India, 20,000 for Jurong East, and 15,000 for each of the remaining two locations. No passes will be needed if MWs are visiting community areas including popular places on weekdays, Saturdays or non-public holidays, or if they are visiting other locations in Singapore on Sundays and public holidays.</p><p>&nbsp;</p><p><strong>Updates on COVID-19 Vaccination<br></strong></p><p>6. Our vaccination coverage continues to be high. 95.9% and 91.7% of our eligible population have completed their primary series and first booster vaccinations respectively. As for the second booster dose, as of 8 June 2022, 49.3% of persons aged 80 and above who are eligible have either booked an appointment or already received them. As we take further strides towards normalcy and ease our community SMMs, vaccinations and boosters become even more critical to protect ourselves and our loved ones.</p><p>7. We strongly urge the remaining eligible individuals, particularly our seniors who are more vulnerable to severe disease if they were to become infected by COVID-19, to come forth for their vaccination and boosters, as soon as possible. The Ministry of Health (MOH) will be mounting further efforts to increase our booster rates, and details will be announced shortly.</p><p><u>Facilitating Second Boosters for Medically Vulnerable persons aged 18 and above</u></p><p>8. Medically vulnerable persons are one of the groups of persons recommended by the Expert Committee on COVID-19 Vaccination (EC19V) to receive a second booster dose.</p><p>9. From <strong>1 July 2022</strong>, medically vulnerable persons with specific health conditions<a href=\"#_ftn1\" name=\"_ftnref1\" title=\"\">[1]</a>, may self-declare their health conditions to receive their second booster by walking into any Vaccination Centre, Public Health Preparedness Clinics (PHPCs) and polyclinics that offer vaccinations. To facilitate their vaccination, they will no longer require a doctor’s referral to receive their second booster. Other medically vulnerable persons will continue to be able to receive the second booster by providing a referral memo from their treating doctors. More details on the template of the self-declaration form will be announced in the coming weeks via MOH’s website.</p><p><u>Allowing persons aged 50 to 59 to receive Second Booster</u></p><p>10.&nbsp; We previously announced on 22 April 2022 that persons aged 60 to 79 years will be allowed to take their second booster about five months after receiving their first booster, if they wish to. Since then, EC19V has assessed that persons aged 50 to 59 years who wish to take their second booster may also do so at about five months after their first booster. This is in view of data indicating that the risk of severe COVID-19 increases in the age group of 50 to 59 as well. This is also around the age when chronic diseases start to set in. Hence from <strong>10 June 2022</strong>, persons aged 50 years and above who wish to receive their second booster may do so by walking into any Vaccination Centre offering mRNA vaccines.</p><p><u>Recommended interval between primary series vaccination doses</u><br></p><p>11. The current minimum interval between the first two doses will continue to be 21 days for the Pfizer-BioNTech/Comirnaty and Novavax/Nuvaxovid vaccines and 28 days for Moderna/Spikevax and Sinovac-CoronaVac vaccines. This helped to expedite early protection against COVID-19 during the acute phase of the pandemic. Recent international data has shown that a wider gap of eight weeks between the initial two doses of COVID-19 primary series vaccinations may provide better vaccine protection for individuals. We encourage individuals who are taking their primary series to book their first two doses eight weeks apart. But those who need to complete their primary series sooner, particularly those who are at risk of exposure to COVID-19 or more susceptible to severe disease, may opt for a shorter interval between the two doses as long as it is not below the minimum interval.</p><p><u>Private Vaccination Programme Extended to All</u><br></p><p>12. We previously announced that Short-Term Visitors to Singapore aged 18 years and above could receive paid Moderna/Spikevax vaccinations and boosters under the Private Vaccination Programme (PVP). We will now extend the PVP to all individuals in Singapore who are aged 18 and above, including local residents. This will allow individuals who wish to take additional vaccine doses, but who do not qualify under the National Vaccination Programme, to do so based on a doctor’s assessment. Please refer to <a href=\"http://www.vaccine.gov.sg\" title=\"\" class=\"\" target=\"\">vaccine.gov.sg</a>&nbsp;for the updated list of PVP providers. As this is a private arrangement, the vaccinations under the PVP will be at the individual’s own cost.</p><p><strong>Updates on COVID-19 Financing Schemes</strong></p><p>13. In Singapore, healthcare support in the form of S+3Ms (Government Subsidies, MediSave, MediShield Life and MediFund) are extended broadly to all Singaporeans. Notwithstanding, as part of our pandemic response, COVID-19 treatments have been provided at a very low fee or free of charge, going beyond the regular S+3Ms. As life reverts to normal and we increasingly live with COVID-19 as an endemic disease, we will need to progressively scale back the pandemic subsidy policy, and revert to the S+3Ms healthcare financing frameworks.</p><p><u><br>Reverting to Pre-COVID-19 Subsidy Policy for Respiratory Infection Treatment at Public Health Preparedness Clinics</u></p><p>14. Since February 2020, more than 1,000 PHPCs have been activated to provide subsidised care for patients with respiratory infection symptoms, whether due to COVID-19 or not. Singapore residents pay a flat subsidised rate of $10 and seniors from the Pioneer Generation and Merdeka Generation pay a lower rate of $5. From&nbsp;<strong>1 July 2022, 0001 hours</strong>, subsidies at PHPCs and polyclinics for the treatment of respiratory infections will revert to pre-COVID-19 levels. The $10/$5 fee will no longer apply, but Singaporeans will continue to enjoy prevailing subsidies under the Community Health Assist Scheme (CHAS) at CHAS General Practitioner (GP) clinics.</p><p><br>15. The above does not affect ART and Polymerase Chain Reaction (PCR) tests, where PHPCs and polyclinics will continue to provide government-funded swabs to eligible symptomatic individuals at no charge.<br></p><p><u><br>Cessation of Government-Subsidised Telemedicine care for Individuals on Protocol 2</u><br></p><p>16. Currently, individuals under Protocol 2, i.e. mildly symptomatic, low risk, and recovering from home, and who requested for telemedicine care enjoys full subsidy. In line with the above change for PHPCs, from <strong>1 July 2022, 0001 hours</strong>, we will revert the subsidy policy to pre-COVID-19 arrangements. Full subsidy for the telemedicine will cease, but Singaporeans will continue to enjoy CHAS subsidies if they visit a CHAS GP clinic for treatment. Individuals under Protocol 1, i.e. those at high medical risk or with severe symptoms, but are discharged home for recovery and under telemedicine surveillance, will continue to enjoy fully subsidised telemedicine care.<br></p><p>&nbsp;</p><p><u>Updates to COVID-19 Treatment Coverage in Hospitals</u></p><p>17. Currently, Singapore Citizens/ Permanent Residents /Long-Term Pass Holders (SC/PR/LTPHs) who seek emergency treatment for COVID-19 in Emergency Departments (ED) of public acute hospitals do not have to pay any ED charges if they are fully vaccinated, or certified to be medically ineligible for vaccination. From <strong>1 July 2022, 0001 hours,</strong> this will no longer apply to those who do not require admission after visiting the ED. Those who are assessed to require hospital or COVID-19 Treatment Facility (CTF) admission for COVID-19 treatment will continue to have their ED, inpatient and/or CTF bills fully subsidised by the government, if they are fully vaccinated or certified to be medically ineligible for vaccination. This will help MOH manage the demand for ED services, to those who need them.<br></p><p><strong>Towards COVID-19 Resilience</strong></p><p>18. Our daily caseloads have remained under control even with the significant easing of our community SMMs and border measures. However, new variants will continue to emerge, and we must stay vigilant. As part of ongoing COVID-19 surveillance, the Ministry of Health will continue to monitor for virus strains introduced into and circulating in the community by requiring some infected individuals to take an additional government-funded PCR swab for genomic sequencing. We urge everyone to still take the necessary precautions and remain socially responsible to protect themselves and others, even as we move towards normalcy and living safely with COVID-19.<br></p><p><strong>MINISTRY OF HEALTH</strong></p><div><p><strong>10</strong><strong> JUNE 2022</strong></p></div><div><br clear=\"all\"><hr align=\"left\" size=\"1\" width=\"33%\"><div id=\"ftn1\"><p><a href=\"#_ftnref1\" name=\"_ftn1\" title=\"\">[1]</a> Please refer to the Annex in the press release on EC19V’s recommendations dated 10 June 2022. These include medical conditions include chronic diseases of the heart, lungs, kidneys, liver and other organ systems.</p></div></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "further-rationalisation-of-smms-boosting-vaccinations-and-updates-to-covid-19-subsidies", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}, {"Title": "Groups Eligible for Second Booster and Dosing Interval for Covid-19 Primary Vaccination Series", "PublishedDate": "/Date(1654855200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "10 Jun 2022", "Summary": "", "MainContent": "<p>1.&nbsp; The Expert Committee on COVID-19 Vaccination (EC19V) has made the following updates to the vaccination recommendations:</p><p>a.&nbsp; &nbsp;All persons aged 50 years and older may now be offered the second booster;</p><p>b.&nbsp;&nbsp;&nbsp; Persons aged 18 years and above who are medically vulnerable to severe COVID-19 are no longer require a doctor’s referral to receive the second booster; and</p><p>c.&nbsp;&nbsp;&nbsp;&nbsp; The recommended interval between the first two doses of a primary vaccination series will now be extended to eight weeks, but the minimum allowable interval remains unchanged especially for persons who need to achieve protection more quickly due to their risk of exposure or susceptibility to severe disease.</p><p>&nbsp;</p><p><strong>Updates on COVID-19 Second Booster Vaccination</strong></p><p>2.&nbsp;&nbsp;The EC19V had previously recommended for the following groups of persons to receive a second COVID-19 booster around five months after their first booster:</p><p>a.&nbsp;&nbsp;&nbsp; All persons aged 80 years and above;</p><p>b.&nbsp;&nbsp;&nbsp; Persons living in aged care facilities; and</p><p>c.&nbsp;&nbsp;&nbsp;&nbsp; Medically vulnerable persons at higher risk of severe COVID-19.<br></p><p>3.&nbsp; These groups are most at risk of severe disease. Vaccine protection against severe disease from three doses is also lower in persons aged 80 years and older, and a second booster is important to achieve a high level of protection. As such, the EC19V strongly urges persons in these recommended groups to receive the second booster vaccination as soon as they are eligible.</p><p>4.&nbsp; Data has shown that the risk of severe COVID-19 can increase in persons aged 50 years and older. As such, <strong>the second booster can now be offered to all persons aged 50 years and older to further increase their protection. </strong>This is an update from the previous position of the second booster being offered to all persons aged 60 years and older. All persons aged 80 years and older are strongly recommended to get their second booster, as previously recommended. The second booster should be given around five months after the first booster.&nbsp;</p><p>5.&nbsp; To facilitate uptake of the second booster, EC19V further recommends that <strong>persons aged 18 years and older, who have health conditions that make them medically vulnerable to severe COVID-19, can receive the second booster</strong> <strong>without the need for a physician’s referral</strong>. They can self-declare their health condition to be eligible for the second booster (please refer to the <u><a href=\"/docs/librariesprovider5/default-document-library/annexf3729d8eec3c493787e7f09240b98909.pdf?sfvrsn=ef4ed4b0_0\" title=\"Annex\">Annex</a></u> for the list of health conditions). This is an update from the previous arrangement where such persons were required to provide a doctor’s referral to receive the second booster. The list of health conditions in the <u><a href=\"/docs/librariesprovider5/default-document-library/annexbbfb9972ea284baa83b8b329cab7ff42.pdf?sfvrsn=e2d3d29a_0\" title=\"Annex\">Annex</a></u> covers medical conditions of concern, but is not exhaustive. Persons with medical conditions not listed in the <u><a href=\"/docs/librariesprovider5/default-document-library/annexc8f87e1f8782477d9feb705ca7b5403b.pdf?sfvrsn=3f7a3959_0\" title=\"Annex\">Annex</a></u>, or who are not sure if they are included in the listed groups should consult their doctor.&nbsp; They may then proceed to receive the second booster based on their doctor’s advice if the doctor provides an appropriate referral.</p><p><em>&nbsp;</em></p><p><strong>Extending the Recommended Primary Vaccination Series Dosing Interval</strong></p><p>6.&nbsp;&nbsp;The recommended dosing intervals between the first two doses of a COVID-19 primary vaccination series had been set at 21 to 28 days depending on the vaccine used. This was based on the vaccination protocols used in their respective vaccine trials, and also due to a need to expedite protection against COVID-19 for a vaccine-naive population during the acute phase of the COVID-19 pandemic.</p><p>7.&nbsp; There is now more evidence that an extended interval between the first two doses of the primary vaccination series may confer better immune response and vaccine effectiveness. EC19V is thus now recommending for the dosing interval to be extended to eight weeks between the first two doses of the primary vaccination series for all COVID-19 vaccines<a href=\"#_ftn1\" name=\"_ftnref1\" title=\"\"><sup><sup>[1]</sup></sup></a><sup> </sup>available under the National Vaccination Programme, for those who have yet to be vaccinated with their primary vaccination series.</p><p>8.&nbsp;Individuals, particularly those who are at risk of exposure to COVID-19 or more susceptible to severe disease, may still receive the doses earlier than the eight-week interval but not less than the previously established minimum intervals<a href=\"#_ftn2\" name=\"_ftnref2\" title=\"\"><sup><sup>[2]</sup></sup></a>.</p><p>9.&nbsp;All eligible individuals are strongly encouraged to complete the COVID-19 primary vaccination series and booster vaccinations recommended for them, if they have not done so already.</p><p><strong>&nbsp;</strong></p><p><strong>EXPERT COMMITTEE ON COVID-19 VACCINATION</strong></p><p><strong>10 JUNE 2022</strong></p><div><br clear=\"all\"><hr align=\"left\" size=\"1\" width=\"33%\"><div id=\"ftn1\"><p><a href=\"#_ftnref1\" name=\"_ftn1\" title=\"\">[1]</a> Vaccines available under the National Vaccination Programme are: Pfizer-BionTech/Comirnaty, Moderna/Spikevax, Novavax/Nuvaxovid and Sinovac-Coronavac.</p></div><div id=\"ftn2\"><p><a href=\"#_ftnref2\" name=\"_ftn2\" title=\"\">[2]</a>The minimum intervals that the first two doses of the vaccines should be taken are: 21 days for Pfizer-BioNTech/Comirnaty and Novavax/Nuvaxovid, 28 days for Moderna/Spikevax and Sinovac-CoronaVac.</p></div></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "groups-eligible-for-second-booster-and-dosing-interval-for-covid-19-primary-vaccination-series", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}, {"Title": "Appointment of Mr Tay Choon Hong As Ceo of Health Promotion Board", "PublishedDate": "/Date(1654833600000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "10 Jun 2022", "Summary": "", "MainContent": "Mr Tay Choon Hong will be appointed as Chief Executive Officer (CEO) of the Health Promotion Board (HPB) from 1 July 2022. He will take over from Mr Koh Peng Keng, the Interim CEO of HPB, who will continue in his role as Chief Operating Officer. Mr Tay has been serving as a board member of HPB since 1 April 2018.<br><br>2. Mr Tay Choon Hong is currently Senior Director (Youth) at the Ministry of Culture, Community and Youth (MCCY) and Deputy Chief Executive of the National Youth Council (NYC).<br><br>3. As Senior Director (Youth), MCCY, he drove major workstreams under the SG Youth Action Plan to implement national civic participation programmes, and stewarded youth-related whole-of-government efforts along the main domains of jobs and future of work, and environmental sustainability. He co-headed the communication, partnerships and engagement track of the inter-agency taskforce on mental health and wellbeing. Mr Tay also co-led the planning and execution of Conversations on Women’s Development, partnering various agencies and sector organisations and reaching out to 6,000 Singaporeans on their views and insights, which informed the policy reviews and recommendations of the White Paper on Singapore Women’s Development.<br><br>4. In his role as Deputy Chief Executive, NYC, Mr Tay led the conceptualisation of the Youth Action Challenge, a developmental programme for youths to turn their ideas into concrete projects for positive societal change. He also led the Somerset Belt Masterplan project which included the formation of governance structures and partnership communities, development and implementation of Realise Your Somerset Project and Participatory Budgeting initiatives, as well as formulated further plans to guide upcoming placemaking and infrastructure works.<br><br>5. Prior to his appointments in MCCY and NYC, Mr Tay had held various key positions, including Director (Transformation Office) and Director (Moments of Life - Families) at the Public Service Division, as well as Director (Policy &amp; Planning) and Director (Marriage &amp; Parenthood Policy) at the National Population and Talent Division, Prime Minister’s Office. Mr Tay graduated with a Bachelor of Science in Economics and Bachelor of Science in Electrical and Computer Engineering from Carnegie Mellon University, as well as a Master of Science in Management from Stanford University.<br><br>6. The Ministry of Health and Health Promotion Board wish to extend a warm welcome to Mr Tay Choon Hong as the new CEO of HPB.<br><br><br><strong>MINISTRY OF HEALTH<br>HEALTH PROMOTION BOARD</strong>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "appointment-of-mr-tay-choon-hong-as-ceo-of-health-promotion-board", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}