{"pressItemDictionary": {"Press Releases": [{"Title": "Termination of Chas Participation and Revocation of Medisave Accreditation of the Cliniq; Revocation of Medisave Accreditation of Dr Muhammad Iqbal and Myclnq Medical", "PublishedDate": "/Date(1657782000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "14 Jul 2022", "Summary": "", "MainContent": "<p style=\"text-align: justify;\"><span style=\"font-size: 16px; font-family: Arial;\">1.&nbsp; &nbsp; &nbsp;The Ministry of Health (MOH) has, on 14 July 2022, served the following notices, which will take effect from 29 July 2022:</span></p><p style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 16px;\">&nbsp; &nbsp; &nbsp;a)&nbsp; &nbsp; &nbsp;Notice of termination of Community Health Assist Scheme (CHAS) participation and notice of revocation of MediSave accreditation of The Cliniq (590A Montreal Drive #01-23);</span><br></p><p style=\"text-align: justify;\"><span style=\"font-size: 16px; font-family: Arial;\">&nbsp; &nbsp; &nbsp;b)&nbsp; &nbsp; &nbsp;Notice of revocation of MediSave accreditation of MYCLNQ Medical (554 Ang Mo Kio Avenue 10 #01-2048); and</span></p><p style=\"text-align: justify;\"><span style=\"font-size: 16px; font-family: Arial;\">&nbsp; &nbsp; &nbsp;c)&nbsp; &nbsp; &nbsp;Notice of revocation of the MediSave accreditation of Dr Muhammad Iqbal Bin Abdullah.</span></p><p style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 16px;\">2.&nbsp; &nbsp; &nbsp;Audits by MOH on the CHAS claims made by The Cliniq have revealed severe non-compliances, such as claims for patient visits with no relevant supporting documentation. These claims were submitted by Dr Iqbal, who is also the clinic owner. As The Cliniq and Dr Iqbal are in breach of the terms and conditions of CHAS, MOH has revoked the MediSave accreditation of The Cliniq and Dr Iqbal. As Dr Iqbal is the clinic manager of MYCLNQ Medical, MOH has also revoked the MediSave accreditation of MYCLNQ Medical pursuant to the Terms and Conditions of Approval under the MediSave Scheme and MediShield Life Scheme. Given the severity of the alleged offences, MOH has also referred the case to the Police for further investigation.</span><br></p><p style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 16px;\">3.&nbsp; &nbsp; &nbsp;With the revocation, Dr Iqbal will not be able to make MediSave claims on behalf of his patients for treatments and surgical procedures. Once terminated from CHAS participation and revoked of MediSave accreditation, The Cliniq cannot make claims on behalf of patients for either scheme. MYCLNQ Medical cannot make claims on behalf of patients for MediSave claims. Affected patients may wish to visit other nearby CHAS-accredited or MediSave-accredited clinics instead.</span><br></p><p style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 16px;\">4.&nbsp; &nbsp; &nbsp;MOH closely monitors clinics’ CHAS and MediSave claims, and the majority of clinics and practitioners comply with our guidelines. MOH takes a serious view of fraudulent claims, and will not hesitate to take action where non-compliance is uncovered. We also remind healthcare professionals to uphold a high standard of professionalism, and adhere to their Ethical Code and Ethical Guidelines.</span><br></p><p style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 16px;\">5.&nbsp; &nbsp; &nbsp;We encourage patients to actively engage their doctors and dentists if they have any queries on their treatment, or the charges imposed on their claims. Members of public who come across any suspicious or unusual CHAS/MediSave claims made on their behalf (such as claims made on dates which they did not visit the clinic or items indicated in the invoice which were not prescribed/performed at the visit) can contact MOH (1800-255-4122) or send their feedback to </span><a href=\"mailto:MOH_QSM@moh.gov.sg\" style=\"font-family: Arial; font-size: 16px;\">MOH_QSM@moh.gov.sg</a><span style=\"font-family: Arial; font-size: 16px;\">.</span><br></p><p style=\"text-align: justify;\"><strong style=\"font-family: Arial; font-size: 16px;\">MINISTRY OF HEALTH</strong><br></p><p style=\"text-align: justify;\"><span style=\"font-size: 16px; font-family: Arial;\"><strong>14 JULY 2022</strong></span></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "termination-of-chas-participation-and-revocation-of-medisave-accreditation-of-the-cliniq-revocation-of-medisave-accreditation-of-dr-muhammad-iqbal-and-myclnq-medical", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}