{"pressItemDictionary": {"Press Releases": [{"Title": "Extension of Safe Management Measures for In-person Visits to Hospitals and Residential Care Homes", "PublishedDate": "/Date(1659430800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "02 Aug 2022", "Summary": "", "MainContent": "<p>The Ministry of Health (MOH) will extend the safe management measures for visitors at all hospital wards<sup>1</sup>&nbsp;and residential care homes (‘Homes’) for another four weeks until 31 August 2022 (inclusive).</p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; While the daily number of local COVID-19 cases has fallen gradually over the past week, our hospitals continue to face a high volume of both COVID-19 and non-COVID-19 patients. Homes have had to manage an increased number of COVID-positive residents on-site. As such, the adjusted visitor safe management measures which have been in place since 7 July 2022 will remain in effect until 31 August 2022.<br></p><p><strong>In-person Visits at Hospitals</strong><br></p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; All patients will be allowed two pre-designated visitors for the duration of their admission, and only one visitor may be allowed at the bedside at any one time. Critically ill patients will be allowed up to five pre-designated visitors, and two visitors may be allowed at the bedside at any one point in time.<br></p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The visit duration will be limited to 30 minutes. In exceptional situations, such as for critically ill patients, paediatric patients, birthing or post-partum mothers, and for patients requiring additional care support<sup>2</sup>, visitors may be allowed to stay beyond 30 minutes on a case-by-case basis at the hospitals’ discretion.<br></p><p>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Visitors are reminded not to eat or drink in the hospital wards, or use the toilets designated for patients in the wards. They should also avoid sitting on patients’ beds.&nbsp;&nbsp;<br></p><p><strong>In-person Visits at Homes</strong><br></p><p>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;All residents will be allowed up to four pre-designated visitors, and only one visitor may visit at any one time with the visit duration limited to 30 minutes. Visitors should continue to schedule the visits with the Home ahead of time. Visitors should strictly adhere to prevailing safe management measures within the Homes. This includes remaining within the designated visitor areas, outside of the wards.<br></p><p>7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We also seek the understanding of visitors that visits may have to be suspended if a Home is managing active COVID-19 cases. Next-of-kin of residents may approach the Home for further details.<br></p><p>8.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; All visitors to hospitals and Homes are to ensure that they are well and are strongly encouraged to test themselves with an antigen rapid test (ART) on the day of the visit to their loved ones. They must don face masks with good filtration capability at all times. These include surgical masks and reusable masks that are made of two layers of fabric. Hospitals and Homes have the discretion to impose stricter visitor limits or testing requirements for visitors of vulnerable or unvaccinated patients.<br></p><p>9.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; MOH will review and calibrate these measures regularly in line with the evolving situation. We seek the understanding and cooperation of patients, residents, their family members and loved ones as we work to reduce the risk of COVID-19 transmission in our healthcare institutions.<br></p><div><div id=\"ftn1\"><p>[1] Including public acute hospitals, community hospitals and private hospitals.</p></div><div id=\"ftn2\"><p>[2] Patients who require additional care support, such as patients who have mental incapacities, or family members who are undergoing caregiver training to better care for their loved ones after hospital discharge.</p></div></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "extension-of-safe-management-measures-for-in-person-visits-to-hospitals-and-residential-care-homes", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}