{"pressItemDictionary": {"Press Releases": [{"Title": "Private Ambulance Operators to Be Licensed Under Healthcare Services Act", "PublishedDate": "/Date(1641139200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "03 Jan 2022", "Summary": "", "MainContent": "To ensure the safety and welfare of patients seeking ambulance services, private ambulances services will be regulated as either Emergency Ambulance Service (EAS) or Medical Transport Service (MTS) and licensed under the Healthcare Services Act (HCSA) from 3 January 2022.&nbsp;<br><br>2. Licensed EAS and MTS providers must ensure that they establish a proper clinical and quality assurance governance framework. This would include proper oversight by a designated Clinical Governance Officer, provision of service crew members with the right training, skillset and competencies as well as ensuring that vehicles are equipped with necessary medication, consumables and equipment, which are in working order and not expired.<br><br>3. Private ambulance operators must ensure that all conveyance services are provided in accordance with the requirements for EAS and MTS and general obligations under the HCSA. They will be held liable should they be found to have breached any of the regulations. MOH will also conduct random audits and compliance checks on all providers to ensure that the requirements continue to be met.<br><br>4. Members of the public should only engage licensed EAS and MTS providers for conveyance services, depending on the level of services they require. For example, those patients seeking emergency medical care should call a licensed EAS provider. Members of the public can find a list of licensed EAS or MTS providers on HealthHub (<a href=\"https://www.healthhub.sg/directory\" title=\"\" class=\"\" target=\"\">https://www.healthhub.sg/directory</a>). Patients or caregivers utilising the services should also be well informed of the charges for the conveyance through either calling the EAS and MTS providers or checking the published common charges at their respective websites and obtaining proper financial counselling from the providers prior to consuming the service.<br><br>5. From 3 January 2022, it will be an offence to provide private emergency ambulance and medical transport services without a valid licence under the HCSA. Any unlicensed providers may be prosecuted and liable to a fine not exceeding $100,000 or to imprisonment for a term not exceeding 2 years or to both. Unlicensed private ambulance services may be reported to <a href=\"https://www.moh.gov.sg/feedback\" title=\"\" class=\"\" target=\"\">https://www.moh.gov.sg/feedback</a>.<br><div><br></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "private-ambulance-operators-to-be-licensed-under-healthcare-services-act", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}