{"pressItemDictionary": {"Press Releases": [{"Title": "Key Findings From Healthier Sg Engagement", "PublishedDate": "/Date(1662174000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "03 Sep 2022", "Summary": "", "MainContent": "<p><strong>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;</strong>Since March 2022, the Ministry of Health (MOH) has engaged more than 6,000 residents and other key stakeholders, such as private General Practitioners (GPs) and employers on Healthier SG. These include face-to-face engagement sessions, as well as an online survey.</p><p><strong>Key Findings from Engagement</strong></p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; On the whole, there is high awareness of the Healthier SG strategy, with most residents engaged agreeing that having a regular family doctor who will co-develop a health plan with them will support their health goals. A vast majority agree that their health lies in how well they care for themselves. In addition, stakeholders like GPs, employers and insurers are also supportive.</p><p><u>Enrolling with one family doctor</u></p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; About two in three residents support the idea of having a regular family doctor, and are keen to enrol with a family doctor who will have an overview of their medical needs and guide them on staying healthy. The key considerations when choosing a doctor include location, convenience, familiarity, affordability, and quality of care. Other factors include practical considerations such as waiting time, opening hours, types of services and personal considerations such as whether the doctor is able to relate well to them.</p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; A key takeaway from the public engagement is that we need to preserve individual choice. Some residents are worried they will not be able to go to different doctors when they need to, such as when they move. Based on the feedback, we will allow for some flexibility in changes in doctors.</p><p>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Many also raised suggestions or gave feedback about their current experience. Older residents prefer to see a regular GP but as they age and develop chronic diseases, they find it more affordable to get their medications from polyclinics. This makes it hard for them to continue going to the same doctor. To address this, MOH will look at how to make chronic medication costs at the GPs more comparable with polyclinics.</p><p><u>Co-developing a Health Plan</u></p><p>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; About three in four residents are supportive of a health plan that would capture their health goals, status as well as follow-up actions for better health. MOH will incorporate in our proposals key features that residents have said they would like included in their health plan, such as: (i) regular health screenings for early detection and prevention of health issues; (ii) regular check-ins; and (iii) regular consultations to manage existing chronic conditions.</p><p><u>Access to community programmes</u></p><p>7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Respondents also want a more holistic approach to health, integrating their daily activities with opportunities for better health, such as the Health Promotion Board’s National Steps Challenge and greater access to nearby healthy activities. They also raised suggestions on ways to encourage individuals to adopt healthier lifestyles such as:</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; i.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Rewards like health points and discount vouchers;<br>&nbsp; &nbsp; &nbsp;ii.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Using health apps for personal tracking and goal setting at their own time and target;<br>&nbsp; &nbsp; iii.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Peer and community support to motivate and support each other in their health journeys; and<br>&nbsp; &nbsp;iv.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Education and awareness to understand the importance of being healthier.</p><p>8.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We will work with our healthcare clusters to strengthen partnerships with our key community partners – Health Promotion Board, SportSG and People’s Association – to enable healthier living. We will enhance the accessibility and awareness of community lifestyle programmes, enabled through enhancements to Healthy365. The healthcare clusters – National Healthcare Group, National University Health System and SingHealth – will review local health data and coordinate closely with community partners so as to provide support for family doctors and their residents.</p><p><u>Feedback from GPs</u></p><p>9.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We have engaged more than 1,000 healthcare professionals at various primary-care focused webinars and focus group discussions, and also worked with more than 50 directly to design Healthier SG. They shared that they are supportive of Healthier SG, which they believe will benefit residents, and are keen to participate in it.</p><p>10.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; They raised some concerns on the workflows for clinical care and support for IT, and want to focus on patient care instead of time spent on entering data or dealing with IT problems. MOH is looking into giving them adequate support to better manage and care for their patients and residents.&nbsp;</p><p>11.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Healthier SG will likely start with those aged 60 and above in 2023, and expand to other ages over time. This will also serve to provide sufficient time for our family doctors to ramp up their capacity and enrol residents gradually.</p><p><strong>Next Steps Forward</strong></p><p>12. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The feedback gathered will be studied further to develop MOH’s proposals for Healthier SG. We will release our recommendations in a White Paper on Healthier SG, which will be tabled at Parliament for debate in the coming weeks.&nbsp;</p><p><strong>&nbsp;</strong></p><p><strong>MINISTRY OF HEALTH<br></strong><strong>3 SEPTEMBER 2022</strong></p>", "PressCategory": ["Press Releases"], "CustomDetailUrl": "", "UrlName": "key-findings-from-healthier-sg-engagement", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}