{"pressItemDictionary": {"Press Releases": [{"Title": "Suspension of Burger and Lobster Singapore Pte Ltd’s Food Business Operations At Jewel Changi Airport", "PublishedDate": "/Date(1652706000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "16 May 2022", "Summary": "", "MainContent": "&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;The Ministry of Health (MOH) and the Singapore Food Agency (SFA) are investigating six incidents of gastroenteritis affecting a total of 17 persons after consuming food prepared by Burger and Lobster Singapore Pte Ltd located at Jewel Changi Airport between 7 and 15 May 2022. Four persons were hospitalised. One had since been discharged, and the three remaining hospitalised cases are currently stable. The remaining cases either sought outpatient treatment, self-medicated, or recovered without treatment.<br><br>2&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; In view of the suspected ongoing transmission, SFA has suspended the food business operations of Burger and Lobster Singapore Pte Ltd at Jewel Changi Airport, with effect from 16 May 2022 until further notice.&nbsp;<br><br>3&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;All food handlers working in the premises are required to re-attend and pass the Food Safety Course Level 1 and test negative for foodborne pathogens, before they can resume work as food handlers. The appointed Food Hygiene Officer working at the premises must re-attend and pass the WSQ Conduct Food and Beverage Hygiene Audit course before he/she can resume work as a Food Hygiene Officer. The licensee is also required to clean and sanitise the premises, including equipment and utensils, and dispose all ready-to-eat food and perishable food items.<br><br>4&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Food safety is a joint responsibility. SFA would like to remind food operators to observe good food and personal hygiene practices at all times. SFA will not hesitate to take firm action against anyone found to be in violation of the Environmental Public Health Act. In the interest of maintaining a high standard of food hygiene at all eating establishments, we would also like to advise members of the public who come across poor hygiene practices in food establishments not to patronise such outlets but to report to SFA via the online feedback form (<a href=\"http://www.sfa.gov.sg/feedback\" title=\"\" class=\"\" target=\"\">www.sfa.gov.sg/feedback</a>) with details for our follow-up investigations.<br><br><strong>MINISTRY OF HEALTH AND SINGAPORE FOOD AGENCY<br>16 May 2022</strong><br><div><br></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "suspension-of-burger-and-lobster-singapore-pte-ltd-s-food-business-operations-at-jewel-changi-airport", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}