{"pressItemDictionary": {"Press Releases": [{"Title": "Conclusion of Investigation Into Nuh’s Management of Pregnant Patient", "PublishedDate": "/Date(1650988800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "27 Apr 2022", "Summary": "", "MainContent": "The Ministry of Health (MOH) has completed its review of the National University Hospital’s (NUH) investigation into the case involving a pregnant patient alleged to have been left unattended for two hours at its Emergency Department (ED). MOH is satisfied that NUH has identified the gaps in processes and communication that had contributed to the incident and implemented the recommended corrective actions. MOH has also shared the findings and lessons learnt with all public hospitals.<br><br>2. Following the incident on 15 March 2022, NUH conducted a thorough investigation of the incident, which included reviewing video footage and interviewing all staff involved. The investigation was carried out by a team of NUH senior doctors and nurses from the Emergency Department, Obstetrics &amp; Gynaecology (O&amp;G) Department, and the Clinical Governance-Medical Affairs team.<br><br>3. While NUH’s overall assessment is that the processes and communications did not contribute to the miscarriage, there were gaps that needed to be improved. Specifically, NUH had instituted a rapid access protocol for pregnant patients with signs of labour, after triage at the ED, to be transferred directly to the Delivery Suite to be assessed by the O&amp;G doctor, rather than being seen by the ED doctor first before deciding for transfer. However, in this case, due to the unusually high numbers of patients at the ED that night, and the Delivery Suite being full, the process of immediate transfer to the Delivery Suite had broken down, resulting in the patient not being seen in a timely manner.<br><br>4. Learning from this incident, and to address the identified gaps, NUH has implemented the following measures to strengthen care in the following areas and to prevent similar incidents from happening again:<br><br>a) Patients who are pending transfer to the Delivery Suite will be triaged by the ED nurse and reviewed by the ED Doctor who will communicate with the O&amp;G Doctor as clinically indicated;<br>b) Based on clinical assessment, if indicated, pregnant patients may be evaluated using ultrasound at the ED;<br>c) A standardised obstetric assessment score will be used in the ED to triage pregnant patients; and<br>d) Following review by the O&amp;G doctor, foetal heart monitoring will be done at the ED while waiting for a bed in the Delivery Suite.<br><br>5. MOH has reviewed the investigation report submitted by NUH, and is satisfied with NUH’s findings, and the corrective actions are also appropriate to address the gaps identified.<br><br>6. MOH notes that NUH has held several meetings with the patient and her husband to provide clarification on the facts of the incident. The couple has since accepted NUH’s clarifications and acknowledged that the miscarriage may not have occurred at the hospital. NUH has also assured them that the hospital is improving its processes to prevent future occurrence of similar incidents.<br><br>7. MOH has shared NUH’s investigation findings with the senior management of all public hospitals. In addition, MOH has also reinforced to the public hospitals the clinical standards for the management of obstetric emergencies.", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "conclusion-of-investigation-into-nuh-s-management-of-pregnant-patient", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}