{"pressItemDictionary": {"Press Releases": [{"Title": "MOH Statement On One Confirmed Monkeypox Case Involving A Transit Traveller", "PublishedDate": "/Date(1654488000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "06 Jun 2022", "Summary": "", "MainContent": "The Ministry of Health (MOH) was informed on 4 June 2022, by the New South Wales Ministry of Health, of one confirmed case of monkeypox who had transited through Singapore to Australia on 2 June.<br>&nbsp;<br>The traveller arrived in Sydney on 3 June and had tested positive for monkeypox there. He had departed from Barcelona on 1 June and arrived at Changi Airport on 2 June. He had remained in the transit holding area at Changi Airport until his departure for Sydney on the same day, and did not visit other areas in Changi Airport.<br>&nbsp;<br>As the case did not enter Singapore or interact with persons in the community, there is currently no significant risk of community transmission. However, as a precautionary measure, we have conducted contact tracing for the two affected flights and those who might have come into contact with the traveller at the airport transit area.<br>&nbsp;<br>There were no assessed close contacts, and hence no requirement for quarantine. However, we have put 13 persons who may have casual contact with the traveller on phone surveillance for 21 days. Persons under phone surveillance will receive daily phone calls to ascertain their health status until the end of the monitoring period. Should they report symptoms that are suggestive of monkeypox infection, they will be medically assessed and may be conveyed to the National Centre for Infectious Diseases for further evaluation.", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "moh-statement-on-one-confirmed-monkeypox-case-involving-a-transit-traveller", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}