{"pressItemDictionary": {"Press Releases": [{"Title": "Investigation Into Allegations of Improper Conduct of Pre-event Testing and Falsification of Vaccination Records", "PublishedDate": "/Date(1642907760000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "23 Jan 2022", "Summary": "", "MainContent": "The Ministry of Health (MOH) is investigating Wan Medical Clinic which had allegedly partnered Ms Iris Koh, the founder of the group known as “Healing the Divide” (HTD), to offer “remote” Antigen Rapid Test (ART) Pre-Event Testing (PET) for members of HTD.<br><br>2. MOH started its investigations following an anonymous feedback in December 2021. Wan Medical Clinic was found to have allowed individuals to allegedly submit to the clinic pre-recorded videos and/ or photos purporting to show that they had performed ART PET on themselves. The clinic then uploaded the negative ART results for these individuals.<br><br>3. Among other safeguards and requirements, supervised PET must be conducted in real time and in the presence of a registered medical practitioner or qualified self-administered test supervisor. The conduct of any unsupervised PET is a breach of Regulation 12(1A) of the Infectious Diseases (Antigen Rapid Test Providers) Regulations 2021 (“ART Regulations”). Under Regulation 12(4) of the ART Regulations, if convicted of an offence under Regulation 12(1A), the test provider could face a fine not exceeding $5,000 or imprisonment for a term not exceeding 3 months or both.<br><br>4. In the course of MOH’s investigations, we also found that a registered medical practitioner in this clinic, Dr Jipson Quah, has been allegedly involved in providing a vaccination service where false information was caused to be submitted to the National Immunisation Registry to indicate that COVID-19 vaccines had been administered to individuals, when they had in fact not received such vaccinations. In this manner, the individuals will be considered as vaccinated and be eligible for all vaccination-differentiated safe management measures.<br><br>5. Dr Quah was also found to have allegedly submitted a false positive ART result to the Patient Risk Profile Portal, a national healthcare system used by doctors to upload ART results and other patient information, so that the unvaccinated patient could obtain a recovered status and be exempted from vaccination-differentiated safe management measures.<br><br>6. A police report has been lodged on 21 January 2022 for further investigations to be conducted into the matter.<br><br>7. To safeguard public health and ensure that clinic practices are in line with national COVID-19 policies and regulations, whilst pending the outcome of investigations, MOH will be issuing notices of intention of suspension to the four medical clinics i.e. Wan Medical Clinic, Mayfair Medical Clinic, Mayfair Medical Clinic (Yishun Chong Pang), and Ong Clinic &amp; Surgery (Yishun), which were licensed to Dr Quah and/or which he is a clinic manager, as well as revoking the ART approvals for these clinics. MOH will also be referring Dr Quah to the Singapore Medical Council for further investigations.", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "investigation-into-allegations-of-improper-conduct-of-pre-event-testing-and-falsification-of-vaccination-records", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}