{"pressItemDictionary": {"Press Releases": [{"Title": "Extension of Operating Hours of Jtvcs  and Children’s Vaccination Centres ", "PublishedDate": "/Date(1668679200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "17 Nov 2022", "Summary": "", "MainContent": "&nbsp; &nbsp; &nbsp; &nbsp; From 19 November 2022, the Ministry of Health (MOH) will extend on Saturdays, the operating hours of all Joint Testing and Vaccination Centres (JTVCs) and Children’s Vaccination Centres (CVCs) to 7pm.&nbsp;<br><br>2.&nbsp; &nbsp; &nbsp;To optimise COVID-19 vaccination operations, the Vaccination Centre at the former Hong Kah Secondary School will be converted to a JTVC from 21 November 2022. JTVC Bishan, which offers the Novavax/Nuvaxovid vaccine, will be closed, with its last day of operations on 19 November 2022. With this transition, the Novavax/Nuvaxovid COVID-19 vaccine will be available at selected Public Health Preparedness Clinics (PHPCs) and polyclinics.&nbsp;<br><br><strong>Extension of Operating Hours at JTVCs and CVCs<br></strong><br>3.&nbsp; &nbsp; &nbsp;We have seen encouraging take-up of the bivalent Moderna/Spikevax vaccine and vaccination/booster for children. As of 16 November 2022, over 186,000 individuals have received the bivalent Moderna/Spikevax vaccine dose, or have booked an appointment. 17,000 children aged 6 months to 4 years have either received the Moderna/Spikevax vaccine, or have booked an appointment, and 74,000 children between 5 and 11 years have either received the Pfizer-BioNTech/Comirnaty booster or have booked an appointment. Currently, about 20,000 individuals are being administered vaccine doses per day.<br><br>4.&nbsp; &nbsp; &nbsp;To make it more convenient for people coming forward to get vaccinated, we will be extending the operating hours of all JTVCs and CVCs from 9am-1pm to 9am-7pm on Saturdays from 19 November to end-December 2022. With this change, the operating hours on Saturdays will be the same as for weekdays. Please refer to <a href=\"/docs/librariesprovider5/default-document-library/annex-a371ac8f6781f483fa4df730157bf46c0.pdf?sfvrsn=3c058009_0\" title=\"Annex A\">Annex A</a>&nbsp;for the operating hours of JTVCs and CVCs.&nbsp;<br><br>5.&nbsp; &nbsp; &nbsp;Persons aged 50 years and above can currently walk in to a JTVC to receive their vaccinations without appointments. With higher demand for vaccines, they are reminded that the less crowded hours are from Mondays to Thursdays before 6.30pm, and on Saturdays after 2pm. For a smoother experience, walk-ins should be avoided during peak periods of Friday and Saturday morning.&nbsp;<br><br>6.&nbsp; &nbsp; &nbsp;As previously announced, siblings of a child with an existing appointment on Mondays to Thursdays can receive their vaccinations at the same time, without the need for an appointment at the CVCs. Parents are reminded to arrive at the CVC by 5.30pm on Mondays to Thursdays, and to bring along their children’s identification documents for registration.&nbsp;<br><strong><br>Consolidation of Vaccination Locations</strong><br><br>7.&nbsp; &nbsp; &nbsp;To better serve residents in the west, JTVC Jurong West, located at the former Hong Kah Secondary School, will be operational from 21 November 2022. JTVC Jurong West will offer both the bivalent Moderna/Spikevax vaccine and monovalent Pfizer-BioNTech/Comirnaty vaccine.&nbsp;<br><br>8.&nbsp; &nbsp; &nbsp;The last day of operations for JTVC Bishan is 19 November 2022. The area will continue to be adequately served by JTVC Ang Mo Kio, for those who wish to receive the bivalent Moderna/Spikevax vaccine. Ang Mo Kio Polyclinic, Toa Payoh Polyclinic, and the PHPCs in the vicinity offer only the monovalent Pfizer-BioNTech/Comirnaty vaccine.&nbsp;<br><br>9.&nbsp; &nbsp; &nbsp;From 21 November 2022, persons who wish to receive the Novavax/Nuvaxovid vaccine may make an appointment at any of the 19 PHPCs, Jurong Polyclinic and Yishun Polyclinic. The list of vaccination sites offering the Novavax/Nuvaxovid vaccine can be found at <a href=\"/docs/librariesprovider5/default-document-library/annex-b9d5220db83694460b3dd23714c7ce815.pdf?sfvrsn=3d3b64ae_0\" title=\"Annex B\">Annex B</a>.&nbsp;<br><br>10.&nbsp; &nbsp; &nbsp;With these changes, MOH will continue to maintain 10 active JTVCs to serve residents across the island. Please visit <a href=\"https://gowhere.gov.sg/vaccine\" title=\"\" class=\"\" target=\"\">https://gowhere.gov.sg/vaccine</a>&nbsp;for the nearest vaccination location.<br><br>11.&nbsp; &nbsp; &nbsp;Vaccination remains a key part of our COVID-19 strategy in ensuring our population is well protected against infection and severe illness. Individuals, including children, are encouraged to receive COVID-19 vaccines recommended for them as soon as they are eligible to do so.<br><br><strong><br>MINISTRY OF HEALTH&nbsp;<br>17 NOVEMBER 2022&nbsp;</strong><br>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "extension-of-operating-hours-of-jtvcs-and-children-s-vaccination-centres", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}