{"pressItemDictionary": {"Press Releases": [{"Title": "Erroneous Administration of  Fourth Dose of Covid-19 Vaccine to 103-year-old", "PublishedDate": "/Date(1643976900000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "04 Feb 2022", "Summary": "", "MainContent": "&nbsp; &nbsp; &nbsp; &nbsp; The Ministry of Health (MOH) is concluding its investigation of a case of a 103-year-old nursing home resident at ECON Healthcare – Chai Chee Nursing Home who was erroneously administered with a fourth dose of COVID-19 vaccine by a mobile vaccination team from PanCare Medical Clinic.<br><br>2&nbsp; &nbsp; &nbsp;The resident had previously received three doses of COVID-19 vaccine, and was erroneously given a fourth shot on 13 December 2021.&nbsp; On 16 December 2021, the resident was admitted to Changi General Hospital for pneumonia and hyponatremia, and subsequently also diagnosed to have suffered a stroke. She passed away on 10 January 2022.&nbsp; Her death was reported to the Coroner, who ordered an autopsy to be conducted. The autopsy found that the main cause of death was pneumonia, with other contributing factors being cerebral infarction (or stroke) and coronary artery disease, which are natural disease processes common in seniors. The Coroner has not determined whether these causes of death were linked to the vaccination.&nbsp;<br><br>3&nbsp; &nbsp; &nbsp;MOH takes a serious view of this incident and is carrying out a thorough investigation under Regulations 14A(1) and 36(1) of the Private Hospitals and Medical Clinics Regulations. We expect the investigations to conclude in February 2022.&nbsp; Our preliminary findings were that the vaccine was erroneously administered due to possible irregularities in vaccination procedures and poor communication between the nursing home and the medical service provider handling the vaccination. This is the first case of mistaken identity leading to erroneous vaccination by a mobile vaccination team in over 152,000 vaccinations to date.&nbsp;<br><br>4&nbsp; &nbsp; &nbsp;MOH had planned to announce this incident in December 2021. However, the family of the resident had requested to withhold details which could have led to the identification of the resident. We have since consulted the family further and are releasing the information to provide clarity on the incident.&nbsp;<br><br>5&nbsp; &nbsp; &nbsp;We understand that ECON Healthcare Group and PanCare Medical Clinic have co-funded the resident’s hospital bill as a goodwill gesture. ECON Healthcare has also been in contact with the resident’s family to render support to them.&nbsp;<br><br>6&nbsp; &nbsp; &nbsp;Both ECON Healthcare and PanCare Medical Clinic have reviewed their processes to prevent a recurrence. The Agency for Integrated Care, whose role is to facilitate vaccinations in nursing homes, has reminded all nursing homes to ensure proper communications with the mobile vaccination teams when vaccination takes place. MOH has also reminded all mobile vaccination teams to perform independent identity verification and authentication before administering any vaccination.<br><br><strong><br>MINISTRY OF HEALTH&nbsp;<br>4 FEBRUARY 2022<br></strong><div><br></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "erroneous-administration-of-fourth-dose-of-covid-19-vaccine-to-103-year-old", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}