{"pressItemDictionary": {"Press Releases": [{"Title": "Promoting Overall Healthier Living  While Targeting Specific Sub-populations", "PublishedDate": "/Date(1646817300000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "09 Mar 2022", "Summary": "", "MainContent": "<p style=\"text-align: justify;\"><span style=\"font-size: 16px; font-family: Arial;\">&nbsp; &nbsp; To work towards a healthier Singapore, the Ministry of Health (MOH) will take a life-course approach to drive population health. We will redouble efforts to promote overall healthier living, while taking targeted health measures for specific segments of society.</span></p> <p style=\"text-align: justify;\"><span style=\"font-size: 16px; font-family: Arial;\"><strong></strong></span><strong style=\"font-family: Arial; font-size: 16px;\">Making Singapore Healthier<br><br></strong><strong style=\"font-family: Arial; font-size: 16px;\"><em>Stronger focus on preventive care<br><br></em></strong><span style=\"font-family: Arial; font-size: 16px;\">2.&nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">To address the challenges of an ageing population and improve population health outcomes, MOH is developing a Healthier SG strategy to outline a major reform of the healthcare sector. We will focus our efforts upstream on keeping individuals healthy, driving preventive health and early intervention, while continuing to provide appropriate care to those with existing needs.</span></p><p style=\"text-align: justify;\"><p><span style=\"font-size: 16px; font-family: Arial;\">3.&nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">The Healthier SG strategy has five core components:</span></p></p> <ul><li style=\"text-align: justify;\"><span style=\"font-size: 16px; font-family: Arial;\">Mobilisation of our network of family physicians;</span></li><li style=\"text-align: justify;\"><span style=\"font-size: 16px; font-family: Arial;\">Care Plans;</span></li><li style=\"text-align: justify;\"><span style=\"font-size: 16px; font-family: Arial;\">Community partnership to support better health;</span></li><li style=\"text-align: justify;\"><span style=\"font-size: 16px; font-family: Arial;\">National Healthier SG Enrolment programme; and</span></li><li style=\"text-align: justify;\"><span style=\"font-size: 16px; font-family: Arial;\">Support structures and policies.</span><strong style=\"font-family: Arial; font-size: 16px;\"><em></em></strong></li></ul><p style=\"text-align: justify;\"><strong style=\"font-family: Arial; font-size: 16px;\"><em>Activating our network of family physicians<br><br></em></strong><span style=\"font-family: Arial; font-size: 16px;\">4.&nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">International and local studies have shown that those who have a regular family physician are generally healthier, and have fewer hospitalisation and emergency department visits. However only three in five Singaporeans currently have a regular doctor. To support the Healthier SG strategy, we will reorganise care delivery, starting with transforming primary care to be an important pillar of the healthcare system. This requires the integration of primary care providers, especially General Practitioners (GPs), into the public healthcare ecosystem.<br><br>5.&nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">MOH will partner the three healthcare clusters to better support the GPs who are operating within their region and integrating them more closely with the overall health system, such as by enabling data sharing and building up team-based care.<br><br></span><strong style=\"font-family: Arial; font-size: 16px;\"><em>Care Plans<br><br></em></strong><span style=\"font-family: Arial; font-size: 16px;\">6.&nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">Under the Healthier SG strategy, Singaporeans will be encouraged to visit the same family physician clinic regularly for all their care needs and discuss their health goals. This could include completing key preventive care actions, addressing risk factors early and exploring together how to achieve health goals and delay the onset of diseases.<br><br>7.&nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">MOH will be conducting consultation with all stakeholders in the coming months to develop a primary care package that is optimised to encourage participation and adherence. Some proposals include exploring how to make recommended health screenings even more affordable, providing better coverage by Community Health Assist Scheme (CHAS) subsidies and/or MediSave at their chosen doctor, or offer insurance premium discounts for those who diligently follow their Care Plans.<br><br></span><strong style=\"font-family: Arial; font-size: 16px;\"><em>Mobilising community partnerships to support better health</em></strong></p><p style=\"text-align: justify;\"><p><span style=\"font-size: 16px; font-family: Arial;\">8.&nbsp; <strong><em>&nbsp;</em></strong></span><span style=\"font-family: Arial; font-size: 16px;\">We will leverage community partnerships to strengthen support for residents. The regional health clusters will build an integrated health and social ecosystem to better support the needs of residents who stay within their region, by partnering agencies such as the Health Promotion Board (HPB), Agency for Integrated Care (AIC), People’s Association (PA), SportSG, National Parks Board and community partners to provide programmes and services to help residents keep healthy and well in the community.<br><br>9.&nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">Beyond community partnerships, MOH will also explore how we could extend such collaborations to private hospitals.<br><br></span><strong style=\"font-family: Arial; font-size: 16px;\"><em>National Healthier SG enrolment programme<br></em></strong><span style=\"font-family: Arial; font-size: 16px;\"><br>10.&nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">Central to Healthier SG is the plan to roll out a national primary care enrolment programme from 2023. Each resident will be invited to enrol with a family physician of their choice as their first line of care, who would support them across their life-course for different health needs and care episodes, to ensure continuity of care.<br><br>11.&nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">The national enrolment programme will be coordinated by the three healthcare clusters, with each cluster looking after a region of up to 1.5 million residents, and working with family physicians and other partners in the region to engage the residents and strengthen care for them. Family physicians may work with the polyclinic or hospital in the management of patients with more complex needs. Upon discharge, hospitals would refer patients to the family physician they are enrolled with, to ensure continuity of care. There could also be shared care between family physicians and specialists or other allied health professionals to jointly support patients based on their care needs. This partnership will allow the care team that is supporting the patient to coordinate an integrated seamless care.<br><br>12.&nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">A geographical approach will be used to enrol residents so that each individual can get care and support near where they live. Currently, close to nine in 10 residents visit a family physician or hospital near their home. Nevertheless, MOH will preserve individual choice in enrolling with a family physician, even if the doctor is practising far away from their home and/ or operates in an area that is coordinated by another healthcare cluster. Even after enrolment, individuals can make changes when the need arises, for instance, when they move to a new house.<br><br></span><strong style=\"font-family: Arial; font-size: 16px;\"><em>Necessary support structures and policies<br><br></em></strong><span style=\"font-family: Arial; font-size: 16px;\">13.&nbsp; </span><strong style=\"font-family: Arial; font-size: 16px;\"><em>&nbsp;</em></strong><span style=\"font-family: Arial; font-size: 16px;\">MOH will put in place structures and policies to support the healthcare reform and shifts needed. These include further investing in our manpower and strengthening the training focus on delivering care in the community, reviewing our financing schemes to focus on delivering key health outcomes and building up critical support pillars in technology and data.<br><br>14.&nbsp; &nbsp;</span><u style=\"font-family: Arial; font-size: 16px;\">Manpower</u><span style=\"font-family: Arial; font-size: 16px;\">. We need to build up and optimise our primary and community care workforce further to support the shift of the centre of gravity towards primary and community care over the next few years. We will also further build up the competencies and skills of our healthcare workforce.<br><br>15.&nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">In recent years, we have placed strong emphasis on family medicine training and education. We will explore further measures to ensure new graduates have a more broad-based experience. Post-graduate training in Family Medicine is also being strengthened to lay an even stronger ground foundation in family medicine for our medical doctors over time.<br><br>16.&nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">We will continue to invest in the skills development of nurses, pharmacists and allied health professionals, broaden inter-disciplinary training, and empower them to practise at the highest level of their licences. We will also expand the role of community pharmacists and the scope of work for allied health professionals in primary and community care to improve care delivery and support to patients and doctors in the community.<br><br>17.&nbsp; &nbsp;</span><u style=\"font-family: Arial; font-size: 16px;\">Financing</u><span style=\"font-family: Arial; font-size: 16px;\">. MOH is changing the basis of how we fund our healthcare clusters, moving from a workload-based model to a capitation model, where clusters will get a pre-determined fee for every resident living in the region that they are looking after to allow them greater latitude to determine how they will support the residents. With this funding shift, there will be a natural incentive for hospitals to try to keep residents healthy through preventive care.<br><br>18.&nbsp; &nbsp;</span><u style=\"font-family: Arial; font-size: 16px;\">IT and data</u><span style=\"font-family: Arial; font-size: 16px;\">. MOH will study how we can provide better data support for family physicians, such as giving them access to patients’ medical records and tools like clinical dashboards to better track their patient’s conditions and health trends over time. To support this, MOH has been developing the National Electronic Health Record (NEHR) system to synchronise information and enable access by the patients’ care team across settings.<br><br>19.&nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">With more accessing shared data and handling individual records, there is a need to ensure and facilitate secured data sharing, and for users to take greater responsibility for data access. New legislation will be put in place to govern this, with a Health Information Bill that will be put in place.<br><br></span><strong style=\"font-family: Arial; font-size: 16px;\"><em>Consultation and White Paper on Healthier SG<br><br></em></strong><span style=\"font-family: Arial; font-size: 16px;\">20.</span><strong style=\"font-family: Arial; font-size: 16px;\"><em>&nbsp; &nbsp;</em></strong><span style=\"font-family: Arial; font-size: 16px;\">Healthier SG is a major national strategy and more details are being worked out. Over the next few months, we will be consulting different stakeholders, including Singaporeans from all walks of life, GPs, healthcare workers and community partners, to gather their input and views. MOH will then provide more details of Healthier SG in a White Paper and table it for debate in Parliament. We will share more details of the public consultation plans for Healthier SG when ready.<br><br></span><strong style=\"font-family: Arial; font-size: 16px;\">Strengthening Support for the Young and Their Families<br><br></strong><span style=\"font-family: Arial; font-size: 16px;\">21.&nbsp; </span><strong style=\"font-family: Arial; font-size: 16px;\">&nbsp;</strong><span style=\"font-family: Arial; font-size: 16px;\">MOH is developing a Child and Maternal Health and Well-being Strategy and Action Plan to provide holistic and comprehensive support to children and their families to keep healthy and well. The Strategy and Action Plan will address health risks and wider determinants of health across different age segments, spanning the pre-conception phase to adolescents aged 18 years old.<br><br>22.&nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">The Interagency Taskforce, chaired by Mr Masagos Zulkifli, Minister for Social and Family Development and Second Minister for Health, was set up to oversee the development and implementation of the five-year Strategy and Action Plan. The Taskforce has completed the first of two phases of review and development.<br><br>23.&nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">As the needs and support required of children and their mothers vary across the age spectrum, we are developing the Strategy and Action Plan over two phases to develop more targeted programmes and initiatives for each group.</span></p></p> <ul><li style=\"text-align: justify;\"><span style=\"font-size: 16px; font-family: Arial;\">The first phase started last year, and focused on supporting mothers and their children from pre-conception up to 12 years of age.</span></li></ul><ul><li style=\"text-align: justify;\"><span style=\"font-size: 16px; font-family: Arial;\">The second phase, which will commence this year, will focus on supporting adolescents up to 18 years of age and families including fathers and grandparents.</span></li></ul><p style=\"text-align: justify;\"><span style=\"font-size: 16px;\"><span style=\"font-family: Arial; font-size: 16px;\">24.&nbsp; &nbsp;</span>Over the past year, the Taskforce has conducted focus group discussions with parents, parents-to-be and caregivers. We have also conducted some 20 site visits and engagement sessions from February to August 2021 with frontline officers from across the health, social and education domains to better understand what matters most to children and their families.<br><br>25.&nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">The Taskforce has put up a few recommendations for the first phase of the Action Plan for implementation from this year, focusing on three key aspects, namely (i) a healthy mother and a healthy child, (ii) a happy mother and a happy child, and (iii) a well-supported mother and an able child.</span></p><p style=\"text-align: justify;\"><p><span style=\"font-size: 16px; font-family: Arial;\"></span><strong style=\"font-family: Arial; font-size: 16px;\"><em>More service delivery as a mother-child dyad at polyclinics</em></strong></p><p><span style=\"font-size: 16px; font-family: Arial;\">26.&nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">Since 2019, we have started two pilot programmes to offer the mother-child dyad service model in Punggol Polyclinic and Yishun Polyclinic. These pilots offer integrated healthcare services for both mothers and children when they visit the polyclinics as a dyad, where postnatal depression screening and breastfeeding support are provided to the mothers when they bring their child for vaccination and childhood developmental screening at the polyclinics. Since the pilots started, more than 10,000 children and mothers have benefitted from the programmes.<br><br>27.&nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">To support the dyad of a healthy mother and a healthy child, MOH will scale up the pilot to deliver integrated services through a mother-child dyad service model in 12 more polyclinics across Singapore over the next three years. This will enable more mothers and children to benefit from the services delivered.</span></p></p><p style=\"text-align: justify;\"><p><span style=\"font-size: 16px; font-family: Arial;\"></span><strong style=\"font-family: Arial; font-size: 16px;\"><em>Family Nexus<br></em><br></strong><span style=\"font-family: Arial; font-size: 16px;\">28.</span><strong style=\"font-family: Arial; font-size: 16px;\">&nbsp;<em> &nbsp;</em></strong><span style=\"font-family: Arial; font-size: 16px;\">Besides integrating services for the mother and child, we also need to enhance integration of services across the health and social domains for more holistic support for children and their families. In this regard, we will be piloting an integrated family support programme called “Family Nexus”, at four sites in Choa Chu Kang, Punggol, Sembawang and Tampines in 2022.<br><br>29.&nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">Family Nexus will bring together selected health and social services under one roof, allowing families to easily access varied services at a one-stop community node near them. This could be at or near a polyclinic, a GP clinic, or social service agency office. Families can also navigate and sign up for other relevant programmes organised by community partners in the region, including breastfeeding and lactation support services, Body Mass Index and Growth Assessment checks for young children, marriage prep courses, parenting or grandparent programmes, and caregivers’ training.</span></p></p><p style=\"text-align: justify;\"><p><span style=\"font-size: 16px; font-family: Arial;\"></span><strong style=\"font-family: Arial; font-size: 16px;\"><em>More antenatal and postnatal mental wellness support<br><br></em></strong><span style=\"font-family: Arial; font-size: 16px;\">30.&nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">We will also scale up support for the mental well-being of women during and after their pregnancy. The local study, Growing Up in Singapore Towards Healthy Outcomes (GUSTO), found that maternal mental well-being during pregnancy could affect the brain development of the foetus, giving rise to vulnerability, such as mood or anxiety disorders later on in life. The study also found that positive maternal mental health and well-being play an important role in the child’s development after birth. In Singapore, about 7.2% of pregnant women are found to have high score of depressive symptoms during pregnancy. The proportion increases to 1 in 10 women during the first three months postpartum.<br><br>31.&nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">KK Women’s and Children’s Hospital and National University Hospital will enhance their mental well-being support for pregnant women and mothers by scaling up accessibility to antenatal and post-natal mental health screening. We will also enhance early intervention and support for more women who are screened to be at risk of depressive symptoms. Case management support and consultation with a psychologist or case manager will be provided to journey with them during their pregnancy as well as the first few years of childbirth (should there be an assessed need to continue after childbirth).</span></p></p><p style=\"text-align: justify;\"><p><span style=\"font-size: 16px; font-family: Arial;\"></span><strong style=\"font-family: Arial; font-size: 16px;\"><em>More practical guides and resources on calibrating screen time<br><br></em></strong><span style=\"font-family: Arial; font-size: 16px;\">32.&nbsp; </span><strong style=\"font-family: Arial; font-size: 16px;\"><em>&nbsp;</em></strong><span style=\"font-family: Arial; font-size: 16px;\">We will enhance support to parents and caregivers, to help them to inculcate healthy lifestyle habits in their children from young. In particular, we will develop practical guides and resources for parents to calibrate their children’s exposure to screen time, and forge healthy screen time habits. This is important as the GUSTO study found that infant screen time could have a negative association with later cognition if the child gets exposed to screen viewing too early. Excessive screen time could also have a negative impact on a child’s health and well-being.<br><br></span><strong style=\"font-family: Arial; font-size: 16px;\"><em>Parent Hub<br><br></em></strong><span style=\"font-family: Arial; font-size: 16px;\">33.&nbsp;</span><strong style=\"font-family: Arial; font-size: 16px;\"><em> &nbsp;</em></strong><span style=\"font-family: Arial; font-size: 16px;\">Besides examining evidence-based findings to put in place interventions and enhancing service integration, the Taskforce also reviewed the approaches on how we engage our stakeholders and the public, so as to keep resources, messages and support to them relevant. Last year, HPB launched Parent Hub which serves as a one-stop evidence-based resource portal for parents to obtain information to enhance their children’s health and well-being. Parent Hub consolidates reliable information in one place and allows parents to seek advice and help easily. More resources to support parents to keep themselves and their children healthy will be provided in the coming months.<br><br></span><strong style=\"font-family: Arial; font-size: 16px;\">Targeted Measures to Support Seniors for Successful Ageing<br><br></strong><strong style=\"font-family: Arial; font-size: 16px;\"><em><u>Seniors</u></em></strong><strong style=\"font-family: Arial; font-size: 16px;\"><em>: </em></strong><strong style=\"font-family: Arial; font-size: 16px;\"><em>Refresh of the Action Plan for Successful Ageing<br><br></em></strong><span style=\"font-family: Arial; font-size: 16px;\">34.&nbsp; </span><strong style=\"font-family: Arial; font-size: 16px;\"><em>&nbsp;</em></strong><span style=\"font-family: Arial; font-size: 16px;\">The Ministerial Committee of Ageing (MCA) is refreshing the Action Plan for Successful Ageing, to ensure that it continues to meet the needs of the seniors of today and tomorrow. The Refresh of the Action Plan, which is targeted to be launched in end 2022, will focus on the three “C”s of Care, Contribution and Connectedness:<br><br>-&nbsp; &nbsp;</span><u style=\"font-family: Arial; font-size: 16px; text-align: left;\">Care</u><span style=\"font-family: Arial; font-size: 16px; text-align: left;\">: Empower seniors to take charge of their physical and mental well-being through preventive health, active ageing programmes and care services to stay healthy and pursue their aspirations<br><br>-&nbsp; &nbsp;</span><u style=\"text-align: left; font-family: Arial; font-size: 16px;\">Contribution</u><span style=\"text-align: left; font-family: Arial; font-size: 16px;\">: Enable seniors to continue to contribute their knowledge and expertise and remain resilient, through an enhanced learning, volunteerism and employment landscape<br><br>-&nbsp; &nbsp;</span><u style=\"font-family: Arial; font-size: 16px; text-align: left;\">Connectedness</u><span style=\"font-family: Arial; font-size: 16px; text-align: left;\">: Support seniors to age-in-place within an inclusive built environment, while staying connected to their loved ones and society through digital platforms and support networks that embody the \"kampung spirit\".<br><br>35.&nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">As part of the SGTogether movement, we have embarked on a series of engagements with Singaporeans from all walks of life to co-create the Refresh of the Action Plan. These include focus group discussions on a wide variety of topics such as retirement adequacy, digital participation for seniors, as well as active ageing programmes and surveys to gauge public sentiments, and the Citizens’ Panel on Contribution, as a call-to-action for Singaporeans to partner the Government in co-creating the Refresh of the Action Plan. More than 5,000 Singaporeans attended around 35 engagement sessions to discuss and shape transformation in how we can enable seniors to age well in the community.<br><br></span><strong style=\"font-family: Arial; font-size: 16px;\"><em>Health and wellness programme, “Live Well, Age Well”<br><br></em></strong><span style=\"font-family: Arial; font-size: 16px;\">36.&nbsp;</span><strong style=\"font-family: Arial; font-size: 16px;\"><em> &nbsp;</em></strong><span style=\"font-family: Arial; font-size: 16px;\">‘Live Well, Age Well’ is a new health and wellness programme that is jointly developed and implemented by HPB and PA, which aims to empower seniors to improve and maintain their health through a holistic programme that comprises six domains, spanning physical, mental and social wellness:<br><br>-&nbsp; &nbsp;</span><u style=\"font-family: Arial; font-size: 16px; text-align: left;\">Live Active</u><span style=\"font-family: Arial; font-size: 16px; text-align: left;\">: To engage seniors in regular exercises, focusing on strength, balance and flexibility to support seniors in meeting their recommended physical activity levels.<br><br>-&nbsp; &nbsp;</span><u style=\"font-family: Arial; font-size: 16px; text-align: left;\">Live Enriched</u><span style=\"font-family: Arial; font-size: 16px; text-align: left;\">: To equip seniors with knowledge and skills to improve and maintain their physical, mental and functional health.<br><br>-&nbsp; &nbsp;</span><u style=\"font-family: Arial; font-size: 16px; text-align: left;\">Live Nourished</u><span style=\"font-family: Arial; font-size: 16px; text-align: left;\">: To encourage seniors to adopt a healthy and balanced diet, with a focus on meeting recommended intake of important nutrients including protein and calcium.<br><br>-&nbsp; &nbsp;</span><u style=\"font-family: Arial; font-size: 16px; text-align: left;\">Live Assured</u><span style=\"font-family: Arial; font-size: 16px; text-align: left;\">: To encourage seniors to go for regular health screening and follow-up.<br><br>-&nbsp; &nbsp;</span><u style=\"font-family: Arial; font-size: 16px; text-align: left;\">Live Happy</u><span style=\"font-family: Arial; font-size: 16px; text-align: left;\">: To educate seniors on the importance of mental and social well-being and encourage active participation to stay socially connected.<br><br>-&nbsp; &nbsp;</span><u style=\"font-family: Arial; font-size: 16px; text-align: left;\">Live Prepared</u><span style=\"font-family: Arial; font-size: 16px; text-align: left;\">: To equip seniors with essential knowledge and skills to stay independent and fulfilled post-retirement.</span></p></p><p style=\"text-align: justify;\"><span style=\"font-size: 16px; font-family: Arial;\">37.&nbsp; &nbsp;The programme will be gradually rolled out nationwide in a ‘hub-and-spoke’ model from May 2022, where the suite of programming from all six domains will be offered at designated Community Centres, and complemented by Residents’ Corners, Eldercare Centres and faith-based organisations, based on the profile of residents and clients.<br><br></span><strong style=\"font-family: Arial; font-size: 16px;\"><em>Expansion of private assisted developments<br><br></em></strong><span style=\"font-family: Arial; font-size: 16px;\">38.&nbsp; </span><strong style=\"font-family: Arial; font-size: 16px;\"><em>&nbsp;</em></strong><span style=\"font-family: Arial; font-size: 16px;\">Last year, we launched the Community Care Apartments at Bukit Batok with senior-friendly features and care services that can be scaled to individual care needs. Given that the flats were over-subscribed with more than four seniors applying for each flat, MOH, the Ministry of National Development and Urban Redevelopment Authority (URA) have been jointly looking to expand the suite of such housing-cum-care models to private developments.<br><br>39.&nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">MOH and URA will launch a site at Parry Avenue for sale by public tender in the coming months. Tenderers will be invited to propose innovative assisted living models that can support seniors with a continuum of care and support their physical and mental wellbeing. This launch will also catalyse the input and leverage the strengths of private stakeholders in the assisted living ecosystem, and further support our seniors’ aspirations to age-in-place.<br><br></span><strong style=\"font-family: Arial; font-size: 16px;\">Introduce Targeted Health Measures for Other Specific Sub-Populations<br><br></strong><strong style=\"font-family: Arial; font-size: 16px;\"><em><u>Women</u></em></strong><strong style=\"font-family: Arial; font-size: 16px;\"><em>: Women’s health event</em></strong></p><p style=\"text-align: justify;\"><p><span style=\"font-size: 16px; font-family: Arial;\">40.&nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">The Women’s Health Committee, chaired by Ms Rahayu Mahzam, Parliamentary Secretary, Ministry of Health, is made up of representatives from various government agencies, and several non-governmental organisations with a shared interest in promoting women’s health in Singapore. Amongst the Committee’s priorities in improving health outcomes for women are efforts to inculcate a healthy lifestyle from young, as well as women-specific health matters such as bone health and cancer screening. Please refer to the </span><u style=\"font-family: Arial; font-size: 16px;\"><a href=\"/docs/librariesprovider5/default-document-library/annexeee31cc63f23477bb585bcf76573b3f8.pdf?sfvrsn=6dc05b45_0\" title=\"Annex\">Annex</a></u><span style=\"font-family: Arial; font-size: 16px;\"> for the composition of the Women’s Health Committee.<br><br>41.&nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">The Committee is planning a women’s health event in 2022, consisting of a series of events and activities where its member agencies and organisations can collectively raise greater awareness of women’s health matters and women-specific health issues to maximise outreach to different segments of the female population. More details of the women’s health event will be shared in the later part of 2022.</span></p></p><p style=\"text-align: justify;\"><p><span style=\"font-size: 16px; font-family: Arial;\"></span><strong style=\"font-family: Arial; font-size: 16px;\">Redoubling Efforts to Promote Healthier Lifestyles</strong></p><p style=\"\"><span style=\"font-size: 16px; font-family: Arial;\"><strong></strong></span><strong style=\"font-family: Arial; font-size: 16px;\"><em>Introducing measures to curb sodium consumption<br><br></em></strong><span style=\"font-family: Arial; font-size: 16px;\">42.</span><strong style=\"font-family: Arial; font-size: 16px;\"><em>&nbsp; &nbsp;</em></strong><span style=\"font-family: Arial; font-size: 16px;\">High sodium intake is associated with increased risk of hypertension, which is in turn associated with higher risks of cardiovascular complications such as stroke and heart attack. More than one in three Singapore residents aged 18 to 74 years had hypertension between 2019 and 2020. Singapore residents were also consuming 3,600mg of sodium per day (or more than 1.5 teaspoons of salt) on average in 2018. This is almost double that of the World Health Organization’s (WHO) recommended limit of less than 2,000mg of sodium per day.<br><br>43.&nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">HPB will introduce a series of measures from 2022, aimed at reducing our sodium consumption.<br><br>a.&nbsp; &nbsp;</span><u style=\"font-family: Arial; font-size: 16px;\">Sodium substitution</u><span style=\"font-family: Arial; font-size: 16px;\">: The food service sector is a major contributor to our sodium intake and the impact is set to grow as more Singaporeans eat out. HPB will increase support through the Healthier Ingredient Development Scheme (HIDS), working with salt suppliers and the food service sector to encourage the substitution of regular salt used in cooking with lower-sodium alternatives such as lower-sodium salt, which contains 30% less sodium at the same quantity.<br><br>b.&nbsp; &nbsp;</span><u style=\"font-family: Arial; font-size: 16px;\">Increase range and variety of lower-sodium alternatives</u><span style=\"font-family: Arial; font-size: 16px;\">: HPB will ramp up existing efforts under the HIDS to spur industry reformulation of lower-sodium salt, sauces and seasonings to further increase the range and variety of healthier choices for Singaporeans. HPB will also invest in upstream prototyping for sauces and seasonings using lower-sodium salt, focusing on products commonly used by the food service sector to spur business innovation.<br><br>c.&nbsp; &nbsp;</span><u style=\"font-family: Arial; font-size: 16px;\">Public Education</u><span style=\"font-family: Arial; font-size: 16px;\">: On top of existing public education efforts, HPB will also embark on a nationwide campaign to encourage Singaporeans to take steps to reduce their sodium intake. The campaign will educate on the harms of consuming too much salt, build awareness of salt substitutes and highlight how consumers can replace salt in their foods while retaining flavour.</span></p></p><p style=\"text-align: justify;\"><p><span style=\"font-size: 16px; font-family: Arial;\"><strong></strong></span><strong style=\"font-family: Arial; font-size: 16px;\">Stepping Up Efforts to Strengthen Support for Mental Health and Well-Being<br><br></strong><span style=\"font-family: Arial; font-size: 16px;\">44.&nbsp; </span><strong style=\"font-family: Arial; font-size: 16px;\">&nbsp;</strong><span style=\"font-family: Arial; font-size: 16px;\">The Interagency Taskforce on Mental Health and Well-being was set up in July 2021 to oversee and coordinate mental health efforts, focusing on cross-cutting issues that require interagency collaborations. The Taskforce, comprising members from over 30 government agencies, public and private sectors, has reviewed the current landscape to uncover gaps. Four focus areas have been identified:<br></span></p><ul><li><span style=\"font-family: Arial; font-size: 16px;\">Strengthen services and family support for parents and youths;</span></li><li><span style=\"font-family: Arial; font-size: 16px;\">Provide and improve access to mental health care by integrating health and social services;</span></li><li><span style=\"font-family: Arial; font-size: 16px;\">Provide employment support for recovered persons with mental health conditions; and</span></li><li><span style=\"font-family: Arial; font-size: 16px;\">Improve mental health literacy among the citizens and create an inclusive society for greater acceptance of persons with mental health conditions.</span></li></ul></p><p><span style=\"font-family: Arial; font-size: 16px;\"></span><span style=\"font-family: Arial; font-size: 16px;\">The Taskforce is refining the recommendations, and plans to hold a public consultation in the coming months.</span></p><p style=\"text-align: justify;\"><p><span style=\"font-size: 16px; font-family: Arial;\"></span><strong style=\"font-family: Arial; font-size: 16px;\"><em>Enhancements to mental health outreach and support</em></strong></p><p><span style=\"font-family: Arial; font-size: 16px;\">45.&nbsp; &nbsp;MOH will continue to expand current mental health services in the community and our public hospitals. Together with AIC, MOH has piloted community mental health teams to provide a range of mental health support services for youths aged 12 to 25 years who are at risk of, or suspected to have, mental health conditions. To date, four youth outreach teams and two youth integrated teams have been set up under social service agencies including Care Corner Singapore, Fei Yue Community Services, Limitless, SHINE Children and Youth Services, Singapore Association for Mental Health, and TOUCH Community Services.</span></p></p> <ul><li style=\"text-align: justify;\"><span style=\"font-size: 16px; font-family: Arial;\">Community outreach teams conduct outreach to raise awareness of mental health issues, and provide basic emotional support and screening to facilitate early identification and referrals of youth at risk of mental health conditions for further assessment and intervention if necessary.</span></li></ul><ul><li style=\"text-align: justify;\"><span style=\"font-size: 16px; font-family: Arial;\">Youth integrated teams, which are led by allied health professionals, provide holistic support including outreach, assessment and psycho-social therapeutic interventions for youth with mental health needs.</span></li></ul><p style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 16px;\">46.&nbsp; &nbsp;As of December 2021, the youth community outreach teams have reached out to over 21,000 youths and provided support to more than 1,600 youths, while the youth integrated teams have provided interventions to over 500 youths.<br></span><br>47.&nbsp; &nbsp;<span style=\"font-family: Arial; font-size: 16px;\">To provide better support for persons experiencing mental health crises, the Institute of Mental Health (IMH) has piloted the Crisis Response Team (CRT) to respond to calls from the Singapore Police Force on cases of suicide attempts. This multi-disciplinary team conducts on-site assessment of suicidal individuals and connects them with appropriate intervention and follow-up management after the immediate crisis is resolved. This pilot will run for three years from 2020 to 2023.<br><br>48.&nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">The CRT started in March 2021 with the Bedok Division, and subsequently expanded to include the Jurong Division. It has since been rolled out island-wide from 6 December 2021. The CRT picked up an average of 32 calls per month from March 2021 to October 2021. Calls are also picked up within 46 seconds on average.<br><br></span><strong style=\"font-family: Arial; font-size: 16px;\"><em>Expanded Provision and Increased Access to Mental Health Services<br><br></em></strong><span style=\"font-family: Arial; font-size: 16px;\">49.&nbsp; </span><strong style=\"font-family: Arial; font-size: 16px;\"><em>&nbsp;</em></strong><span style=\"font-family: Arial; font-size: 16px;\">To improve access to addictions services, the National Addictions Management Service (NAMS), currently based in IMH, will be extended to other hospitals including Changi General Hospital (CGH) and National University Hospital (NUH). Each site will have multidisciplinary teams providing inpatient and outpatient services for patients with addictions issues. CGH and NUH will also be able to treat addictions patients with medical co-morbidities or complications and will co-manage them with other clinical specialties. Services are also being reviewed to address changing patient needs and emergent addiction trends, such as internet and gaming addictions.<br><br>50.&nbsp; &nbsp;</span><span style=\"font-family: Arial; font-size: 16px;\">To future-proof more dedicated hospital capacity for psychiatric services beyond IMH, the National University Health System will set up psychiatric services at the redeveloped Alexandra Hospital, in addition to its suite of General Hospital services. This will include inpatient beds for acute and sub-acute psychiatric care and rehabilitation, as well as services on Medical Psychiatry, Child and Adolescent Psychiatry, and Psychogeriatrics to service the residents in the west of Singapore. These services will complement those that are currently being offered at IMH.<br><br></span></p><div> </div><p><strong><span style=\"font-family: Arial; font-size: 16px;\">MINISTRY OF HEALTH<br></span></strong><strong><span style=\"font-family: Arial; font-size: 16px;\">9 MARCH 2022</span></strong></p>", "PressCategory": ["Highlights", "Press Releases"], "CustomDetailUrl": "", "UrlName": "promoting-overall-healthier-living-while-targeting-specific-sub-populations", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}, {"Title": "Singapore’s Contribution to the Coalition for Epidemic Preparedness Innovations (cepi)", "PublishedDate": "/Date(1646755200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "09 Mar 2022", "Summary": "", "MainContent": "<div style=\"padding: 0cm 0cm 1pt; border-top: none; border-right: none; border-bottom-width: 1pt; border-bottom-style: solid; border-left: none;\"><p style=\"margin: 0cm; padding: 0cm; font-size: 11pt; font-family: Calibri, sans-serif; border: none; text-align: justify;\"><span style=\"font-family: Arial; font-size: 16px;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;As part of our continued commitment to strengthen global health security and provide support for fair and equitable access to vaccines, Singapore will contribute USD15 million over five years to the Coalition for Epidemic Preparedness Innovations (CEPI). &nbsp;This was announced by Mr Ong Ye Kung, Minister for Health, at the Global Pandemic Preparedness Summit 2022.</span></p><p style=\"margin: 0cm; padding: 0cm; font-size: 11pt; font-family: Calibri, sans-serif; border: none; text-align: justify;\"><span style=\"font-size: 16px;\"><span style=\"font-family: Arial;\">&nbsp;</span></span></p><p style=\"margin: 0cm; padding: 0cm; font-size: 11pt; font-family: Calibri, sans-serif; border: none; text-align: justify;\"><span style=\"font-size: 16px;\"><span style=\"font-family: Arial;\">2.<span style=\"font-stretch: normal;\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>COVID-19 has shone the spotlight on perennial under-investment in pandemic preparedness. There is a clear need for increased collective financing and action, such as in vaccine development and production. The contribution from Singapore will go towards CEPI’s mission of accelerating vaccine development against emerging infectious diseases and enabling equitable access to these vaccines.</span></span></p><p style=\"margin: 0cm; padding: 0cm; font-size: 11pt; font-family: Calibri, sans-serif; border: none; text-align: justify;\"><span style=\"font-size: 16px;\"><span style=\"font-family: Arial;\">&nbsp;</span></span></p><p style=\"margin: 0cm; padding: 0cm; font-size: 11pt; font-family: Calibri, sans-serif; border: none; text-align: justify;\"><span style=\"font-size: 16px;\"><span style=\"font-family: Arial;\">3.<span style=\"font-stretch: normal;\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>Singapore has a strong interest and stake in pandemic preparedness and we strongly urge all countries to work towards collective global action for a strengthened global health system. Singapore will continue to work closely with the global community to overcome this pandemic together and prepare better for future ones.</span></span></p><p style=\"margin: 0cm; padding: 0cm; font-size: 11pt; font-family: Calibri, sans-serif; border: none; text-align: justify;\"><span style=\"font-size: 16px;\"><span style=\"font-family: Arial;\">&nbsp;</span></span></p><p style=\"margin: 0cm; padding: 0cm; font-size: 11pt; font-family: Calibri, sans-serif; border: none; text-align: justify;\"><span style=\"font-size: 16px;\"><span style=\"font-family: Arial;\"><strong>&nbsp;</strong></span></span></p><p style=\"margin: 0cm; padding: 0cm; font-size: 11pt; font-family: Calibri, sans-serif; border: none;\"><span style=\"font-size: 16px;\"><span style=\"font-family: Arial;\"><strong>MINISTRY OF HEALTH</strong></span></span></p><p style=\"margin: 0cm; padding: 0cm; font-size: 11pt; font-family: Calibri, sans-serif; border: none;\"><span style=\"font-family: Arial; font-size: 16px;\"><strong>9 MARCH 2022</strong></span></p></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "singapore-s-contribution-to-the-coalition-for-epidemic-preparedness-innovations-(cepi)", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}