{"pressItemDictionary": {"Press Releases": [{"Title": "White Paper On Healthier Sg", "PublishedDate": "/Date(1663754520000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "21 Sep 2022", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; Healthier SG is a multi-year strategy to transform the way we deliver healthcare, by shifting our emphasis from reactively caring for those who are already sick, to proactively preventing individuals from falling ill. It aims to empower individuals to become healthier and improve their quality of life through preventive care and strong patient-doctor relationships, supported by the community and the three healthcare clusters. The White Paper on Healthier SG has been submitted to Parliament on 21 September and will be debated in Parliament in October 2022.<br><br>2.&nbsp; &nbsp; &nbsp;Since March 2022, the Ministry of Health (MOH) has consulted more than 6,000 residents and engaged stakeholders such as private General Practitioners (GP) employers and community partners to design the key features of Healthier SG. We are encouraged by the broad support received for the Healthier SG strategy<strong>.</strong></p><p><strong>Key Features of Healthier SG</strong></p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Healthier SG comprises five key features:</p><p>i)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Mobilise our network of family doctors to deliver preventive care for residents;<br>ii)&nbsp;&nbsp;&nbsp;&nbsp; Develop health plans that include lifestyle adjustments, regular health screening and appropriate vaccinations;<br>iii)&nbsp;&nbsp; Activate community partners to support residents in leading healthier lifestyles;<br>iv)&nbsp;&nbsp; Launch a national enrolment programme for residents to commit to seeing one family doctor and adopt a health plan; and<br>v)&nbsp;&nbsp;&nbsp; Set up necessary enablers such as IT, manpower development plan and financing policy to make Healthier SG work.</p><p><strong>Residents</strong></p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;Under Healthier SG, residents will be encouraged to choose and enrol with a family doctor, who will serve as a first point-of-contact to holistically manage their health. We will allow some flexibility for residents to change their family doctor to take into account changes in their life circumstances. Enrolment will open to residents aged 60 years and above in the second half of 2023, followed by those in the 40-59 age group in the next two years.</p><p>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Upon successful enrolment, residents can schedule a face-to-face onboarding health consultation, which will be fully paid for by the Government. Once enrolled, residents will develop a health plan with their doctor and discuss how to improve their health, such as by making lifestyle adjustments, having regular check-ins on their health, and taking up the recommended health screenings and vaccinations.</p><p>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Residents will also enjoy the following benefits at the clinic they enrol with under Healthier SG:</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Fully subsidised nationally recommended screenings and vaccinations for Singapore Citizens;<br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; No need for cash co-payment when using MediSave for chronic care management;<br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Access to a new Community Health Assist Scheme (CHAS) subsidy tier, under which prices for a whitelist of common chronic disease management drugs at their enrolled private family doctor clinic will be comparable with those at polyclinics; and<br>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Rewards for residents for enrolling and completing their first consultation with their enrolled family doctor and for leading active and healthy lifestyles, under the Health Promotion Board’s health points system.&nbsp;&nbsp;</p><p><strong>Family Doctors</strong></p><p>7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Primary care, delivered by family doctors in our Primary Care Networks GP clinics (PCNs) and Polyclinics, is the critical first touchpoint in a patient’s care journey. Individuals who visit a regular family doctor are generally healthier and have fewer visits to the emergency departments and hospitals. Yet only three in five Singaporeans have a regular family doctor. Under Healthier SG, MOH will mobilise its network of family doctors to provide holistic care, focused on preventive and improved chronic care.</p><p>8.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;We will mobilise our network of family doctors to provide holistic care, focused on preventive and improved chronic care, and ensure a consistent and evidence-based level of care delivery across the diverse primary care landscape. We have worked with primary care leaders to develop 12 care protocols to guide the approach to screening and vaccination and managing key chronic conditions. These protocols will ensure a smooth and integrated approach across providers. More protocols will be co-developed over time.</p><p>9.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We will pay family doctors in private practice an annual service fee to care for and manage each enrolled resident. The fee will be tiered based on the health risk profile of each enrolled resident, scope of required care and the progress made in terms of preventive care or chronic disease management.</p><p>10.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We will also provide a one-off grant to Healthier SG family doctors for IT enablement to better serve their residents.</p><p><strong>Community</strong><strong> partners</strong></p><p>11.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Improving our health goes beyond a doctor’s visit. Family doctors will be able to make social prescriptions, which are referrals to community partners, to support residents in leading healthier lives.</p><p>12.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Healthier SG will make it easier for residents to connect to the wide range of activities provided by our community partners such as the Health Promotion Board (HPB), Agency for Integrated Care (AIC), People’s Association (PA) and Sport Singapore (SportSG). These can include activities like aerobics, brisk walking, ball games, community gardening and cooking classes.</p><p>13.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We will also provide additional support for seniors through our Eldercare Centres (EC). We will expand the number of centres from the current 119 to 220 by 2025; and provide more services, such as connecting seniors with community programmes and helping them with monitoring vital signs.</p><p><strong>Regional Health Managers</strong></p><p>14.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;To bring all these features together, our healthcare clusters will step up as regional health managers to actively coordinate and oversee these partnerships and activities for residents. Each healthcare cluster will care for approximately 1.5 million residents and will work with family doctors and other partners in the region to reach out to as many residents as possible. They will coordinate the efforts of various partners, guide the development of referral pathways, review the needs and health outcomes of residents and encourage stronger relationships across partners so as to serve residents better.</p><p><strong>Strengthening system enablers</strong></p><p>15.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;We will enhance our healthcare IT infrastructure to improve data submission and sharing of clinical information to make it more convenient for both patients and doctors. We will also bolster our data governance frameworks and cybersecurity capabilities. This will enable clusters, family doctors and partners to work more closely together to serve residents better.</p><p>16.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Residents participating in Healthier SG will have a digitally enabled health plan on HealthHub, where they can access the key points of their discussions with their family doctor and track their health outcomes. Healthy 365 will also be enhanced to better track physical activities and diets, as well as support access to community activities. It will be made inter-operable with many other digital health apps, which can encourage and nudge residents to adopt healthier lifestyles.</p><p><strong>Next Steps</strong></p><p>17.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Healthier SG will be a long-term, multi-year effort, as it takes time, probably eight to 10 years, to see the initial results of a healthier population. We are investing in and changing the healthcare system, to support individuals to chart their own journey towards better health.</p><p>18. The White Paper on Healthier SG can be accessed at https://www.healthiersg.gov.sg/</p>", "PressCategory": ["Press Releases"], "CustomDetailUrl": "", "UrlName": "white-paper-on-healthier-sg", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}