{"pressItemDictionary": {"Press Releases": [{"Title": "Extension of Safe Management Measures for In-person Visits to Hospitals and Residential Care Homes", "PublishedDate": "/Date(1667988000000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "09 Nov 2022", "Summary": "", "MainContent": "<p style=\"text-align: justify;\">The Ministry of Health (MOH) will extend the current visitor safe management measures at all hospital<sup>1</sup> wards and residential care homes (‘Homes’) until 23 November 2022 (inclusive). This is to relieve pressure on our hospitals and Homes, and to protect vulnerable patients and residents.&nbsp;<br><br>2. While the daily number of local COVID-19 cases has fallen over the past weeks, our hospitals continue to be under stress with a significant number of COVID-19 patients still warded in hospitals. Homes are also caring for an increased number of COVID-positive residents on-site compared to the previous months. MOH had earlier announced the tightening of safe management measures from 14 October to 10 November 2022.<br><br><strong>In-person Visits at Hospitals</strong><br><br>3. All patients will be allowed only two pre-designated visitors for the duration of their admission, and only one visitor may be allowed at the bedside at any one time. Critically ill patients will be allowed up to five pre-designated patients, and two visitors may be allowed at the bedside at any one point in time.&nbsp;<br><br>4. The visit duration will be limited to 30 minutes. In exceptional situations, such as for critically ill patients, paediatric patients, birthing or post-partum mothers, and for patients requiring additional care support<sup>2</sup>, visitors may be allowed to stay beyond 30 minutes on a case-by-case basis at the hospitals’ discretion.<br><br>5. Visitors are reminded not to eat or drink in the hospital wards, or use the toilets designated for patients in the wards. They should avoid sitting on patients’ beds.&nbsp;<br><br><strong>In-person Visits at Homes</strong><br><br>6.  All residents will be allowed up to four pre-designated visitors, and only one visitor may visit at any one time with the visit duration limited to 30 minutes. Visitors should continue to schedule the visits with the Home ahead of time. Visitors should strictly adhere to prevailing safe management measures within the Homes. This includes remaining within the designated visitor areas, outside of the wards.<br><br>7. We also seek the understanding of visitors that visits may have to be suspended if a Home is managing active COVID-19 cases. Next-of-kin of residents may approach the Home for further details.<br><br>8. Visitors to hospitals and Homes are to ensure that they are well and are strongly encouraged to test themselves with an antigen rapid test (ART) kit on the day of the visit to their loved ones. They must don face masks with good filtration capability at all times. These include surgical masks and reusable masks that are made of two layers of fabric. Hospitals and Homes have the discretion to impose stricter visitor limits or testing requirements for visitors of vulnerable or unvaccinated patients and residents.&nbsp; &nbsp;<br><br>9. MOH will review and calibrate these measures regularly in line with the evolving COVID-19 situation. We seek the understanding and cooperation of patients, residents, and their family members and loved ones.<br><br>[1]&nbsp;Including public acute hospitals, community hospitals and private hospitals<br>[2]&nbsp;Patients who require additional care support, such as patients who have mental incapacities, or family members who are undergoing caregiver training to better care for their loved ones after hospital discharge</p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "extension-of-safe-management-measures-for-in-person-visits-to-hospitals-and-residential-care-homes-9nov22", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}