{"pressItemDictionary": {"Press Releases": [{"Title": "Resumption of In-person Visits to Hospitals and Residential Care Homes", "PublishedDate": "/Date(1648724400000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "31 Mar 2022", "Summary": "", "MainContent": "&nbsp; &nbsp; &nbsp; &nbsp; The Ministry of Health (MOH) will resume in-person visits to all hospital wards<sup>1</sup> and residential care homes (‘Homes’) from 4 April 2022.&nbsp;<br><br>2.&nbsp; &nbsp; &nbsp;MOH had earlier announced the suspension of in-person visits to hospitals and Homes until 3 April 2022 (inclusive). As the daily number of local COVID-19 cases has fallen, and the situation in our hospitals and Homes is starting to improve, <strong>in-person visits to hospital wards and Homes will resume from 4 April 2022</strong>.&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp;As hospitals and Homes are settings with vulnerable patients/residents, visitors will have to comply with the safe management measures (SMMs) to better protect the patient/resident.&nbsp;<br><br>4.&nbsp; &nbsp; &nbsp;In-person visits are only allowed for individuals (i.e. patients, residents and visitors) who are fully vaccinated. As a concession, we will allow visits for individuals (i.e. patients, residents and visitors) who are medically ineligible for COVID-19 vaccination. Under exceptional circumstances, hospitals and Homes may also exercise flexibility in their visitor policies on a case-by-case basis. More details can be found in the <a href=\"/docs/librariesprovider5/default-document-library/annexea6feb9ec2094128a0433889fe8ad341.pdf?sfvrsn=1066aaf7_0\" title=\"Annex\">Annex</a>.&nbsp;<br><br>5.&nbsp; &nbsp; &nbsp;We understand the past months have been difficult for patients/residents, and their family members and loved ones as in-person visits were suspended, and thank everyone for their understanding. We seek their continued cooperation to comply with the SMMs to keep patients/ residents safe as in-person visits are resumed. MOH will review and calibrate these measures as the situation evolves.<br><br><br><strong>MINISTRY OF HEALTH<br>31 MARCH 2022</strong><br><div><br><sup>1</sup> Includes public acute hospitals, community hospitals and private hospitals.<br></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "resumption-of-in-person-visits-to-hospitals-and-residential-care-homes", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}