{"pressItemDictionary": {"Press Releases": [{"Title": "Recall of Abbott Instant Formula Products", "PublishedDate": "/Date(1645621200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "23 Feb 2022", "Summary": "", "MainContent": "&nbsp; &nbsp; &nbsp; &nbsp; The Ministry of Health (MOH) has advised all public and private hospitals in Singapore to cease the use of Abbott Similac Alimentum powdered infant formula (“Alimentum”), 400g tin and Similac Human Milk Fortifier (“HMF”), 0.9g sachet. This follows a recall direction that had been issued by the Singapore Food Agency to Abbott Laboratories (S) Pte Ltd (“Abbott”) for Abbott infant formula products from the United States due to possible Cronobacter sakazakii and Salmonella Newport contamination.&nbsp;<br><br>2.&nbsp; &nbsp; &nbsp;MOH has also advised all public and private hospitals to be vigilant for Cronobacter infection or Salmonellosis among infants or young children who may have consumed products affected by the recall.&nbsp;<br><br>3.&nbsp; &nbsp; &nbsp;Investigations are ongoing to determine the extent of use of the implicated products in our hospitals. To date, nine hospitals (Gleneagles Hospital, KK Women’s and Children’s Hospital, Mount Alvernia Hospital, Mount Elizabeth Hospital, Mount Elizabeth Novena Hospital, National University Hospital, Raffles Hospital, Singapore General Hospital and Thomson Medical Centre) have confirmed the use of the implicated products. We are working with the hospitals to identify and contact parents and caregivers of patients who might have received the products, to advise them on the actions to be taken. To date, the hospitals have not reported any case of adverse events arising from the consumption of these products. MOH will continue to monitor the situation closely.<br><br>4.&nbsp; &nbsp; &nbsp;Parents and caregivers of infants who have purchased the implicated infant formula products from retail outlets, should also stop using the products immediately. They should seek immediate medical treatment if their infants become unwell after consuming the implicated products with symptoms including fever, crying, poor feeding, lethargy seizures (for Cronobacter infections) and diarrhoea, fever, abdominal cramps, aches, headaches, lethargy, rash and blood in urine or stools (for Salmonella infection). Both infections can be treated with antibiotics.<br><br>5.&nbsp; &nbsp; &nbsp;The implicated products can be identified by the lot number and expiry date indicated at the bottom of the packaging. The first two digits of the code are “22” through “37”. The code on the container also contains “K8”, “SH” or “Z2” and the expiration date is on 1 April 2022 or later.&nbsp;&nbsp;<br><br><strong>Health Advisory</strong><br><br><em>Cronobacter sakazakii</em><br><br>6.&nbsp; &nbsp; &nbsp;Cronobacter sakazakii is a bacterium found in the environment that can survive dry conditions, such as dry food like infant formula and powdered milk. It cannot be spread from person to person.<br><br>7.&nbsp; &nbsp; &nbsp;Cronobacter infections are generally rare. When associated with serious infections such as meningitis in infants, it may be fatal. It can also cause serious illness among persons with immunocompromised conditions and the elderly.<br>&nbsp;<br>8.&nbsp; &nbsp; &nbsp;Infants with Cronobacter infections may show symptoms such as fever, crying, poor feeding or lethargy. Some may also develop seizures. The incubation period ranges from four to nine days, but can be up to 21 days. Cronobacter infections can be treated with antibiotics.<br><br><em>Salmonella Newport<br></em><br>9.&nbsp; &nbsp; &nbsp;Salmonella Newport is a bacterium that can be found in many foods, including vegetables, meat and processed food. Salmonella can be transmitted via the consumption of contaminated food.<br><br>10.&nbsp; &nbsp; &nbsp;Some individuals with Salmonella infection may not develop any symptoms while others may have diarrhoea, fever and abdominal cramps.&nbsp; More severe cases may experience high fever, aches, headaches, lethargy, rash or blood in urine or stools.<br><br>11.&nbsp; &nbsp; &nbsp;Infants, young children under the age of five, the elderly aged 65 years and above and immunocompromised individuals are at higher risk of severe illness. The incubation period ranges from six hours to six days after infection. Salmonella infection can be treated with antibiotics.<br><br>12.&nbsp; &nbsp; &nbsp;The key to preventing Cronobacter and Salmonella infections lies in proper hygiene and preparation of formula milk. To minimise the risk of infection, the following practices should be maintained:<br><br>• Wash hands with soap and water before handling items (e.g. milk bottles, pacifiers, and food) which will come into contact with the infant’s mouth and after using the toilet or changing diapers.<br><br>• Properly sanitise items meant for baby feeding (e.g. milk bottles, breast milk pump parts, utensils for feeding) with hot water and soap or commercial sterilisers (follow the manufacturer’s instruction).<br><br>• Prepare powdered infant formula in a clean environment, and ensure the cleanliness of infant formula containers, lids and scoops.<br><br>• Give infants only freshly prepared infant formula. Using hot water to prepare infant formula can kill bacteria such as Cronobacter sakazakii and Salmonella Newport in the formula.<br><br> &nbsp;&nbsp;&nbsp;&nbsp;o Boil water and allow to cool to no less than 70°C before pouring into a clean and sterilised feeding bottle. To achieve this temperature, the water should be left for no more than 30 minutes after boiling.<br><br>• Use the prepared formula milk within two hours of preparation. If the infant does not finish the entire bottle of milk, discard the content.<br><br>• If the prepared formula milk is not to be used right away, refrigerate it immediately and use it within 24 hours.<br><br>• When unsure if the milk prepared is fresh, discard it.<br><div><br></div><br><br><strong>MINISTRY OF HEALTH&nbsp;<br>23 FEBRUARY 2022</strong><br><div><br></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "recall-of-abbott-instant-formula-products", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}