{"pressItemDictionary": {"Press Releases": [{"Title": "Update On the Hiv/aids Situation In Singapore 2021 (june 2022)", "PublishedDate": "/Date(1656649800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "01 Jul 2022", "Summary": "", "MainContent": "&nbsp; &nbsp; &nbsp; &nbsp; There were 250 new cases of human immunodeficiency virus (HIV) infections reported among Singapore residents<sup>1 </sup>in 2021. This brings the total number of HIV-infected Singapore residents to 9,129 as of end 2021, of whom 2,255 had passed away over the years. The annual number of new HIV cases among Singapore residents had ranged from 400 to 500 from 2007 to 2017, had decreased to about 320 in 2018 and 2019, and had further decreased to 261 in 2020.&nbsp;<br><br>2.&nbsp; &nbsp; &nbsp;Of the 250 new cases in 2021, 95% were male and 68% were aged 20 to 49 years. About 62% had late-stage HIV infection<sup>2</sup> when they were diagnosed.<br><br>3.&nbsp; &nbsp; &nbsp;Sexual intercourse remains the main mode of HIV transmission. 95% (237 out of 250) of the cases had acquired the infection through sexual intercourse.&nbsp; Heterosexual transmission accounted for 33% of cases, while 62% of the cases occurred in men who have sex with men (MSM), including bisexual transmission (3%).&nbsp;<br><br>4.&nbsp; &nbsp; &nbsp;57% of the newly reported cases were detected during the course of medical care<sup>3</sup> and typically at a late stage of HIV infection. Another 18% were detected during routine programmatic HIV screening<sup>4</sup> and 16% were detected from self-initiated HIV screening. The rest were detected through other forms of screening. Cases detected via self-initiated screening tended to be at the early stage of infection. A higher proportion of MSMs (23%) had their HIV infection detected via self-initiated HIV screening compared to heterosexuals (6%). Please refer to the <a href=\"/docs/librariesprovider5/default-document-library/annexeb392b677eb74e7797136c5f03c148e1.pdf?sfvrsn=f98e65f1_0\" title=\"Annex\">Annex</a>&nbsp;for detailed data for cases reported from 1985 to 2021.<br><br><strong>Public Advisory</strong><br><br>5.&nbsp; &nbsp; &nbsp;The most effective way to prevent HIV infection is to remain faithful to one’s spouse/ partner and to avoid casual sex, or sex with sex workers. Persons engaging in high-risk sexual behaviour, such as having multiple sexual partners or engaging in casual or commercial sex, are strongly advised to use condoms to reduce their risk of HIV infection and other sexually-transmitted infections. Condoms should be used consistently and correctly during every sexual encounter. In addition, the use of preventive measures like HIV pre-exposure prophylaxis are highly effective when used as part of a comprehensive HIV prevention strategy.&nbsp;<br><br>6.&nbsp; &nbsp; &nbsp;The Ministry of Health and the Health Promotion Board (HPB) urge individuals who engage in high-risk sexual behaviour to go for regular HIV testing. Going for HIV testing is the only way to know one’s HIV status. Regular testing and early diagnosis allow persons living with HIV to be treated early and achieve better treatment outcomes. This also provides an opportunity to protect their partners from infection as persons living with HIV who are on treatment and have an undetectable viral load have practically no risk of transmitting the virus to their sexual partners. With early and effective treatment, people living with HIV can lead lives no different from others.<br><br>7.&nbsp; &nbsp; &nbsp;HIV testing is widely available at healthcare institutions, including polyclinics, private clinics, hospitals, and at anonymous HIV test sites where personal particulars are not required when undergoing a HIV test.&nbsp;<br><br>8.&nbsp; &nbsp; &nbsp;From 1 August 2022, the National HIV Programme, which is under the National Centre for Infectious Diseases, will be introducing HIV self-testing to complement the existing testing modalities, and encourage self-testing for those who prefer this testing option. HIV self-testing can be done in the privacy of one’s home and involves self-collection of oral specimen using a swab. The results can be obtained within 20 to 40 minutes. HIV self-testing kits will be available at the Department of Sexually Transmitted Infections Control (DSC) Clinic and Action for AIDS (AfA) Anonymous Test Site (ATS) at 31 Kelantan Lane, from 1 August 2022. The HIV self-test kit costs between $20 and $32.&nbsp;<br><br>9.&nbsp; &nbsp; &nbsp;The result of a single rapid diagnostic test such as the HIV self-test is not sufficient to make a HIV-positive diagnosis. Therefore, Individuals with a positive result from the self-testing kit should receive further confirmatory testing from a healthcare provider and be referred for treatment. If the test result is negative, it also does not mean that the individual is not infected with HIV. As it can take up to three months for antibodies to develop following HIV infection before they can be detected by the self-test kits, a recent infection may not be detected unless a second test is performed three months after the first test. Those at higher risk of HIV infection should test more frequently and see a health care provider to discuss options for preventive measures and testing. More information about the HIV self-testing can be found at <a href=\"http://www.ncid.sg/nhivp\" title=\"\" class=\"\" target=\"\">www.ncid.sg/nhivp</a>.<br><br>10.&nbsp; &nbsp; &nbsp;More information about HIV and AIDS as well as where to undergo anonymous HIV testing can be found on <a href=\"https://www.healthhub.sg\" title=\"\" class=\"\" target=\"\">https://www.healthhub.sg</a>.<br><br><br><strong>MINISTRY OF HEALTH&nbsp;<br>NATIONAL CENTRE FOR INFECTIOUS DISEASES<br>1 JULY 2022</strong><br><div><br><sup>1 </sup>Singapore citizens and permanent residents<br><sup>2 </sup>CD4+ cell count of less than 200 per cu mm or AIDS-defining opportunistic infections or both<br><sup>3 </sup>Includes cases that presented with HIV-specific symptoms and cases with non-HIV related medical conditions&nbsp;<br><sup>4</sup> Includes screening programmes for individuals with sexually transmitted infections, hospital inpatients and those identified through contact tracing<br><div><br></div></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "update-on-the-hiv-aids-situation-in-singapore-2021-(june-2022)", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}