{"pressItemDictionary": {"Press Releases": [{"Title": "Start of Nuvaxovid Covid-19 Vaccination and  Joint Testing Vaccination Centre Operations", "PublishedDate": "/Date(1652425200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "13 May 2022", "Summary": "", "MainContent": "<div>&nbsp; &nbsp; &nbsp; &nbsp; Starting today, individuals aged 18 years and above who are recommended to receive COVID-19 vaccination, including boosters, may book an appointment to receive the Nuvaxovid COVID-19 vaccine (Nuvaxovid) by Novavax at the Joint Testing and Vaccination Centre (JTVC) Bishan (former Bishan Park Secondary School), or any of the 20 participating Public Health Preparedness Clinics (PHPCs). The PHPCs will commence Nuvaxovid vaccination from 18 May 2022, while the JTVC Bishan will commence vaccination services from 24 May 2022.&nbsp;<br><br>2.&nbsp; &nbsp; &nbsp;The JTVC Bishan is one of five JTVCs, a new class of facility offering both COVID-19 testing and vaccination services, which will begin operations from 24 May 2022. The list of JTVCs and participating PHPCs can be found at <a href=\"http://www.vaccine.gov.sg/locations\" title=\"\" class=\"\" target=\"\">www.vaccine.gov.sg/locations</a>.&nbsp;<br><br><strong>Joint Testing and Vaccination Centres&nbsp;<br></strong><br>3.&nbsp; &nbsp; &nbsp;As of 12 May 2022, 92% of our total population have completed their primary vaccination series and 75% have received their booster doses. With good vaccination coverage and the majority of our total population well-protected, we will be progressively stepping down the number of Vaccination Centres (VCs) from end-May 2022, as previously announced on 22 April 2022.&nbsp;<br><br>4.&nbsp; &nbsp; &nbsp;To ensure that COVID-19 testing and vaccination services remain accessible to the general public, we will be establishing a first tranche of five JTVCs on 24 May 2022, with another five JTVCs opening progressively across the island from end-June 2022. These centres are designed with the ability to scale up operations in the event of an emerging Variant of Concern in future.&nbsp;&nbsp;<br><br>5.&nbsp; &nbsp; &nbsp;To enable the medical service providers to better manage vaccine preparation and reduce any unnecessary wastage, the public are strongly encouraged to book an appointment via the National Appointment System before proceeding to the JTVCs. Please refer to <a href=\"/docs/librariesprovider5/default-document-library/annex-a155c1d7be6984480adbf7084e230f582.pdf?sfvrsn=83c45979_0\" title=\"Annex A\">Annex A</a>&nbsp;for the list of the JTVCs.&nbsp;<br><br><strong>Rollout of Nuvaxovid Vaccination<br></strong><br>6.&nbsp; &nbsp; &nbsp;Persons who have yet to take a dose of any COVID-19 vaccine and wish to receive Nuvaxovid for their primary vaccination series may register their interest at <a href=\"http://www.vaccine.gov.sg\" title=\"\" class=\"\" target=\"\">vaccine.gov.sg</a>&nbsp;from today. An SMS with a personalised booking link will be sent to the registered mobile number to book an appointment on the National Appointment System. Those with an existing SMS to book an appointment may use the booking link in that SMS to book their Nuvaxovid vaccination appointments.&nbsp;<br><br>7.&nbsp; &nbsp; &nbsp;As recommended by the Expert Committee on COVID-19 Vaccination, individuals aged 18 years and above may receive the Nuvaxovid vaccine for their primary series or booster vaccination, although the mRNA vaccines remain the preferred vaccines due to their higher efficacy and the stronger immune response generated. Those who are medically ineligible to receive the mRNA vaccines should consider the Nuvaxovid. Under the National Vaccination Programme, the Sinovac-Coronvac vaccine will only be made available as a booster to persons who are medically ineligible<sup>1 </sup>to receive the mRNA vaccines and Nuvaxovid. Persons receiving Nuvaxovid for their primary vaccination series are recommended to receive two doses at least 21 days apart. Those receiving Nuvaxovid for their first or second booster dose are recommended to receive it from about five months after their last dose.&nbsp;<br><br>8.&nbsp; &nbsp; &nbsp;Persons aged 18 and above will need to be medically ineligible to mRNA, Nuvaxovid and Sinovac-CoronaVac COVID-19 vaccines to be considered medically ineligible for COVID-19 vaccination in Singapore and exempted from Vaccination-Differentiated Safe Management Measures.&nbsp;<br><br>9.&nbsp; &nbsp; &nbsp;Individuals who are currently medically ineligible for mRNA and Sinovac-CoronaVac would need to complete their vaccination with Nuvaxovid or be reassessed as medically ineligible to all COVID-19 vaccines under the National Vaccination Programme by their doctors to maintain their vaccination status. The validity of medical ineligibility memos issued before 1 June 2022 will expire on 1 August 2022. Medical ineligibility memos issued on 1 June 2022 onwards will be valid and required for these individuals to maintain their vaccination status past 1 August 2022.<br><br>10.&nbsp; &nbsp; &nbsp;Boosters and vaccinations remain a critical part of our COVID-19 strategy in ensuring our population is well-protected against infection and severe illness. We urge all who are eligible for vaccinations and booster doses to receive them as soon as possible.<br><br><br><strong>MINISTRY OF HEALTH<br>13 MAY 2022</strong><br><div><br><sup>1 </sup>Individuals who are medically ineligible for mRNA COVID-19 vaccines include those who developed anaphylaxis/severe allergic reactions or myocarditis/pericarditis to a previous dose of any mRNA vaccine. Individuals who are medically ineligible for Nuvaxovid include those who had anaphylaxis/severe allergic reactions to a previous dose of the vaccine, or to any ingredients in the vaccine.<br></div></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "start-of-nuvaxovid-covid-19-vaccination-and-joint-testing-vaccination-centre-operations", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}, {"Title": "Minister for Health Mr Ong Ye Kung to Attend the 15th Asean Health Ministers Meeting and  Related Meetings In Bali, Indonesia", "PublishedDate": "/Date(1652371200000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "13 May 2022", "Summary": "", "MainContent": "<p style=\"margin-left: 0cm; text-align: justify;\"><span style=\"font-size: 12pt; font-family: Arial; color: rgb(0, 0, 0);\">&nbsp; &nbsp; &nbsp; &nbsp; Mr Ong Ye Kung, Minister for Health, will attend the 15<sup>th</sup> ASEAN Health Ministers Meeting and Related Meetings (9<sup>th</sup> ASEAN Plus Three Health Ministers Meeting, 8<sup>th</sup> ASEAN-China Health Ministers Meeting, 1<sup>st</sup> ASEAN-Republic of Korea Health Ministers Meeting, and the ASEAN-US Health Ministerial Meeting) in Bali, Indonesia from 14 to 15 May 2022.</span></p> <p style=\"margin-left: 0cm; text-align: justify;\"><span style=\"font-family: Arial; font-size: 16px; color: rgb(0, 0, 0);\">&nbsp;</span></p> <p><span style=\"font-family: Arial; font-size: 16px; color: rgb(0, 0, 0);\">2.&nbsp; &nbsp; &nbsp; &nbsp; The ASEAN Health Ministers Meeting and Related Meetings are held biennially to set the direction for regional health cooperation and chart the future course of the ASEAN health sector. Attendees include Health Ministers and senior officials from ASEAN and Plus Three countries (China, Japan and the Republic of Korea), the ASEAN Secretary-General, and the World Health Organization’s Regional Directors or their representatives. The theme for this year’s meetings is Advancing the Achievement of ASEAN Health Development</span><span style=\"font-family: Arial; font-size: 16px; color: rgb(0, 0, 0);\">.</span><p><span style=\"font-family: Arial; font-size: 16px; color: rgb(0, 0, 0);\">&nbsp;</span></p></p><p><span style=\"font-family: Arial; font-size: 16px; color: rgb(0, 0, 0);\">3.&nbsp; &nbsp; &nbsp; &nbsp; The Meeting will discuss health issues including efforts and collaborations in building regional health system resilience and accelerating COVID-19 recovery; optimising mobilisation of essential health resources in responding to health crises; promoting the One Health approach<sup>1</sup>&nbsp;to prepare and respond to pandemics; achieving sustainable universal health coverage and health security; and future collaborations towards strengthening health systems for public health emergencies</span><span style=\"font-family: Arial; font-size: 16px; color: rgb(0, 0, 0);\">.</span><p><span style=\"font-family: Arial; font-size: 16px; color: rgb(0, 0, 0);\">&nbsp;</span></p></p><p><span style=\"font-family: Arial; font-size: 16px; color: rgb(0, 0, 0);\">4.&nbsp; &nbsp; &nbsp; &nbsp; Mr Ong will also meet with his counterparts during the visit. He will be accompanied by senior officials from the Ministry of Health</span><span style=\"font-family: Arial; font-size: 16px; color: rgb(0, 0, 0);\">.</span></p> <p style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 16px; color: rgb(0, 0, 0);\"><strong>&nbsp;</strong></span></p> <p style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 16px; color: rgb(0, 0, 0);\"><strong>MINISTRY OF HEALTH<br></strong><strong style=\"text-align: left;\">13 MAY 2022</strong></span></p> <div><span style=\"font-family: Arial; font-size: 16px; color: rgb(0, 0, 0);\"><br clear=\"all\"> </span><hr align=\"left\" size=\"1\" width=\"33%\"> <div id=\"ftn1\"> <p style=\"text-align: justify;\"><span style=\"font-family: Arial; font-size: 14px; color: rgb(0, 0, 0);\">[1] The One Health approach is a strategy for expanding cross-sectoral and interdisciplinary collaborations and communication between the human health, animal health and environmental health sectors for the purpose of protecting public health. </span></p> </div> </div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "minister-for-health-mr-ong-ye-kung-to-attend-the-15th-asean-health-ministers-meeting-and-related-meetings-in-bali-indonesia", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}