{"pressItemDictionary": {"Press Releases": [{"Title": "Adjustment of Measures for In-person Visits to Hospitals and Residential Care Homes", "PublishedDate": "/Date(1657022400000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "05 Jul 2022", "Summary": "", "MainContent": "In view of the rising number of COVID-19 cases in the community, the Ministry of Health (MOH) will be adjusting the visitor safe management measures at all hospital wards<sup>1</sup> and residential care homes (‘Homes’) for a period of four weeks from 7 July to 3 August 2022 (both dates inclusive) to protect healthcare capacity and vulnerable patients and residents during this period.&nbsp;&nbsp;<br><br><strong>In-person Visits at Hospitals</strong><br><br>2. All patients will be allowed two pre-designated visitors for the duration of their admission, and only one visitor may be allowed at the bedside at any one time. Critically ill patients will be allowed up to five pre-designated visitors, and two visitors may be allowed at the bedside at any one point in time.&nbsp;<br><br>3. The visit duration will be limited to 30 minutes. In exceptional situations, such as for critically ill patients, paediatric patients, birthing or post-partum mothers, and for patients requiring additional care support<sup>2</sup>, visitors may be allowed to stay beyond 30 minutes on a case-by-case basis at the hospitals’ discretion.<br><br>4. All visitors are to ensure that they are well and are strongly encouraged to test themselves with an antigen rapid test (ART) on the day of the visit to their loved ones at the hospital. Hospitals have the discretion to impose stricter visitor limits or testing requirements for visitors of vulnerable or unvaccinated patients.<br><br>5. Visitors are reminded not to eat or drink in the hospital wards, or use the toilets designated for patients in the wards. They should also avoid sitting on patients’ beds.&nbsp;&nbsp;<br><br><strong>In-person Visits at Homes</strong><br><br>6.  All residents will be allowed up to four pre-designated visitors, and only one visitor may visit at any one time with the visit duration limited to 30 minutes. Visitors should continue to schedule the visits with the Home ahead of time. All visitors are to ensure that they are well and are strongly encouraged to test themselves with an ART on the day of the visit to their loved ones at the Home. Visitors should strictly adhere to prevailing safe management measures within the Homes. This includes remaining within the designated visitor areas, outside of the wards.&nbsp;<br><br>7. We also seek the understanding of visitors that visits may have to be suspended if a Home is managing active COVID-19 cases. Next-of-kin of residents may approach the Home for further details.<br><br>8. All visitors must don face masks with good filtration capability at all times in the hospitals and Homes. These include surgical masks and reusable masks that are made of two layers of fabric.&nbsp;<br><br>9. The public is encouraged to test and isolate themselves if unwell, and to seek medical care via the telemedical providers or their family doctors should their conditions worsen. They should only seek medical treatment at a hospital’s Emergency Department only for serious or life-threatening emergencies, such as chest pain, breathlessness and uncontrollable bleeding. This allows those with severe illness in need of emergency care to be attended to quickly and helps to preserve our hospital capacity for those who truly need acute hospital care.<br><br>10. MOH will review and calibrate these measures regularly in line with the evolving situation. We seek the understanding and cooperation of patients, residents, their family members and loved ones as we work to reduce the risk of COVID-19 transmission in our healthcare institutions and residential care homes.<br><div><br>[1] Including public acute hospitals, community hospitals and private hospitals.<br><br>[2] Patients who require additional care support, such as patients who have mental incapacities, or family members who are undergoing caregiver training to better care for their loved ones after hospital discharge.<br></div>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "adjustment-of-measures-for-in-person-visits-to-hospitals-and-residential-care-homes", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}