{"pressItemDictionary": {"Press Releases": [{"Title": "Issuance of Correction Direction Under the Protection From Online Falsehoods and Manipulation Act On Falsehoods Regarding Xbb Wave In Singapore", "PublishedDate": "/Date(1665725400000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "14 Oct 2022", "Summary": "", "MainContent": "<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;The Ministry of Health (MOH) is aware of false and misleading statements in an article titled ‘BREAKING! Singapore Is Under Attack By The New SARS-CoV-2 XBB Recombinant Variant With COVID-19 Infections And Hospitalizations Rising. Thailand Could Be Next!’. First published on 9 October 2022 by Thailand Medical News on their website, Facebook page, Twitter page, this article has also been shared on Facebook pages belonging to Mr Goh Meng Seng (10 October 2022), and on a HardwareZone forum thread (10 October 2022). <br><br>2.&nbsp; &nbsp; &nbsp; &nbsp; The article claimed that increased disease severity of COVID-19 is becoming a common occurrence, even in the fully vaccinated. The article also claimed that mortuaries, funeral parlours, and crematoria are facing a ‘pile up’ in cases. These claims are false. <br><br>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; There has been no evidence of XBB subvariant causing more severe illness than previous variants. In fact, our local data in the last two weeks shows that XBB cases are estimated to have a 30% lower risk of hospitalisation compared to Omicron BA.5 variant cases. MOH also did not observe increases in COVID-19 deaths over the past month. <br><br>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Although Thailand Medical News has since amended the article, the article as first published on 9 October 2022 misrepresented the COVID-19 situation in Singapore and had been circulating in private messaging chats and other social media channels, and could cause undue public concern. <br><br>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The Minister for Health has instructed the Protection from Online Falsehoods and Manipulation Act (POFMA) Office to issue POFMA Correction Directions to Thailand Medical News, Goh Meng Seng, Goh Meng Seng People’s Power Party, and HardwareZone Forum. The Correction Directions require recipients to insert a notice against the original post or article, with a link to the Government’s clarification. <br><br>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; For the facts, please refer to the Factually article “<a href=\"https://www.gov.sg/article/factually141022-a\">Corrections regarding XBB wave in Singapore</a><a href=\"https://www.gov.sg/article/factually291121\"></a>”.</p><p>7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We urge the public not to speculate and/or spread misinformation that may cause public alarm.</p>", "PressCategory": ["Press Releases"], "CustomDetailUrl": "", "UrlName": "issuance-of-correction-direction-under-the-protection-from-online-falsehoods-and-manipulation-act-on-falsehoods-regarding-xbb-wave-in-singapore", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}