{"pressItemDictionary": {"Press Releases": [{"Title": "Reviewing System Enablers to Support Healthcare Transformations - Continuing to Invest In Infrastructure", "PublishedDate": "/Date(1677772800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "03 Mar 2023", "Summary": "", "MainContent": "<p style=\"text-align: justify;\"><strong>Continuing to Invest in Infrastructure&nbsp;</strong><br><br>The Ministry of Health (MOH) will continue to invest in healthcare infrastructure to meet the needs of our population.&nbsp;&nbsp;<br><br>2. We will continue to strengthen and expand our acute care system to meet rising healthcare needs.&nbsp;<br><br>a) The new National Cancer Centre Singapore has started operations since December 2022, and all clinical services will be available at the new Centre by March 2023.&nbsp;<br><br>b) We plan to progressively open the following facilities by the end of 2023 – the new National Skin Centre, Tan Tock Seng Hospital-Integrated Care Hub, and Woodlands Health Campus.<br><br>c) The Singapore General Hospital (SGH) Emergency Medicine Building is slated to be completed by 2024, and the SGH Elective Care Centre and the National Dental Centre Singapore by 2027.&nbsp;<br><br>d) Preparatory works are in progress for the redevelopment of Alexandra Hospital and the new Eastern Integrated Health Campus at Bedok North, comprising a new integrated general and community hospital. Both are scheduled to be completed around 2030.&nbsp;<br><br>3. We are on track in expanding our network of polyclinics to 32<sup>1 </sup>by 2030. A summary of our plans is as follows:<br><br><strong>New Polyclinics</strong><br><br>a) Sembawang and Tampines North Polyclinics are scheduled to open in 2023;<br><br>b) Four polyclinics in Kaki Bukit, Khatib, Serangoon and Tengah are scheduled to be completed by 2026; and<br><br>c) Four polyclinics in Bidadari, Bishan, Taman Jurong and Yew Tee are scheduled to be completed by 2030.<br><br><strong>Polyclinic Redevelopments&nbsp;</strong><br><br>d) Six polyclinics will be redeveloped by 2030. They are Bukit Merah , Clementi, Jurong, Outram<sup>2</sup>, Pasir Ris and Queenstown Polyclinics.<br><br><br><sup>1</sup>&nbsp;Currently, there are 23 polyclinics.<br><sup>2</sup> Bukit Merah and Outram polyclinics will be consolidated into one polyclinic after the redevelopment.<br><br><strong>MINISTRY OF HEALTH&nbsp;<br>3 MARCH 2023</strong><br></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "reviewing-system-enablers-to-support-healthcare-transformations---continuing-to-invest-in-infrastructure", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}, {"Title": "Promoting Healthier Living for All Ages and Families", "PublishedDate": "/Date(1677772800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "03 Mar 2023", "Summary": "", "MainContent": "<p style=\"text-align: justify;\">The Ministry of Health (MOH) will lay the foundations for healthier residents with the launch of Healthier SG. We will continue efforts to promote healthier choices, empower residents to lead healthier lifestyles, and integrate social and health support to keep families healthy.&nbsp;<br><br><strong>Updates on Healthier SG</strong><br><br><strong><em>National enrolment</em></strong> <br><br>2. Under Healthier SG, residents are encouraged to enrol with a Healthier SG clinic and commit to seeing one family doctor who will support them in developing and adopting a Health Plan. The Healthier SG family doctor will serve as the first point-of-contact to holistically manage residents’ health.&nbsp;<br><br>3. From May 2023, we will start with pre-enrolment for residents with chronic illness, who are aged 40 and above and already seeing a Healthier SG-registered General Practitioner (GP) clinic regularly. To preserve their existing physician-patient relationship, the GP clinic will engage its regular pool of patients with chronic conditions to pre-enrol onsite at the clinic. Healthier SG benefits will commence for pre-enrolled residents from July 2023.<br><br>4. From July 2023, the national enrolment programme will begin with Singapore Citizens and Permanent Residents who are aged 60 years and above. We will progressively invite the remaining residents who are aged 40 years and above to choose and enrol with any Healthier SG clinics, including the polyclinics. All residents eligible for Healthier SG enrolment have the flexibility to choose any Healthier SG-registered clinic using the HealthHub app.&nbsp;&nbsp;<br><br><strong><em>Resident benefits</em></strong><br><br>5. Upon successful enrolment, residents can schedule an appointment for a&nbsp; face-to-face onboarding Health Plan consultation with their enrolled Healthier SG clinic. The first on-boarding Health Plan consultation will be fully paid for by the Government.&nbsp;<br><br>6. After completing the onboarding health consultation, residents will receive 3,000 Healthpoints, worth $20, through the Healthy 365 app. These can be exchanged for vouchers from participating merchants, such as NTUC FairPrice vouchers or TransitLink credits.&nbsp;&nbsp;<br><br>7. Nationally recommended vaccinations under the National Adult Immunisation Schedule and screenings under the Screen for Life programme will be fully subsidised for enrolled Singapore Citizens when they visit their Healthier SG family doctor.<br><br>8. From early 2024, CHAS cardholders enrolled to Healthier SG GP clinics who have&nbsp; higher chronic medication needs and bills, can opt for a new Healthier SG Chronic Tier subsidy framework, where they can enjoy access to a selected whitelist of chronic medications (e.g. metformin, losartan) similar to those prescribed and subsidised at polyclinics, at prices more comparable to polyclinics. Under the Healthier SG Chronic Tier, CHAS cardholders can receive means-tested subsidies of up to 87.5% for whitelisted medications, with no dollar cap. They will also receive subsidies of up to $360 per year for other components of their chronic care, such as consultation, lab tests and non-whitelisted medications.&nbsp;<br><br>9. Patients who are more likely to benefit from the new Healthier SG Chronic Tier are those with chronic illnesses with higher medication needs and bills which exceed the current CHAS annual subsidy limits. Such patients may wish to consult their family doctors about whether they are suitable to switch to the whitelisted subsidised medications under the Healthier SG Chronic Tier. Other patients, especially those with low medication needs, may be well covered by their existing CHAS chronic subsidies of up to $540 annually, and need not switch to the new Healthier SG Chronic Tier. Patients will be permitted to switch between the existing CHAS Chronic Tier and the new Healthier SG Chronic Tier, to cater for possible changes to their medication needs. Pro-ration of the annual dollar subsidy balance will apply upon switching. More details of the new Healthier SG Chronic Tier can be found in <a href=\"/docs/librariesprovider5/default-document-library/promoting-healthier-living-for-all-ages-and-families---annex-a.pdf?sfvrsn=ffaf57e4_0\" title=\"Annex A\">Annex A</a>.&nbsp;&nbsp;<br><br>10. From early 2024, enrolled residents with chronic conditions under the CDMP can use MediSave to pay for their full treatment at their Healthier SG family physician, up to the MediSave500/700 withdrawal limit. They no longer need to co-pay 15% of their bill in cash.<br><br><strong>National Diabetes Reference Materials</strong><br><br>11. The National Diabetes Reference Materials (NDRM) Tier 2 materials will be published in April 2023. Available in the four official languages, the materials focus on guidelines on physical activities, healthy eating, ways to cope with stress, and support for Type 1 diabetes.<br><br>12. First developed and published in 2019, the NDRM aims to empower patients to take charge of diabetes with easy-to-understand tips and knowledge on diabetic care. It also equips care teams with resources to increase patients’ and caregivers’ health literacy and motivate patients for sustained lifestyle changes. The Tier 1 materials in 2019 contain basic information on diabetes, and how patients can manage their condition.<br><br>13. Following a series of engagement sessions in 2019 to understand the next tier of diabetes informational needs of the general public, patients with diabetes and their caregivers, the NDRM Tier 2 Workgroup was convened in April 2021, comprising more than 40 experts from various settings (private and public sectors, and covering physicians, dietitians, physiotherapists and psychologists) and patient champions, to develop in-depth Tier 2 content to address feedback from engagement sessions.<br><br>14. A total of four topics have been developed under Tier 2 NDRM, with the aim of providing patients and caregivers with deeper knowledge of materials. The topics of focus are:<br><br>a) <span style=\"text-decoration: underline;\">Physical Activity</span>: To educate patients with diabetes on how they can adopt physical activity in their lifestyle, and provide information on blood glucose monitoring tips for their exercise regime, different intensity of exercises and recommended exercises for patients with diabetes, heart diseases and obesity;<br><br>b) <span style=\"text-decoration: underline;\">Healthy Eating</span>: To educate patients with diabetes on how they can adopt healthy eating habits to better manage their condition. The Tier 2 materials will provide details on how to read nutritional labels, monitor calorie intake and glycaemic index, healthier cooking and practical tips;<br><br>c) <span style=\"text-decoration: underline;\">Emotional Well-being</span>: To provide information on how patients can cope with the stresses of living with diabetes. The Tier 2 materials include information on managing stress in diabetes, how diabetes may impact sleep, as well as where to get support; and<br><br>d) <span style=\"text-decoration: underline;\">Type 1 Diabetes</span>: To share practical tips specific to Type 1 diabetes, and how patients with the condition can be supported in their daily lives.<br><br>15. Flipcharts and bite-sized infographics on Tier 2 topics such as Healthy Eating and Physical Activity will be made available when the Diabetes Hub on the HealthHub website and app is updated in April 2023. An animation video will also be developed to raise awareness of NDRM Tier 2 materials.<br><br><strong>Targeted Measures to Keep Families Healthy</strong><br><br>16. MOH announced in March 2021 that we are developing a Child and Maternal Health and Well-being (CAMH) Strategy and Action Plan to provide holistic and comprehensive support, and address health risks and wider determinants of health from the preconception phase to adolescents aged 18 years old.<br><br>17. We have adopted a three-pronged approach to enable families to achieve better health outcomes, namely, (i) going upstream to prevent and address issues early; (ii) strengthening integration across health and social domains; and (iii) embracing family-centricity to better support children and their families.&nbsp;<br><br>18. The inter-agency Taskforce set up to oversee the development and implementation of the CAMH Strategy and Action Plan has completed the first of two phases of review and development. It has also embarked on phase 1 implementation, focusing on three key aspects, namely (i) a healthy mother and a healthy child, (ii) a happy mother and a happy child, and (iii) a well-supported mother and an able child.<br><br>19. Several new initiatives have been announced and implemented over the last year and more will be put in place over the next few months including plans on Phase 2 review and development.<br><br><strong><em>New universal Mental Health Screening for pregnant women at KKH</em></strong><br><br>20. As part of our efforts to scale up support for the mental well-being of women during and after pregnancy, KK Women’s and Children’s Hospital (KKH) implemented the Psychological Resilience in Antenatal Management (PRAM) programme, which offers universal antenatal mental health screening for all pregnant women receiving outpatient obstetric care at the hospital since December 2022. The new programme will enable early detection and intervention for pregnant women with depressive symptoms.<br><br><strong><em>Guidelines launched for mental health support for mothers</em></strong><br><br>21. In February 2023, KKH and the College of Obstetricians and Gynaecologists Singapore launched a set of Perinatal Mental Health Guidelines for women of child-bearing age in Singapore. With these guidelines, women and their families will be equipped with the relevant know-how to recognise changes in their mental well-being during pregnancy, identify basic signs and symptoms of mental health conditions such as anxiety and depression, and be encouraged to seek help when needed. The set of guidelines will be disseminated to healthcare professionals and the general public.&nbsp;<br><br><strong><em>New advisory on screen use for children 12 and below</em></strong><br><br>22. MOH has launched a new advisory on screen use for children up to 12 years of age to provide parents with more resources and practical help to support their children on healthy screen and device use. The advisory was developed by an expert panel comprising professionals from healthcare, social and educational agencies under the ambit of the Child and Maternal Health and Well-being Taskforce. The advisory can be downloaded from <a href=\"https://go.gov.sg/moh-screenadvisory\" title=\"\" class=\"\" target=\"\">https://go.gov.sg/moh-screenadvisory</a>.<br><br><strong><em>Family Nexus – integrated hub to support families</em></strong><br><br>23. In March 2022, MOH announced the piloting of Family Nexus at four sites across Singapore to enhance the integration of services across the health and social domains for more holistic support for children and their families.&nbsp;<br><br>24. SingHealth and Families for Life have started operations of the first site at Our Tampines Hub since November 2022, and families with young children residing in Tampines or the East region can now access Family Nexus services and/or sign up for activities. The other three sites at Choa Chu Kang, Punggol and Sembawang will be progressively rolled out over the next few months.<br><br><strong><em>More family-centric service delivery as a mother-child dyad at polyclinics<br></em></strong><br>25. The mother-child dyad services have been implemented at nine polyclinics as of 1 March 2023, including the pilot sites at Punggol and Yishun Polyclinics.&nbsp;<br><br>26. Following good outcomes achieved at Punggol and Yishun Polyclinics, MOH is scaling up the delivery of integrated services through a mother-child dyad service model to 14 polyclinics by 2025.&nbsp;<br><br>27. Under this effort, both mothers and their children can access healthcare services relevant to them in the same visit to the polyclinic. For example, postnatal depression screening and breastfeeding support are provided to the mothers when they bring their child for vaccination and childhood developmental screening at the polyclinics.<br><br><strong><em>More support for fathers and grandparents&nbsp;&nbsp;</em></strong><br><br>28. We are also exploring more support for fathers and grandparents to aid them in keeping themselves and their children healthy. The National University Hospital (NUH) will be extending its mental health screening and support to fathers of children and husbands of women under its care. The programme allows for early intervention, case management and multidisciplinary treatment. To widen the reach to support fathers, the programme will be made available to clients referred by its social and community partners, including partners for Family Nexus and KidSTART.<br><br><strong><em>Enhanced support for lower-income families&nbsp;</em></strong><br><br>29. We will also be doing more to help families with lesser means to care for themselves. This will enable children from low-income families to have a good head start in health and well-being in their early formative years. Two regional pilots will be launched to provide more holistic and comprehensive support for preschool children from low-income families.&nbsp;<br><br>30. In the Northeast Region, SingHealth will be working alongside the KidSTART and ComLink teams, to lead cross-domain and multi-agency effort to support children through Project HOME (Holistic Management &amp; Enablement).&nbsp;<br><br>31. NUH will be rolling out a similar pilot in the West through HEADS-UPP (HEAlth and Development SUpport in Preschool Partnerships) programme, working with Care Corner and PCF Sparkletots preschools in the region.&nbsp;<br><br>32. Both pilot programmes will equip preschool educators and social workers with skills to support the health and development screening of preschool children; identify at-risk children and refer them for intervention; and provide multi-disciplinary case management to children and their families.&nbsp;<br><br>33. Please refer to <a href=\"/docs/librariesprovider5/default-document-library/promoting-healthier-living-for-all-ages-and-families---annex-b.pdf?sfvrsn=2d401ff9_0\" title=\"Annex B\">Annex B</a>&nbsp;for details of the various programmes.&nbsp;<br><br><strong>Mental Health Remains a Key Priority&nbsp;</strong><br><br>34. The Interagency Taskforce on Mental Health and Well-being conducted a public consultation between May and August 2022 to gather views and feedback on 12 preliminary recommendations across three focus areas:&nbsp;<br><br>a) Improving accessibility, coordination and quality of mental health services;&nbsp;<br>b) Strengthening services and support for youth mental well-being; and&nbsp;<br>c) Improving workplace well-being measures and employment support.&nbsp;<br><br>35. The Taskforce received over 950 responses through an online survey on the Government's feedback unit REACH, as well as virtual and in-person small group engagements with key stakeholders, including youths, parents, persons with mental health conditions, service providers, employers, and community agencies. In general, participants were supportive of the preliminary recommendations, and provided useful suggestions on the refinement of implementation details of the recommendations. The Taskforce will incorporate the feedback gathered into the development of a national strategy for mental health and well-being, aimed to be released at the end of 2023.&nbsp;<br><br><strong><em>Introducing a tiered care model for mental health and well-being</em></strong><br><br>36. To facilitate better access and smoother transitions for users of mental health services in the social and health sectors, the Taskforce recommends implementing a care model with a tiered system of services to reflect the different groups of clients with varying mental health needs and the types of mental health services, providers and para-professionals/ professionals required to meet those needs. For the general public, this care model will help them identify the appropriate level of service required. For service providers, it will serve to guide them on service provision, referrals, and care coordination among agencies.&nbsp;<br><br><strong><em>Developing a national mental health competency training framework</em></strong><br><br>37. To complement the tiered care model, the Taskforce is also developing a national mental health competency training framework to establish a common set of training standards and clearly defined competencies expected of mental health professionals and para-professionals who support individuals with varying mental health needs. The framework will outline the competencies needed and recommended training programmes available, both for members of the public who are keen to be equipped with skills to serve as peer supporters in the community, as well as mental health para-professionals/professionals, to uplift mental health capabilities across the care continuum.&nbsp;<br><br><strong><em>Improving awareness and attitudes towards mental health and well-being</em></strong><br><br>38. The Taskforce recognises that stigma and attitudes towards mental health continue to be significant concerns to many. Public education campaigns such as HPB's \"It's OKAY to Reach Out\" and National Council of Social Service's \"Beyond The Label\" campaigns have been rolled out to encourage individuals to seek help for mental health and well-being, and destigmatise mental health issues. The Taskforce will continue with efforts to normalise conversations on mental health and well-being in the community, to build our collective resilience as a nation.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH&nbsp;<br>3 MARCH 2023</strong></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "promoting-healthier-living-for-all-ages-and-families", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}, {"Title": "Transforming Aged Care for Seniors to Live and Age Well", "PublishedDate": "/Date(1677772800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "03 Mar 2023", "Summary": "", "MainContent": "<p style=\"text-align: justify;\">As we anchor ageing in communities, the Ministry of Health (MOH) will review the financing and services framework to be more care-centric and support more Singaporeans to fulfil their wishes to pass away at home. We will also strengthen our healthcare financing safety nets to support the elderly and families in need.<br><br><strong>Shift Towards More Premises-Neutral, Care-Centric Financing&nbsp;</strong><br><br><strong><em>Supporting care at home</em></strong><br><br>2. As we encourage ageing-in-place, our healthcare financing policies need to transform to better support care delivery within communities and homes. Currently, our financing coverage varies based on the setting and premises where care is delivered. We intend to make our financing system more premises-neutral to improve affordability for appropriate care delivered across settings. This means that the availability and/or extent of financing coverage will depend on the type of care services received by the patient, rather than whether the patient had received care in a particular healthcare institution or other settings.&nbsp;<br><br>3. This will be a major shift and changes will have to be made gradually. As a first step, we will improve affordability for patients who seek care at home. Homebound patients receiving MOH-subvented home medical and home nursing services will be able to tap on the MediSave 500/700 and Flexi-MediSave schemes. This means that homebound patients who receive treatment at home for the 23 conditions under the Chronic Disease Management Programme (CDMP) will be able to use up to $500 or $700 yearly (depending on the complexity of their chronic condition) from MediSave to pay for their home care bills, similar to if they had sought outpatient treatment at a clinic. This will cover components such as consultation fees and blood tests conducted at home. Patients who are aged 60 years and above can also use an additional $300 yearly under Flexi-MediSave.<br><br>4. These MediSave changes will benefit up to 6,800 patients each year who seek care at home. The changes will be implemented in the latter half of 2023.<br><br><strong><em>Telehealth as a viable option for care delivery</em></strong><br><br>5. Although telehealth is a relatively new modality of care delivery, we saw its benefits in supporting care in the community and at home during the COVID-19 pandemic. The COVID-19 Virtual Ward Programme allowed patients to continue receiving the necessary medical care, while freeing up beds in acute hospitals. We had also allowed the use of MediSave and Community Health Assist Scheme (CHAS) Chronic subsidies for video consultations of regular follow-ups for chronic diseases under the CDMP for a time-limited period, which helped to support safe distancing.&nbsp;<br><br>6. Moving forward, we will continue incorporating telehealth in our care models, where appropriate. Mainstream financing schemes will be progressively extended to more telehealth services. For a start, we intend to extend the usage of MediSave and CHAS Chronic subsidies for video consultations of chronic diseases under CDMP beyond the current time-limited extension. More details on implementation will be provided later this year.&nbsp;<br><br><strong><em>Facilitating more flexible palliative care services</em></strong><br><br>7. Many patients prefer to spend their final days at home rather than in hospitals. To support patients’ wishes to pass away at home, MOH will undertake a review of the financing framework for palliative care services. For a start, more providers will be allowed to make MediSave claims for patients receiving palliative care at home. Currently, only home palliative care providers who specialise in providing palliative care can help patients make MediSave claims. Moving forward, we will allow MOH-subvented home medical and home nursing providers who provide basic palliative care to also help these patients make MediSave claims for palliative care. These changes are expected to benefit more than 200 patients each year.<br><br>8. In addition, we will work with hospitals and palliative care providers to pilot new models of palliative care delivery which are setting-neutral to ensure seamless care transition.<br><br>9. Tan Tock Seng Hospital will partner Dover Park Hospice in a pilot programme to enable patients to receive timely and seamless care across inpatient, day and home hospice care settings, depending on their needs. This will reduce unnecessary readmissions to hospital. Under this pilot, rather than funding the care as and when utilised in each hospice care setting, MOH will provide a single bundled funding rate to empower hospice care providers to decide which setting is most suitable, based on the patient’s needs. Through this, providers will be better able to streamline referral and transfer protocols across settings, and care will be more tightly coordinated throughout the patient’s journey.&nbsp;<br><br><strong>Strengthening Our Safety Nets for Needy Elderly and Families&nbsp;</strong><br><br>10. With the ageing population and rising cost of living, there is a need to strengthen our safety nets to ensure that needy patients continue to have access to basic healthcare.&nbsp;<br><br>11. The Government will provide a $1.5 billion top-up to the MediFund in 2023, to provide financial support for needy Singaporeans who are unable to afford their remaining healthcare bills after government subsidies, and drawing on other means of payment including MediShield Life and MediSave. Although Permanent Residents (PRs) are not eligible for MediFund, we will separately extend discretionary financial assistance to PRs who face difficulties paying for their healthcare bills on a case-by-case basis later this year. This would alleviate the healthcare burden on needy families, especially those with Singaporean family members.<br><br><br><strong>MINISTRY OF HEALTH&nbsp;<br>3 MARCH 2023</strong></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "transforming-aged-care-for-seniors-to-live-and-age-well", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}, {"Title": "Reviewing System Enablers to Support Healthcare Transformations - Health Information Bill", "PublishedDate": "/Date(1677772800000)/", "LastModifiedDateTimeList": null, "PublishedDateStr": "03 Mar 2023", "Summary": "", "MainContent": "<p style=\"text-align: justify;\"><strong>Health Information Bill</strong><br><br>As we embark on Healthier SG, there is a need to transform the communication and sharing of data among healthcare clusters, family doctors and community care providers, to ensure a more holistic and coordinated care journey. The Ministry of Health (MOH) aims to table the Health Information Bill in the second half of 2023 to facilitate the proper collection, use and sharing of patient information across different healthcare providers and care settings in a safe and secure manner.<br><br>2. The National Electronic Health Record (NEHR) was established in 2011 as a central repository of patient summary health records drawn from and shared across healthcare providers to enhance care continuity. Since 2015, key health summaries from NEHR, such as medications and COVID-19 test results, have been progressively shared with patients and caregivers through HealthHub for their health management. As of December 2022, all public healthcare institutions and over 30% of private MOH-licensed healthcare institutions have access to NEHR. This includes over 90% of private hospitals, nursing homes and over 60% of medical clinics.<br><br>3. The Health Information Bill will benefit patients, residents and healthcare providers by:<br><br>a) Increasing the functionality of the central NEHR repository, through mandatory contribution of summary data to NEHR by licensed healthcare providers, such as hospitals, clinics, laboratories, and extending access and/or contribution to prescribed users like retail pharmacists;<br><br>b) Enhancing the legal framework to facilitate proactive data sharing across MOH entities, Healthcare Services Act (HCSA) licensees and appointed community partners to allow healthcare professionals to have a fuller picture of one’s health for better monitoring and follow-up;&nbsp;<br><br>c) Putting in place safeguards for data sharing to protect patient confidentiality and respect patient autonomy; and<br><br>d) Putting in place cybersecurity, data security and data protection measures to safeguard health information.<br><br><strong><em>Ensuring safe and secure data sharing</em></strong><br><br>4. Since May 2022, we have consulted more than 800 residents, patients, industry experts and healthcare providers to better understand their concerns on the Bill. Most of the participants generally agreed with the benefits of data sharing and were supportive of the Bill. However, there were some concerns on medicolegal liabilities, cybersecurity and data security.&nbsp;<br><br>5. To address these concerns, we will provide guidance for healthcare professionals:&nbsp;<br><br>a) On the cybersecurity front, we will be setting out cyber and data security requirements for healthcare entities. Data intermediaries including Clinic Management System (CMS) vendors will need to ensure that their IT systems and services maintain good cyber hygiene (e.g. protected with anti-malware, implementation of proper access controls) Data and systems will also have to undergo regular backups and updating of software and security patches. In addition, healthcare staff will be adequately trained in cybersecurity.&nbsp;<br><br>b) In addition to putting in place safeguards such as the need for data security classification, and requirements for proper data storage, transmission and disposal, we will also align data security and protection with prevailing policies and standards under the Personal Data Protection Act. Only authorised personnel will be allowed to access the relevant patient health data, which will be limited to what is necessary for their work. Healthcare providers or system vendors must meet these requirements and are expected to report any suspected incidents or breaches to MOH in a timely manner.&nbsp;<br><br>6.  Health information is personal and we respect patient autonomy. As such, we are reviewing ways to allow patients greater control over access to their records, while ensuring that should the patient decide to opt back in after initially opting out, he would still have a complete set of information for his healthcare needs.&nbsp;<br><br>7. We will continue to engage stakeholders to gather their concerns and feedback as we design the Health Information Bill.&nbsp;<br><br><br><strong>MINISTRY OF HEALTH&nbsp;<br>3 MARCH 2023</strong></p>", "PressCategory": ["Press Releases", "Highlights"], "CustomDetailUrl": "", "UrlName": "reviewing-system-enablers-to-support-healthcare-transformations---health-information-bill", "CurrentPageUrl": null, "CustomPressWidgetLocationUrl": null}]}, "pressItemDictionaryCount": 1, "allowPagination": true, "selectedCategoryForPagination": "Press Releases", "sectionsListingOrder": ["Press Releases"], "paginationInfoDictionary": {"Press Releases": {"ItemsPerPage": 10, "CurrentPageIndex": 0, "LastPageIndex": 0}}}